{
  "commentary": [
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Finch and Dhawan to open. Sandeep Sharma has the new ball"
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "$$Bailey$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$Kings$$ $$XI$$ $$will$$ $$bowl$$"
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "$$Manan$$ $$Vohra$$  finally gets a game. He is in for Kings XI, along with Shivam Sharma. Sunrisers are unchanged"
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Bailey: \"Dry (pitch), it will turn a little bit, might be a bit slower than the other night, may be a bit of dew as the sun goes down.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Dhawan: \"We would have batted first as the wicket is slow, it suits our bowling. Don't think the wicket is going to change.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "------- Aayush: \"Bailey is not in any kind of form and would not make the playing XI if he wasn't captain. Definitely a weak overseas player considering Marsh is sitting out for him.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Oregata: \"Still longing for that solitary spell of Ishant? I am sure William Wordsworth would have written 'Solitary Spell of Ishant' rather than his 'Solitary Reaper'. And I am also sure he would have repented it, too.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Dhanya: \"This squad of KXIP looks the best, effective bowlers and frontline batsmen followed with mix of positive mindset all rounders . I feel this should be their line up throughout\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Kunal: \"Irony- Amit Mishra was the one warming the bench for Indian team for long..now bcoz of him Rasool is warming the bench..High Time he needs to play.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "hardik: \"For me Irfan Pathan's career is over. Sad to see such a promising guy failing so consistently. he has lost his swing and lost everything. He looks very ordinary for the class he has. Almost similar story with ishant.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Shahed: \"A pathetic display of death bowling even by the likes of frontline test bowlers like Starc, Steyn, Johnson. The performances of Mohit, Bhuvi stand out and of course, Malinga. Here's hoping for another good display by Bhuvi.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Soumydut: \"Every time I see (or don't) Ishant Sharma, I feel sad. What potential he arrived with. That magical spell to Ricky Ponting. Once a strike bowler for India - a bench warmer today for his franchise. Well at least he has company in the team in the form of Irfan Pathan\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "$$3.15pm$$  Another double header today. Sunrisers Hyderabad take on Kings XI Punjab at home in the first match - No 39 of the season. With eight wins, Chennai Super Kings are more or less in safe territory. A win today, and Kings XI will be there too."
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Jesen: \"Parvez Rasool has not got even a single game. That is bad, given the performances of Mishra this season\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "niranjan: \"Looking forward for Dhawan to score atleast some boundaries today. This man needs some runs as a captain.\""
    },
    {
      "ball": 0,
      "isHighlight": false,
      "text": "----------------------- We are midway into Powerplay 4 at  $$CricIQ$$ . How much have you scored? One good attempt could earn you a berth in the  $$video$$ $$round$$ , so keep playing."
    },
    {
      "ball": 0.1,
      "isHighlight": true,
      "text": "Sandeep Sharma to Finch, $$FOUR$$ ,and Finch is away first ball, he walks out calmly to a length delivery and even as it comes in a bit, he lofts it cleanly over extra cover"
    },
    {
      "ball": 0.2,
      "isHighlight": false,
      "text": "Sandeep Sharma to Finch,1 run,stands well outside his crease and turns the incoming length ball past midwicket"
    },
    {
      "ball": 0.3,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,no run,pitches it up to the left-hander and moves it away outside off, left alone"
    },
    {
      "ball": 0.4,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,no run,gets some width on this length and hits it square, but there are three men in that region, cover-point fields"
    },
    {
      "ball": 0.5,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,no run,jumps out to an away moving delivery, but mistimes the drive as he gets too close to the pitch, and it rolls to mid off"
    },
    {
      "ball": 0.6,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,1 run,the line is on the pads this time and Dhawan punches it through midwicket, there is a man in the deep though"
    },
    {
      "ball": 0.6,
      "isHighlight": false,
      "text": "Mitchell Johnson"
    },
    {
      "ball": 0.6,
      "isHighlight": false,
      "text": "Shahed: \"On 0.6 there, was it Gayle running for Dhawan? That was an easy 2.\""
    },
    {
      "ball": 1.1,
      "isHighlight": false,
      "text": "Johnson to Dhawan,1 run,length ball angled into the pad, tucked to fine leg"
    },
    {
      "ball": 1.2,
      "isHighlight": false,
      "text": "Johnson to Finch,1 run,Johnson gets it to come back in after pitching around a length, and a thick inside edge from Finch runs behind square leg as he tries to punch"
    },
    {
      "ball": 1.2,
      "isHighlight": false,
      "text": "Brandon: \"@Aayush: Bailey's strikerate for this year's IPL is better than McCullum's and Warner's. His only crime is being overshadowed by the M&M's hitting.\""
    },
    {
      "ball": 1.3,
      "isHighlight": false,
      "text": "Johnson to Dhawan,1 wide,Johnson hurls it too far down leg with the angle now"
    },
    {
      "ball": 1.3,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,corrects the line and is right on middle this time, Dhawan pushes it back"
    },
    {
      "ball": 1.4,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,cramps him for room again with a sharp delivery on middle again, Dhawan tries to chop it square, mishits it into the pitch"
    },
    {
      "ball": 1.5,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,and yet again, Dhawan just not able to do anything with these deliveries angled into middle, middle and leg, an inside edge onto pad now as he pushes at it"
    },
    {
      "ball": 1.6,
      "isHighlight": false,
      "text": "Johnson to Dhawan,1 run,Johnson goes short of a length, into the body, Dhawan nudges it square on leg for a single"
    },
    {
      "ball": 2.1,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,1 run,Dhawan is struggling, he steps out to a length delivery and pushes weakly at it, and the inside edge goes to fine leg"
    },
    {
      "ball": 2.1,
      "isHighlight": false,
      "text": "Keeper standing up"
    },
    {
      "ball": 2.2,
      "isHighlight": true,
      "text": "Sandeep Sharma to Finch, $$FOUR$$ ,superbly done, a back of a length ball, Finch gets on his toes, opens the face and runs it between backward point and short third man, all timing on that"
    },
    {
      "ball": 2.3,
      "isHighlight": false,
      "text": "Sandeep Sharma to Finch,no run,good length on off and middle, he turns it to midwicket"
    },
    {
      "ball": 2.4,
      "isHighlight": false,
      "text": "Sandeep Sharma to Finch,1 run,a length ball on middle, and Finch punches it dead straight down the ground between the non-striker and the stumps, there is long on around though"
    },
    {
      "ball": 2.5,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,1 leg bye,this is on the pads, but Dhawan cannot do anything with it, a direct hit from the keeper as he runs forward to pick up the ball on the leg side, they go to the third umpire, but Finch is home"
    },
    {
      "ball": 2.6,
      "isHighlight": false,
      "text": "Sandeep Sharma to Finch,1 run,pushed to mid off for a single, could have been tight but Vohra fails to pick it up"
    },
    {
      "ball": 3.1,
      "isHighlight": false,
      "text": "Johnson to Finch,no run,pitches it up, angles it across for the drive, Finch has a go at it, and is beaten"
    },
    {
      "ball": 3.2,
      "isHighlight": false,
      "text": "Johnson to Finch,1 wide,dug in short but a tad down the leg side, Finch moves outside the line, thinks about the hook but withdraws in the end"
    },
    {
      "ball": 3.2,
      "isHighlight": false,
      "text": "Johnson to Finch,no run,back of a length, guided softly to point"
    },
    {
      "ball": 3.3,
      "isHighlight": false,
      "text": "Johnson to Finch,2 runs,whoa, this length ball has been taken from the stumps and chopped down to third man, had to get it right, else he was gone, third man fumbles and they take a second"
    },
    {
      "ball": 3.4,
      "isHighlight": false,
      "text": "Johnson to Finch,no run,short of a length, nudged into the leg side"
    },
    {
      "ball": 3.4,
      "isHighlight": false,
      "text": "Round the stumps"
    },
    {
      "ball": 3.5,
      "isHighlight": false,
      "text": "Johnson to Finch,1 wide,overdoes the angle into the right hander and sends it down leg"
    },
    {
      "ball": 3.5,
      "isHighlight": false,
      "text": "ganesh: \"@Aayush; The main reason for Punjab's success this year has been Bailey's captaincy. \""
    },
    {
      "ball": 3.5,
      "isHighlight": false,
      "text": "Johnson to Finch,1 run,short of a length, just outside off, steered to third man"
    },
    {
      "ball": 3.5,
      "isHighlight": false,
      "text": "Raul: \"So Dhawan is edgy again. What option do we have at SRH to replace him?\""
    },
    {
      "ball": 3.6,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,tries to punch this from the crease, but it is not that full, and he mistimes it to covers"
    },
    {
      "ball": 4.1,
      "isHighlight": false,
      "text": "Sandeep Sharma to Finch,(no ball) 1 run,he's been caught brilliantly off a no-ball by Maxwell, running back from point and diving to take it as Finch mishits a lofted stroke, the fielders celebrate, but umpire Kulkrani's arm is outstretches as Sandeep' front foot is well over the line"
    },
    {
      "ball": 4.1,
      "isHighlight": true,
      "text": "Sandeep Sharma to Dhawan,(no ball)  $$FOUR$$ ,goes full around off, and is drilled straight and hard down the ground, the free hit is not done yet, as this is another no-ball"
    },
    {
      "ball": 4.1,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,no run,a slower one slanted across Dhawan, who has a slog and misses"
    },
    {
      "ball": 4.2,
      "isHighlight": true,
      "text": "Sandeep Sharma to Dhawan, $$FOUR$$ ,Dhawan opening up this over, comes down the track with purpose and slams the length ball from outside off, over the bowler"
    },
    {
      "ball": 4.2,
      "isHighlight": false,
      "text": "Keeper standing up"
    },
    {
      "ball": 4.3,
      "isHighlight": true,
      "text": "Sandeep Sharma to Dhawan, $$SIX$$ ,Sandeep goes wider, Dhawan stays in the crease, fetches it with a forward stride and wallops it into the sightscreen"
    },
    {
      "ball": 4.4,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan, $$FOUR$$ ,Dhawan is motoring now, Sandeep drops it short, and he thumps the pull out of the reach of deep midwicket"
    },
    {
      "ball": 4.5,
      "isHighlight": true,
      "text": "Sandeep Sharma to Dhawan, $$FOUR$$ ,gets worse for Sandeep, he goes full and wide outside off, Dhawan lofts him into the wide long off boundary"
    },
    {
      "ball": 4.6,
      "isHighlight": false,
      "text": "Sandeep Sharma to Dhawan,1 run,finall a ball that does not go for four, he bowls a length ball on the pad, and Dhawan pushes it to mid on to keep the strike"
    },
    {
      "ball": 4.6,
      "isHighlight": false,
      "text": "Rohit: \"Yeah Raul, who do we have to replace him..considering he is so edgy (sarcasm)\""
    },
    {
      "ball": 5.1,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,feet moving now for Dhawan, Johnson hurls it full into the pad, Dhawan gets legs out of the way and clips it straight to midwicket"
    },
    {
      "ball": 5.2,
      "isHighlight": true,
      "text": "Johnson to Dhawan, $$FOUR$$ ,Johnson goes full around off, and Dhawan lifts him over mid off, bends the knee and scoops it over the infield"
    },
    {
      "ball": 5.3,
      "isHighlight": false,
      "text": "Johnson to Dhawan,no run,yorker now from Johnson, dug out"
    },
    {
      "ball": 5.4,
      "isHighlight": false,
      "text": "Johnson to Dhawan,1 run,short of a length, rising on him, he pulls in the air, hasn't middled it, deep square leg fields"
    },
    {
      "ball": 5.5,
      "isHighlight": false,
      "text": "Johnson to Finch,no run,good length, on middle and off, Finch comes forward and defends"
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "Johnson to Finch,1 run,a slower one from back of a length, dropped softly in front of point for one"
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "Shivam Sharma to bowl offspin"
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "Johny: \"The free hit for Dhawan has triggered something inside, transforming him instantly...\""
    },
    {
      "ball": 6.1,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,no run,starts with a length ball from round the stumps, pushed to extra cover"
    },
    {
      "ball": 6.2,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,no run,that took off, Finch went back to try and cut this length ball but it jumped from around off, and beat him"
    },
    {
      "ball": 6.3,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,no run,comes down the track, is not to the pitch, and it pops up off pad"
    },
    {
      "ball": 6.4,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,no run,beaten on the sweep now with a pitched up one just outside off"
    },
    {
      "ball": 6.5,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,no run,pushed back to the bowler"
    },
    {
      "ball": 6.6,
      "isHighlight": false,
      "text": "Shivam Sharma to Finch,2 runs,won't be a maiden as Finch turns this through square leg for a couple"
    },
    {
      "ball": 6.6,
      "isHighlight": false,
      "text": "Akshar Patel fo left-arm spin"
    },
    {
      "ball": 7.1,
      "isHighlight": false,
      "text": "Patel to Dhawan,no run,starts with a length ball around off, is steered to backward point"
    },
    {
      "ball": 7.2,
      "isHighlight": false,
      "text": "Patel to Dhawan,1 run,comes across to punch a length ball to long on, only slight turn"
    },
    {
      "ball": 7.3,
      "isHighlight": false,
      "text": "Patel to Finch,1 run,angled in flat to the right-hander, nudged to the leg side in front of square"
    },
    {
      "ball": 7.4,
      "isHighlight": false,
      "text": "Patel to Dhawan,no run,a straighter and wider one as he comes down the track and pushes to extra cover"
    },
    {
      "ball": 7.5,
      "isHighlight": true,
      "text": "Patel to Dhawan, $$SIX$$ ,this is fuller outside off, and Dhawan has lunged forward to slog-sweep over deep midwicket"
    },
    {
      "ball": 7.6,
      "isHighlight": false,
      "text": "Patel to Dhawan,no run,tries to reverse sweep another one outside off stump, and misses"
    },
    {
      "ball": 7.6,
      "isHighlight": false,
      "text": "Mac: \"Hopefully Sunrisers are smart enough to recognise that after this positive start, Warner should be coming in at first drop (rather than down the order like he has been) so they can continue the attack and put huge pressure on! Even if SRH lose a wicket now, Warner coming in after this start could easily mean 200+.\""
    },
    {
      "ball": 8.1,
      "isHighlight": true,
      "text": "Shivam Sharma to Finch, $$OUT$$ ,Shivam strikes, a flat length delivery from round the wicket, Finch makes room to cut, but it hurries on, and stays a touch low to hit the middle stump"
    },
    {
      "ball": 8.1,
      "isHighlight": false,
      "text": "$$AJ$$ $$Finch$$ $$b$$ $$Shivam$$ $$Sharma$$ $$20$$ $$(40m$$ $$23b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$86.95$$"
    },
    {
      "ball": 8.1,
      "isHighlight": false,
      "text": "Time out. Use it wisely. Have a crack at  $$CricIQ$$  and stay in the hunt for seats at Lord's when India play England this summer."
    },
    {
      "ball": 8.1,
      "isHighlight": false,
      "text": "No Warner, here is Naman Ojha"
    },
    {
      "ball": 8.2,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,no run,length ball on middle, pushed to the off side"
    },
    {
      "ball": 8.3,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,no run,comes down the track, is not to the pitch and all, and pushes to short extra"
    },
    {
      "ball": 8.4,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,1 run,hits a similar flat length delivery past extra cover to long off"
    },
    {
      "ball": 8.5,
      "isHighlight": false,
      "text": "Shivam Sharma to Dhawan,no run,tosses it up a bit to Dhawan, he comes forward to defend"
    },
    {
      "ball": 8.6,
      "isHighlight": false,
      "text": "Shivam Sharma to Dhawan,1 run,fuller delivery tucked to deep midwicket"
    },
    {
      "ball": 8.6,
      "isHighlight": false,
      "text": "Rishi Dhawan to bowl"
    },
    {
      "ball": 9.1,
      "isHighlight": false,
      "text": "Dhawan to Dhawan,1 run,a good length around middle and leg, punched to wide long on"
    },
    {
      "ball": 9.2,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,leans forward and pushes to sweeper cover"
    },
    {
      "ball": 9.3,
      "isHighlight": false,
      "text": "Dhawan to Dhawan,1 run,length ball outside leg, Dhawan turns it in front of square, deep midwicket runs in and and keeps them to one"
    },
    {
      "ball": 9.4,
      "isHighlight": false,
      "text": "Dhawan to Ojha,no run,slanted into the right-hander's pads, he works it to short midwicket"
    },
    {
      "ball": 9.5,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,cut to sweeper cover for one more"
    },
    {
      "ball": 9.6,
      "isHighlight": false,
      "text": "Dhawan to Dhawan,1 run,a fuller one on middle and leg, Dhawan comes forward and pushes it down the ground"
    },
    {
      "ball": 9.6,
      "isHighlight": false,
      "text": "venkat: \"it is actually a good decision to send ojha in as warner would struggle against shivam. warner can come in the end and send fast bowlers into the stands\""
    },
    {
      "ball": 10.1,
      "isHighlight": false,
      "text": "Shivam Sharma to Dhawan,1 run,skips out first ball of the over, is too close to the pitch and flays it along the ground to long on"
    },
    {
      "ball": 10.2,
      "isHighlight": true,
      "text": "Shivam Sharma to Ojha, $$SIX$$ ,Ojha's walloped this over the long on boundary, it was a fuller one angled across from round the stumps, he's taken it from just outside off"
    },
    {
      "ball": 10.3,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,2 runs,goes quicker and flatter, Ojha stays in the crease and cuts with quick hands, Sandeep does well to run from sweeper cover and dive to stop it"
    },
    {
      "ball": 10.4,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,1 run,pitched up this time, and Ojha drills it powerfully down the ground, long off runs around"
    },
    {
      "ball": 10.5,
      "isHighlight": false,
      "text": "Shivam Sharma to Dhawan,no run,angled down the pads and Dhawan misses the sweep"
    },
    {
      "ball": 10.6,
      "isHighlight": false,
      "text": "Shivam Sharma to Dhawan,1 run,takes a step out to one tossed up slower, and drives along the turf to long off"
    },
    {
      "ball": 11.1,
      "isHighlight": false,
      "text": "Dhawan to Dhawan,5 wides,back of a length and just down the leg side, clips the thigh pad, brushes the keeper's gloves and races fine, given wide"
    },
    {
      "ball": 11.1,
      "isHighlight": true,
      "text": "Dhawan to Dhawan, $$OUT$$ ,Dhawan has another gift on the pad, and he's whipped the short of a length ball straight to short fine leg, he turns around in disappointment and walks back"
    },
    {
      "ball": 11.1,
      "isHighlight": false,
      "text": "$$S$$ $$Dhawan$$ $$c$$ $$Shivam$$ $$Sharma$$ $$b$$ $$Dhawan$$ $$45$$ $$(54m$$ $$37b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$121.62$$"
    },
    {
      "ball": 11.1,
      "isHighlight": false,
      "text": "Warner is in"
    },
    {
      "ball": 11.2,
      "isHighlight": false,
      "text": "Dhawan to Warner,1 run,comes out of the crease first ball and tucks a length ball to deep midwicket"
    },
    {
      "ball": 11.3,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,Ojha languidly lofts a length delivery over extra cover with an open face, long off gets to it"
    },
    {
      "ball": 11.4,
      "isHighlight": false,
      "text": "Dhawan to Warner,no run,makes some room and opens the face to squeeze a fuller one from leg to the off side, but straight to extra cove"
    },
    {
      "ball": 11.5,
      "isHighlight": false,
      "text": "Dhawan to Warner,1 run,a length ball on middle and leg, tucked behind square"
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,Ojha is looking in nice touch, he stands in the crease and thumps a pitched up delivery to wide long off"
    },
    {
      "ball": 12.1,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,no run,stays in the crease and tries to cut this straightening length ball, is beaten"
    },
    {
      "ball": 12.2,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha,1 run,this is fuller and again Ojha smashes it down to wide long off"
    },
    {
      "ball": 12.3,
      "isHighlight": false,
      "text": "Shivam Sharma to Warner,2 runs,that is straight to Sehwag at backward point, and straight through him as Warner connects on the reverse sweep"
    },
    {
      "ball": 12.4,
      "isHighlight": false,
      "text": "Shivam Sharma to Warner,1 run,comes across and nudges off the pad to fine leg"
    },
    {
      "ball": 12.5,
      "isHighlight": true,
      "text": "Shivam Sharma to Ojha, $$SIX$$ ,Ojha's connected big again, taken a full delivery from outside off and swatted it just over long on's jump"
    },
    {
      "ball": 12.6,
      "isHighlight": false,
      "text": "Shivam Sharma to Ojha, $$SIX$$ ,no chance of being caught off this one, full again, around off stump, and Ojha goes dead straight, into the sightscreen, he isn't stepping out, just fetching them from the crease"
    },
    {
      "ball": 13.1,
      "isHighlight": false,
      "text": "Patel to Warner,no run,Warner cuts hard, but straight to backward point"
    },
    {
      "ball": 13.2,
      "isHighlight": false,
      "text": "Patel to Warner,no run,pushed but straight to extra cover"
    },
    {
      "ball": 13.3,
      "isHighlight": false,
      "text": "Patel to Warner,1 run,a fuller one just outside off, worked down to long on"
    },
    {
      "ball": 13.4,
      "isHighlight": false,
      "text": "Patel to Ojha,1 run,turned off the pad in front of square leg"
    },
    {
      "ball": 13.5,
      "isHighlight": false,
      "text": "Patel to Warner,no run,wide and straight, Warner reaches for it, but bottom edges it to the bowler"
    },
    {
      "ball": 13.6,
      "isHighlight": false,
      "text": "Patel to Warner,1 run,Warner on the knee for the big slog sweep, but mishits it on the bounce to long on"
    },
    {
      "ball": 14.1,
      "isHighlight": true,
      "text": "Dhawan to Warner, $$SIX$$ ,Warner tried the slog sweep last over, this time he's taken to this length ball outside leg stump and smashed it way over deep midwiceket"
    },
    {
      "ball": 14.1,
      "isHighlight": false,
      "text": "edwintapiwa: \"they should seriously consider dropping Finch for Brendan Taylor, with today`s strike rate and his 50 last game not ideal\""
    },
    {
      "ball": 14.2,
      "isHighlight": false,
      "text": "Dhawan to Warner,1 run,another length ball down the leg side, he gets away as Bailey dives and stops at short fine leg"
    },
    {
      "ball": 14.3,
      "isHighlight": false,
      "text": "Dhawan to Ojha,no run,around the blockhole, squeezed out to extra cover"
    },
    {
      "ball": 14.4,
      "isHighlight": true,
      "text": "Dhawan to Ojha, $$SIX$$ ,full and wide, Ojha goes after it, and lofts it high over extra cover, he's connected almost every time today"
    },
    {
      "ball": 14.5,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,smacks a full one down to long on now"
    },
    {
      "ball": 14.6,
      "isHighlight": false,
      "text": "Dhawan to Warner,2 runs,makes room outside leg stump and square drives, sweeper cover has some running to do"
    },
    {
      "ball": 14.6,
      "isHighlight": false,
      "text": "Warner's reached 5000 T20 runs, the fifth one to do so"
    },
    {
      "ball": 15.1,
      "isHighlight": false,
      "text": "Patel to Ojha,1 run,angled into the pad, turned to fine leg"
    },
    {
      "ball": 15.2,
      "isHighlight": false,
      "text": "Patel to Warner,1 run,slogs a flat length ball from outside off to long on"
    },
    {
      "ball": 15.3,
      "isHighlight": false,
      "text": "Patel to Ojha,no run,skips out and square drives, cannot beat backward point"
    },
    {
      "ball": 15.4,
      "isHighlight": true,
      "text": "Patel to Ojha, $$FOUR$$ ,Ojha keeps hitting boundaries, he steps out, takes the length ball and lofts it flat over extra cover"
    },
    {
      "ball": 15.5,
      "isHighlight": false,
      "text": "Patel to Ojha, $$FOUR$$ ,easily done, lots of width on the quick delivery outside off, and Ojha cuts it crisply between backward point and short third man"
    },
    {
      "ball": 15.6,
      "isHighlight": false,
      "text": "Patel to Ojha,1 run,he looks to whack this over midwicket but mishits it high in the air, it falls in vacant space in that region"
    },
    {
      "ball": 15.6,
      "isHighlight": false,
      "text": "Johnson to bowl out"
    },
    {
      "ball": 15.6,
      "isHighlight": false,
      "text": "Ashwin: \"With Ojha in form and Warner along with him SRH look set to reach 180 and it will be very hard for Maxwell and co. to get those runs should Steyn and Bhuvi make inroads early.\""
    },
    {
      "ball": 16.1,
      "isHighlight": false,
      "text": "Johnson to Ojha,1 run,opens the face to a widish length ball and runs it to third man"
    },
    {
      "ball": 16.2,
      "isHighlight": false,
      "text": "Johnson to Warner, $$FOUR$$ ,mid off is up, Warner makes room to a full delivery on middle and leg, and lofts it cleanly over the man"
    },
    {
      "ball": 16.3,
      "isHighlight": false,
      "text": "Johnson to Warner,no run,a slower one into the pad, Warner cannot connect as he looks to turn it square"
    },
    {
      "ball": 16.4,
      "isHighlight": false,
      "text": "Johnson to Warner, $$FOUR$$ ,this is a sharp short ball and Warner is hurried, but he arches back and pulls hard past short fine leg"
    },
    {
      "ball": 16.5,
      "isHighlight": false,
      "text": "Johnson to Warner,1 run,full down the leg side as Warner makes room, he gets his leg out of the way as he jabs it to square leg, fielder has a go and misses, and another run is conceded"
    },
    {
      "ball": 16.6,
      "isHighlight": false,
      "text": "Johnson to Ojha,1 run,slow length ball pushed in the air to the sweeper"
    },
    {
      "ball": 16.6,
      "isHighlight": false,
      "text": "Mahe: \"Since M&M come in for middle-overs, it would be wise to bring Steyn then only. Bhuvi and Irfan can deal in power-play..\""
    },
    {
      "ball": 17.1,
      "isHighlight": false,
      "text": "Patel to Ojha,no run,Ojha has a rare miss this innings, as he fails to pull one angled flat into him"
    },
    {
      "ball": 17.2,
      "isHighlight": false,
      "text": "Patel to Ojha,1 run,worked down to long on for a single"
    },
    {
      "ball": 17.3,
      "isHighlight": true,
      "text": "Patel to Warner, $$SIX$$ ,a tossed up helpful full toss, Warner cranks up and thumps it over deep midwicket off the front foot"
    },
    {
      "ball": 17.4,
      "isHighlight": false,
      "text": "Patel to Warner, $$FOUR$$ ,comes down the track, Patel drags it short, Warner pulls, long on gets to it with a dive, but it is it so hard it ricochets into the boundary"
    },
    {
      "ball": 17.5,
      "isHighlight": true,
      "text": "Patel to Warner, $$SIX$$ ,Warner goes a step back in the crease and pummels a powerful slog sweep now, into the crowd over deep midwicket"
    },
    {
      "ball": 17.6,
      "isHighlight": false,
      "text": "Patel to Warner,1 run,cannot get under this full ball and drags the slog along the turf to deep midwicket"
    },
    {
      "ball": 17.6,
      "isHighlight": false,
      "text": "Kartik: \"@Mahe How can u even ask Irfan who is so low on confidence to bowl to Sehwag in the power play? He is the perfect bowler for Sehwag to capitalize\""
    },
    {
      "ball": 18.1,
      "isHighlight": true,
      "text": "Sandeep Sharma to Warner,1 wide,Warner backs away to the leg side, Sandeep goes full and wide, outside the marker, late call for wide from umpire Kulkarni"
    },
    {
      "ball": 18.1,
      "isHighlight": true,
      "text": "Sandeep Sharma to Warner,1 run,  $$OUT$$ ,uh oh, what a giveaway, Warner squeezes a full delivery wide of the sweeper, he wants two, but Ojha has already settled for one, he holds up a hand and shouts no to his partner, Warner has his mind on getting the strike back, he is already half way up the pitch, the throw comes in to Sandeep, and Warner walks back in disgust"
    },
    {
      "ball": 18.1,
      "isHighlight": false,
      "text": "$$DA$$ $$Warner$$ $$run$$ $$out$$ $$44$$ $$(31m$$ $$23b$$ $$3x4$$ $$3x6)$$ $$SR:$$ $$191.30$$"
    },
    {
      "ball": 18.2,
      "isHighlight": true,
      "text": "Sandeep Sharma to Ojha, $$FOUR$$ ,a full toss outside off, Ojha reaches fifty as he slices it to the deep point boundary"
    },
    {
      "ball": 18.2,
      "isHighlight": false,
      "text": "Round the stumps"
    },
    {
      "ball": 18.3,
      "isHighlight": true,
      "text": "Sandeep Sharma to Ojha,(no ball)  $$SIX$$ ,a nightmare afternoon for Sandeep continues, a high full toss above the waist down the leg side, Ojha wallops it over the man at fine leg"
    },
    {
      "ball": 18.3,
      "isHighlight": false,
      "text": "Sandeep Sharma to Ojha,3 runs,square drives a slower one, and gets it in the gap at cover, Johnson labours after it, and pulls it back inches from the rope"
    },
    {
      "ball": 18.4,
      "isHighlight": true,
      "text": "Sandeep Sharma to Henriques, $$OUT$$ ,gone first ball, as he mishits a slower length ball in the air, and Miller runs to his right from long on to take it"
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "$$MC$$ $$Henriques$$ $$c$$ $$Miller$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$0$$ $$(3m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"
    },
    {
      "ball": 18.5,
      "isHighlight": false,
      "text": "Sandeep Sharma to Ojha, $$FOUR$$ ,short and wide, Ojha waits and places the cut past backward point's dive"
    },
    {
      "ball": 18.6,
      "isHighlight": true,
      "text": "Sandeep Sharma to Ojha, $$SIX$$ ,terrible end to a terrible spell, a length ball outside off, Ojha smashes it over the wide long off boundary"
    },
    {
      "ball": 18.6,
      "isHighlight": false,
      "text": "This is the  $$second-most$$ $$expensive$$ $$spell$$  in the IPL"
    },
    {
      "ball": 19.1,
      "isHighlight": false,
      "text": "Dhawan to Pathan,1 run,squeezes it down to third man"
    },
    {
      "ball": 19.2,
      "isHighlight": true,
      "text": "Dhawan to Ojha,2 wides,nothing going right for Kings XI, this is wide down leg, bounces in front of the keeper, rolls away from him towards short third man"
    },
    {
      "ball": 19.2,
      "isHighlight": false,
      "text": "Dhawan to Pathan, $$OUT$$ ,Irfan goes for the six, connects with the full ball outside off and holes out to wide long on"
    },
    {
      "ball": 19.2,
      "isHighlight": false,
      "text": "$$IK$$ $$Pathan$$ $$c$$ $$Miller$$ $$b$$ $$Dhawan$$ $$1$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"
    },
    {
      "ball": 19.3,
      "isHighlight": false,
      "text": "Dhawan to Ojha,1 run,gets a full toss, but hits it off the inner part of the bat to deep midwicket"
    },
    {
      "ball": 19.4,
      "isHighlight": false,
      "text": "Dhawan to Sharma,1 run,a wide, low full toss, he reaches for it, but cannot reach backward point"
    },
    {
      "ball": 19.5,
      "isHighlight": true,
      "text": "Dhawan to Ojha, $$SIX$$ ,Ojha can't do anything wrong today, a full delivery, on the stumps, under the bat, and lofted straight, lands in front of the sightscreen"
    },
    {
      "ball": 19.6,
      "isHighlight": true,
      "text": "Dhawan to Ojha,1 run,a low full toss on leg stump, hit down to long on"
    },
    {
      "ball": 19.6,
      "isHighlight": false,
      "text": "$$Warner$$ : \"Naman played with freedom today, that is what we asked from him. It is always tough to come in and get going but I am enjoying it at the moment. The slower balls held in the wicket a little bit.\""
    },
    {
      "ball": 19.6,
      "isHighlight": false,
      "text": "When he is in touch, Naman Ojha is a fantastic timer of the ball. He's given Sunrisers a 200-plus total to defend, but if any line-up can chase it down, it is Maxwell and co"
    }
  ],
  "name": "Sunrisers Hyderabad v Kings XI Punjab",
  "innings": "Sunrisers Hyderabad  innings",
  "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734007.html?innings=1;view=commentary",
  "match_num": 39
}