{
  "commentary": [
    {
      "ball": 0,
      "isHighlight": false,
      "text": "Brendon McCullum might be back but it's still Faf du Plessis at the top of the order. Dwayne Smith is his partner. Mumbai Indians will open with Praveen Kumar. Slip and short midwicket in"
    },
    {
      "ball": 0.1,
      "isHighlight": false,
      "text": "Kumar to Smith,no run,what a ripper! This darted back off the seam and missed off stump by a whisker. Smith was rooted to the crease as he went for a cross-batted hoick through the leg side and is soundly beaten"
    },
    {
      "ball": 0.2,
      "isHighlight": true,
      "text": "Kumar to Smith, $$FOUR$$ ,not this time. he's a littler shorter and the movement is considerably less. Smith steps forward and belts it through midwicket"
    },
    {
      "ball": 0.3,
      "isHighlight": false,
      "text": "Kumar to Smith,no run,miscues a drive on the up and finds mid-on"
    },
    {
      "ball": 0.4,
      "isHighlight": false,
      "text": "Kumar to Smith,1 leg bye,full and speared into his pads, Smith wanted to whip it away behind square but doesn't succeed. Big appeal from the bowler, but that was always missing the stumps"
    },
    {
      "ball": 0.5,
      "isHighlight": false,
      "text": "Kumar to du Plessis,no run,it's the outswinger now and Faf is left groping outside off. Good length ball weaves away in the air and then moves away off the deck as well"
    },
    {
      "ball": 0.6,
      "isHighlight": false,
      "text": "Kumar to du Plessis,1 leg bye,dances down to negate the swing but the inward movement is just enough to foil his flick through midwicket. The ball wanders towards slip who sends in a throw at the keeper's end. The deflection gifts a run"
    },
    {
      "ball": 0.6,
      "isHighlight": false,
      "text": "Anderson from the other end"
    },
    {
      "ball": 1.1,
      "isHighlight": false,
      "text": "Anderson to du Plessis, $$FOUR$$ ,dances down and lashes it through extra cover. Rohit runs to his left and dives, but lets it through his hands. He lands awkwardly on his left shoulder but all seems fine"
    },
    {
      "ball": 1.2,
      "isHighlight": false,
      "text": "Anderson to du Plessis,1 run,advances and he swings off his hips, the thick outside edge flies to third man."
    },
    {
      "ball": 1.2,
      "isHighlight": false,
      "text": "There seems to be some dew on the ground now."
    },
    {
      "ball": 1.3,
      "isHighlight": false,
      "text": "Anderson to Smith,1 run,tucks him up on middle and leg, with a tiny bit of shape into him. Smith works it towards midwicket"
    },
    {
      "ball": 1.4,
      "isHighlight": false,
      "text": "Anderson to du Plessis,no run,fullish and just outside off, Faf pushes into the covers"
    },
    {
      "ball": 1.4,
      "isHighlight": false,
      "text": "Karthick: \"I dont understand Dhoni! Baz was not in playing XI past 2 matches,So faf was best option to open the innings. I dont know why he(Baz) was pushed down the order!\""
    },
    {
      "ball": 1.5,
      "isHighlight": true,
      "text": "Anderson to du Plessis, $$FOUR$$ ,wonder if that's why. This was dug in and as Faf was pushing forward. But still he was able to shift his balance well enough to pull behind square leg"
    },
    {
      "ball": 1.6,
      "isHighlight": false,
      "text": "Anderson to du Plessis,no run,this time his swing isn't quite as well timed as Anderson dupes him with a slower ball pushed across him"
    },
    {
      "ball": 2.1,
      "isHighlight": false,
      "text": "Kumar to Smith,no run,Praveen keeps smith guessing, a short of length ball nips in a long way, Smith responds with a slog across the line, doesn't connect"
    },
    {
      "ball": 2.2,
      "isHighlight": false,
      "text": "Kumar to Smith,1 run,this one goes away from the batsman, Smith dabs it towards cover and pinches a tight single"
    },
    {
      "ball": 2.2,
      "isHighlight": false,
      "text": "Keeper standing up, though the ball is swinging big"
    },
    {
      "ball": 2.3,
      "isHighlight": false,
      "text": "Kumar to du Plessis,1 run,outside off and moving away, taken by the keeper"
    },
    {
      "ball": 2.4,
      "isHighlight": true,
      "text": "Kumar to Smith,no run,the worst decision of the IPL? Oxenford thinks that is going down, but there is no way that that is going to miss the stumps, a beautiful curving delivery comes in, beats Smith's bat and strikes his back leg dead in front, Praveen looks on in disbelief after his appeal is turned down, you can sympatise with him"
    },
    {
      "ball": 2.5,
      "isHighlight": false,
      "text": "Kumar to Smith,1 run,a low full toss is swatted away towards deep square leg, Anderson does well to cut that off at the rope"
    },
    {
      "ball": 2.6,
      "isHighlight": false,
      "text": "Kumar to du Plessis,1 run,full and on the stumps, to midwicket for a single"
    },
    {
      "ball": 3.1,
      "isHighlight": false,
      "text": "Anderson to du Plessis,1 run,chopped towards point, Ben Dunk moves across from cover and dives to stop that one"
    },
    {
      "ball": 3.2,
      "isHighlight": false,
      "text": "Anderson to Smith,1 run,guides it down towards third man for a single"
    },
    {
      "ball": 3.3,
      "isHighlight": false,
      "text": "Anderson to du Plessis, $$FOUR$$ ,short of length ball, Faf skips down the track and wants to launch that over mid-off, mistimes it and the ball flies agonisingly wide of a leaping Rohit"
    },
    {
      "ball": 3.4,
      "isHighlight": true,
      "text": "Anderson to du Plessis,2 runs,another half-chance, this should have been taken, a top edge towards deep square leg, Rayudu is coming in from the rope, Harbhajan is going back to take that skier, there is confusion between the two, neither makes an effort to take it, it lands between them, Rohit is less than impressed"
    },
    {
      "ball": 3.5,
      "isHighlight": true,
      "text": "Anderson to du Plessis, $$SIX$$ ,no doubt about that one, slugged powerfully over square leg for six, way into the crowd, Chennai making strong start here"
    },
    {
      "ball": 3.6,
      "isHighlight": false,
      "text": "Anderson to du Plessis, $$FOUR$$ ,four more, Anderson tries the slower one, it is dismissed towards cow corner for a boundary"
    },
    {
      "ball": 4.1,
      "isHighlight": false,
      "text": "Kumar to Smith,1 run,pushed towards cover point for a single"
    },
    {
      "ball": 4.2,
      "isHighlight": false,
      "text": "Kumar to du Plessis,no run,too wide from Praveen but he gets away with it, slapped straight to cover point"
    },
    {
      "ball": 4.3,
      "isHighlight": false,
      "text": "Kumar to du Plessis,1 run,this one curves in towards middle and leg, Faf is cramped as he charges out, can't free his arms, he jabs the ball towards midwicket"
    },
    {
      "ball": 4.4,
      "isHighlight": false,
      "text": "Kumar to Smith,1 run,short of length ball on off stump, clipped towards deep midwicket for a single"
    },
    {
      "ball": 4.4,
      "isHighlight": false,
      "text": "Bhav: \"Lack of a fifth bowler has really hurt Mumbai this year. Pollard and Anderson both have ludicrous averages. \""
    },
    {
      "ball": 4.5,
      "isHighlight": false,
      "text": "Kumar to du Plessis,1 run,full ball well outside off, deflected towards backward point"
    },
    {
      "ball": 4.5,
      "isHighlight": false,
      "text": "Harsha Bhigle tweets: \"i really do think my \"pt sir\" at school would have asked rayudu and harbhajan to run 5 rounds after play for that\" There was no calling at all between the two of them, one of them should have got under that chance."
    },
    {
      "ball": 4.6,
      "isHighlight": false,
      "text": "Kumar to Smith,1 run,the ball moves in once more from Praveen, smith looks to drive, gets a thick inside-edge towards midwicket, Praveen grimaces in frustration"
    },
    {
      "ball": 4.6,
      "isHighlight": false,
      "text": "Padmanabhan: \"Am a CSK fan, but this is atrocious umpiring. I feel for MI fans!\""
    },
    {
      "ball": 5.1,
      "isHighlight": false,
      "text": "Bumrah to Smith,no run,full ball from Bumrah to start, Smith is a bit surprised by that one, he is looking to nudge that off the pads to square leg, off the back of the bat to the off side"
    },
    {
      "ball": 5.2,
      "isHighlight": false,
      "text": "Bumrah to Smith, $$FOUR$$ ,Smith living on the edge here, outside one this time, if there was slip, this was a sitter, there isn't one and he survives, once more smith was looking to work the ball towards the leg side"
    },
    {
      "ball": 5.3,
      "isHighlight": true,
      "text": "Bumrah to Smith, $$FOUR$$ ,this time the trademark Smith mow connects well, that means the ball is flying to the midwicket boundary"
    },
    {
      "ball": 5.4,
      "isHighlight": true,
      "text": "Bumrah to Smith, $$FOUR$$ ,backs away from the stumps, Smith thumps that over point for four more, the runs coming quick here, it was back of a length and just outside off, Smith looking to hit everything here"
    },
    {
      "ball": 5.5,
      "isHighlight": false,
      "text": "Bumrah to Smith,1 run,slower, 111kph, wide outside off, Smith wants to thump that to the leg side as well, reaches out and slugs it to midwicket"
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "Bumrah to du Plessis, $$FOUR$$ ,low full toss as he tries for the yorker, squeezed to the backward point boundary for four more, that's the fourth four of the over, Chennai are running away with this"
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "$$Time-out$$ ."
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "ashok: \"Surprising to see the pace generated by Bumrah bowling with a straight arm , not even 1 degree bend noticed .. \""
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "VJain: \"There should be reviews allowed in IPL. I am sure all franchises will agree.\""
    },
    {
      "ball": 5.6,
      "isHighlight": false,
      "text": "Srini: \"It's CSK's match to lose from this point on. MI missed at least 25-30 runs due to batsmen procession at the end.\""
    },
    {
      "ball": 6.1,
      "isHighlight": false,
      "text": "Harbhajan Singh to Smith,no run,Harbhajan begins with a short of length ball outside off, defended down the track"
    },
    {
      "ball": 6.2,
      "isHighlight": true,
      "text": "Harbhajan Singh to Smith, $$OUT$$ ,flighted length ball, Smith wanted to slog that out of the park, he get it on the toe end of the bat, Pollard lying in wait at long-on, Smith's chancy innings is over"
    },
    {
      "ball": 6.2,
      "isHighlight": false,
      "text": "$$DR$$ $$Smith$$ $$c$$ $$Pollard$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$24$$ $$(30m$$ $$20b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$120.00$$"
    },
    {
      "ball": 6.3,
      "isHighlight": false,
      "text": "Harbhajan Singh to du Plessis,1 wide,flighted once more, but it drifts down the leg side"
    },
    {
      "ball": 6.3,
      "isHighlight": false,
      "text": "Harbhajan Singh to du Plessis,1 wide,another one down the leg side"
    },
    {
      "ball": 6.3,
      "isHighlight": false,
      "text": "Harbhajan Singh to du Plessis,1 run,flighted and spinning in, towards short fine leg for a single"
    },
    {
      "ball": 6.4,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,length ball from round the wicket, tapped towards deep point for a single"
    },
    {
      "ball": 6.5,
      "isHighlight": true,
      "text": "Harbhajan Singh to du Plessis, $$OUT$$ ,and another one, picks out the man at long-off, both openers are dismissed, Mumbai aren't out of this, Faf plays a lofted inside-out drive, not looking to really power it to clear the man in the deep"
    },
    {
      "ball": 6.5,
      "isHighlight": false,
      "text": "$$F$$ $$du$$ $$Plessis$$ $$c$$ $$sub$$ $$(BR$$ $$Dunk)$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$35$$ $$(34m$$ $$20b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$175.00$$"
    },
    {
      "ball": 6.6,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,no run,on off stump from round the wicket, defended by Raina, and that over cost only four runs, there's spin in this track, Harbhajan and Ojha key here for Mumbai's chances, CSK still on top though"
    },
    {
      "ball": 7.1,
      "isHighlight": false,
      "text": "Anderson to McCullum,1 run,short of length ball outside off, guided down to third man for a single"
    },
    {
      "ball": 7.2,
      "isHighlight": false,
      "text": "Anderson to Raina,1 run,short ball at 134kph, pulled away towards deep square leg for a single"
    },
    {
      "ball": 7.3,
      "isHighlight": false,
      "text": "Anderson to McCullum,no run,ouch! McCullum goes for the pull but that bounces more than McCullum expects, and the ball smashes flush onto the grille of the helmet, the startled McCullum nearly knocks over the bails as he completes the follow through of his stroke, think his helmet needs to be fixed as well"
    },
    {
      "ball": 7.4,
      "isHighlight": false,
      "text": "Anderson to McCullum,no run,short of length ball outside off, glided towards backward point, straight at the fielder"
    },
    {
      "ball": 7.5,
      "isHighlight": false,
      "text": "Anderson to McCullum,1 leg bye,short of length ball on the pads, down towards short fine for one"
    },
    {
      "ball": 7.5,
      "isHighlight": false,
      "text": "Shibu: \"What is Rohit doing? The ball is obviously turning well for spinners - why isn't he bringing in Ojha against the new batsmen instead of Corey Anderson - that'd just give them time to get settled in!\""
    },
    {
      "ball": 7.6,
      "isHighlight": false,
      "text": "Anderson to Raina,1 wide,wide down the leg side, Raina moved across looking to glance that but he misses"
    },
    {
      "ball": 7.6,
      "isHighlight": false,
      "text": "Anderson to Raina, $$FOUR$$ ,short and wide, slapped towards deep backward point for four, that was a poor delivery to end the over"
    },
    {
      "ball": 7.6,
      "isHighlight": false,
      "text": "VJain: \"I think an excellent decision by Rohit to bring in Anderson and get done with the 5th bowler while the new batsmen are in. Anderson/Pollard bowling after 14th over will be a wash out.\""
    },
    {
      "ball": 8.1,
      "isHighlight": false,
      "text": "Harbhajan Singh to McCullum,no run,huge appeal for a catch, Oxenford says that is not out, he's right this time, McCullum goes for the reverse sweep, off the arm"
    },
    {
      "ball": 8.2,
      "isHighlight": false,
      "text": "Harbhajan Singh to McCullum,no run,defended to the leg side this time"
    },
    {
      "ball": 8.3,
      "isHighlight": true,
      "text": "Harbhajan Singh to McCullum, $$SIX$$ ,McCullum springs down the track and clobbers that out of the park, a huge hit over long-off for six"
    },
    {
      "ball": 8.4,
      "isHighlight": false,
      "text": "Harbhajan Singh to McCullum,no run,quicker one, defended by McCullum"
    },
    {
      "ball": 8.5,
      "isHighlight": false,
      "text": "Harbhajan Singh to McCullum,1 run,thick leading edge as he looks to work the ball to the leg side, the ball runs away towards cover"
    },
    {
      "ball": 8.6,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,spinning away outside off, Raina waits on the backfoot and slaps that towards deep backward poiint for a single"
    },
    {
      "ball": 9.1,
      "isHighlight": false,
      "text": "Ojha to Raina,1 run,Ojha starts from round the wicket, a touch short from him, slugged towards midwicket"
    },
    {
      "ball": 9.2,
      "isHighlight": true,
      "text": "Ojha to McCullum, $$SIX$$ , $$dropped$$ , that is a tough chance, McCullum hits it off the bottom of the bat towards Ben Dunk at long-on, Dunk is unsure of exactly how far away from the rope he is, has to leap up to take that overhead chance and then balance himself, Pollard would have done it, Dunk can't, let's the ball through for six"
    },
    {
      "ball": 9.3,
      "isHighlight": true,
      "text": "Ojha to McCullum, $$OUT$$ ,McCullum's gone next ball though, charges down the track, the ball is short and spins away from him, McCullum is stranded yards outside, pretty embarrassing for the batsman to be undone like that"
    },
    {
      "ball": 9.3,
      "isHighlight": false,
      "text": "$$BB$$ $$McCullum$$ $$st$$ $$†Tare$$ $$b$$ $$Ojha$$ $$14$$ $$(14m$$ $$11b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$127.27$$"
    },
    {
      "ball": 9.4,
      "isHighlight": false,
      "text": "Ojha to Hussey,1 run,D Hussey goes well back and guides the ball towards cover"
    },
    {
      "ball": 9.5,
      "isHighlight": false,
      "text": "Ojha to Raina,1 run,spins in towards Raina's body, Raina slaps this towards deep midwicket"
    },
    {
      "ball": 9.6,
      "isHighlight": false,
      "text": "Ojha to Hussey,no run,length ball is driven towards his brother Michael Hussey, 'yours Huss,' is the shout from the field"
    },
    {
      "ball": 10.1,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,no run,quicker and just outside off, sliced off the back foot towards backward point"
    },
    {
      "ball": 10.2,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,2 runs,short of length ball, Raina puts that away towards cow corner, two men in the deep there though and he can't find the rope"
    },
    {
      "ball": 10.3,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,no run,flighted length ball on off stump, defended to the off side"
    },
    {
      "ball": 10.4,
      "isHighlight": true,
      "text": "Harbhajan Singh to Raina, $$SIX$$ ,what a shot that is, Raina skips down the track and launches that over extra cover with the spin, a tough shot but not if you saw Raina execute it, clean hit with minimal effort"
    },
    {
      "ball": 10.5,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,driven towards long-on for a single"
    },
    {
      "ball": 10.5,
      "isHighlight": false,
      "text": "666 sixes now hit in the IPL this season"
    },
    {
      "ball": 10.6,
      "isHighlight": false,
      "text": "Harbhajan Singh to Hussey,no run,Hussey is beaten by the last ball of the over, he ends up playing inside the line of the delivery as he looks to defend, extra bounce as well there for Harbhajan"
    },
    {
      "ball": 11.1,
      "isHighlight": false,
      "text": "Ojha to Raina,1 run,short and wide outside off, should have been put away, Raina only stab it towards backward point where Praveen is struck on the forearm, seems to have hurt himself"
    },
    {
      "ball": 11.2,
      "isHighlight": false,
      "text": "Ojha to Hussey,1 run,turning across, driven towards cover for a single, the 100 comes up"
    },
    {
      "ball": 11.3,
      "isHighlight": false,
      "text": "Ojha to Raina,3 runs,launches this towards deep extra cover, Ben dunk has to motor across fron long-off, Dunk dives to get a hand on the ball and as he slides towards the rope, he lets the ball go, good bit of  fielding"
    },
    {
      "ball": 11.4,
      "isHighlight": false,
      "text": "Ojha to Hussey,no run,defended to the leg side"
    },
    {
      "ball": 11.5,
      "isHighlight": false,
      "text": "Ojha to Hussey,no run,more watchfulness from Hussey"
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": "Ojha to Hussey,no run,three dot balls to end the over, Hussey drives the final ball towards extra cover"
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": "Swapnil Sanghai: \"Whenever Raina comes in for chase like this, he ensures at least one boundary every over and opponent never realizes that they are out of match\""
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": "Harbhajan's final over."
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": ""
    },
    {
      "ball": 11.6,
      "isHighlight": false,
      "text": "Dhoni: \"Raina has again scored more than 400 runs in the IPL. 7 seasons in a row . whadaplayyyaaaaaaaaa.\""
    },
    {
      "ball": 12.1,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,flicked to midwicket"
    },
    {
      "ball": 12.2,
      "isHighlight": false,
      "text": "Harbhajan Singh to Hussey,1 run,sort of length ball is thumped towards long-on for a single"
    },
    {
      "ball": 12.2,
      "isHighlight": false,
      "text": "Senkgutttuvan P: \"Congratulations to Suresh Raina for scoring 400runs...Only player to score 400 in all seasons!!! Happy CSK fan!!\""
    },
    {
      "ball": 12.3,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,well outside off, Raina wanted to late cut that towards third man, off the keeper's gloves towards short third"
    },
    {
      "ball": 12.4,
      "isHighlight": false,
      "text": "Harbhajan Singh to Hussey,1 run,pokes the ball to midwicket for a single"
    },
    {
      "ball": 12.5,
      "isHighlight": false,
      "text": "Harbhajan Singh to Raina,1 run,spinning away after pitching on off and middle, uppish off the edge towards cover, safe for Raina though"
    },
    {
      "ball": 12.6,
      "isHighlight": false,
      "text": "Harbhajan Singh to Hussey,1 run,full ball just outside off, whipped towards deep square leg, Raina wants the second, Hussey doesn't"
    },
    {
      "ball": 12.6,
      "isHighlight": false,
      "text": "$$Time-out$$"
    },
    {
      "ball": 12.6,
      "isHighlight": false,
      "text": "Lots of Mumbai fans asking, Murali J: \"Is there a chance for Malinga to bowl couple of overs now for MI?\""
    },
    {
      "ball": 12.6,
      "isHighlight": false,
      "text": "Bumrah to bowl, big moment for him"
    },
    {
      "ball": 13.1,
      "isHighlight": false,
      "text": "Bumrah to Hussey, $$FOUR$$ ,lovely shot from Hussey, that was short and outside off, steered away wide of third man and backward point for four"
    },
    {
      "ball": 13.2,
      "isHighlight": false,
      "text": "Bumrah to Hussey,no run,angling in towards off stump, defended towards backward point"
    },
    {
      "ball": 13.3,
      "isHighlight": false,
      "text": "Bumrah to Hussey,no run,length ball heading for off once more, Hussey slugs that towards midwicket, sharp stop from Harbhajan there"
    },
    {
      "ball": 13.4,
      "isHighlight": false,
      "text": "Bumrah to Hussey,1 run,too wide from Bumrah, slower one, the first ball of the over had been a similar length, Hussey used the pace to put it away for four, this time he can only guide it towards deep point for a single"
    },
    {
      "ball": 13.5,
      "isHighlight": false,
      "text": "Bumrah to Raina,no run,a 136.8kph bouncer from Bimrah, Raina initially shapes to play a shot, but then decides against it"
    },
    {
      "ball": 13.6,
      "isHighlight": false,
      "text": "Bumrah to Raina, $$FOUR$$ ,short of length ball on leg stump, sits up to be hit, Raina hits it to deep midwicket for four, Anderson sprints across and though he covers a lots of ground, he has too much to do"
    },
    {
      "ball": 14.1,
      "isHighlight": false,
      "text": "Kumar to Hussey,1 run,Praveen's final over starts with a short of length ball that is inside-edged towards midwicket"
    },
    {
      "ball": 14.1,
      "isHighlight": false,
      "text": "Praveen has given his thick gold chain to the umpire (only temporarily, I presume)."
    },
    {
      "ball": 14.2,
      "isHighlight": false,
      "text": "Kumar to Raina,2 runs,short of length and outside off, glided down to third man, Raina sprints the first, a touch lazy from Bumrah, Raina pounces on the chance to take the second, Praveen is less than happy"
    },
    {
      "ball": 14.3,
      "isHighlight": false,
      "text": "Kumar to Raina,2 runs,full ball on the pads, squeezed out towards deep backward point, once again they take two to Bumrah, though this time the ball was well wide of him"
    },
    {
      "ball": 14.4,
      "isHighlight": false,
      "text": "Kumar to Raina,2 runs,a yorker on legstump from round the wicket, jammed out towards deep backward square leg for two more"
    },
    {
      "ball": 14.5,
      "isHighlight": false,
      "text": "Kumar to Raina,1 run,full toss outside off, moves across and sweeps that, straight to square leg but still steals a single"
    },
    {
      "ball": 14.6,
      "isHighlight": true,
      "text": "Kumar to Hussey, $$SIX$$ ,an amazing hit from David Hussey! that was a full ball from Praveen, Hussey mananges to get under that somehow, and manages to find the power to send that over sweeper cover for six, top shot, 16 off the over, CSK in charge"
    },
    {
      "ball": 15.1,
      "isHighlight": false,
      "text": "Ojha to Raina,1 run,length ball is driven towards long-off for a single"
    },
    {
      "ball": 15.2,
      "isHighlight": true,
      "text": "Ojha to Hussey, $$SIX$$ ,drops it short, sits up for him, Hussey hammers that over wide long-on, he started slowly but he is 23 off 17"
    },
    {
      "ball": 15.3,
      "isHighlight": false,
      "text": "Ojha to Hussey,no run,flat-batted towards mid-off, no run"
    },
    {
      "ball": 15.4,
      "isHighlight": true,
      "text": "Ojha to Hussey, $$SIX$$ ,length ball is launched over long-on for six more, this game will not be needing any final-over Dhoni heroics, three sixes from Hussey has more or less killed off this contest, especially with Bhajji's spell over"
    },
    {
      "ball": 15.5,
      "isHighlight": false,
      "text": "Ojha to Hussey,1 run,towards point for a single"
    },
    {
      "ball": 15.6,
      "isHighlight": true,
      "text": "Ojha to Raina, $$SIX$$ ,over wide long-on for six more, this game is all but over"
    },
    {
      "ball": 16.1,
      "isHighlight": false,
      "text": "Bumrah to Hussey,no run,fires that full outside the off stump he pushes it to the off side"
    },
    {
      "ball": 16.2,
      "isHighlight": false,
      "text": "Bumrah to Hussey, $$FOUR$$ ,this one lands on a yorker length and he gets an inside edge to fine leg, CSK getting close"
    },
    {
      "ball": 16.3,
      "isHighlight": false,
      "text": "Bumrah to Hussey,2 runs,full outside the off stump and he drives him down to deep cover"
    },
    {
      "ball": 16.4,
      "isHighlight": false,
      "text": "Bumrah to Hussey,1 run,full in length and he bashes that down to long-on"
    },
    {
      "ball": 16.5,
      "isHighlight": false,
      "text": "Bumrah to Raina,1 run,length ball and he clears the front leg and lofts down to long-on"
    },
    {
      "ball": 16.6,
      "isHighlight": false,
      "text": "Bumrah to Hussey,no run,low full toss and he makes room and punches it back to the bowler"
    },
    {
      "ball": 16.6,
      "isHighlight": false,
      "text": "Jury: \"No last over finish? No heart stopping moments? Is this CSK?\" Kieron Pollard to bowl his first over. Will it be the last of the match?"
    },
    {
      "ball": 17.1,
      "isHighlight": false,
      "text": "Pollard to Raina,1 wide,bowls a tame short ball way down the leg side. Raina needn't worry about that"
    },
    {
      "ball": 17.1,
      "isHighlight": false,
      "text": "Pollard to Raina,1 no ball,another one, this was considerably more shorter but still down the leg side. Raina went for a hook, but missed. Second bouncer, so a no-ball"
    },
    {
      "ball": 17.1,
      "isHighlight": false,
      "text": "Pollard to Raina, $$FOUR$$ ,corrects his line, but not his length. Raina knew it was going to be short as he went deep in his crease and pulls between long-on and midwicket"
    },
    {
      "ball": 17.2,
      "isHighlight": false,
      "text": "Pollard to Raina,1 run,stays back and pulls down to long-on. Didn't time it this time"
    },
    {
      "ball": 17.3,
      "isHighlight": false,
      "text": "Pollard to Hussey,1 run,goes wide of the crease and the angle allows Hussey to nudge if off his knees through square leg"
    },
    {
      "ball": 17.4,
      "isHighlight": true,
      "text": "Pollard to Raina,1 run,that's his fifty. Raises his bat as he was running through for the single. This was back of a length and he punched it down the ground. Pollard tries to cut it off but misfields"
    },
    {
      "ball": 17.5,
      "isHighlight": false,
      "text": "Pollard to Hussey,no run,gloved. but it doesn't carry. A slower short ball, Huss wants to pull it fine but ends up almost ballooning it to the keeper."
    },
    {
      "ball": 17.6,
      "isHighlight": false,
      "text": "Pollard to Hussey,1 run,pushed down to long-off to retain strike"
    },
    {
      "ball": 17.6,
      "isHighlight": false,
      "text": "chibi: \"you cannot find a better big match player than Suresh Raina in the IPL.. He's there for CSK when its needed..! He's not only the player the team needs, he's also the one the team deserves. \""
    },
    {
      "ball": 18.1,
      "isHighlight": false,
      "text": "Bumrah to Hussey,1 run,intended to be a yorker, but it ends up a full toss on off stump. Huss steers it to deep point"
    },
    {
      "ball": 18.2,
      "isHighlight": false,
      "text": "Bumrah to Raina,no run,shortish and he pulls towards midwicket"
    },
    {
      "ball": 18.3,
      "isHighlight": false,
      "text": "Bumrah to Raina,1 wide,this has too much height on it. Called a wide as it sails over Raina's head"
    },
    {
      "ball": 18.3,
      "isHighlight": false,
      "text": "Sriram Raghava: \"@Chibi.. You missed \"The Yellow Knight\" in the end.\""
    },
    {
      "ball": 18.3,
      "isHighlight": false,
      "text": "Bumrah to Raina,no run,finds the yorker just outside off, Raina looked to guide it to third man but couldn't"
    },
    {
      "ball": 18.4,
      "isHighlight": true,
      "text": "Bumrah to Raina, $$FOUR$$ ,all over, a bottom-handed flick through midwicket seals Chennai Super Kings' progress to the second qualifier. It was in the slot, Raina pulled his front leg out of the way and struck this far too powerfully for anyone to bother chasing"
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "That's all we have for you now. Join us in a couple of days' time when Super Kings take on Kings XI Punjab in the second qualifier. Until then, thank you for your company. Good night"
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "$$Suresh$$ $$Raina$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"God has been very kind to me [after being named captain of India for Bangladesh] We executed the bowing plan really well. And then the batsmen, all of them did their job. I knew I had to bat till the last over. Wicket was really good, ball was coming on nicely. I knew I could hit Ojha over midwicket and Bhajji over cover. Huss was batting well and we were running between the wickets well too. Ishwar took a brilliant catch to dismiss Anderson and hopefully we can continue playing good cricket in the next two games as well\""
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "\"I think the bowlers did a real good job. I twas a very good wicket to bat on. Asish and Ishwar moved the ball around a bit. In the middle overs, the spinners bowled well. 180-185 was a par score, good track, fast outfield and not too big boundaries. 173 was just a bit under par, but we needed to score the runs. It would have been better had the top order carried on after. I though those catches would have been dropped, but Ishwar's catch was brilliant. Anderson will try and swing and I kept Ashwin for him and it paid off. That's where experience counts. I felt with Hussey around, if he gets going he can accelerate and the firepower with me and Jaddu around, we could chase 9 or 10 an over\""
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "$$\"Hold$$ $$on,\"$$ $$says$$ $$Ashwin$$ $$at$$ $$the$$ $$end$$ $$of$$ $$an$$ $$inteview,$$ $$\"Maxwell$$ $$can$$ $$expect$$ $$me$$ $$to$$ $$bowl$$ $$more$$ $$over$$ $$the$$ $$wicket$$ $$in$$ $$the$$ $$next$$ $$game\"$$ . Can you spell gauntlet? \"We batted really well and for David Hussey to come in and play like that. It was not the easiest pitch. A little like Australia. And the kind of shots he played was amazing\""
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "\"Dont think so. We batted well till the 15th-16th over. 170 was a good enough, target. We would have liked some more but we really played well and I have a lot of pride in this side and how long we've come in this tournament. This just wasn't our day,\" says  $$Rohit$$ $$Sharma$$ . \"We showed a lot of character after losing the first five games. Coming back to India and performing like that was incredible. I didn't have to do too much, we were in that momentum after our last win and we wanted to carry it though to this game. But unfortunately CSK were the better team today and that's what it is. We've got some work to do and hopefully we'll come back bigger and stronger next year\""
    },
    {
      "ball": 18.4,
      "isHighlight": false,
      "text": "$$11.25$$ $$pm$$  Suresh Raina completed his seventh season with over 400 runs. Super Kings were facing a tough chase, but Raina as he has done so many times in yellow, served as the backbone of the chase. He timed his acceleration well and his placement and timing were top notch. Mumbai bow out, but not before producing some very memorable moments this season"
    }
  ],
  "name": "Chennai Super Kings v Mumbai Indians",
  "innings": "Chennai Super Kings  innings",
  "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734045.html?innings=2;view=commentary",
  "match_num": 58
}