{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$6.25$$ $$pm$$  The last season opened with the stumps being flattened the very first ball. What will happen this time? The umpires have been strapped with cameras on their hats and stride out the middle first. Mumbai follow them and get into a huddle. Gautam Gambhir and Jacques Kallis are Kolkata's openers. Zak has the ball in hand and has two slips for support. Funnily enough, movement behind the sightscreen forces a false start"}, {"ball": 0, "isHighlight": false, "text": "$$6.20$$ $$pm$$  The XIs has been updated on the scorecard, by the way. Kolkata acquired Robin Uthappa after his previous team Pune was dissolved. \"We have had good prep, came to the UAE early and adapted to conditions and change in weather. It's been getting hotter and hotter and I don't know how those four pm games will be. Kolkata is a fantastic side on paper but we need to get momentum early on in the tournament. We'll concentrate on expressing ourselves. I'm most productive at the top and I'm sure I'll get my chance there soon\""}, {"ball": 0, "isHighlight": false, "text": "Michael Hussey presents the Mumbai perspective and he says he's looking forward to playing for a team he's long since admired. He talked about enjoying chats with Sachin Tendulkar and adds the team needs to play fearless cricket"}, {"ball": 0, "isHighlight": false, "text": "\"Can we get the playing XI ? Need to update my fantasy team !!!!\" Those exclamation marks are making me very nervous to report that we are still waiting on them. Hopefully Karthik Krishnaswamy's quest to  $$gauge$$ $$the$$ $$pulse$$  on the eve of this match can lure you off my back for a little while"}, {"ball": 0, "isHighlight": false, "text": "$$6.00$$ $$pm$$ $$Kolkata$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bat$$ . Shakib Al Hasan, Morne Morkel, Sunil Narine and Jacques Kallis make up the overseas players. Gautam Gambhir, the captain, is pleased with the younger players in the side and a stronger bowling attack. It was his faith in them defending a total that made him choose to bat"}, {"ball": 0, "isHighlight": false, "text": "Rohit Sharma wanted to bowl first himself because he was unsure about what the pitch would do. It has a bit of live grass on it. They are playing five batsmen, two allrounders and four bowlers"}, {"ball": 0, "isHighlight": false, "text": "Vernon: \"From the Windies side of the globe, we would like to see Polly, Sunil, Santokie and Andre play today...all exciting players. It will be a very pleasing on the eyes to watch Sunil bowl against Polly! Santokie and Malinga will be a handful for Kolkata! \""}, {"ball": 0, "isHighlight": false, "text": "$$5.45$$ $$pm$$  The toss is about 15 minutes away and our favourite arm-chair critics have got their minds whirring about the compositions already, among other issues"}, {"ball": 0, "isHighlight": false, "text": "\"Are the led stumps being used here!! they would add more glitter to IPL\" Srinu Potnuru with the burning questions"}, {"ball": 0, "isHighlight": false, "text": "Dan: \"\"Quality Sloggers\" how times have changed!\""}, {"ball": 0, "isHighlight": false, "text": "Nitin: \"Praying that Shreyas Gopal & Kuldeep Yadav play today..want to see how well they hold their nerve against the biggies\""}, {"ball": 0, "isHighlight": false, "text": "chetan jivani: \"interesting to see if Robin Uthapa will open along side GG or Bisla starts.\""}, {"ball": 0, "isHighlight": false, "text": "vamsi krishna: \"@asit giri: no big star, Gambhir,Kallis,Naraine are there guys stars!!!!!!! Then what does a star mean?? Looking manly and handsome?\" Some reckon they tick the second box too, the mohawk notwithstanding"}, {"ball": 0, "isHighlight": false, "text": "\"The other thing: in the revamped live scores page there used to be a box giving the name of the commentator. Its more fun if we know who we are writing to, despite never getting 'published'. Well Dev, today's  $$rants$$  pithy insights will be provided by the Alagappan Muthu, who has only just remembered to link Sid Ravindran's  $$preview$$ for today's match."}, {"ball": 0, "isHighlight": false, "text": "Sameer Karkhani: \"I Think both the Teams are strong but Mumbai has slight advantage over Kolkatta as they have 2 quality sloggers in their Line-Up (Pollard and Anderson). I will go with Mumbai Indians today for the Win...!\""}, {"ball": 0, "isHighlight": false, "text": "asit giri: \"Kolkata will rock again ....there is no big star in there team , but the team is very much balanced . All the best\""}, {"ball": 0, "isHighlight": false, "text": "$$5.30$$ $$pm$$  It's baaaaack... and as ever there is enough razzle-dazzle to almost mask the cricket. There had been other issues taking precedence over the on-field activities, but that's all been scrubbed rather noticeably aside for the moment to allow defending champions Mumbai kick the tournament off against former victors Kolkata. Time for cricket to take back the stage and already the buzz among the fans has reached fever pitch with tickets for the first-week's matches sold out well in advance."}, {"ball": 0, "isHighlight": false, "text": "\"I waited a year for IPL to return .. and am online for last 15 min to see the commentary scrolls go live.. Come on Cricinfo .. Let the coverage begin .. \" I can almost imagine Mudit stomping his feet after saying all that."}, {"ball": 0, "isHighlight": false, "text": "The biggest T20 franchise tournament in the cricketing calendar is getting underway on the field ... But the action is heating up off the field as well. Cricket's biggest battle of brains is now here. Are you ready for  $$CricIQ$$ ?  Answering fifteen questions could get you on the plane to London to watch India play England at Lord's this summer. And you get multiple shots at it. Get... Set... Score."}, {"ball": 0.1, "isHighlight": false, "text": "Khan to Gambhir,no run,hint of away swing away from the bat to start off and Gambhir strides forward to block"}, {"ball": 0.2, "isHighlight": false, "text": "Khan to Gambhir,no run,play and miss as Gambhir is rooted to the crease while he looks to slash through point. Bite more bounce on offer as he hits the deck"}, {"ball": 0.3, "isHighlight": false, "text": "Khan to Gambhir,no run,walks at the back of a length ball outside off and drops it towards second slip. Wanted the single, but Kallis coolly declines"}, {"ball": 0.3, "isHighlight": false, "text": "There is a strange beige-colored envelop around the pitches on the square"}, {"ball": 0.4, "isHighlight": false, "text": "Khan to Gambhir,no run,good length ball on middle, cramps Gambhir up as he dead bats it"}, {"ball": 0.5, "isHighlight": false, "text": "Khan to Gambhir,no run,looks for the expansive drive as he saw the ball in his half, but Zak had brought this back in at him and Gambhir can only bunt it back to the bowler"}, {"ball": 0.6, "isHighlight": false, "text": "Khan to Gambhir,1 wide,a little indiscipline fetches Kolkata's first runs as this length ball goes down leg"}, {"ball": 0.6, "isHighlight": false, "text": "Khan to Gambhir,no run,big shout for leg before as Gambhir plays a whip right across the line. But the umpire reckons there was a bit of inside edge. Lovely line from Zak again as this was full and tailing in at him"}, {"ball": 0.6, "isHighlight": false, "text": "Nitin Chaudhary: \"With no disrespect to Gambhir, Kallis and Sakib, I think the key for success of Kolkata is Pathan as he is only impact player in the team and it is very important for him to fire in 15-20 over otherwise Kolkata will miss the finishing touch.\""}, {"ball": 0.6, "isHighlight": false, "text": "Lasith Malinga, Sri Lanka's T20 World Cup winning captain, from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Malinga to Kallis,2 runs,opens the face to dab this back of a length delivery behind point. Malinga manages some swing away from the bat as well"}, {"ball": 1.2, "isHighlight": false, "text": "Malinga to Kallis,1 run,nicely done by Gambhir. Realised the ball was defended with softly enough into the off side to sneak a quick single. Back of a length again with a bit of away movement"}, {"ball": 1.2, "isHighlight": false, "text": "Hariharan: \"Great Start to the tournament. Housefull crowds.\""}, {"ball": 1.3, "isHighlight": false, "text": "Malinga to Gambhir,no run,low full toss seeking the base of off stump, Gambhir works it to midwikcet"}, {"ball": 1.4, "isHighlight": false, "text": "Malinga to Gambhir, $$OUT$$ ,what a yorker! Gambhir was so late on it and he throws a little look back at the stumps. That slingy action brought the ball back in at him and his jittery stay in the middle ends in the most emphatic fashion"}, {"ball": 1.4, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$b$$ $$Malinga$$ $$0$$ $$(10m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 1.4, "isHighlight": false, "text": "Manish Pandey is in at No.3, with some neat ink on his left bicep"}, {"ball": 1.5, "isHighlight": false, "text": "Malinga to Pandey,no run,back of a length and on the off stump corridor, defended"}, {"ball": 1.6, "isHighlight": false, "text": "Malinga to Pandey,1 run,slower delivery kept right up there on off stump, Pandey is wise to it as he adjusts his stroke and pushes to mid-off"}, {"ball": 1.6, "isHighlight": false, "text": "Sagar: \"The most annoying aspect of Kolkata is back. Approaching a T20 game with a Test match attitude! I wonder if any other team in the world would have used Ten Doeschate the way Kolkata has. The impending doom looms large again!\""}, {"ball": 2.1, "isHighlight": false, "text": "Khan to Pandey,no run,looks to pick it off his knees but he doesn't connect. Zak rushes forward to control the ricochet off the pad"}, {"ball": 2.2, "isHighlight": false, "text": "Khan to Pandey,no run,the left-armer's angle lured an angled bat from Pandey. Pulled it back just in time to prevent the outside edge"}, {"ball": 2.3, "isHighlight": false, "text": "Khan to Pandey,1 run,walks at him and nudges to mid-on. Pollard was the man there but Pandey's momentum takes him home safely"}, {"ball": 2.3, "isHighlight": false, "text": "Adesh: \"There goes Gambhir's confidence.. and perhaps his shot at the england tour as well\""}, {"ball": 2.4, "isHighlight": false, "text": "Khan to Kallis,1 run,rips a back of a length delivery right across Kallis. Well-managed in the end as he plays with soft hands and lets the outside edge run down to third man"}, {"ball": 2.5, "isHighlight": false, "text": "Khan to Pandey,2 runs,lovely timing! Stood up tall and punches this shortish ball through point. Rode the bounce and he found the gap to the left of the fielder there"}, {"ball": 2.6, "isHighlight": false, "text": "Khan to Pandey,1 run,good length ball tucking him up on leg stump, worked away to square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Early change as Corey Anderson comes on."}, {"ball": 3.1, "isHighlight": false, "text": "Anderson to Pandey,no run,goes for the blockhole wide of off stump, ends up a little off the mark but the batsman drags it to mid-on. Should have gone extra cover"}, {"ball": 3.2, "isHighlight": false, "text": "Anderson to Pandey,no run,good length ball going across him, Pandey taps it into the covers"}, {"ball": 3.2, "isHighlight": false, "text": "Amit: \"Come on guys. This is Malinga we are talking about. He managed to keep Kohli quiet in the finals even though Kohli faced fewer balls. Give Gambhir another chance.\""}, {"ball": 3.3, "isHighlight": false, "text": "Anderson to Pandey,no run,he's struck on the front pad and he seemed pretty adjacent too! But the ball might just have gone over the stumps. He was walking across and the bowler responded with a slower delivery just back of a length. Deceived the batsman as it darted back in at him and his guide to third man was nowhere close to it"}, {"ball": 3.4, "isHighlight": false, "text": "Anderson to Pandey, $$FOUR$$ ,walks at him and though the bowler goes short he manages to thump it through midwicket. Not enough pace from Anderson to worry the batsman here"}, {"ball": 3.5, "isHighlight": false, "text": "Anderson to Pandey, $$SIX$$ ,and that's the first six of the tournament this year. Soars straight over the bowler's head as he gets forward to the overpitched delivery and just extends the arms from a forward defensive"}, {"ball": 3.6, "isHighlight": false, "text": "Anderson to Pandey,no run,good length ball going across him, Pandey makes some room and guides it to point"}, {"ball": 4.1, "isHighlight": false, "text": "Khan to Kallis,1 run,dabbed off the back foot to third man as Zak continues probing the off stump channel"}, {"ball": 4.2, "isHighlight": false, "text": "Khan to Pandey,2 runs,cuts behind point after shimmying down and meeting the shortish delivery with an angled blade"}, {"ball": 4.3, "isHighlight": false, "text": "Khan to Pandey,no run,think that was the offcutter and it seemed to have gripped into the pitch to square the batsman up. Pandey was waiting on the back foot and blocks it awkwardly"}, {"ball": 4.4, "isHighlight": false, "text": "Khan to Pandey,1 wide,strays in line again as he goes for a length ball which goes down leg"}, {"ball": 4.4, "isHighlight": false, "text": "Khan to Pandey,1 run,back of a length on middle, Pandey tucks it into the midwicket region and they race across for a quick single"}, {"ball": 4.5, "isHighlight": false, "text": "Khan to Kallis,1 run,slower offcutter, Kallis spotted it and gives some work for deep third man"}, {"ball": 4.5, "isHighlight": false, "text": "Kunal: \"I'm still not convinced regarding why Kallis sent as opener over Uthappa\""}, {"ball": 4.6, "isHighlight": false, "text": "Khan to Pandey,1 wide,137kph, another one that is off the radar. Length ball sliding way across the off stump"}, {"ball": 4.6, "isHighlight": false, "text": "Khan to Pandey,1 run,shortish ball refusing him any room, Pandey is off his feet while clipping this through to deep midwicket"}, {"ball": 4.6, "isHighlight": false, "text": "Pragyan Ojha will bowl the final over of the Powerplay. One slip in place"}, {"ball": 4.6, "isHighlight": false, "text": "James: \"Kunal: Kallis has scored off every ball faced. He's barely had the strike first 5 overs.\""}, {"ball": 5.1, "isHighlight": false, "text": "Ojha to Pandey,1 run,skips down the track to ease this flighted ball outside off into the covers"}, {"ball": 5.2, "isHighlight": false, "text": "Ojha to Kallis,1 run,looks to whack it through the covers but doesn't reach the pitch and ends up mistiming it. Single taken though"}, {"ball": 5.3, "isHighlight": false, "text": "Ojha to Pandey,no run,flighted just outside off, Pandey pushes back to the bowler"}, {"ball": 5.4, "isHighlight": false, "text": "Ojha to Pandey,no run,comes down the track and gets hit on the front pad as he looked to flick around it"}, {"ball": 5.5, "isHighlight": false, "text": "Ojha to Pandey,1 run,goes back and dabs it behind point"}, {"ball": 5.6, "isHighlight": false, "text": "Ojha to Kallis,no run,flatter delivery on middle and Kallis can only push it to mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "sarvesh: \"Kallis is sent in inorder to anchor where as uthappa can hit some out of the park during the slog overs. because Kolkata lack in the number of impact players. hence uthappa is one of the impact player along with pathan\""}, {"ball": 5.6, "isHighlight": false, "text": "They've taken about 30 minutes to bowl the first six overs and here's Harbhajan Singh to help hasten the over-rate. No slips"}, {"ball": 6.1, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,flighted on off stump, nudged to mid-on"}, {"ball": 6.2, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,goes back as he sees this flatter on off stump and pushes towards mid-on"}, {"ball": 6.3, "isHighlight": false, "text": "Harbhajan Singh to Kallis,no run,loopy delivery on off stump and Kallis defends to the bowler"}, {"ball": 6.4, "isHighlight": false, "text": "Harbhajan Singh to Kallis,1 run,swept away, but there is protection at deep square leg. Lunged forward and kept it all along the ground"}, {"ball": 6.5, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,goes for a heave across the line but this doesn't spin in at him as he had surmised. Looks terrible as the keeper collects it"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to Pandey, $$FOUR$$ ,this is short and it allows Pandey to rock back and pull in between the long-on and deep midwicket regions. Muscled away."}, {"ball": 7.1, "isHighlight": false, "text": "Ojha to Kallis,2 runs,stays firmly leg side of this nicely flighted delivery outside off and he smears it behind point. Didn't time it well enough"}, {"ball": 7.2, "isHighlight": false, "text": "Ojha to Kallis,1 run,skips down the track and he works to long-on for a single"}, {"ball": 7.3, "isHighlight": false, "text": "Ojha to Pandey,1 run,saw the batsman charging at him and pulled his length back. Pandey blocks into the off side and Rohit rushes in from short cover to cut the angle. Isn't successful"}, {"ball": 7.4, "isHighlight": false, "text": "Ojha to Kallis,no run,makes room outside leg but this flatter ball can only be squeezed out to point"}, {"ball": 7.5, "isHighlight": false, "text": "Ojha to Kallis,2 runs,picked away through midwicket as this was a length ball on middle, good hustle between the wickets"}, {"ball": 7.6, "isHighlight": false, "text": "Ojha to Kallis,1 run,fires this fuller delivery on middle as he sees the batsman charge at him, Kallis hurries into a push down the ground"}, {"ball": 7.6, "isHighlight": false, "text": "Parag: \"\"Because players like Kallis & Dravid have established themselves as quality test players, so people have been writing them off right from the first edition. They have proved themselves so valuable since...but people are relentless........image is hard to change\"\""}, {"ball": 8.1, "isHighlight": false, "text": "Harbhajan Singh to Kallis,2 runs,the run-rate prompts Kallis to do something he's not at all known for. Manages an awkward looking reverse sweep and they take two as the quicker length ball goes off his gloves"}, {"ball": 8.2, "isHighlight": false, "text": "Harbhajan Singh to Kallis,no run,flighted ball on middle, punched back to the bowler"}, {"ball": 8.3, "isHighlight": false, "text": "Harbhajan Singh to Kallis,2 runs,well-flighted as he angles it into the leg side, but Kallis drags it behind point with another reverse sweep"}, {"ball": 8.4, "isHighlight": false, "text": "Harbhajan Singh to Kallis, $$FOUR$$ ,this time it's the conventional sweep and he picked the line wonderfully well. Saw it drifting into the pads and swung it dead square"}, {"ball": 8.5, "isHighlight": false, "text": "Harbhajan Singh to Kallis,1 run,tapped away behind point"}, {"ball": 8.6, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,loopy delivery on middle, nudged down to long-on and that will be the strategic time-out"}, {"ball": 8.6, "isHighlight": false, "text": "Sokhi Uppal: \"Kolkata are doing well here as par score will be around 145. With 2 big hitters to come they are well placed to do that and their bowlers will rip into this poor Mumbai batting line-up.\" The middle-order does look to be lacking a bit of power"}, {"ball": 8.6, "isHighlight": false, "text": "James: \"Mumbai might struggle for a 5th bowler. Anderson went for a few. The alternatives are Pollard, or the captain bringing himself on.\" Anderson now around the stumps"}, {"ball": 9.1, "isHighlight": false, "text": "Anderson to Pandey,1 run,shortish and outside off, Pandey goes back and cuts to deep point"}, {"ball": 9.2, "isHighlight": false, "text": "Anderson to Kallis,1 run,tapped to third man as the bowler tightens his line outside off"}, {"ball": 9.2, "isHighlight": false, "text": "Gaurav: \"Are people making calculation mistake.. I guess Kolkata have 3 hitters down the line.. 1.Uthappa 2.Pathan and 3.Shakib.. Shakib can hit guys.. \""}, {"ball": 9.3, "isHighlight": false, "text": "Anderson to Pandey, $$FOUR$$ ,flat-batted to the long-on boundary! Cleared his front leg and slammed the back of a length ball outside off stump"}, {"ball": 9.4, "isHighlight": false, "text": "Anderson to Pandey,1 run,was setting up for the same shot but the length is a lot fuller and he has to adjust and steer it through the covers with an angled bat"}, {"ball": 9.5, "isHighlight": false, "text": "Anderson to Kallis,1 run,flicks a good length ball off his knees to the left of Malinga at short fine leg"}, {"ball": 9.6, "isHighlight": false, "text": "Anderson to Pandey,1 run,takes a couple of steps down the pitch and dabs this length ball from off stump to deep point"}, {"ball": 10.1, "isHighlight": false, "text": "Ojha to Pandey,1 run,makes room outside leg and beats cover with a punch. Ojha darts a length ball at middle"}, {"ball": 10.2, "isHighlight": false, "text": "Ojha to Kallis,no run,clear evidence of Kallis being rusty. Goes for a sweep when the length did not permit it. Bounces a bit more and it takes his glove and almost hits his helmet"}, {"ball": 10.3, "isHighlight": false, "text": "Ojha to Kallis,1 run,goes down the track and eases this into the covers. Rohit is the man there and had he struck the stumps direct, Kallis would have been well out"}, {"ball": 10.4, "isHighlight": false, "text": "Ojha to Pandey, $$FOUR$$ ,gorgeous! Charges at him while making room outside leg and carves it over extra cover"}, {"ball": 10.5, "isHighlight": false, "text": "Ojha to Pandey,no run,fires this length ball on middle and Pandey's attempt to dance down the track and loft him amounts to naught"}, {"ball": 10.6, "isHighlight": false, "text": "Ojha to Pandey,no run,steered away towards point as he goes flatter and shorter"}, {"ball": 10.6, "isHighlight": false, "text": "Bhajji around the stumps"}, {"ball": 11.1, "isHighlight": false, "text": "Harbhajan Singh to Kallis,no run,flighted on leg stump, Kallis looks to flick it through midwicket but gets a bit of an edge back to the bowler"}, {"ball": 11.2, "isHighlight": false, "text": "Harbhajan Singh to Kallis,1 run,itches to get down the track and pick it off his legs through midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Harbhajan Singh to Pandey,2 runs,sweeps to deep square leg as this was flighted outside leg stump. Moved his front leg away to make room for the swing of the bat"}, {"ball": 11.4, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,just a tad shortish and he goes deep in his crease to pull to deep midwikcet"}, {"ball": 11.4, "isHighlight": false, "text": "Shan Fastian: \"@Gauruv, Weak when compared to Mumbai's Hitters. They got Mighty Pollard and the recently added fastest ODI century scorer Corey Anderson.\""}, {"ball": 11.5, "isHighlight": false, "text": "Harbhajan Singh to Kallis,1 run,flighted on middle and leg, Kallis goes down on one-knee and sweeps to deep square leg"}, {"ball": 11.5, "isHighlight": false, "text": "back over for Pandey"}, {"ball": 11.6, "isHighlight": false, "text": "Harbhajan Singh to Pandey, $$FOUR$$ ,hoisted over the top. Got under it nicely and muscled it down the ground. Long-on can only usher it to the boundary"}, {"ball": 11.6, "isHighlight": false, "text": "Kolkata are struggling to make the pace and Mumbai are aware of it. Here's their spearhead"}, {"ball": 12.1, "isHighlight": false, "text": "Malinga to Kallis,no run,fires a low full toss on leg stump and Kallis goes for the flick a little too early. Leading edge back to the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Malinga to Kallis, $$FOUR$$ ,bouncer on middle and leg and Kallis has pulled it to the long leg boundary. Zak is the man there and he tumbled in an effort to try stop it but never looked like he was going to succeed"}, {"ball": 12.3, "isHighlight": false, "text": "Malinga to Kallis,1 run,full and on the pads again, Kallis whips it to deep square leg"}, {"ball": 12.4, "isHighlight": false, "text": "Malinga to Pandey,1 run,slower ball outside off stump, tapped away to point for a single"}, {"ball": 12.5, "isHighlight": false, "text": "Malinga to Kallis,1 run,fullish on middle, Kallis punches it down the ground"}, {"ball": 12.6, "isHighlight": false, "text": "Malinga to Pandey,1 run,back of a length and outside off, Pandey stays beside it and eases it through to deep point"}, {"ball": 12.6, "isHighlight": false, "text": "Here's another of Mumbai's death overs specialist, Kieron Pollar"}, {"ball": 12.6, "isHighlight": false, "text": "rssampat: \"These two should look to play Malinga sensibly by looking to score just 6-7 runs off him without taking risks or any bravado. All the other bowlers can be taken to the cleaners and targeted heavily by the big hitters like Pathan & Uthappa in the end. Kolkata if they play smart from here should post around 160 easily.\""}, {"ball": 13.1, "isHighlight": false, "text": "Pollard to Pandey,no run,back of a good length and just outside off stump, Pandey cannot beat cover."}, {"ball": 13.2, "isHighlight": false, "text": "Pollard to Pandey,1 run,that's his fifty. Full delivery outside off smeared through point"}, {"ball": 13.3, "isHighlight": false, "text": "Pollard to Kallis,no run,good length ball outside off and Kallis goes for the booming drive through the covers but there is no timing on the shot"}, {"ball": 13.4, "isHighlight": false, "text": "Pollard to Kallis,1 run, $$dropped$$  at short fine leg. Kallis was making big-time room outside leg and Pollard followed him with a full delivery speared in at his pads. He flicks it to Malinga who fells a sitter"}, {"ball": 13.5, "isHighlight": false, "text": "Pollard to Pandey,no run,slower ball outside off and Pandey is flummoxed by it. Goes for a slog-sweep and misses"}, {"ball": 13.6, "isHighlight": false, "text": "Pollard to Pandey,2 runs,full and wide outside off, looks to heave it over the covers but gets a leading edge that evades the fielder running back"}, {"ball": 13.6, "isHighlight": false, "text": "Ojha in his final over, three overs for 16 runs"}, {"ball": 14.1, "isHighlight": false, "text": "Ojha to Kallis,1 run,tossed up outside off stump and he slogs it to deep midwicket. Ugly hack of a shot"}, {"ball": 14.2, "isHighlight": false, "text": "Ojha to Pandey,1 run,goes down the track but Ojha pulls his length back and refuses any room. Pandey tries to pull it but gets a leading edge that lobs the bowler"}, {"ball": 14.3, "isHighlight": false, "text": "Ojha to Kallis, $$FOUR$$ ,smacked through extra cover. Made room for himself, opened his shoulders up and thumped this length ball on middle to the boundary"}, {"ball": 14.4, "isHighlight": false, "text": "Ojha to Kallis, $$SIX$$ ,that's more like it! Shimmies down the track to get under the ball and launches it into the crowd behind long-on"}, {"ball": 14.5, "isHighlight": false, "text": "Ojha to Kallis,2 runs,punched through the covers as this is a length ball fired in on off stump"}, {"ball": 14.5, "isHighlight": false, "text": "Amritesh: \"Mixed feelings about the miss! keeps the big hitters away at the cash end of the game!\""}, {"ball": 14.6, "isHighlight": false, "text": "Ojha to Kallis, $$SIX$$ ,flighted on middle and Kallis swipes it over the midwicket boundary. Second six of the over and that raises Kallis' fifty. It's not his best innings but he seems to have found his form now"}, {"ball": 15.1, "isHighlight": false, "text": "Pollard to Pandey, $$FOUR$$ ,length ball and Pandey has pummeled this between long-on and deep midwicket. Clears his front leg and let the bat just swing freely"}, {"ball": 15.2, "isHighlight": false, "text": "Pollard to Pandey,1 run,goes wide of the crease and presents a slower ball outside off, Pandey is out of his crease and pulls to deep mdiwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Siva: \"After all that slow batting comments on Kallis, he jump passed Pandey strike rate by huge margin.\""}, {"ball": 15.3, "isHighlight": false, "text": "Pollard to Kallis, $$FOUR$$ ,walks around his crease and he has upset Pollard's rhythm wonderfully well. Moved outside leg first and lured him to angle the fuller ball in at him. And once that was done he quickly switched outside off and lap swept it to the long leg boundary"}, {"ball": 15.3, "isHighlight": false, "text": "naidu: \"kallis did an ABD..!!\""}, {"ball": 15.4, "isHighlight": false, "text": "Pollard to Kallis,no run,back of a length delivery on middle, holds up on this slow deck and a leading edge falls safely past the bowler's reach on his right"}, {"ball": 15.5, "isHighlight": false, "text": "Pollard to Kallis,2 runs,slower length ball outside off, Kallis looks to slog over deep midwicket but gets a bottom edge to deep third man. Pollard can't believe it"}, {"ball": 15.6, "isHighlight": false, "text": "Pollard to Kallis, $$FOUR$$ ,length ball carted away to the deep midwicket boundary! Terrible length to bowl and Kallis pounces on it as he clears his front leg and dismisses it. Strategic time-out again. Mumbai definitely need to gather themselves a bit here"}, {"ball": 15.6, "isHighlight": false, "text": "Here's Malinga"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Pandey,no run,and he outwits the batsman straight away. Offcutter on leg stump, Pandey stayed beside it and swung across the line. Missed wildly"}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to Pandey, $$SIX$$ ,goes fuller with that slower ball and he was expecting it this time. Stays still at the crease and whacks it over deep square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Pandey,no run,the yorker on off stump, Pandey slams down an angled bat outside off to find point"}, {"ball": 16.3, "isHighlight": false, "text": "Sanju Z: \"Kallis is playing a Kohli-esque gem here. The key was not playing many dots early, keeping the SR at or above 100, and backing himself once set.\" That comparison's gonna get some getting used to"}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to Pandey,4 leg byes,low full toss that slides down leg and Pandey indicated he got wood on it but the ump turns him down. The keeper's dive isn't good enough and the ball dribbles away to the long leg boundary"}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Pandey,no run,searing yorker fired in down the leg side and Pandey cannot get bat to it"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Pandey, $$OUT$$ ,that stumps are in disarray again! Another Malinga yorker finds its mark. He was making room to try and open up the off side which made it all the more complicated for him to intervene with the ball's trajectory and off stump is knocked back"}, {"ball": 16.6, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$b$$ $$Malinga$$ $$64$$ $$(54m$$ $$53b$$ $$6x4$$ $$2x6)$$ $$SR:$$ $$120.75$$"}, {"ball": 16.6, "isHighlight": false, "text": "Robin Uthappa is the new batsman, Zak is the new bowler"}, {"ball": 17.1, "isHighlight": false, "text": "Khan to Kallis,1 run,length ball outside off, Kallis flays it to deep cover"}, {"ball": 17.2, "isHighlight": false, "text": "Khan to Uthappa,1 run,walks across to push this fuller delivery down the ground"}, {"ball": 17.3, "isHighlight": false, "text": "Khan to Kallis, $$SIX$$ ,picked it up and swats it over the deep midwicket boundary! It was length and he kept his front foot out of the way and muscled it."}, {"ball": 17.4, "isHighlight": false, "text": "Khan to Kallis,no run,walks across to beat Malinga at short fine leg, but Zak slows it down and drags the length shorter to ensure his timing isn't up to the mark this time"}, {"ball": 17.5, "isHighlight": false, "text": "Khan to Kallis,1 run,full and outside off, smeared away into the covers and Rohit dives to his right to keep it to a single. Had to tussle with an awkward bounce there"}, {"ball": 17.6, "isHighlight": false, "text": "Khan to Uthappa, $$OUT$$ ,safely taken! The knucke ball brings Mumbai back into the game. Uthappa was lured into playing an expansive drive on the up and he was an age too early into the shot. Gets a leading edge and perishes in quite a tame fashion"}, {"ball": 17.6, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Sharma$$ $$b$$ $$Khan$$ $$1$$ $$(4m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Yusuf Pathan has 12 balls to make a difference"}, {"ball": 18.1, "isHighlight": false, "text": "Malinga to Pathan,1 run,full and seeking the base of middle, Yusuf flicks it to deep square leg"}, {"ball": 18.1, "isHighlight": false, "text": "Siva: \"After first 6 overs I thought this match is one sided, it is still one sided now, but Kallis made U turn in 15th over, great driving skills.\""}, {"ball": 18.2, "isHighlight": false, "text": "Malinga to Kallis, $$OUT$$ ,taken at long-off! Anderson, you beaty! This was full on middle and Kallis made a little room to blast it down the ground. Didn't get as much bat as he would have liked as the fielder rushes in and dives forward to pick up a neat, low catch! That was plucked inches off the ground. Asked the fielder if it was a clean catch, Anderson nods and off he walks"}, {"ball": 18.2, "isHighlight": false, "text": "$$JH$$ $$Kallis$$ $$c$$ $$Anderson$$ $$b$$ $$Malinga$$ $$72$$ $$(83m$$ $$46b$$ $$5x4$$ $$3x6)$$ $$SR:$$ $$156.52$$"}, {"ball": 18.3, "isHighlight": false, "text": "Malinga to Pathan,1 run,fullish on off stump, goes off the inside edge as he looks to thump it through midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Shakib Al Hasan surveys the field"}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,1 wide,goes for the yorker outside off but this time he toes across the line a little"}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,1 run,yorker just outside off, Shakib digs it out into the off side"}, {"ball": 18.5, "isHighlight": false, "text": "Malinga to Pathan,1 run,low full toss on the pads, Pathan glances it down to long leg"}, {"ball": 18.6, "isHighlight": false, "text": "Malinga to Shakib Al Hasan, $$OUT$$ ,caught at the edge of the circle at cover! Fuller delivery on off stump and Shakib tries to force the pace by shoveling it over the infield. The ball was too full to get under as well as he would have liked. Mumbai stringing some quiet and successful overs in the death here"}, {"ball": 18.6, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$c$$ $$Sharma$$ $$b$$ $$Malinga$$ $$1$$ $$(4m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "Anderson for the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Anderson to Yadav,1 run,he's gotten away with that. It was a length ball outside off and the batsman can only hit it as far as deep cover"}, {"ball": 19.2, "isHighlight": false, "text": "Anderson to Pathan,1 run,walks across his stumps and drills the full delivery to long-off"}, {"ball": 19.3, "isHighlight": false, "text": "Anderson to Yadav, $$FOUR$$ ,walks at him and swings it away to the long leg boundary! Top shot from Yadav. Picked it up off a length and whipped it into the gap"}, {"ball": 19.4, "isHighlight": false, "text": "Anderson to Yadav, $$FOUR$$ ,more cheek from Yadav! This was full and outside off and he has reverse flicked it to the third man boundary! That is an astounding stroke!"}, {"ball": 19.5, "isHighlight": false, "text": "Anderson to Yadav,no run,goes for it again but this time the length just wasn't there. The keeper goes up in appeal and the bowler joins him very very late. Went off the thigh"}, {"ball": 19.6, "isHighlight": false, "text": "Anderson to Yadav, $$FOUR$$ ,in the slot on off stump and he has smeared it to the extra cover boundary. Made room outside leg and launched it and more importantly found the gap"}, {"ball": 19.6, "isHighlight": false, "text": "$$Sunil$$ $$Gavaskar$$ , BCCI interim president for the Indian T20, is pleased with the turn out, especially on a working day. Adds the pricing of the tickets has been sensible. He reckons the total is good enough for Kolkata to defend. Integrity is non-negotiable he says. No compromise there. It's important for the image to be changed, the perception has to be changed. Because of a couple of people you must not tarnish the tournament. He hopes the majority of the audience understand there are many people working hard for the success of this event"}, {"ball": 19.6, "isHighlight": false, "text": "$$8.05$$ $$pm$$  Kolkata had some trouble cranking up the run-rate early on but Manish Pandey and Jacques Kallis hung in there and found their rhythm eventually. Indeed Kallis' 72 off 46 is his second-fastest innings in this tournament. Malinga was the best bowler for Mumbai and his slower balls and yorkers fetched him four good wickets. A late blitz from Suryakumar Yadav though helped Kolkata over 160."}, {"ball": 19.6, "isHighlight": false, "text": "pavithran: \"Oh My god, Where did this lad come from. Just extra ordinary, will Corey anderson be able to compensate the damage done in his last over!!\""}, {"ball": 19.6, "isHighlight": false, "text": "rssampat: \"Considering the Mighty MI batting line up, matched equally by the Magical KKR bowling, 163 look par for the course with the opening game looking set to go right down to the last 6 balls\""}, {"ball": 19.6, "isHighlight": false, "text": "sudha: \"So called big hitters ( shakib, uthappa,, pathan) faced 8 balls and scored 6 runs...it tells they also need time to fire.\""}], "name": "Mumbai Indians v Kolkata Knight Riders", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729279.html?innings=1;view=commentary", "match_num": 1}