{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase"}, {"ball": 0.1, "isHighlight": false, "text": "Vinay Kumar to Hussey,2 runs,good length, hint of straightening, turned in front of square leg off the pad"}, {"ball": 0.2, "isHighlight": false, "text": "Vinay Kumar to Hussey,no run,coming in to the left-hander on the stumps, he goes back and defends"}, {"ball": 0.3, "isHighlight": false, "text": "Vinay Kumar to Hussey,no run,this one does not come in, carries across the left-hander on the angle, also moves away a tad beats a tentative push by some distance"}, {"ball": 0.4, "isHighlight": false, "text": "Vinay Kumar to Hussey,1 run,back of a length now, into the body, tucked in front of square"}, {"ball": 0.5, "isHighlight": false, "text": "Vinay Kumar to Tare, $$FOUR$$ ,dug in short and he takes it on to hook it powerfully behind square"}, {"ball": 0.6, "isHighlight": false, "text": "Vinay Kumar to Tare,1 run,shout for leg-before as he is hit with this pitched up ball but the angle was easily taking it down leg"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Tare,1 run,dabs a rising back of a length ball to third man"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Hussey,no run,left from a good length, this is pitching right on the middle stump, but he is sure it will climb comfortably over the stumps"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Hussey,no run,beaten, this time he prods at it, but it moves away slightly from a good length on the stumps to beat him"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Hussey,no run,left alone outside off on the angle across him"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Hussey,no run,tries to drive this one pitched up across him, but is beaten once more"}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Hussey,no run,this one hits the inner part of the bat now as he tries another drive, and the ball goes to mid on"}, {"ball": 2.1, "isHighlight": false, "text": "Vinay Kumar to Tare,no run,shortish and outside off, Tare looks to force it through the off side but his timing is hampered by a little more bounce"}, {"ball": 2.2, "isHighlight": false, "text": "Vinay Kumar to Tare,no run,swings wildly and the bit of away swing on offer makes Tare look terrible as he looks to slog towards deep midwicket"}, {"ball": 2.3, "isHighlight": false, "text": "Vinay Kumar to Tare,no run,back of a length and it's punched with a straight bat to mid-off"}, {"ball": 2.4, "isHighlight": false, "text": "Vinay Kumar to Tare, $$FOUR$$ ,this time he connects and the length ball on middle is dispatched to the deep midwicket boundary. Hadn't middled it but he did hit the gap"}, {"ball": 2.4, "isHighlight": false, "text": "Deep square leg shifts to deep midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Vinay Kumar to Tare,2 runs,manages to lob it over short cover. Stands up tall and essays a back-foot punch to a shortish ball outside off."}, {"ball": 2.5, "isHighlight": false, "text": "Ankith: \"Whats up with the umpire's bag ?! Reminds me of Joey from Friends !!\" It's the equipment for the camera on their caps"}, {"ball": 2.6, "isHighlight": false, "text": "Vinay Kumar to Tare,1 run,he was cramped for room and sort of pulls the short ball down to mid-on"}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Tare,no run,straightens off the deck as he pitches it just outside off and lures the batsman into poking outside off. PLay and miss"}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Tare,no run,143kph, extra bounce, extra pace. Tare was slow on his rather ambitious back-foot punch. Well beaten"}, {"ball": 3.2, "isHighlight": false, "text": "Only one slip though"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Tare,1 run,backs away and slice the shortish ball away to deep third man. Had no intention of keeping it down"}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Hussey,no run,short ball on middle hurries onto him and Huss can't get it away. Struck on the body and the leg bye isn't on offer with the bowler rushing forward from his followthrough"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Hussey,no run,no feet from the batsman as he looks to slap it through the covers. Morkel beats the outside edge again."}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Hussey,no run,lets this good length ball angled across him go safely through to the keeper"}, {"ball": 3.6, "isHighlight": false, "text": "mohan kumar dal: \"we are witnessing the difference b/w indian fast bowlers and south african fast bowler in Mumbai innings today. One side Vinay kumar is struggling to get a pace and bounce the other side morne morkel is able to generate good pace , bounce and swing with new ball. Who is the tallest fast bowler represented india in international cricket ( is it venkatesh prasad??) \" To be honest Vinay's getting the ball to nip around quite nicely"}, {"ball": 3.6, "isHighlight": false, "text": "Narine into the attack"}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Tare,no run,starts off with a shortish one on off stump and it's tapped to point"}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Tare, $$SIX$$ ,swiped into the crowd behind square leg! This was drifting into the pads and he gets down on one-knee and slog swept it so powerfully"}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Tare,1 run,quicker ball on middle, pushed down to mid-on"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Hussey, $$OUT$$ ,castled! Skids on after pitching and sneaks through his bat and pad. Huss' feet fail him once again as this one is pitched on a good length and deviates in at him. He looked all at sea trying to keep that out and by the time he played his shot the middle stump was knocked back"}, {"ball": 4.4, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Narine$$ $$3$$ $$(14m$$ $$13b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$23.07$$"}, {"ball": 4.4, "isHighlight": false, "text": "Ambati Rayudu is the new batsman. Slip in place"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Rayudu,no run,back of a length and just outside off, he goes back and punches into the off side"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Rayudu,1 run,flighted outside off and Rayudu strides forward and pushes towards mid-off. Vinay swoops on it and underarms a throw which would have made for an interesting replay had it hit the stumps."}, {"ball": 4.6, "isHighlight": false, "text": "Shakib makes it spinners from both ends"}, {"ball": 5.1, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,flighted on middle and leg, worked away into the midwicket region"}, {"ball": 5.2, "isHighlight": false, "text": "Shakib Al Hasan to Tare,no run,nicely tossed up outside off, he waited on it and looks to slash it through the off side, But gets an inside edge to the keeper"}, {"ball": 5.3, "isHighlight": false, "text": "Shakib Al Hasan to Tare,no run"}, {"ball": 5.4, "isHighlight": false, "text": "Shakib Al Hasan to Tare,1 run,flighted on off stump, he pulls out the sweep through to deep midwikcet"}, {"ball": 5.4, "isHighlight": false, "text": "I think Rayudu's gone down, clutching his left shoulder. I saw a few Mumbai players in their bibs running around with the drinks. The physio might be out there as well"}, {"ball": 5.4, "isHighlight": false, "text": "Chetan D: \"End of a very ordinary (?) performance by Hussey. Hope he picks up form in the matches to follow. One last hurrah from Mr. Cricket is definitely worth waiting for.\""}, {"ball": 5.5, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu, $$FOUR$$ ,races down the track and whacks him down the ground. Shakib tried to send the flighted delivery well outside off to evade his reach, but he struck it wonderfully well"}, {"ball": 5.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,good length ball fired in on middle and leg, worked away in front of square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Kallis to bowl after the Powerplay"}, {"ball": 6.1, "isHighlight": false, "text": "Kallis to Rayudu,1 run,fullish and outside off, pushed down the ground to long-on"}, {"ball": 6.2, "isHighlight": false, "text": "Kallis to Tare,1 run,pulled uppishly, but it bounces short of Morkel at the long leg boundary. Picked up the short ball on middle and leg and helped it along, but because of the slower pace the ball went up in the air"}, {"ball": 6.3, "isHighlight": false, "text": "Kallis to Rayudu,no run,back of a length delivery, defended"}, {"ball": 6.4, "isHighlight": false, "text": "Kallis to Rayudu,2 runs,short ball on middle, eased behind square leg and the placement is good enough to fetch a couple. Well run"}, {"ball": 6.5, "isHighlight": false, "text": "Kallis to Rayudu,2 runs,charges at him and drills one down the ground. Long-on is on hand to keep it to a couple"}, {"ball": 6.6, "isHighlight": false, "text": "Kallis to Rayudu,no run,slower ball and the batsman is kept to a defensive flick to mid-on"}, {"ball": 6.6, "isHighlight": false, "text": "sridhar: \"If Rayudu can do what Pandey did and Rohit can play like Kallis. Pollard can make all the difference to this chase. \""}, {"ball": 7.1, "isHighlight": false, "text": "Shakib Al Hasan to Tare,1 run,stays on the back foot despite this being nicely flighted on off stump, chopped to deep point"}, {"ball": 7.2, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,no run,comes down the track and pushes into the covers"}, {"ball": 7.3, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,nudged into the point region with an open blade and they swipe a quick single"}, {"ball": 7.4, "isHighlight": false, "text": "Shakib Al Hasan to Tare,no run,tossed up on middle and off, Tare drives strongly to short cover"}, {"ball": 7.5, "isHighlight": false, "text": "Shakib Al Hasan to Tare, $$OUT$$ ,goes straight up in the air and Shakib himself takes the catch, albeit after a bit of a juggle. Deceived in flight as he charged down the pitch and swung across the line without getting to the pitch. Leading edge spells his doom"}, {"ball": 7.5, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$&$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$24$$ $$(36m$$ $$22b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$109.09$$"}, {"ball": 7.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,good length ball on middle and off, punched into the off side"}, {"ball": 8.1, "isHighlight": false, "text": "Kallis to Rayudu,1 run,opens the face to ride this back of a length deliver outside off down to third man"}, {"ball": 8.1, "isHighlight": false, "text": "Pudota: \"If Rayudu and Rohit do what Pandey and Kallis did, what else will be left for Pollard to do?\" The captain to face his first ball"}, {"ball": 8.2, "isHighlight": false, "text": "Kallis to Sharma,1 run,shortish and angled in at him, whipped away calmly to deep midwicket"}, {"ball": 8.3, "isHighlight": false, "text": "Kallis to Rayudu,no run,ducks back in off a fullish length, Rayudu was on the back foot and chops to point"}, {"ball": 8.4, "isHighlight": false, "text": "Kallis to Rayudu,2 runs,short-armed jab and he finds the gap between deep midwicket and long-on. Cleared the infield comfortably and the ball seemed to gather pace off the turf"}, {"ball": 8.5, "isHighlight": false, "text": "Kallis to Rayudu,1 run,fullish on middle and off, driven down to long-on"}, {"ball": 8.5, "isHighlight": false, "text": "Shree: \"Kolkata may be this years's Hyderabad!\""}, {"ball": 8.6, "isHighlight": false, "text": "Kallis to Sharma,1 run,fullish on off stump, Rohit flicks into the midwicket region and that ushers the strategic time out"}, {"ball": 9.1, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,2 runs,fired in on leg stump, worked to the right of long-on"}, {"ball": 9.1, "isHighlight": false, "text": "Manish Pandey is down now. Clutches his right calf muscle after he sent the throw back. He was midway through a dive while firing the ball back and as he hit the ground he seemed to have done some damage."}, {"ball": 9.2, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,2 runs,flighted on middle and leg, flicked through square leg to raise Mumbai's fifty"}, {"ball": 9.3, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,this was quicker and flatter, Rohit comes forward to block and gets an inside edge onto pad"}, {"ball": 9.4, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,2 runs,flicked into the midwicket region and since the two men are right on the boundary the keeper himself has to run across and hunt the ball down"}, {"ball": 9.5, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,round-arms a flatter delivery on leg stump and Rohit answers with an open face to pick up a single towards mid-off"}, {"ball": 9.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,no run,advances out of his crease and a little and drills this flighted ball into the cover field"}, {"ball": 10.1, "isHighlight": false, "text": "Kallis to Sharma,2 runs,gorgeous flick and he's bisected deep midwicket and long-on"}, {"ball": 10.2, "isHighlight": false, "text": "Kallis to Sharma,1 run,good length ball on middle, Rohit looks to whip it away again but there isn't enough pace on it this time"}, {"ball": 10.3, "isHighlight": false, "text": "Kallis to Rayudu, $$FOUR$$ ,lofted it over short fine leg. Walked across to the off side and lap swept it well over the lone man in the infield. It was the slower delivery but Rayudu struck it well enough"}, {"ball": 10.4, "isHighlight": false, "text": "Kallis to Rayudu,no run,back of a length on off stump, defended"}, {"ball": 10.4, "isHighlight": false, "text": "Sherul: \"@Pudota: The way Mumbai are going, looks like there is going to be plenty for Pollard and Anderson to do!\""}, {"ball": 10.5, "isHighlight": false, "text": "Kallis to Rayudu,2 runs,he made room to cut this short ball, but there is protection in the deep"}, {"ball": 10.6, "isHighlight": false, "text": "Kallis to Rayudu,2 runs,advances at him and turns a length ball into a half-volley which goes down to long-off"}, {"ball": 10.6, "isHighlight": false, "text": "Piyush Chawla for some legspin"}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to Sharma,no run,flighted on middle and leg, stays back to block it"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to Sharma,1 run,opens up his stance and punches the shortish ball with a hint of room to long-off"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Rayudu,1 run,slows it up and loops it outside off, Rayudu sweeps it to deep midwicket. He was almost deceived in the flight there"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Sharma,1 run,short ball with enough room to cut to deep point"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to Rayudu,2 runs,that is a pretty neat chip. Comes down the track and picked it away off his pads to the right of deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to Rayudu,1 run,another trek down the track but this time Chawla bowls it quicker and flatter. Pushed down to long-on"}, {"ball": 11.6, "isHighlight": false, "text": "Kuldeep: \"Mumbai are sticking to a strategy here. See off the stronger bowlers (Shakib and Kallis) and go after the weaker Narine. Ohh Wait something is wrong with that statement!! Hope Mumbai realize that too!!\""}, {"ball": 12.1, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu, $$FOUR$$ ,excellent footwork from Rayudu! Reached the pitch, cleared his front hip and smears it to the extra cover boundary"}, {"ball": 12.2, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,that time his trip down the track ends up being detrimental as he yorks himself. Dug out to cover"}, {"ball": 12.3, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,2 runs,slashes to the left of cover. He'd timed it extremely well but the substitute fielder down the there has equally well. Shakib applauds"}, {"ball": 12.3, "isHighlight": false, "text": "over the wicket"}, {"ball": 12.4, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,quick, length ball on the pads. Whipped to deep midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,2 runs,charges him again and though Shakib tried to fire it outside his reach, Rayudu manages to slice it to point"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,2 runs,and again! Shakib fires a quicker, fuller delivery well outside off after seeing him charge down the pitch. But Rayudu throws his bat at it and gets two to deep point"}, {"ball": 12.6, "isHighlight": false, "text": "Mornzilla's back"}, {"ball": 13.1, "isHighlight": false, "text": "Morkel to Sharma,1 run,138kph, shortish on off stump, opens the face and drops it behind point"}, {"ball": 13.1, "isHighlight": false, "text": "Pollard has his pads on"}, {"ball": 13.1, "isHighlight": false, "text": "Joy: \"Mumbai are targeting 60-65 runs in last 5 overs. Which is achievable with 8 wickets in hand\""}, {"ball": 13.2, "isHighlight": false, "text": "Morkel to Rayudu,no run,138kph, runs at him but Morkel gets a little too much bounce to flat bat down the ground"}, {"ball": 13.3, "isHighlight": false, "text": "Morkel to Rayudu,1 run,uses his height extremely well as this thuds unto the splice of the bat. Also there is no room on offer. Only a single into the covers"}, {"ball": 13.4, "isHighlight": false, "text": "Morkel to Sharma,1 run,Rohit was making room but the bowler follows him. Again hits the bat hard as Rohit runs it down to third man"}, {"ball": 13.5, "isHighlight": false, "text": "Morkel to Rayudu,no run,walks across to the off side and the shortish ball goes down the leg side. The ump reckons its not a wide because of Rayudu's premeditation"}, {"ball": 13.6, "isHighlight": false, "text": "Morkel to Rayudu,no run,tries it again, only off a fuller length and still Rayudu cannot get bat to it. This one sails over leg stump"}, {"ball": 13.6, "isHighlight": false, "text": "Narine from the other end"}, {"ball": 14.1, "isHighlight": false, "text": "Narine to Sharma,1 run,good length ball on middle and off, Rohit clips into the midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Narine to Rayudu,no run,raps him on the pads as this is fullish and skids into him. Rayudu was slow with his flick and he was looking to play across the line as well"}, {"ball": 14.3, "isHighlight": false, "text": "Narine to Rayudu,2 runs,races down the pitch and slashes this down to long-off. No timing there"}, {"ball": 14.4, "isHighlight": false, "text": "Narine to Rayudu,1 run,his use of feet turns a shortish ball into a length one which is belted to long-off"}, {"ball": 14.5, "isHighlight": false, "text": "Narine to Sharma,1 run,neatly clipped into the vacant midwicket region"}, {"ball": 14.5, "isHighlight": false, "text": "B Sekhar Anand: \"So let me get this straight. Morkel has bowled 2.1 overs of dots in 3 overs in an T20!!!\""}, {"ball": 14.6, "isHighlight": false, "text": "Narine to Rayudu,4 byes,Uthappa has missed the stumping there. Had not picked the ball turning in, nor did he stay low. Rayudu was deceived as well, racing down the track and swinging wildly."}, {"ball": 15.1, "isHighlight": false, "text": "Morkel to Sharma, $$SIX$$ ,smacked over deep square leg! That's a Rohit special! He was waiting for the back of a length delivery and pulled it comfortably into the crowd"}, {"ball": 15.2, "isHighlight": false, "text": "Morkel to Sharma, $$OUT$$ ,143kph, off the bottom of the bat and his luck runs out this time. It was full and angled in at him. Rohit was looking to clear the midwicket boundary this time but Kallis had to make a bit of ground to his left and he overran it initially. But a timely little dive helps him hold it safely. Strategic time out now"}, {"ball": 15.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$Kallis$$ $$b$$ $$Morkel$$ $$27$$ $$(33m$$ $$20b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$135.00$$"}, {"ball": 15.2, "isHighlight": false, "text": "Ozee: \"Kolkata have absolutely choked Mumbai here....there is hardly any momentum....runs have dried up.....won't be easy even though they have got some big lads to come in....gonna be difficult to chase this down.\" Lets see if Kieron Pollard can do something about it"}, {"ball": 15.3, "isHighlight": false, "text": "Morkel to Rayudu, $$FOUR$$ ,148kph, walks across and he pulls it to the fine leg boundary. Uses all the pace on that delivery and finds a much needed boundary"}, {"ball": 15.4, "isHighlight": false, "text": "Morkel to Rayudu,1 run,146kph, Rayudu has decided he is going to shift across his stumps to to play Morkel. Drags a short ball from well outside off to deep square leg"}, {"ball": 15.4, "isHighlight": false, "text": "Terrence: \"This Kolkata bowling lineup is one of the best...mystery, left arm, and leg spin, really fast bowling and good medium and part-timers\""}, {"ball": 15.5, "isHighlight": false, "text": "Morkel to Pollard,no run,he's broken his watch! Short ball angled in at his body and Pollard got into a perfect tangle. Strikes him on the wrist and the ball lands safely"}, {"ball": 15.6, "isHighlight": false, "text": "Morkel to Pollard,no run,another ripper of a bouncer and Pollard looks in considerable discomfort as he tries to fend it away"}, {"ball": 16.1, "isHighlight": false, "text": "Narine to Rayudu, $$OUT$$ ,he has it on the second time, Uthappa is seriously chuffed with that. This was the one that goes the other way and like the last time the batsman misread it. Keeper does though and in his excitement he missed the bails the first time, but Rayudu was so far down the track he has enough time to remedy his mistake"}, {"ball": 16.1, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$st$$ $$†Uthappa$$ $$b$$ $$Narine$$ $$48$$ $$(59m$$ $$40b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$120.00$$"}, {"ball": 16.1, "isHighlight": false, "text": "Kamal: \"Still two overs of Vinay left. A ray of hope for Mumbai\" And it's Corey Anderson in the middle now"}, {"ball": 16.2, "isHighlight": false, "text": "Narine to Anderson,no run,pushed through on off stump, Anderson chops it to point"}, {"ball": 16.3, "isHighlight": false, "text": "Narine to Anderson,no run,good length ball and it turns back in at him. Anderson was caught in front of all three stumps but there was a lit on inside edge"}, {"ball": 16.4, "isHighlight": false, "text": "Narine to Anderson,1 run,think Uthappa's dropped it! This turns away from the left-hander, who swings seeking midwicket. Very thick bottom edge and it would have tested a regular keeper as well."}, {"ball": 16.5, "isHighlight": false, "text": "Narine to Pollard,2 runs,flighted outside off, eased into the midwicket region"}, {"ball": 16.6, "isHighlight": false, "text": "Narine to Pollard,no run,good length ball fired in on the pads, blocked"}, {"ball": 16.6, "isHighlight": false, "text": "Puri: \"@KamaL: No way! You perhaps don't remember Vinay's death bowling last year.\""}, {"ball": 16.6, "isHighlight": false, "text": "Here;s Chawla. Think he's here for Anderson"}, {"ball": 17.1, "isHighlight": false, "text": "Chawla to Anderson,no run,starts off with the googly and it's too wide for him to cut"}, {"ball": 17.2, "isHighlight": false, "text": "Chawla to Anderson,no run,he was into the pull shot way too early! Top spinner from Chawla and it held onto the pitch that much longer to sneak under his bat"}, {"ball": 17.3, "isHighlight": false, "text": "Chawla to Anderson,no run,flighted outside off, he goes down on one-knee to slog sweep it into the stands behind midwicket. Soundly beaten"}, {"ball": 17.4, "isHighlight": false, "text": "Chawla to Anderson,1 run,shortish and spins across him, pulls to long-on"}, {"ball": 17.5, "isHighlight": false, "text": "Chawla to Pollard,2 runs,flighted on middle and leg, whipped away to deep midwicket"}, {"ball": 17.5, "isHighlight": false, "text": "Chinmay: \"I am surprised by the lack of urgency from the batsman! First Rayudu and now Pollard\""}, {"ball": 17.6, "isHighlight": false, "text": "Chawla to Pollard,1 wide,fires it down the leg side. Good take from Uthappa. Moved with the ball and stayed low too"}, {"ball": 17.6, "isHighlight": false, "text": "Chawla to Pollard,no run,what's happened there? Uthappa has knocked the bail off with his gloves as Pollard's cut gets a bottom edge and wanders into the off side"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Anderson, $$OUT$$ ,off stump is knocked back and Anderson's much awaited debut in the tournament ends up an anti-climax. Flighted on off stump and it turns back in. The slog over midwicket fails again and this time it signals the end of his innings"}, {"ball": 18.1, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$b$$ $$Narine$$ $$2$$ $$(17m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$25.00$$"}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Harbhajan Singh,no run,flighted on off stump, Bhajji the new batsman looks to smear it to deep midwicket and gets a bottom edge"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Harbhajan Singh, $$OUT$$ ,how much did that turn! Pitched on leg stump and turned right across the tail-ender's slog to disturb the off stump. A legspinner would be proud of that"}, {"ball": 18.3, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$b$$ $$Narine$$ $$0$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.3, "isHighlight": false, "text": "Out walks CM Gautam, Mumbai's keeper"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Gautam,no run,good length ball which turns away from him. Goes back to try and read it off the deck and gets a leading edge back to the bowler"}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Gautam, $$FOUR$$ ,moves across to the off side and slog sweeps it to the square leg boundary"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Gautam,no run,switches his stance around in search of a reverse whip, but Narine is too clever for him. Fires in a yorker down the leg side and his premeditation means it's not a wide"}, {"ball": 19.1, "isHighlight": false, "text": "Chawla to Pollard,1 run,flighted on off stump, driven to long-off"}, {"ball": 19.1, "isHighlight": false, "text": "Idrees Kanchwal: \"GAME, SET & MATCH SUNIL NARINE!!\""}, {"ball": 19.2, "isHighlight": false, "text": "Chawla to Gautam,2 runs,comes down the track to get to the pitch of a flighted ball on off stump. Lovely drive over the off side"}, {"ball": 19.3, "isHighlight": false, "text": "Chawla to Gautam,no run,well flighted outside off and he was looking to sweep it. Misses. They're checking the stumping but Gautman has dragged his back foot back just in time"}, {"ball": 19.3, "isHighlight": false, "text": "Harish: \"How not to chase a 160 odd target ! Mumbai are setting a sample . Do not underestimate any bowling attack with your power hitting skills . 50 from 5 is different from 65 from 5 .\""}, {"ball": 19.4, "isHighlight": false, "text": "Chawla to Gautam,1 run,down the track and swings this flighted delivery down to long-on"}, {"ball": 19.5, "isHighlight": false, "text": "Chawla to Pollard,1 run,quicker and flatter delivery outside off, chopped to short third man"}, {"ball": 19.6, "isHighlight": false, "text": "Chawla to Gautam, $$OUT$$ ,that's emphatic. Misreads the googly as he races down the track. Misses wildly and Uthappa breaks the stumps. Kolkata beat the defending champions by 41 runs, their biggest win over Mumbai"}, {"ball": 19.6, "isHighlight": false, "text": "$$CM$$ $$Gautam$$ $$st$$ $$†Uthappa$$ $$b$$ $$Chawla$$ $$7$$ $$(5m$$ $$7b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "$$10.10$$ $$pm$$  So the tournament gets off with the ball besting the bat on a pitch that did have some grass on it. Kolkata had upstaged the champions who have some work to do in sorting out their batting order, or at least what each player's role is. But like Rohit said this is a big competition and the next game coming at you is Delhi v Bangalore. Hope to have your company then, but for now this is Alagappan Muthu saying good night"}, {"ball": 19.6, "isHighlight": false, "text": "$$Jacques$$ $$Kallis$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Had a good few months off. Nice to catch up with friends and family, but I worked had on my cricket to help Kolkata this season. There was more bounce this season which suited. Kept the good balls out at the start and cashed it in the death. Morne started great at the start with the ball and Narine was brilliant as well. I probably haven't got too many years left and I'm just looking forward to having some fun in the middle\""}, {"ball": 19.6, "isHighlight": false, "text": "\"We've got a very good bowling attack and if we put runs on the board most of the times we'll end up winning,\" $$Gautam$$ $$Gambhir$$  says, \"A quality batter like Kallis knows when to accelerate and if either me or him stays till the 15th over we'll get a good score. We have Morne's pace and Narine and Chawla in the spin department and Vinay's pretty good at the death as well\""}, {"ball": 19.6, "isHighlight": false, "text": "\"Disappointing, first game of the season. Lots to learn from this game. We will tak the positives from this game, although there weren't many. I hope the guys stay positive and enjoy each other's company. It's a long tournament,\" says  $$Rohit$$ $$Sharma$$ . \"They batted really well, we didn't get a wicket when we wanted and they knew with eight wickets in hand they went after the bowling. We tried our best, Malinga bowled really well and I hope the guys can turn it around as quickly as possible. Fair bit of grass on the wicket, there was a bit of bounce. Odd balls were stopping and coming so it wasn't true. It played well but we didn't bat well. Still 13 more games and I hope we come back strongly\""}, {"ball": 19.6, "isHighlight": false, "text": "$$9.55$$ $$pm$$  Gambhir was highly confident with his bowling attack and they showed it off in restricting the big-name Mumbai to a very ordinary total. Morne Morkel set the tone early on with his extra bounce and pace and Sunil Narine's variations proved too good in the death"}, {"ball": 19.6, "isHighlight": false, "text": "Pushkar: \"I think Kallis should be the MoM instead of Narine. Batting doesnt seem to be that easy on this pitch... and Mumbai bowling lineup is not that bad\""}, {"ball": 19.6, "isHighlight": false, "text": "Pratyush: \"What is the world was Polly doing? Was he playing for being not out? Pathetic from a player of his stature!\" In his defence the game was pretty much done when he came out"}], "name": "Mumbai Indians v Kolkata Knight Riders", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729279.html?innings=2;view=commentary", "match_num": 1}