{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$6.25$$ $$pm$$  We're about a handful of minutes away from the first ball. Royals are in a huddle beyond the boundary. The umpires have strode out to the middle with the match ball. Brendon McCullum and Dwayne Smith man their positions on either end of the pitch. Dhawal Kulkarni has a slip in place"}, {"ball": 0, "isHighlight": false, "text": "\"Looking forward to another \"clash of titans\"......Guys we need thrilling performance...Pls NO drop catches....\" Amol's plea is quite striking, but here in rebuttal is Andrew Hughes  $$explaining$$  how human beings were not made to take catches"}, {"ball": 0, "isHighlight": false, "text": "\"@ Mustafa : As per cricinfo's fantasy team RR have 6 all rounders playing !!!\" Rakesh Jain has found a source for a definitive ruling."}, {"ball": 0, "isHighlight": false, "text": "anand: \"why is abhishek nayar not bowling?? he is decent bowler as per the domestic performance is considered\""}, {"ball": 0, "isHighlight": false, "text": "Mustafa: \"8 allrounders in rajasthan royal no wonder they chose to chase......\" Might be a little generous there, but the point is well received"}, {"ball": 0, "isHighlight": false, "text": "shushank : \"If csk were looking to bat, why are they disappointed. .. aren't they batting now..??\" Good spot, mate. It's been changed now. Hopefully that's the last time my fingers malfunction"}, {"ball": 0, "isHighlight": false, "text": "$$6.00$$ $$pm$$ $$Rajasthan$$ $$Royals$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bowl$$  They think the wicket is going to play pretty well and their side is set up for the chase.  $$Tim$$ $$Southee$$ $$is$$ $$in$$ $$for$$ $$Kane$$ $$Richardson$$  who is sick. Shane Watson has not been bowling lately because of a \"back issue\" but he is hopeful of rolling his arm over soon"}, {"ball": 0, "isHighlight": false, "text": "Super Kings were looking to bat as well so they are not disappointed. Dhoni says they are playing an unchanged XI. The side has \"complete balance\" he adds no matter what the pitch offers"}, {"ball": 0, "isHighlight": false, "text": "Joshua: \"I'm torn. I love watching Watson cut loose in the short format, but if he scores big this IPL it just prolongs his shaky but seemingly interminable run in the test side. Guess I'll just relax enjoy the cricket whatever happens!\""}, {"ball": 0, "isHighlight": false, "text": "Ankit: \"Ishwar pandey looked great in the last match. I hope he get a long run in this IPL\""}, {"ball": 0, "isHighlight": false, "text": "Sahil: \"RR need to sort out their opening combination. Unmukt Chand is a viable option (Now that Brett Lee is not playing IPL 7!) in case Watson doesn't want to promote himself.\""}, {"ball": 0, "isHighlight": false, "text": "$$5.50$$ $$pm$$  There is only one image that comes to mind when the words \"Desert Storm\" is uttered. Karthik Krishnaswamy was in Sharjah on the 16th anniversary of Sachin Tendulkar's seminal century and explores all the things that have  $$changed$$  and all that has remained the same"}, {"ball": 0, "isHighlight": false, "text": "SriniDasari: \"This season is real test for Royals. So far they have been riding on their strong performances at their forte, Jaipur. Playing at a neutral venue this time really tests their character as a team.\""}, {"ball": 0, "isHighlight": false, "text": "Hari: \"No replacements for Bravo?\" We haven't heard any announcements. He wasn't available for the last game as well, which allowed place for Hilfenhaus in the XI"}, {"ball": 0, "isHighlight": false, "text": "Sahil: \"I really hope Baba Aparajith gets a game today. Would be great to see two highly talented youngsters (Samson and Aparajith) take the field.\""}, {"ball": 0, "isHighlight": false, "text": "$$5.40$$ $$pm$$  Welcome to ESPNcricinfo's live coverage of the IPL match between Chennai Super Kings and Rajasthan Royals. For those who're lagging behind in the news, Super Kings have lost Dwayne Bravo to a shoulder problem. Both teams have won one and lost one so far. Here are more comprehensive  $$insights$$  from Rachna Shetty"}, {"ball": 0, "isHighlight": false, "text": "------------"}, {"ball": 0, "isHighlight": false, "text": "$$CricIQ$$  gathers steam as Powerplay 1 heads into the slog overs. Have you booked your place at the top of the weekly leaderboard yet? Time is running out.  $$Pad$$ $$up.$$ $$Play$$ $$your$$ $$shots.$$"}, {"ball": 0, "isHighlight": false, "text": "Want to stay plugged in to all the cricket buzz on Twitter, but don't know where to start? ESPNcricinfo's  $$Cricket$$ $$on$$ $$Twitter$$  page is just the place for you. Follow the best voices on cricket, find out who is trending, and stay updated with all the social chatter."}, {"ball": 0.1, "isHighlight": false, "text": "Kulkarni to Smith, $$FOUR$$ ,that was clean! Invited Smith on the front foot and was also offering enough room for him to exploit. A simple extension of the arms sends it scurrying through the cover field"}, {"ball": 0.2, "isHighlight": false, "text": "Kulkarni to Smith,no run,bit of seam away and Smith is mindful of it as he leaves it alone"}, {"ball": 0.3, "isHighlight": false, "text": "Kulkarni to Smith,no run,goes fuller on off stump, Smith steps forward and blocks the outswinger with an open face"}, {"ball": 0.3, "isHighlight": false, "text": "Shrikant: \"Contribution of leg spinners in this tournament makes me happy. Looking forward eagerly to Tambe to bowl. Hope Smith also turns his arms today.\""}, {"ball": 0.4, "isHighlight": false, "text": "Kulkarni to Smith,no run,just back of a length, Smith's weight was on the front foot as he punches to cover point"}, {"ball": 0.5, "isHighlight": false, "text": "Kulkarni to Smith,no run,and there's the first bit of misbehaviour from the pitch. This good length ball holds up a little more and Smith was into his defensive push quite early. Has to pull his bottom hand off and yet it went a little uppishly to point"}, {"ball": 0.6, "isHighlight": false, "text": "Kulkarni to Smith,1 run,pushes down to mid-on off the back foot to keep strike"}, {"ball": 0.6, "isHighlight": false, "text": "Tim Southee from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Southee to Smith,2 runs,fullish but dipping on the pads, Smith works it away to deep square leg"}, {"ball": 1.2, "isHighlight": false, "text": "Southee to Smith,no run,short of a good length, Smith still prods forward and blocks to the bowler. Not enough room to enable the power he wanted to use"}, {"ball": 1.3, "isHighlight": false, "text": "Southee to Smith,no run,sneaks a little wide of the crease to add a little more teeth to a fuller delivery that straightens outside off. Smith was looking to flay it over the off side and is well beaten"}, {"ball": 1.4, "isHighlight": false, "text": "Southee to Smith,no run,changes it up with the indipper and Smith is a little late in whipping it through midwicket. Inside edges it onto the pads and lingers outside his crease as he searches for the ball. Sees Southee charging at him and backtracks into his crease"}, {"ball": 1.5, "isHighlight": false, "text": "Southee to Smith,1 run,full and angled in at him and the angle was more acute with his moving wide of the crease. Smith nudges to square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Senthil: \"CSK is back, I mean their sedate start as usual. I wonder will Baz attack his countryman?\""}, {"ball": 1.6, "isHighlight": false, "text": "Southee to McCullum,no run,of course he will. Charges down the track for the very first ball he faces today and turns a fuller delivery into a full toss. Only he strikes it at the very bottom of the bat and should consider himself lucky that it didn't carry to Watson at mid-off"}, {"ball": 2.1, "isHighlight": false, "text": "Faulkner to Smith,1 run,leading edge has enough to fly down to third man. Tambe was the fielder there but he can't cut the angle quick enough to get under it. A swifter man down there might have made that into a chance. Back of a length delivery seams away from Smith as he was looking to whip it through square leg"}, {"ball": 2.2, "isHighlight": false, "text": "Faulkner to McCullum,1 run,makes an ugly thwack on impact as Baz meets this fuller delivery with a defensive push. Gets it off the outside half of the bat as Watson swoops down on it from mid-off"}, {"ball": 2.3, "isHighlight": false, "text": "Faulkner to Smith,no run,fullish and wide outside off, Smith slaps it into the cover field"}, {"ball": 2.4, "isHighlight": false, "text": "Faulkner to Smith, $$SIX$$ ,that was in the slot and Smith has taken ample toll. Length ball on off stump and a free swing of his strong arms sends crashing into the sight screen"}, {"ball": 2.5, "isHighlight": false, "text": "Faulkner to Smith,1 run,fuller delivery on and around off stump, eased into the covers again"}, {"ball": 2.6, "isHighlight": false, "text": "Faulkner to McCullum,1 run,slower ball off the back of the hand, Baz has spotted it as he shuffles across and picks it away off his hips"}, {"ball": 2.6, "isHighlight": false, "text": "Ishan Jain: \"@Shrikant: I guess you did not see Maxwell slaughtering Mishra yesterday. Mishra really made a huge contribution yesterday :P\" Kulkarni switches ends. Third man inside the circle"}, {"ball": 3.1, "isHighlight": false, "text": "Kulkarni to McCullum,no run,seeks the block hole on off stump, Baz digs it out to mid-off"}, {"ball": 3.2, "isHighlight": false, "text": "Kulkarni to McCullum,no run,slightly slower on middle stump, Baz steps forward and blocks"}, {"ball": 3.2, "isHighlight": false, "text": "Slip moves to midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Kulkarni to McCullum,no run,another slower ball keeps McCullum into a a forward defensive"}, {"ball": 3.4, "isHighlight": false, "text": "Kulkarni to McCullum,1 run,and when the change of pace is dug in short, he lunges forward and swats it to deep square leg. He's certainly not holding back if he sees anything in his area"}, {"ball": 3.4, "isHighlight": false, "text": "Karthick: \"Excellent Captaincy from Watson. He's rotating the bowlers to build up Pressure on CSK\""}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Smith,no run,the slower ball bouncer works against the other opener. Smith was done with the shot ages before it came up and hit the back of his helmet. Has an embarrassed grin on his face"}, {"ball": 3.6, "isHighlight": false, "text": "Kulkarni to Smith,1 run,back of a length and outside off, Smith stands up tall and punches through the gap at extra"}, {"ball": 3.6, "isHighlight": false, "text": "Avin Mehta: \"First and Second overs are always good from Kulkarni its the 3rd over where he always leaks runs\""}, {"ball": 4.1, "isHighlight": false, "text": "Southee to Smith,no run,he's having trouble when he's cramped for room. Slow on the draw against a fuller skidder that darts in at his pads. Flick shot employed, but in vain"}, {"ball": 4.2, "isHighlight": false, "text": "Southee to Smith, $$SIX$$ ,smack! Southee goes wide of the crease but makes the fatal error of providing an overpitched delivery outside off. Smith is on the front foot and pummels it flat over the long-off boundary"}, {"ball": 4.3, "isHighlight": false, "text": "Southee to Smith,1 run,pulls his length back and targets middle, Smith is able to whip it away through midwicket this time"}, {"ball": 4.4, "isHighlight": false, "text": "Southee to McCullum,1 run,skips down the track and almost yorks himself, drills the ball down to mid-on and runs with the shot. Steve Smith is the man there and strikes the stumps direct. But he had enough momentum to make his ground"}, {"ball": 4.4, "isHighlight": false, "text": "Sarthak Aggarwa: \"Bloomington, IL: I dont understand this split personality issue with McCullum. When he is on song he is a different person but when he is not you can predict it easly that he is no longer going to stay and its the same kind of feeling I am getting today!\""}, {"ball": 4.5, "isHighlight": false, "text": "Southee to Smith,no run,terrific bowling. They're getting their slower balls on target. Southee presents a leg cutter, something he's been working on lately and deceives the batsman. Smith was again way too soon on the pull"}, {"ball": 4.6, "isHighlight": false, "text": "Southee to Smith, $$FOUR$$ ,no trouble timing that one. Again when there is width on offer Smith looks imperious. Sinks down to reach the almost wide yorker and squeezes it through point"}, {"ball": 5.1, "isHighlight": false, "text": "Faulkner to McCullum,1 wide,slower ball gone wrong there as he slides it down the leg side"}, {"ball": 5.1, "isHighlight": false, "text": "Faulkner to McCullum,2 runs,he's looking quite eager. Charges down the pitch and targets the cover field, but has to settle for a thick edge that almost finds the boundary at point. The edges on these cricket bats!"}, {"ball": 5.2, "isHighlight": false, "text": "Faulkner to McCullum, $$OUT$$ ,Smithy, you absolute sensation! Three men were hunting down that catch, it was about to land just out of reach but he dives and sticks out both hand and plucks it out of it's trajectory! It was length but Baz hit it a little too high on the bat. It was a very difficult skier somewhere beyond the circle in the midwicket region but he was quick enough and athletic enough to pull it off"}, {"ball": 5.2, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Smith$$ $$b$$ $$Faulkner$$ $$6$$ $$(26m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 5.3, "isHighlight": false, "text": "Faulkner to Smith, $$FOUR$$ ,that time he had no trouble despite the lack of room. It has to be on middle to keep him quiet and this was down leg stump and Smith has pulverized it to the long leg boundary"}, {"ball": 5.4, "isHighlight": false, "text": "Faulkner to Smith, $$FOUR$$ ,and he shows he can be delicate as well. Late cuts a back of a length ball from off stump and beats short third man"}, {"ball": 5.5, "isHighlight": false, "text": "Faulkner to Smith, $$FOUR$$ ,low full toss on off stump, Smith plants his front leg down the pitch and drills it to the long-off boundary. There was no stopping that"}, {"ball": 5.6, "isHighlight": false, "text": "Faulkner to Smith, $$FOUR$$ ,this time he goes aerial. That's CSK's fifty and you wouldn't have believed they had lost a wicket in that over. It was fullish on off stump, but he stayed put to make sure his arms had enough room to swing clean through the line. The advertising boards at long-off takes a battering again"}, {"ball": 5.6, "isHighlight": false, "text": "Tambe comes in for damage control"}, {"ball": 6.1, "isHighlight": false, "text": "Tambe to Raina,no run,tossed up on middle, Raina the new batsman pushes down the pitch"}, {"ball": 6.2, "isHighlight": false, "text": "Tambe to Raina,no run,I think this went on with the arm and Raina opened the face to find point"}, {"ball": 6.3, "isHighlight": false, "text": "Tambe to Raina,no run,almost through him! Got the legspinner to dip just before it reached the batsman and the turn almost allowed it to sneak through bat and pad"}, {"ball": 6.4, "isHighlight": false, "text": "Tambe to Raina,2 runs,skips down the track and squeezes it through point. Neat stroke but Southee from the deep sends in a rocket through right on top of the stumps and Raina just about makes it"}, {"ball": 6.5, "isHighlight": false, "text": "Tambe to Raina,no run,flighted outside off, Raina closes the face on impact and pushes it back to the bowler"}, {"ball": 6.6, "isHighlight": false, "text": "Tambe to Raina,no run,meets it on the full after using his feet, but he doesn't beat midwicket"}, {"ball": 6.6, "isHighlight": false, "text": "Ahmed: \"Score is 51/1 and Smith on 44.. such scores were common when Jaysuriya & Kaluwitrana or Sehwag & Gambhir played... one player scores 95% of the total..\""}, {"ball": 6.6, "isHighlight": false, "text": "nag: \"one instigating comment from Faulkner and that seemed to earned the wrath of every West Indian Player-then Sammy, now Smith, next who?\" Watson has pulled him off now. It's Stuart Binny"}, {"ball": 7.1, "isHighlight": false, "text": "Binny to Smith, $$SIX$$ ,slightly short to start with and Smith has mauled it into the stands behind cow corner. Flat, hard, murderous. That's an emphatic way to reach fifty"}, {"ball": 7.2, "isHighlight": false, "text": "Binny to Smith, $$OUT$$ ,that's instant revenge and Smith throws his head back! He's spliced a slower, back of a length ball down the throat of mid-off. He was trying his best to make some room to lash it quite a bit squarer than where it ended up but the ball struck him a little too high on the bat and he wasn't able to instill any power into the shot"}, {"ball": 7.2, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Watson$$ $$b$$ $$Binny$$ $$50$$ $$(36m$$ $$28b$$ $$6x4$$ $$3x6)$$ $$SR:$$ $$178.57$$"}, {"ball": 7.2, "isHighlight": false, "text": "Royals have an opening here with two new batsman. Faf is in at No.4"}, {"ball": 7.2, "isHighlight": false, "text": "BABU: \"what was Mumbai Indian thinki g this time at auction they let Maxwell and Smith go and they both doing extremely dangerous batting. i am sure mumbai owner must be in regretting in each match they watching this two batsman exploding \""}, {"ball": 7.3, "isHighlight": false, "text": "Binny to Raina,1 run,even Binny bowls short at Raina. Got good height on it too, but it is well negotiated as he went back and pulled down to long leg"}, {"ball": 7.4, "isHighlight": false, "text": "Binny to du Plessis,1 run,back of a length and just outside off, Faf rides it behind point"}, {"ball": 7.5, "isHighlight": false, "text": "Binny to Raina,1 run,top edges a short ball! But there is no one at square leg. It was the offcutter as well and Raina must have had his heart in his mouth."}, {"ball": 7.6, "isHighlight": false, "text": "Binny to du Plessis,1 run,shortish and in the channel, Faf taps it down to third man"}, {"ball": 7.6, "isHighlight": false, "text": "Singh: \"Last 6 balls Smith played before he got out...4,4,4,4,4,6. Exellect batting.\" On come the Royals' Indian allrounders. This is Rajat Bhatia"}, {"ball": 8.1, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,fullish and outside off, Faf opens the face to ease it behind point"}, {"ball": 8.2, "isHighlight": false, "text": "Bhatia to Raina, $$OUT$$ ,and finally the slower ball has him! It's not a short one though. Raina backed away to flay the good length offcutter through the off side and gets a thick outside edge that lobs to short third man. Kulkarni dives forward and plucks a pretty neat take"}, {"ball": 8.2, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Kulkarni$$ $$b$$ $$Bhatia$$ $$4$$ $$(15m$$ $$9b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$44.44$$"}, {"ball": 8.2, "isHighlight": false, "text": "And the wicket ushers the strategic time out"}, {"ball": 8.2, "isHighlight": false, "text": "Kalyan Sen: \"It looks like every alternative match Domestic bowlers will bowl well .. 1st match Dinda conceded 40+ next match 14 runs Bala conceded 40+ next match 13 runs 4 wicket .. Last Match Dhawal conceded 50+ .. hope he will prove me right .. :) \""}, {"ball": 8.3, "isHighlight": false, "text": "Bhatia to du Plessis,no run,good length and just outside off, not too much pace on it. Faf gets behind it and pushes to short extra cover"}, {"ball": 8.4, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,leg cutter bowled fullish on off stump, Faf punches down to mid-on. Less than 95ks that"}, {"ball": 8.4, "isHighlight": false, "text": "MS Dhoni surveys the field"}, {"ball": 8.5, "isHighlight": false, "text": "Bhatia to Dhoni,no run,fullish on off stump, Dhoni leans forward to block"}, {"ball": 8.6, "isHighlight": false, "text": "Bhatia to Dhoni,1 run,another leg cutter, Dhoni taps it in front of point and these two are quite quick between the wickets"}, {"ball": 8.6, "isHighlight": false, "text": "Sam: \"Dhoni has about 12 overs to play, this will be new and interesting to watch. CSK are either in for a 200+ score or if RR can get him out, they can almost ensure their win.\" Tambe's back"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to Dhoni,1 run,flighted on off stump, Dhoni almost flicks it down to long-off"}, {"ball": 9.2, "isHighlight": false, "text": "Tambe to du Plessis,no run,hit around the neck! That's the other side of a scoop shot. He's run it onto his own body to in trying to find the boundary fine behind the keeper"}, {"ball": 9.3, "isHighlight": false, "text": "Tambe to du Plessis,2 runs,doesn't put him off the shot though and this time he employs better technique. Goes across and scoops the tossed up delivery from leg stump for pick up  a couple"}, {"ball": 9.4, "isHighlight": false, "text": "Tambe to du Plessis,1 run,leans forward and woks the tossed up delivery into midwicket"}, {"ball": 9.5, "isHighlight": false, "text": "Tambe to Dhoni,1 run,nonchalantly nudged down the ground to long-on. Tambe giving the ball some nice air"}, {"ball": 9.6, "isHighlight": false, "text": "Tambe to du Plessis,no run,this time he spots Faf coming down the pitch and pulls the length back. A bit of turn as well for the batsman to negotiate. All he can do is block"}, {"ball": 9.6, "isHighlight": false, "text": "Manu: \"Dhoni should have sent in Manhas. Dhoni is best coming in with 5 overs or so to go. Moreover, Manhas isn't a great batsman at the death (though he did well in the last game)\""}, {"ball": 10.1, "isHighlight": false, "text": "Bhatia to Dhoni, $$OUT$$ ,This would have been a catch, but now it might well be a run-out. It was another legcutter and Dhoni was looking to force it down the ground. But the punch had no power in it. Bhatia dives to his right and gets the very tip of his fingers on it and luckily for Royals it strikes the stumps"}, {"ball": 10.1, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$run$$ $$out$$ $$7$$ $$(17m$$ $$9b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$77.77$$"}, {"ball": 10.2, "isHighlight": false, "text": "Bhatia to Dhoni,1 run,fullish on middle, Dhoni pushes down the ground and mid-off cuts across to keep it to a single"}, {"ball": 10.2, "isHighlight": false, "text": "Jadeja is the new batsman"}, {"ball": 10.3, "isHighlight": false, "text": "Bhatia to Jadeja,no run,length ball outside off, Jaddu pushes down to the right of mid-off"}, {"ball": 10.4, "isHighlight": false, "text": "Bhatia to Jadeja,1 run,fullish and outside off, he comes forward to block and gets a thick edge through to third man. The offcutter grips and bounces off this slow deck"}, {"ball": 10.5, "isHighlight": false, "text": "Bhatia to Dhoni,1 run,stays back and nurdles the good length ball behind square leg. He was charging down the pitch, looking for a second but it's not there"}, {"ball": 10.6, "isHighlight": false, "text": "Bhatia to Jadeja,no run,another offcutter on middle, Jaddu turns it to short midwicket"}, {"ball": 11.1, "isHighlight": false, "text": "Tambe to Dhoni, $$OUT$$ ,he's picked out deep square leg! Faulkner hardly had to move! Dhoni looked quite dangerous skipping down the track and he connected pretty cleanly as well. But he forgot all about the placement. A terribly soft dismissal considering the situation"}, {"ball": 11.1, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ $$c$$ $$Faulkner$$ $$b$$ $$Tambe$$ $$5$$ $$(12m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$62.50$$"}, {"ball": 11.1, "isHighlight": false, "text": "Don: \"Poor Dhoni, the man can never win can he. When he comes in 6-7 people complain he's in far too low and he should come in earlier, now he promotes himself ahead of somebody and again people are complaining that he came in too early. It must be tough being a cricketer, no matter what you do someones bound to criticize you. \" And he's just given them a bit more ammo"}, {"ball": 11.1, "isHighlight": false, "text": "Mithun Manhas has made his way to the middle"}, {"ball": 11.2, "isHighlight": false, "text": "Tambe to Jadeja, $$FOUR$$ ,flighted on leg stump, Jaddu glances it to the left of short fine leg and it has enough to skim off to the boundary. Tambe's angry with his poor line"}, {"ball": 11.3, "isHighlight": false, "text": "Tambe to Jadeja,no run,flighted on middle and leg, Jaddu wanted to block but had to bring it around his front pad, Mild appeal but it would have gone down leg"}, {"ball": 11.4, "isHighlight": false, "text": "Tambe to Jadeja,1 run,flatter delivery on off stump, he goes back and pushes down to long-on"}, {"ball": 11.5, "isHighlight": false, "text": "Tambe to Manhas,2 runs,stays back and lets the ball turn and then guides it behind point with an open face. Couple of runs craftily done. Quite a delay from the third umpire considering Manhas has dragged his bat into his crease before the stumps were broken by the keeper"}, {"ball": 11.6, "isHighlight": false, "text": "Tambe to Manhas,no run,tossed up on middle and leg, the clip can't beat midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Naresh: \"Success mantra for Tambe is his pace. He doesn't too give too much air for the batsmen to go against him. I've seen many leggies going for runs but this guy is incredibly consistent !\""}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Jadeja,no run,no pace offered as this is fullish and outside off, Jadeja steers it to point"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Jadeja,no run,back of a length and just outside off, Jaddu looks to force it through the off side but he can't beat cover"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Jadeja,1 run,full on the pads, Jaddu flicks it behind square leg"}, {"ball": 12.3, "isHighlight": false, "text": "Amyth: \"The umpire cam is the most useless addition - the amatuerish shaky coverage gives viewers headaches and not to forget it makes the umpires look like 90s messenger boys with the sling bags they have to wear\""}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Manhas,1 run,stays deep in his crease and works the back of a length ball through to deep midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Jadeja,1 run,offcutter now, pushed full on leg stump. Jadeja turns it away square into the leg side"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Manhas,1 run,back of a length and outside off, steered down to deep third man. That brings the strategic time out as well"}, {"ball": 12.6, "isHighlight": false, "text": "Shashi Kiran: \"Once again, Binny is removed after giving just one over for 3rd consecutive match.. why??? He has variations and can be given more overs... \""}, {"ball": 12.6, "isHighlight": false, "text": "Sam: \"@Don - Well, if you are a specialist finisher, you have got to finish. And whenever you fail to do so, there will be complaints. When you succeed in finishing, there will be praises. Its a s simple as that.\""}, {"ball": 13.1, "isHighlight": false, "text": "Tambe to Manhas, $$FOUR$$ ,there's some aggression. Lashes it inside out over the cover field. Made room and opened up his stance to place it in the gap"}, {"ball": 13.2, "isHighlight": false, "text": "Tambe to Manhas,1 run,flighted outside off and he taps it through the covers"}, {"ball": 13.3, "isHighlight": false, "text": "Tambe to Jadeja,2 runs,flat on middle, Jaddu waits on his back foot and clips it between midwicket and square leg. Easy two there"}, {"ball": 13.4, "isHighlight": false, "text": "Tambe to Jadeja,1 run,pushes him back again with a quicker skidding leg break. With pace on the ball, Jaddu has little trouble turning it through midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Tambe to Manhas,5 wides,a bit of flight to the right-hander but his line goes wrong. Manhas was looking to glance it fine but it's a better result for the team as the ball scurries away for five wides"}, {"ball": 13.5, "isHighlight": false, "text": "Tambe to Manhas,no run,flighted on off stump, but he still stays back to slice it to point"}, {"ball": 13.6, "isHighlight": false, "text": "Tambe to Manhas,no run,tossed up outside off, Manhas pushes it into the covers. That ends his spell, a very decent one indeed"}, {"ball": 14.1, "isHighlight": false, "text": "Bhatia to Jadeja,1 run,offcutter which is worked away into the leg side. The two batsmen hesitated in the middle of the pitch and there was ample opportunity for the run out but Bhatia does not field it cleanly"}, {"ball": 14.2, "isHighlight": false, "text": "Bhatia to Manhas,1 run,fullish and just outside off, Manhas opens the face and picks up a single behind point"}, {"ball": 14.3, "isHighlight": false, "text": "Bhatia to Jadeja,no run,fuller legcutter this time and Jaddu is forward with a block"}, {"ball": 14.3, "isHighlight": false, "text": "Abhishek Jayswa: \"All good bowling will not matter if Chennai reaches 150. It would be a tough chase against Ashwin, Jadeja and company.\""}, {"ball": 14.4, "isHighlight": false, "text": "Bhatia to Jadeja,1 run,another leg cutter but it's a tad short and he pulls to deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Bhatia to Manhas, $$OUT$$ ,who needs pace when he can keep snapping batsmen up like that. Another leg cutter and I bet it was still well under 100ks. Manhas was looking to cut it into the gap behind point but the ball gained just a little more bounce and he steered it straight into the hands of the square fielder"}, {"ball": 14.5, "isHighlight": false, "text": "$$M$$ $$Manhas$$ $$c$$ $$Nayar$$ $$b$$ $$Bhatia$$ $$10$$ $$(18m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 14.5, "isHighlight": false, "text": "R Ashwin gets to set up what total he will defend later"}, {"ball": 14.6, "isHighlight": false, "text": "Bhatia to Ashwin,no run,full and outside off, he strides forward to block"}, {"ball": 14.6, "isHighlight": false, "text": "Prabhu: \"Badri, Oh Badri! Where are you?\" Watson did say he was getting about fit enough to bowl after some back issues. Here he is"}, {"ball": 15.1, "isHighlight": false, "text": "Watson to Jadeja,1 run,starts with a full toss on the pads. Offcutter gone wrong actually and Jaddu clips it to deep square leg"}, {"ball": 15.2, "isHighlight": false, "text": "Watson to Ashwin,1 run,legcutter which Ashwin tries to steer past the keeper. Doesn't go wide enough and seeing Ash just about out of his crease Samson has a shy at the stumps. Jaddu steals the single off the ricochet"}, {"ball": 15.3, "isHighlight": false, "text": "Watson to Jadeja,1 run"}, {"ball": 15.4, "isHighlight": false, "text": "Watson to Ashwin,no run,walks at him and he's spotted the movement early and fires it wide outside off, Ashwin wonders about the extra but it's not given"}, {"ball": 15.5, "isHighlight": false, "text": "Watson to Ashwin,1 run,skips down the track again and Watson fires it in at the pads. Clipped away through square leg"}, {"ball": 15.6, "isHighlight": false, "text": "Watson to Jadeja,1 run,full and wide outside off, Jaddu squeezes it to deep cover"}, {"ball": 15.6, "isHighlight": false, "text": "Abhijeet: \"What a buy Rajat Bhatia has been for RR. He has been one of the most consistent bowlers even when he was with KKR and they rued their chance of getting him back with a matching card\""}, {"ball": 15.6, "isHighlight": false, "text": "Kulkarni is back to bowl in the death"}, {"ball": 16.1, "isHighlight": false, "text": "Kulkarni to Jadeja,no run,slants a slower ball across him and Jaddu swings and misses"}, {"ball": 16.2, "isHighlight": false, "text": "Kulkarni to Jadeja,2 runs,shortish and a touch outside off, he stays back and pulls in front of deep square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Kulkarni to Jadeja,no run,fires in a wide yorker that is just inside the wide line. Jaddu's leave doesn't end up being profitable"}, {"ball": 16.4, "isHighlight": false, "text": "Kulkarni to Jadeja,1 wide,this time he strays on the wrong side of the tram lines. Jaddu judges the line of this wide yorker well and shoulders arms"}, {"ball": 16.4, "isHighlight": false, "text": "Kulkarni to Jadeja, $$FOUR$$ ,short ball and he pounces on it. Let one go earlier in the over but this time he puts a lot more muscle into the shot. And found the gap between long-on and midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Kulkarni to Jadeja,1 run,low full toss outside off, Jaddu slashes to deep point"}, {"ball": 16.5, "isHighlight": false, "text": "SriniDasari: \"So far this IPL has been a fight between Indian bowlers and foreign batsmen.\""}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Ashwin,1 wide,terrible line there. His search for the wide yorker goes wildly awry"}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Ashwin,1 wide,another one. Does he really need to be afraid of being belted by a batsman who's only four balls into his innings? And it's not like Ash is known for his big hits"}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Ashwin,1 wide,more exercise for the umpire as Kulkarni bowls the 10th wide of the innings. Ashwin had moved across and looked to dab it to third man but can't get it"}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Ashwin,no run,this time he's on target. Finds the block hole just a shade outside off and Ashwin who was looking to jam it down to third man, misses"}, {"ball": 16.6, "isHighlight": false, "text": "Southee has the ball in hand"}, {"ball": 17.1, "isHighlight": false, "text": "Southee to Jadeja,1 run,seeks the yorker but ends up a low full toss that's bunted off the bottom of the bat to long-on"}, {"ball": 17.2, "isHighlight": false, "text": "Southee to Ashwin,no run,goes wide of the crease and gets a fuller delivery to straighten outside off. Ashwin has a waft and misses"}, {"ball": 17.2, "isHighlight": false, "text": "Rohit: \"Its Simple!!! Kulkarni is trying wide Yorkers against Ashwin to see if it works before trying on a specialist batsmen....\""}, {"ball": 17.3, "isHighlight": false, "text": "Southee to Ashwin,no run,sets up for the lap sweep but it's a slower ball and Ashwin doesn't adjust to the pace. Southee was  $$way$$  wide on the bowler crease. He was almost cutting the line there"}, {"ball": 17.4, "isHighlight": false, "text": "Southee to Ashwin,no run,fullish and outside off, Ashwin looks to launch over cover but can't connect. He's two off eight now"}, {"ball": 17.5, "isHighlight": false, "text": "Southee to Ashwin,1 run,walks across and pulls this slower short ball to deep midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Southee to Jadeja,1 run,low full toss which had ample room to slash square on the off side. Jaddu connects well but he can't thread the gap between point and backward point"}, {"ball": 17.6, "isHighlight": false, "text": "James Faulkner, after going for 19 in his last over"}, {"ball": 18.1, "isHighlight": false, "text": "Faulkner to Jadeja,1 run,full and just outside off, Jaddu belts it down to long-off"}, {"ball": 18.2, "isHighlight": false, "text": "Faulkner to Ashwin, $$FOUR$$ ,outside edge and off it flies to the third man boundary. Full and sliding across the right-hander, Ashwin shuffles across and swings. Gets lucky"}, {"ball": 18.3, "isHighlight": false, "text": "Faulkner to Ashwin,2 leg byes,bowls it full and outside off, Ashwin has premeditated and walks across and looks to sweep fine. Too full for that. Jaddu races across for the single and would have been out had Southee hit the stumps at the bowlers'"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to Ashwin,1 run,fullish and outside off, Ashwin hoists it over the top. The connection is poor though and it doesn't reach the two men in the deep."}, {"ball": 18.5, "isHighlight": false, "text": "Faulkner to Jadeja,2 runs,full and wide and Jaddu gets under it and carves it through extra cover. Long-off is quick enough to keep it to a couple"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to Jadeja,1 run,gets the wide yorker bang on and Jaddu manages to retain strike with a single through point"}, {"ball": 18.6, "isHighlight": false, "text": "Southee with the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Southee to Jadeja,2 runs,full and sliding across him, Jaddu slices it and gets a thick outside edge to Watson at point. He lobs in a throw but the bowler fails to collect and gives an extra run"}, {"ball": 19.2, "isHighlight": false, "text": "Southee to Jadeja,no run,slower delivery outside off, Jaddu was shuffling towards it and then leaves it alone thinking it was wide. Very optimistic from him, terrific bowling from Southee"}, {"ball": 19.3, "isHighlight": false, "text": "Southee to Jadeja,1 run,fired into the blockhole outside off, Jaddu swipes it down to long-on"}, {"ball": 19.3, "isHighlight": false, "text": "chibi: \"Dhoni would be happy with 140 on this wicket.. he has an arsenal of slow bowlers to take pace off the ball right from the get go.. it could be a close contest\" It could well have been 150"}, {"ball": 19.4, "isHighlight": false, "text": "Southee to Ashwin,1 run,slower ball fools Ashwin again. Decides on a sweep soon enough for Southee to see his intentions and the inside edge onto pad only fetches a single"}, {"ball": 19.5, "isHighlight": false, "text": "Southee to Jadeja,2 runs,yorker just outside off, Jaddu digs it out to long-off and picks up a couple"}, {"ball": 19.6, "isHighlight": false, "text": "Southee to Jadeja,1 wide,this time he loses his line. Full and way too wide outside off"}, {"ball": 19.6, "isHighlight": false, "text": "Southee to Jadeja,2 runs,it's a low full toss outside off and Jadeja bunts it down to long-off for a couple that takes CSK to 140"}, {"ball": 19.6, "isHighlight": false, "text": "$$8.15$$ $$pm$$  It's taken  $$105$$ $$minutes$$  and Chennai Super Kings just couldn't cope with pace off the ball. They owe a lot to Dwayne Smith's belligerent 50 off 28, but no one down the order managed to get any momentum. Rajat Bhatia stifled the batsman with an assortment of slower deliveries to end up with 2 for 13. \"This pitch might be slower than me,\" he jokes. \"Have to bat sensible, track might change with rolling. I always see to it that the batsman use his own power and doesn't use my pace. So I bowl as slow as possible and sometimes just sneak a faster one in. Have to continue that in these kinds of tracks. I wont tell [how to bat against me].\""}], "name": "Rajasthan Royals v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729297.html?innings=1;view=commentary", "match_num": 10}