{"commentary": [{"ball": 0, "isHighlight": false, "text": "Hilfenhaus to start things off for Chennai. Can he get the ball to swing around?"}, {"ball": 0.1, "isHighlight": false, "text": "Hilfenhaus to Nayar,no run,starts with a back of length ball that cramps up Abhishek Nayar as he looks to work it to the leg side, struck on the thigh pad"}, {"ball": 0.2, "isHighlight": false, "text": "Hilfenhaus to Nayar,no run,pitched up, 136kph, defended towards cover off the front foot"}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to Nayar,1 wide,gets the ball to swerve but starts on the wrong side, down the leg side"}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to Nayar, $$FOUR$$ ,length ball is whipped away towards the square leg innings, again the line is on the legs, Nayar capitalises"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Nayar,1 run,short of length ball on off stump, pushed towards cover for a single"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to Rahane, $$FOUR$$ ,gets the ball to curl away outside off, a thick outside edge as Rahane pokes at it, past the slip for four, too fine for third man"}, {"ball": 0.6, "isHighlight": false, "text": "Hilfenhaus to Rahane,no run,beauty to end the over, unplayable from Hilfenhaus, pitching around off and jagging away, Rahane does well to not nick it"}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Nayar,no run,cuts him in half with a good length delivery that nips back in quite late. Nayar was on the front foot looking to force it through midwicket but can't hit it"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Nayar,no run,charges down the track but Pandey shortens the length and foils his hopes for acceleration"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Nayar, $$OUT$$ ,fullish and curling in again as Nayar swings across the line. There's a big leg before appeal and the batsman has absently wandered down the pitch. McCullum swoops down on the ball from short cover and races over to the keeper's end and flicks the bails off. Terrific presence of mind from the NZ captain"}, {"ball": 1.3, "isHighlight": false, "text": "$$AM$$ $$Nayar$$ $$run$$ $$out$$ $$5$$ $$(6m$$ $$7b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$71.42$$"}, {"ball": 1.3, "isHighlight": false, "text": "Sanju Samson is in at No.3"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Samson,no run,hint of seam away but it's nothing to trouble him as he rides it to point off the back foot"}, {"ball": 1.4, "isHighlight": false, "text": "Keeper comes up to the stumps now"}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Samson,no run,shortish and a shade outside off, Samson cuts to point"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Samson,no run,beaten this time as Pandey tempts him outside off with a short of a good length delivery."}, {"ball": 1.6, "isHighlight": false, "text": "Two slips in one, the second one a little wide"}, {"ball": 2.1, "isHighlight": false, "text": "Hilfenhaus to Rahane,no run,invites the batsman forward with an away swinger as Rahane nudges into the covers"}, {"ball": 2.2, "isHighlight": false, "text": "Hilfenhaus to Rahane,2 runs,fullish and outside off but Rahane is forward and rolls his wrists on top of the ball and drags it through midwicket"}, {"ball": 2.3, "isHighlight": false, "text": "Hilfenhaus to Rahane,no run,looks to steer this down to third man, dangerous tactic with those two slips. Only just avoids nicking behind. Lovely outswing from Hilfy"}, {"ball": 2.4, "isHighlight": false, "text": "Hilfenhaus to Rahane,no run,back of a length and on off stump, Rahane was looking to bring those wrists into play again but he is surprised by the bounce this gets. Mis-hits to mid-on"}, {"ball": 2.5, "isHighlight": false, "text": "Hilfenhaus to Rahane,1 run,shortish and outside off, clipped away in front of square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Hilfenhaus to Samson,no run,gets a thick inside edge to a shortish delivery that darts away off the deck. Into the back-foot punch a little too early"}, {"ball": 2.6, "isHighlight": false, "text": "rohan: \"Abhishek Nayar has no sense about running betwen the wickets. I am following him from hi Mumbai Indians days. His run out against RR in 2009 when he brought us very close to victory (18 needed from 18 balls); then the one in 2010 IPL final just when he started getting few shots away & was building important partnership with SRT etc etc.\""}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Rahane, $$FOUR$$ ,gorgeous stroke! There were two men square on the off side but Rahane has threaded it through them. Went back and across and timed the punch brilliantly"}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Rahane,3 runs,this one strays a little too close on middle and Rahane clips it off his hips to deep square leg. It's a tough chase down there but Hilfy's game enough to slide and keep it to three. Royals have got a little momentum here"}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to Samson,no run,fullish and outside off, Samson looks to slap it over the off side and is beaten. Dhoni does well, being up to the stumps"}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to Samson,no run,he needs to settle down here. Samson looks to hit on the up ever ball and the little bit of away moment is making him look all the more ugly. Excellent lengths from the seamer"}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to Samson,2 runs,misfield at point gets him off the mark. Tempts him with a fuller delivery outside off and Samson is forward with a drive. Jaddu has to dive to his right but doesn't make it"}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to Samson,1 run,back of a length outside off, Samson dabs it to the right of short third man for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Sunil Sharma: \"If a batsman scores runs in flat track, then they are sure to get berth in national cricket team. However, same cannot be true for bowler...However hard Pandey tries, there are miles to go before lady luck smiles on him. Wondering when is he going to get chance in national team.\""}, {"ball": 4.1, "isHighlight": false, "text": "Hilfenhaus to Samson,no run,strides forward and hits the fullish delivery on the up to point. Hilfy still getting it to nibble away"}, {"ball": 4.2, "isHighlight": false, "text": "Hilfenhaus to Samson,no run,back of a length and tucks him up on leg, Samson pushes to mid-on"}, {"ball": 4.3, "isHighlight": false, "text": "Hilfenhaus to Samson, $$SIX$$ ,looks for the change of pace and Samson picked it up early, backed away and pounded it over long-on. He may be a small lad but he hits it long"}, {"ball": 4.4, "isHighlight": false, "text": "Hilfenhaus to Samson,1 run,back of a length and outside off, Samson guides it to deep third man"}, {"ball": 4.5, "isHighlight": false, "text": "Hilfenhaus to Rahane,1 run,picked away off his knees as he goes for the length ball on middle. Single to square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Hilfenhaus to Samson, $$SIX$$ ,length again and Samson has sent it into orbit! That was like his captain - planting his front leg down the ground and slapping it through the line and into the stands behind long-on. Royals are on their way"}, {"ball": 4.6, "isHighlight": false, "text": "Ash into the attack early, around the wicket"}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Rahane,no run,flatter on leg stump, Rahane clips it square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Rahane, $$OUT$$ ,goes for the slog sweep and he's picked out the man in the deep! He had to drag a good length ball that went on with the arm, which hampers his timing and Manhas at deep square leg holds on easily"}, {"ball": 5.2, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$Manhas$$ $$b$$ $$Ashwin$$ $$15$$ $$(22m$$ $$12b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 5.2, "isHighlight": false, "text": "Karthick: \"Absolute Stunner from Sanju Samson. Never mind whose going to bowl,he plays calm. . Applause from Rahul Dravid and Paddy\" In walks Shane Watson at No. 4. Slip in place as he stays around the wicket"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Watson,no run,good length ball on off stump, Watson is far forward and blocks"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Watson,1 run,tossed up on leg stump and Watson nudges it through midwicket"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Samson,no run,flatter delivery on off stump, Samson stays back and blocks"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Samson,no run,walks way down leg to try and fool the bowler but Ashwin isn't lulled into it. Bowls flat on middle and leg and restricts it to a tap to point"}, {"ball": 5.6, "isHighlight": false, "text": "Jadeja into the attack"}, {"ball": 6.1, "isHighlight": false, "text": "Jadeja to Watson,no run,and produces a ripper straight away. Darts it in on off stump but when it hits the pitch it gains a ton of turn and beats the outside edge handsomely. Dhoni is quick to whip the bails off but Watson has grounded his back leg"}, {"ball": 6.2, "isHighlight": false, "text": "Jadeja to Watson,no run,pushed through on the pads, Watson has to bring his bat around his front pad and gets struck on it"}, {"ball": 6.3, "isHighlight": false, "text": "Jadeja to Watson, $$SIX$$ ,skips down the track and reaches the pitch and once that's done he smacks it straight down the ground. Clears long-on easily"}, {"ball": 6.4, "isHighlight": false, "text": "Jadeja to Watson, $$OUT$$ ,slowed it up this time and the extra flight dupes him. Watson doesn't hold back as he goes over the top again. This time it's the leading edge that gains more height than distance. Hilfy was at long-off and leaps up to hold down a pretty good catch. Think he was very worried about the rope, but it was well behind him"}, {"ball": 6.4, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$Hilfenhaus$$ $$b$$ $$Jadeja$$ $$7$$ $$(4m$$ $$6b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 6.5, "isHighlight": false, "text": "Jadeja to Samson, $$OUT$$ ,that's two in two! Jadeja gets reward for floating it up in the air. Samson is forward and looks to clip through midwicket, closes the face too early and gets a leading edge that is pouched by the bowler himself. Punches the air and screams in triumph"}, {"ball": 6.5, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$&$$ $$b$$ $$Jadeja$$ $$16$$ $$(22m$$ $$16b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 6.5, "isHighlight": false, "text": "Tow batsmen who are yet to face a ball out in the middle. Smith in at No.6"}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja to Smith,no run,skips down the track and yorks himself as Jaddu darts in a fuller delivery on leg stump. Digs it out"}, {"ball": 6.6, "isHighlight": false, "text": "Suresh Raina into the attack"}, {"ball": 7.1, "isHighlight": false, "text": "Raina to Binny,no run,flighted on off stump, Binny is forward and clips his first ball to midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Raina to Binny,no run,short deliver on off stump, Binny can only push it back to the bowler"}, {"ball": 7.3, "isHighlight": false, "text": "Raina to Binny,1 run,shortish and outside off, he goes deep in his crease and cuts through the covers"}, {"ball": 7.3, "isHighlight": false, "text": "rssampat: \"7 req per over from there and plenty batsmen waiting with 2 big proven power hitters in Binny & Faulkner at the end. All that Rahane & Watson needed to do was knock the ball around, take 5-6 singles per over and knock the occasional bad ball to the fence to keep level with the run rate, basically play sensible cricket, but what do we have?? They try to be heroes and bat as if they want to finish this in 11-12 over's and end up at 44-4 from 37/1.\""}, {"ball": 7.4, "isHighlight": false, "text": "Raina to Smith,1 run,advances down the pitch and clips the shortish ball through square leg"}, {"ball": 7.5, "isHighlight": false, "text": "Raina to Binny,no run,he doesn't want to flight the ball at all. Binny gets down the track and punches to mid-on"}, {"ball": 7.6, "isHighlight": false, "text": "Raina to Binny,1 run,shortish and outside off, Binny stays back and cuts to the sweeper"}, {"ball": 7.6, "isHighlight": false, "text": "Narbavi: \"That should give SRJ a lot of confidence. He hasn't been bowling well ever since his exploits in the Asia cup!!\" Mohit Sharma is the new bowler"}, {"ball": 8.1, "isHighlight": false, "text": "Sharma to Binny,1 run,Back of a length and outside off, he goes back and punches it to the sweeper"}, {"ball": 8.2, "isHighlight": false, "text": "Sharma to Smith,2 runs,short ball outside off, Smith has to reach for it and gets it off the bottom of the bat and can't beat the sweeper"}, {"ball": 8.3, "isHighlight": false, "text": "Sharma to Smith,no run,this stays low and it squirts in at him as well. Smith manages to present a straight bat to stop it crashing into his stumps"}, {"ball": 8.4, "isHighlight": false, "text": "Sharma to Smith,no run"}, {"ball": 8.5, "isHighlight": false, "text": "Sharma to Smith,2 runs,slower ball outside off and Smith saw fine leg inside the circle and pulls it past his despairing dive. That's a wonderfully collected couple"}, {"ball": 8.6, "isHighlight": false, "text": "Sharma to Smith,1 run,full on off stump, he pushes it down to long-off to keep strike. Which he will take after the time out"}, {"ball": 8.6, "isHighlight": false, "text": "Moiz: \"Let me get this straight Ashwin and Jadeja pick up 3 wickets in 2 overs, two new batsman at the crease and Dhoni brings Raina into the attack!!!! Just shows how defensive captain Dhoni has become off late\" He throws it to Raina a lot in the IPL and he delivers too. I'm more concerned with him pulling Jaddu out of the attack or Mohit. Pace on the ball hasn't worked today"}, {"ball": 8.6, "isHighlight": false, "text": "Two very similar players out in the middle for Royals. Smith and Binny like to build their innings with a few singles and then set up for the big ones. This chase is still well on"}, {"ball": 9.1, "isHighlight": false, "text": "Raina to Smith,1 run,flighted on middle, Smith clips it away to deep square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Raina to Binny,1 run,holds it back and Binny works it away through the leg side"}, {"ball": 9.3, "isHighlight": false, "text": "Raina to Smith,no run,Dhoni has fluffed a stumping! You don't see that too often. He juggled it about three times with Smith still halfway down the pitch. But he just could not get it in the gloves. The ball turned through his flick, Raina beat him in the flight, and would have had him stranded"}, {"ball": 9.4, "isHighlight": false, "text": "Raina to Smith,no run,fired in on a good length on the pads, turned away through square leg"}, {"ball": 9.5, "isHighlight": false, "text": "Raina to Smith,1 run,keeps it on the pads and Smith tucks it away off square on the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Raina to Binny,no run,tossed up on leg stump, defended"}, {"ball": 10.1, "isHighlight": false, "text": "Sharma to Smith,2 runs,back of a length and outside off, Smith drags it away to deep midwicket with a pull. Didn't get it off the middle though"}, {"ball": 10.2, "isHighlight": false, "text": "Sharma to Smith,1 run,back of a length and outside off, punched through to the sweeper"}, {"ball": 10.3, "isHighlight": false, "text": "Sharma to Binny,2 runs,shortish and outside off, but it came a little slower off the deck. Binny was swinging off his feet and gets a thick bottom edge to deep third man"}, {"ball": 10.4, "isHighlight": false, "text": "Sharma to Binny,2 runs,length ball outside off, Binny heaves over the top. It's a mis-hit and long-off is too far away"}, {"ball": 10.5, "isHighlight": false, "text": "Sharma to Binny, $$OUT$$ ,right down Faf's throat at long-off. Binny chooses a very bad shot there as he looks to smite it down the ground. Gets it off the bottom of the bat, which turns in his hands, and Faf controls a simple catch"}, {"ball": 10.5, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Sharma$$ $$8$$ $$(19m$$ $$11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$72.72$$"}, {"ball": 10.5, "isHighlight": false, "text": "Manu Ajmani: \"Moiz: Defensive? Have you seen Raina's and Mohit's figures? Do you even see that Binny and Smith are going to build their innings as they cannot risk to lose more wickets and thus will play cautiously against jadeja and ashwin too? Do you understand Dhoni's tactics of rather getting the part timers out now and go for less runs so the run rate can creep and then bring his best bowlers? Someone rightly said while Chennai was batting, Dhoni has to be criticized one way or the other without a reason.\""}, {"ball": 10.6, "isHighlight": false, "text": "Sharma to Smith,no run,back of a length on off stump, pushed to midwicket"}, {"ball": 11.1, "isHighlight": false, "text": "Pandey to Bhatia,1 run,probes the channel outside off and is steered down to deep third man"}, {"ball": 11.2, "isHighlight": false, "text": "Pandey to Smith,1 run,bit of movement away from the bat and squared him up. Smith someone manages to keep it down and pick up a single to deep third man"}, {"ball": 11.3, "isHighlight": false, "text": "Pandey to Bhatia,no run,rips a back of a length delivery away from him. Bhatia had no chance with that."}, {"ball": 11.3, "isHighlight": false, "text": "There's a slip in now"}, {"ball": 11.4, "isHighlight": false, "text": "Pandey to Bhatia,no run,back of a length and outside off, Bhatia looks to dab it down to third man and misses"}, {"ball": 11.5, "isHighlight": false, "text": "Pandey to Bhatia,1 run,fullish on off stump, Bhatia nudges into the off side and sets off. Manhas is the man there and he sends in a throw that clatters the stumps at the bowler' but Bhatia was home"}, {"ball": 11.6, "isHighlight": false, "text": "Pandey to Smith,no run,shortish and curling away, Smith was stuck in his crease as he looked to smack it through the off side. Bottom-edges it to the covers"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja's back"}, {"ball": 12.1, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,tossed up on off stump, Bhatia drills it through the covers"}, {"ball": 12.2, "isHighlight": false, "text": "Jadeja to Smith,2 runs,he skips down the track and thumps the flighted delivery down the ground. Mohit is at long-off, rushes to his right and dives. Gets both hands to it but it pops out. Dhoni asks him to move straighter"}, {"ball": 12.3, "isHighlight": false, "text": "Jadeja to Smith, $$FOUR$$ ,and Smith plays with the field by getting down the track, taking the ball on the full and creaming it through extra cover"}, {"ball": 12.4, "isHighlight": false, "text": "Jadeja to Smith,1 run,nicely tossed up on middle and he waits for it to turn before defending with an angled bat"}, {"ball": 12.5, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,fires in the arm ball on middle, Bhatia hurries into a defensive"}, {"ball": 12.6, "isHighlight": false, "text": "Jadeja to Smith, $$OUT$$ ,Faf has been put at long-off and it goes straight to him! Jaddu pulled his length back a little but Smith still went after it. But he picked out the fielder. Punches his bat in disgust"}, {"ball": 12.6, "isHighlight": false, "text": "$$SPD$$ $$Smith$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Jadeja$$ $$19$$ $$(27m$$ $$20b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$95.00$$"}, {"ball": 12.6, "isHighlight": false, "text": "James Faulkner is Royals' last hope"}, {"ball": 12.6, "isHighlight": false, "text": "Guru: \"it could have been a simple chase by Royals but they made a mess there! They could have just scored 6 in an over without an aggressive hitting and in the last few oven with more wickets could have won easily! Instead they tried to hit in the beginning and lost wickets!!! Poor captancy!!\""}, {"ball": 13.1, "isHighlight": false, "text": "Pandey to Bhatia,1 run,fullish on off stump, Bhatia whips it around to long-on"}, {"ball": 13.2, "isHighlight": false, "text": "Pandey to Faulkner, $$FOUR$$ ,sliding down leg and Faulkner has glanced it quite fine. Mohit runs across but mistimes the slide. The ball sneaks in through his legs and into the boundary"}, {"ball": 13.3, "isHighlight": false, "text": "Pandey to Faulkner, $$OUT$$ ,he's nicked off! There wasn't much of an appeal from the keeper but Ishwar knew it straight away. Fullish delivery nibbling away outside off, Faulkner chases after it and gets a pretty thick edge. That's the strategic time out as well"}, {"ball": 13.3, "isHighlight": false, "text": "$$JP$$ $$Faulkner$$ $$c$$ $$†Dhoni$$ $$b$$ $$Pandey$$ $$4$$ $$(2m$$ $$2b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 13.3, "isHighlight": false, "text": "Rakesh Jain: \"Just have a feeling that Faulkner will pull this back for RR -- uh oh.. Got to take back my words !!\""}, {"ball": 13.4, "isHighlight": false, "text": "Pandey to Southee,no run,back of a length on off stump, Southee defends off the back foot"}, {"ball": 13.5, "isHighlight": false, "text": "Pandey to Southee, $$FOUR$$ ,short ball and Southee's carted it away behind square. Pulled that with considerable disdain"}, {"ball": 13.6, "isHighlight": false, "text": "Pandey to Southee,no run, $$dropped$$  and it's Faf there at slip! Southee gently steered the back of a length ball to the fielder's right. He had to dive and Faf usually gobbles those but this bests him. Ahsiwn has a hand around his shoulder in comfort"}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,flighted on off stump, he skips down the track and drills it through the covers"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to Southee, $$OUT$$ ,off stump is pegged back and Jaddu is on a roll! It was flat, it skidded off the deck and it sneaked below Southee's intended cut"}, {"ball": 14.2, "isHighlight": false, "text": "$$TG$$ $$Southee$$ $$b$$ $$Jadeja$$ $$4$$ $$(2m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 14.2, "isHighlight": false, "text": "Vasanth: \"Its the 130s and 150s becoming tough TARGETs. if you score near 200s, there is only one option. But the 130s need some cricketing mind which is lacking in todays chases. \""}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to Kulkarni,1 run,flighted on off stump, eased down the ground for a single by Dhawal Kulkarni the new batsman"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,pushed in on middle and leg and Bhatia was playing around his front pad. Could've been a close leg before if he hadn't hit that through square leg"}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Kulkarni,no run,flighted on off stump, defended down the pitch"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Kulkarni,no run,gives this a lot of air and sees the ball turn appreciably outside off. The batsman doesn't want anything to do with it though"}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin around the wicket"}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Bhatia,1 wide,tossed up outside leg stump, Bhatia goes for the sweep but can't connect"}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Bhatia,1 run,swept away to long leg as this is on a length and on the pads"}, {"ball": 15.2, "isHighlight": false, "text": "Ashwin to Kulkarni,no run,flighted on off stump, defended feebly into the covers"}, {"ball": 15.3, "isHighlight": false, "text": "Ashwin to Kulkarni,1 run,goes for the slog as he sees it tossed up on off stump. Mistimes it to deep square leg"}, {"ball": 15.3, "isHighlight": false, "text": "Over the wicket"}, {"ball": 15.4, "isHighlight": false, "text": "Ashwin to Bhatia,no run,skips down the track, but Ashwin is wise to it as he pulls the length back. Can only defend down the pitch"}, {"ball": 15.5, "isHighlight": false, "text": "Ashwin to Bhatia,1 run,flighted outside off, swept away behind square leg"}, {"ball": 15.6, "isHighlight": false, "text": "Ashwin to Kulkarni,1 run,carrom ball, grips and turns as much as a leg spinner. Batsman hadn't a clue as he reads it off the pitch and dabs into the off side"}, {"ball": 16.1, "isHighlight": false, "text": "Jadeja to Kulkarni,2 runs,flighted and angled in on leg stump, gets a thick outside edge that scurries away down to third man"}, {"ball": 16.2, "isHighlight": false, "text": "Jadeja to Kulkarni,1 run,flighted on off stump, he opens the face and drives through to long-off"}, {"ball": 16.3, "isHighlight": false, "text": "Jadeja to Bhatia, $$SIX$$ ,that's smashed out of here! Comes down the track to launch the flatter ball into the sight screen"}, {"ball": 16.4, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,tossed up on the pads, Bhatia turns it through to deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Jadeja to Kulkarni,1 run,darted in on off stump, Kulkarni pushes it down to long-on"}, {"ball": 16.6, "isHighlight": false, "text": "Jadeja to Bhatia, $$FOUR$$ ,rank long hop and Bhatia has pulled it with the greatest authority"}, {"ball": 17.1, "isHighlight": false, "text": "Ashwin to Kulkarni,no run,flighted on off stump, he shuffles back and across and blocks"}, {"ball": 17.2, "isHighlight": false, "text": "Ashwin to Kulkarni,1 run,carrom ball on leg stump, picked away to long leg"}, {"ball": 17.3, "isHighlight": false, "text": "Ashwin to Bhatia,1 run,tossed up and it was the one that spins the other way. Bhatia comes forward and clips it down to long-on"}, {"ball": 17.4, "isHighlight": false, "text": "Ashwin to Kulkarni,1 run,swings across the line and gets an inside edge to the flighted delivery on middle. Deep square leg tidies up"}, {"ball": 17.5, "isHighlight": false, "text": "Ashwin to Bhatia,no run,he was coming down the track but Ashwin shortens his length and forces the batsman to punch to midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Ashwin to Bhatia,2 runs,shortish and outside off, Bhatia rocks back and pulls between long-on and deep midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "\"This match is far from over.......Rajat bhatia can definitely bat.......he has a first class average of about 50.......it's going to be a nail-biter if he gets some out of the park. \" says a very optimistic Ozee"}, {"ball": 18.1, "isHighlight": false, "text": "Hilfenhaus to Kulkarni,1 run,back of a length and outside off, he heaves it around to deep square leg"}, {"ball": 18.2, "isHighlight": false, "text": "Hilfenhaus to Bhatia,no run,goes for a wild swipe as he sees some room outside off. It was back of a length and it was too quick for him"}, {"ball": 18.3, "isHighlight": false, "text": "Hilfenhaus to Bhatia, $$OUT$$ ,shortish again and Bhatia goes for a pull. Only succeeds in getting a top edge that soars into the night sky before settling in the hands of Ashwin in the covers"}, {"ball": 18.3, "isHighlight": false, "text": "$$R$$ $$Bhatia$$ $$c$$ $$Ashwin$$ $$b$$ $$Hilfenhaus$$ $$23$$ $$(32m$$ $$20b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$115.00$$"}, {"ball": 18.3, "isHighlight": false, "text": "Pravin Tambe is the last man in"}, {"ball": 18.4, "isHighlight": false, "text": "Hilfenhaus to Kulkarni,1 run,back of a length on middle and he wasn't too keen to stay in line. Backs away and blocks"}, {"ball": 18.5, "isHighlight": false, "text": "Hilfenhaus to Tambe,1 run,shortish and outside off, he dabs it away to deep third man"}, {"ball": 18.5, "isHighlight": false, "text": "Kamal: \"Thanks Ozee. You just hit the final nail on the coffin!!!\""}, {"ball": 18.6, "isHighlight": false, "text": "Hilfenhaus to Kulkarni,2 runs,makes room outside leg to loft this shortish ball angled into him over the head of point."}, {"ball": 18.6, "isHighlight": false, "text": "25 to win off the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Ashwin to Tambe,1 run,premeditated a lap sweep as Ashwin delivers the carrom ball. Gets a single to long leg"}, {"ball": 19.2, "isHighlight": false, "text": "Ashwin to Kulkarni, $$SIX$$ ,that's what they want. Got under it nicely and though he had to hit against the turn it was in the slot to cart over to the midwicket boundary and that's exactly what he does"}, {"ball": 19.3, "isHighlight": false, "text": "Ashwin to Kulkarni,2 runs,this was tossed up way outside off and Kulkarni has thrown his bat for a couple. That was a wide for the taking"}, {"ball": 19.4, "isHighlight": false, "text": "Ashwin to Kulkarni, $$SIX$$ ,carrom ball on leg stump and Kulkarni has pummeled this over square leg. Dhoni is in deep conversation with his bowler. That was such a powerful strike. Not to mention a pretty poor ball from Ashwin. Length in the last over"}, {"ball": 19.5, "isHighlight": false, "text": "Ashwin to Kulkarni,1 run,  $$OUT$$ ,low full toss outside off, Kulkarni has thumped it down to long-on.Kulkarni has racing to retain strike,  Tambe has to go for the two but he just camped at the strikers and said no. Kulkarni was the only man who could have got those runs, no matter how much Tambe explains after being out by yards"}, {"ball": 19.5, "isHighlight": false, "text": "$$PV$$ $$Tambe$$ $$run$$ $$out$$ $$2$$ $$(5m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "That's all we have for you from this game. We hope you join us for tomorrow's bout between Kolkata Knight Riders and Royal Challengers Bangalore, same time. Until then this is Alagappan Muthu, slipping off into the night"}, {"ball": 19.5, "isHighlight": false, "text": "$$Ravindra$$ $$Jadeja$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Bowling [was the more enjoyable], when I went out to bat the situation was tight. So I had to play till the last ball and luckily I did. Wicket was pretty slow and the ball was turning so I was bowling on the right areas and we knew 140 was a defendable total\""}, {"ball": 19.5, "isHighlight": false, "text": "\"The last few overs were quite pleasing. Apart from that it was a very good game. the wicket got a little slower in the second innings which made it hard for them. Ishwar bowled the perfect length on this wicket and was well supported,\" says  $$MS$$ $$Dhoni$$ , \"When Smith was batting he was batting on a different wicket. You must have seen the batsmen hitting the top half of the bat rather than the middle. The bounce made it tough. It's looking good, but at the same time Bravo has been a terrific allrounder for us. Overall the batsman have put on a good score and the bowlers have backed it up. Still with Bravo around it gives us a further option to strengthen the side. I have to thank them [crowd] for their support, they have to come through the traffic and the heat and stay here and watch\""}, {"ball": 19.5, "isHighlight": false, "text": "\"Very disappointing,\" says  $$Shane$$ $$Watson$$ , \"One decent partnership was needed and we weren't able to get that. It was a very good bowling effort against their high quality batting as well. It doesn't often happen that someone goes crazy like Smith did, especially after an early wicket. We're trying to execute wide yorkers, but getting a few wides there is okay. It's a learning curve for us, we have to be better next time to chase down something like that. Myself as captain and at No.4, I shouldn't have got out like that. [On him opening the batting] It's something we were talking about and what might fit the team's needs best\""}, {"ball": 19.5, "isHighlight": false, "text": "Karandeep Nagpa: \"Dear Ashwin, You almost made me recall what Afridi did to you some months back! Phew!\""}, {"ball": 19.5, "isHighlight": false, "text": "Suresh: \"It was a bad gamble by Dhoni in final over. He should have given the final over to Mohit or D Smith. Lucky to win this.. Captain is loosing his cool a lot nowadays...\""}, {"ball": 19.5, "isHighlight": false, "text": "$$10.00$$ $$pm$$  With the pitch enabling the slower bowlers, Dhoni and the Super Kings were always in it. Royals assisted with a fair few mistakes. No batsman looked to stay at the crease and guide the innings towards the death where they could have exploded. Jadeja got into the act once he realised that the slower he bowled the more turn he got"}], "name": "Rajasthan Royals v Chennai Super Kings", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729297.html?innings=2;view=commentary", "match_num": 10}