{"commentary": [{"ball": 0, "isHighlight": false, "text": "Here we go then... Gautam Gambhir is at the non-striker's end.. looking at the mirror-finish pitch..That is one hell of a reflective surface.. shinier then the gold helmets these teams bring in. Kallis on strike against Mitchell Starc. one slip in place"}, {"ball": 0, "isHighlight": false, "text": "$$6.20$$ $$pm$$  While a lot of attention revolves around the big stars, Parthiv Patel at RCB and Pandey - Uthappa combine at KKR have all started well in their new franchises. That's always a good sign for a franchise when they are not overtly dependent only on their foreign recruits."}, {"ball": 0, "isHighlight": false, "text": "Vivek Rahul: \"What is with this IPL? Majority of the players don't play for their own state. If you look at yesterday's and today's playing teams, it is only Ashwin who played for his own state!!\""}, {"ball": 0, "isHighlight": false, "text": "$$6.00$$ $$pm$$   $$RCB$$ $$win$$ $$toss$$ $$and$$ $$will$$ $$bowl$$ . They have made two changes to their squad - Murali comes in for Maddinson and Takawale comes in for Rana. Gambhir brings in Umesh for Chawla and Chris Lynn for Shakib Al Hasan."}, {"ball": 0, "isHighlight": false, "text": "The pitch 'brings back the memories' for Virat Kohli as he sees the sheen on the Sharjah surface. Gautam Gambhir agrees with Kohli and hopes to get some runs."}, {"ball": 0, "isHighlight": false, "text": "Makran: \"there you go... 5 genuine bowlers for RCB today.... what is it with these teams nowadays. Umesh vs Aaaron should be fun pace battle. One trying to outdo the other... moreso since they are on opposite sides today. i am confused about who the fastest in India is, Lets see if we get that answer tonight.\""}, {"ball": 0, "isHighlight": false, "text": "James: \"Makran, I'll give you a clue. The fastest bowler in India won't be Vinay Kumar!\""}, {"ball": 0, "isHighlight": false, "text": "Karthik: \"Clearly the captains/thinktanks are on different pages as to how the pitch will behave. One team gets an extra spinner inplace of a batsman and the other drops two spinners to get a batsman and a quick!\""}, {"ball": 0, "isHighlight": false, "text": "$$5.45$$ $$pm$$  Is he going to play today? The suspense if Chris Gayle will be seen or not in Sharjah tonight will soon be cleared. His inclusion will certainly make this Royal Challengers line-up intimidating. However, KKR can take solace in the fact that RCB have always had such explosive batsmen and still haven't managed to win the title, whereas, they have. Anyway, welcome to our coverage. Here is the  $$preview$$ . Some word is filtering in that Gayle may still be unfit for this match. That's the kind of news that would buoy most KKR supporters."}, {"ball": 0, "isHighlight": false, "text": "\"This match is like RCB Vs RCB A team. Most of the players in KKR like Vinay , Uthappa , Kallis are ex RCB,\" that's one way of beating an opposition Barry.. buy it out."}, {"ball": 0, "isHighlight": false, "text": "Viral Bhatt: \"We've already got loads of buzz about Gayle playing or not, well, I just hope that we (pure cricketing fans) gets to see a competitive cricket. Hope, Viral & Gauti would have buried their spat of IPL 6 (2013), which was absolutely not required at that time, and will demonstrate their aggression while batting and help their team win the match.\""}, {"ball": 0, "isHighlight": false, "text": "It's the last 4 balls of the first Powerplay at  $$ESPNcricinfo's$$ $$CricIQ$$ . Four days left (that's 12 attempts) to book your spot in the first set of video rounds. Pad up, play your shots, use your lifelines well and go for broke... And if you miss out, come back next week to take guard again. Much like Test cricket,  $$CricIQ$$  gives you multiple shots at redemption."}, {"ball": 0, "isHighlight": false, "text": "Word is that Chris Gayle had a bat at the RCB nets yesterday. Have you brought him into your  $$Cricinfo$$ $$Fantasy$$  XI yet?"}, {"ball": 0, "isHighlight": false, "text": "Gayle or Kohli? Narine or de Villiers? Which player is generating the most buzz on Twitter?  $$Find$$ $$out$$ $$here.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Kallis,no run,gets one to swing in first up.. Kallis defends it solidly down the pitch"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Kallis,1 run,he is surprised a touch with the pace on this short of length delivery, hurries him into his defensive shot. He takes a single as the ball drops close to the stumps"}, {"ball": 0.2, "isHighlight": false, "text": "Here's Gambhir.. the third duck chasing him.. can he shoo it away.. ? Two slips"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Gambhir, $$OUT$$ ,no he can't! Gambhir is gone first ball. That is some record to have.. Three ducks in a row for Gambhir. This is full, fast and hitting middle and leg stump. Gambhir is too slow to bring his bat down and is caught plumb in front. He falls over as he tries to flick it"}, {"ball": 0.3, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$lbw$$ $$b$$ $$Starc$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 0.3, "isHighlight": false, "text": "Manish Pandey is here."}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Pandey,1 run,short of length outside off, the batsman glides it down to third man"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Kallis,2 runs,fuller delivery on the stumps, Kallis wanted to push it down straight but the bat rotates in his hands and he ends up pushing it past midwicket"}, {"ball": 0.5, "isHighlight": false, "text": "Lokesh Kaza: \"This IPL is probably Gambhir's only shot at getting back into form and stake a spot back in the national side. With the current spate of ducks he's having, that looks far, far away.\""}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Kallis,2 runs,this is stylishly clipped over square leg.. The ball is a touch short and even though he is still hurried by the pace, he leans back and manages to get a couple to Murali at deep backward square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Albie Morkel comes in now"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Pandey, $$FOUR$$ ,short and wide, Pandey is a decent batsman and he is not going to miss out on these ones.. he arches back and punches it over point for a boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Pandey, $$OUT$$ ,leading edge to cover point now! It's RCB's bowlers who are making all the positive moves. This is so much better than the first delivery - fuller on off, with some shape on it. Pandey looks to play a loose push towards mid-on but closes the face too early.. Kohli takes a simple catch"}, {"ball": 1.2, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$c$$ $$Kohli$$ $$b$$ $$Morkel$$ $$5$$ $$(4m$$ $$3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$166.66$$"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Lynn,1 run,he gets off the mark with a firm push to the right of mid-off fielder"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Kallis, $$FOUR$$ ,that was not too far from the mid-on fielder! Kallis punches this through the line and in the air and although it looks to be a good shot in the end, a little to the right and that would have gone straight to mid-on"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Kallis,1 run,back of length delivery on off, he defends it to backward point"}, {"ball": 1.5, "isHighlight": false, "text": "Jignesh: \"First match Gambhir took 8 balls and out on zero. Second match 4 balls and out on 0. Third match 1st ball out on zero. now how can he improve? may be by dropping himself in the next match.\""}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Lynn,1 run,Murali is on the edge of the circle at mid-off and Lynn spots an opportunity for a single with a push to him"}, {"ball": 1.6, "isHighlight": false, "text": "sathish2888: \"Antonyms of Maxwell : Gambhir\""}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Lynn,1 run,he is bowling quick here.. this one flies off the outside edge very quickly down to third man"}, {"ball": 2.1, "isHighlight": false, "text": "Lots of movement behind the sight-screen.. the bowler is stopped in his run up twice"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Kallis,no run,on the pads and Kallis flicks it straight to square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Kallis,no run,it's a length delivery outside off but Kallis pushes it to cover off the back foot"}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Kallis,no run,short of length delivery outside off, the batsman defends it to backward point"}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Kallis,no run,he still can't find the gap.. It's a full delivery and the batsman tries to push it through cover without moving forward, hits it straight to fielder"}, {"ball": 2.5, "isHighlight": false, "text": "Sid Losalka: \"Newton's 3rd law: \"For every Maxwell, there's an equal and opposite Gambhir!\"\""}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Kallis, $$FOUR$$ ,what a shot that was! There is absolutely no room on this short of length delivery, but Kallis arches back and not only manages to create room, but also times it perfectly behind point to pick up a boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Now Varun Aaron comes in"}, {"ball": 3.1, "isHighlight": false, "text": "Aaron to Lynn,1 run,he picks up his third run to mid-off with another firm push.. This was straight to Murali, but he threw it towards the stumps like a five year old.. no force behind it"}, {"ball": 3.2, "isHighlight": false, "text": "Aaron to Kallis,no run,extra bounce beats Kallis as he tries to cut the short of length delivery"}, {"ball": 3.3, "isHighlight": false, "text": "Aaron to Kallis,no run,goes full and fires it on the stumps, the batsman comes forward and pushes it to mid-on"}, {"ball": 3.4, "isHighlight": false, "text": "Aaron to Kallis,1 run,short and quick outside off, the batsman looks to pull and is hurried by the pace, but manages to clear the midwicket fielder"}, {"ball": 3.5, "isHighlight": false, "text": "Aaron to Lynn, $$FOUR$$ ,now there is some power on this shot! He moves a little to the leg side and drives it all along the ground, between the bowler and Murali at mid-off"}, {"ball": 3.6, "isHighlight": false, "text": "Aaron to Lynn,no run,moves leg side again and looks to hoick it over mid-on, but this is not full enough and beats the inside edge"}, {"ball": 3.6, "isHighlight": false, "text": "Albie comes from the other end"}, {"ball": 4.1, "isHighlight": false, "text": "Morkel to Kallis,1 run,fuller and wider outside off, the batsman slices it behind point to pick up a single to third man"}, {"ball": 4.2, "isHighlight": false, "text": "Morkel to Lynn,no run,good delivery from Ablie now.. A yorker outside off, the batsman is beaten as he tries to chop it to the off side"}, {"ball": 4.3, "isHighlight": false, "text": "Morkel to Lynn,no run,another dot ball as the bowler hurls it wide outside off, but just inside the marker.. Lynn fails to get a bat on it"}, {"ball": 4.4, "isHighlight": false, "text": "Morkel to Lynn, $$FOUR$$ ,what has the cover fielder done there! Dinda it is. The batsman drives it beautifully, but this just spins away from the fielder.. Can't blame him for that."}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Lynn, $$FOUR$$ ,No chance for Dinda this time as this half-volley is thumped between extra cover and Dinda this time"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Lynn,1 wide,he tries to go wide outside off again but goes too wide"}, {"ball": 4.6, "isHighlight": false, "text": "\"Thats right. Maxwell = Gambhir * Acceleration\", Qursheed, that's wrong unfortunately.. What's the use of acceleration when you are multiplying with a duck.."}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Lynn,no run,more bad bounce at cover now.. The batsman punches it on the up and it hits Kohli's jaw as he was bending down to stop that.. He is bleeding and he is going off now...That edge of the square seems to be the culprit.. The first one cost 4 runs.. the second has cost them RCB their captain"}, {"ball": 5.1, "isHighlight": false, "text": "Aaron to Kallis,no run,fuller delivery on the stumps, he defends it back down the pitch"}, {"ball": 5.1, "isHighlight": false, "text": "Fajji: \"Qursheed's formula is just as good as Gambhir's batting\""}, {"ball": 5.2, "isHighlight": false, "text": "Aaron to Kallis,1 run,he chops down the length delivery down to third man to bring Lynn to strike"}, {"ball": 5.3, "isHighlight": false, "text": "Aaron to Lynn,no run,Lynn seems to have a liking for two things - Murali and Murali at mid-off. He punches this length delivery to the same fielder at the same position again"}, {"ball": 5.4, "isHighlight": false, "text": "Aaron to Lynn,1 run,it's a yorker outside off, Lynn, who was making room, stretches and blocks it out towards cover for a change and picks up a single"}, {"ball": 5.5, "isHighlight": false, "text": "Aaron to Kallis,no run,this is short and wide outside off, but it shot up quite high.. The batsman chases it but it keeps going over the bat"}, {"ball": 5.6, "isHighlight": false, "text": "Aaron to Kallis,2 runs,he comes down the pitch and punches it over cover.. But again, it's not hit too far..Just evades AB running backwards.. Maybe Steven Smith would have taken that.."}, {"ball": 5.6, "isHighlight": false, "text": "Kiran: \"Maxwell + Gambhir = Star performer Maxwell - Gambhir = Star performer This happens only if Gambhir is zero. Hence proved :-) \""}, {"ball": 5.6, "isHighlight": false, "text": "Kohli is back .. back on the field I meant.. He is still holding a towel on his face though..meanwhile, here is  $$Murali$$ ...One slip in place"}, {"ball": 6.1, "isHighlight": false, "text": "Muralitharan to Lynn, $$SIX$$ ,Lynn was waiting for Murali too as he goes down on his knee and launches it over midwicket.. this is high and long and hits the giant TV screen which is showing a picture of .. Murali.."}, {"ball": 6.1, "isHighlight": false, "text": "The ball has taken some beating.. it is being changed.. Murali goes over the wicket"}, {"ball": 6.2, "isHighlight": false, "text": "Muralitharan to Lynn,1 run,tossed up on the stumps, the batsman dabs it to midwicket for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Muralitharan to Kallis,1 run,super stuff from AB at cover, but he can't prevent the single.. The batsman was struggling though"}, {"ball": 6.4, "isHighlight": false, "text": "Muralitharan to Lynn,no run,flatter delivery, defended back down the pitch"}, {"ball": 6.5, "isHighlight": false, "text": "Muralitharan to Lynn, $$SIX$$ ,tossed up again and Lynn goes down on his knee again, this is whacked high and handsome over deep square leg for another biggie"}, {"ball": 6.6, "isHighlight": false, "text": "Muralitharan to Lynn,1 run,he waits on the back foot and punches this through cover for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Not a great welcome for Murali there.. now it's Chahal.. who has not been hit for a single boundary"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Lynn,1 run,flatter delivery on the leg stump line, the batsman pushes it to long on for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Kallis,1 run,he allows the ball to turn away, then pushes it to deep cover for a single"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Lynn, $$SIX$$ ,oh this is painful for the bowler! Lynn goes back and whacks the flatter delivery to deep midwicket, where Starc lines himself up, but as he completes the catch, he touches the ropes.. He has not only given the batsman a life, he is given away six runs.."}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Lynn,no run,length delivery, this is chopped behind point"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Lynn,1 run"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Kallis,no run,this is a googly now, the batsman comes forward and pushes it to cover"}, {"ball": 7.6, "isHighlight": false, "text": "Murali continues.."}, {"ball": 8.1, "isHighlight": false, "text": "Muralitharan to Lynn,1 run,bowls it wide outside off, no spin on this one.. the batsman waits on the back foot and punches it to deep cover"}, {"ball": 8.2, "isHighlight": false, "text": "Muralitharan to Kallis,no run,he looks to sweep this across the line, much like Lynn.. but makes no connection and is hit high on the pads"}, {"ball": 8.3, "isHighlight": false, "text": "Muralitharan to Kallis,1 run,this one keeps a touch low, but Kallis manages to nudge it to midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Muralitharan to Lynn,1 run,here comes the slog sweep again, but it's off the inside edge to deep square leg for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Muralitharan to Kallis, $$SIX$$ ,slog sweep again, this time it is Kallis.. Gets this on the middle off the bat and whacks it deep over square leg.. Another six.. Murali being taken apart here."}, {"ball": 8.6, "isHighlight": false, "text": "Muralitharan to Kallis,1 run,top-spinner on off stump, Kallis waits on the back foot and dabs it to midwicket for a quick single"}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Kallis,2 runs,it's a full delivery and the batsman tucks it to deep midwicket with soft hands to pick up two"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Kallis,no run,good delivery on off, Kallis can only slice it to point"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Kallis,2 runs,he fires up another googly but Kallis smartly picks up another couple to deep midwicket.. He is pushing these very softly"}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Kallis,1 run,now he pushes the legspinner to deep cover for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Lynn,no run,he looks to cut this through the off side, but doesn't get the timing as the googly comes into him.."}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Lynn,1 run,slightly short and Lynn is quick to swivel and pulls this to deep square leg.."}, {"ball": 9.6, "isHighlight": false, "text": "Now we have a bowler from the 70s.. Here is Dinda with his headbands"}, {"ball": 10.1, "isHighlight": false, "text": "Dinda to Lynn,1 run,length delivery outside off, the batsman cracks it to deep point off the back foot"}, {"ball": 10.2, "isHighlight": false, "text": "Dinda to Kallis,1 run,length delivery on off, the batsman punches it firmly back at the bowler, who manages to get a boot on it.. only to deflect it towards mid-on"}, {"ball": 10.3, "isHighlight": false, "text": "Dinda to Lynn,1 run,he wouldn't be happy with the result there. This was a half-volley on off and Lynn only managed a bit of toe-end on it, pushing it just over the bowler's head"}, {"ball": 10.4, "isHighlight": false, "text": "Dinda to Kallis,1 run,low full toss on off, the batsman gets an inside edge behind square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Dinda to Lynn,1 run,just like two deliveries ago, Lynn only manages to toe-end this half-volley to long off"}, {"ball": 10.6, "isHighlight": false, "text": "Dinda to Kallis,1 wide,attempts a slower ball but this is way down the leg side"}, {"ball": 10.6, "isHighlight": false, "text": "That should have been the last ball of the over.. What has he got in store in the extra one..?"}, {"ball": 10.6, "isHighlight": false, "text": "Dinda to Kallis,1 run,he gives away only a single as Kallis punches this to wide long-off"}, {"ball": 10.6, "isHighlight": false, "text": "\"Bowler from the 70s?? Don't tell me you are comparing Dinda and Dennis?\" Sundar, don't tell me that you think Dennis was the only bowler who bowled in the 70s.."}, {"ball": 10.6, "isHighlight": false, "text": "Varun Aaron comes in again"}, {"ball": 11.1, "isHighlight": false, "text": "Aaron to Kallis,1 run,good pacy length delivery on the stumps, the batsman punches it to long on for a single"}, {"ball": 11.2, "isHighlight": false, "text": "Aaron to Lynn,no run,looks to swing the length delivery over midwicket but is beaten as this one slip between the bat .. was not too far from the leg stump"}, {"ball": 11.3, "isHighlight": false, "text": "Aaron to Lynn, $$OUT$$ ,that's the end of Lynn as he slaps a length delivery straight to AB at long-off. Lynn had slowed down a bit in the last few overs and he didn't really time it as well as he would have liked."}, {"ball": 11.3, "isHighlight": false, "text": "$$CA$$ $$Lynn$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Aaron$$ $$45$$ $$(46m$$ $$31b$$ $$3x4$$ $$3x6)$$ $$SR:$$ $$145.16$$"}, {"ball": 11.3, "isHighlight": false, "text": "Yusuf Pathan is in now.."}, {"ball": 11.4, "isHighlight": false, "text": "Aaron to Pathan,no run,he walks across to the off stump, but punches the length ball back to the bowler"}, {"ball": 11.5, "isHighlight": false, "text": "Aaron to Pathan, $$OUT$$ ,and that's two in three balls for Aaron! Just like Lynn, Yusuf tries to hammer the ball towards long-on, but he fares even worse.. He could only get it as far as Kohli at mid-off. The investment on Yusuf keeps going sour... When will they divest their stocks on him? He has scored a solitary fifty for them in 46 innings"}, {"ball": 11.5, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$c$$ $$Kohli$$ $$b$$ $$Aaron$$ $$0$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 11.5, "isHighlight": false, "text": "Robin Uthappa walks in.. He is a dangerous one if he comes off.."}, {"ball": 11.6, "isHighlight": false, "text": "Aaron to Uthappa,1 run,bowls a low full toss that Robin punches to wide mid-on to get off the mark"}, {"ball": 12.1, "isHighlight": false, "text": "Dinda to Uthappa,1 run,bowls a length delivery on off, the batsman dabs it to cover for a quick single"}, {"ball": 12.2, "isHighlight": false, "text": "Dinda to Kallis,1 run,he stays upright and punches the length delivery to long off for a single"}, {"ball": 12.3, "isHighlight": false, "text": "Dinda to Uthappa,2 runs,he beats midwicket with a flick off a fuller delivery to pick up a couple"}, {"ball": 12.3, "isHighlight": false, "text": "BabaZandu: \"'the begining of the end' starring pathan brothers (running successfully since ipl 5)\""}, {"ball": 12.4, "isHighlight": false, "text": "Dinda to Uthappa,no run,he was walking into this shot, but misses the yorker completely.. Luckily for him, it was outside off"}, {"ball": 12.5, "isHighlight": false, "text": "Dinda to Uthappa,1 run,another good yorker outside off, the batsman closes the face of the bat to steer it to square leg"}, {"ball": 12.6, "isHighlight": false, "text": "Dinda to Kallis,no run,he has bowled beautifully till now.. This is another full delivery outside off and beats the inside edge as the batsman looks to drive it through cover"}, {"ball": 12.6, "isHighlight": false, "text": "Chahal comes back for his second spell"}, {"ball": 13.1, "isHighlight": false, "text": "Chahal to Uthappa,1 run,tossed up delivery, the batsman drives it to deep midwicket for a single"}, {"ball": 13.2, "isHighlight": false, "text": "Chahal to Kallis,no run,flatter delivery on the stumps, Murali from midwicket hares across to his left to cut-off the chance of a single"}, {"ball": 13.3, "isHighlight": false, "text": "Chahal to Kallis,1 run,this one is dabbed to point, but Aaron fumbles to allow a single"}, {"ball": 13.4, "isHighlight": false, "text": "Chahal to Uthappa,1 run,he looks to paddle this fine, but gets a top-edge over the keeper's head for a single"}, {"ball": 13.5, "isHighlight": false, "text": "Chahal to Kallis,1 run,he makes a lot of room this time and looks to go over point, but doesn't get much power behind the shot"}, {"ball": 13.6, "isHighlight": false, "text": "Chahal to Uthappa,no run,that was almost punched back to the bowler! Just drops short of him. The ball stopped on Robin a touch.."}, {"ball": 14.1, "isHighlight": false, "text": "Dinda to Kallis,1 run,he has been bowling superbly till now.. Another full yorker wide outside off, the batsman gets an inside edge towards midwicket for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Dinda to Uthappa,no run,short and wide outside off, Uthappa punches it straight to extra cover."}, {"ball": 14.3, "isHighlight": false, "text": "Dinda to Uthappa,2 runs,fuller delivery wide outside off again, the batsman glides it down to third man"}, {"ball": 14.4, "isHighlight": false, "text": "Dinda to Uthappa,1 run,he swings his bat across the line at this length ball, but doesn't get much timing.. Hits it straight to deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Dinda to Kallis,1 run,bowls a low full toss wide outside off, the batsman slices it to deep point for a single"}, {"ball": 14.5, "isHighlight": false, "text": "abhay: \"just gt a hold of murali dictionary...its missing the words \"gracefully\" and \"retire\"..thats explains everything !!!\""}, {"ball": 14.6, "isHighlight": false, "text": "Dinda to Uthappa,1 run,more super stuff from Dinda here. Can't remember the last time I used those combination of words. This is full and wide and the batsman is only able to squeeze out to backward point"}, {"ball": 15.1, "isHighlight": false, "text": "Chahal to Uthappa,1 run,oh he almost kills Kallis with that shot! he jumps out of the crease and smashes the fuller delivery for a single to long-on.. Kallis is sent back as the throw is fired towards his end"}, {"ball": 15.2, "isHighlight": false, "text": "Chahal to Kallis, $$OUT$$ ,there seems no end to Knight Riders' troubles! Now it's Kallis' turn, who seemed alone in doing all the scoring.. He tries to whack this inside out, with the spin, to the stands. The idea was right, the execution wasn't as he failed to get distance on this.. The catch is comfortably taken at deep extra cover"}, {"ball": 15.2, "isHighlight": false, "text": "$$JH$$ $$Kallis$$ $$c$$ $$Takawale$$ $$b$$ $$Chahal$$ $$43$$ $$(72m$$ $$42b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$102.38$$"}, {"ball": 15.3, "isHighlight": false, "text": "Chahal to Uthappa,1 run,tossed up slowly on leg, he goes back and works it in front of square"}, {"ball": 15.4, "isHighlight": false, "text": "Chahal to SA Yadav,2 runs,googly comes in from just outside off, he nudges it square on the leg side, keeper is after it, but cannot prevent them from taking two"}, {"ball": 15.5, "isHighlight": false, "text": "Chahal to SA Yadav,1 run,length ball spins away from leg to off, he tucks it to midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Chahal to Uthappa,2 runs,bit more on the angle into the right hander, it straightens on leg, and is worked in front of square"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to SA Yadav,no run,full and wide from round the stumps, he tries to square drive, misses"}, {"ball": 16.2, "isHighlight": false, "text": "Starc to SA Yadav,2 runs,full again, much closer to off, he squeezes a drive in the air behind point"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to SA Yadav,1 run,moves across, uses the angle into him to tuck it through vacant midwicket"}, {"ball": 16.4, "isHighlight": false, "text": "Starc to Uthappa, $$SIX$$ ,145 kph short ball, Uthappa swivels for a pull, and the top edge flies high over short fine leg"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to Uthappa,1 run,backs away to leg, Starc goes full on the stumps, Uthappa guides it to backward point"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to SA Yadav, $$SIX$$ ,nicely done, Yadav moves to off stump, and creates space to whip this back of a length ball with the angle, it is timed so well it goes all the way"}, {"ball": 16.6, "isHighlight": false, "text": "Aaron comes back .."}, {"ball": 17.1, "isHighlight": false, "text": "Aaron to Uthappa, $$OUT$$ ,Whoa! how far has that gone! not too far unfortunately for Uthappa. he made room, got a slower ball, lifted it towards deep midwicket and looked like he made a good connection... But that went straight into the bucket hands of Starc"}, {"ball": 17.1, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Starc$$ $$b$$ $$Aaron$$ $$22$$ $$(26m$$ $$18b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$122.22$$"}, {"ball": 17.1, "isHighlight": false, "text": "In comes another former RCBian.. Vinay Kumar"}, {"ball": 17.1, "isHighlight": false, "text": "Umesh: \"Granted KKR batting is trumbling; but somehow they scoring par score to take them over considering strong bowling line-up.\""}, {"ball": 17.2, "isHighlight": false, "text": "Aaron to SA Yadav,no run,short and sharp outside off from Aaron, Surya tries to ramp it over third man but makes no connection"}, {"ball": 17.3, "isHighlight": false, "text": "Aaron to SA Yadav,no run,charges down the pitch to a 142 kph length delivery, but this one swings away and is beaten outside off"}, {"ball": 17.4, "isHighlight": false, "text": "Aaron to SA Yadav,1 run,he almost cuts it all the way to the third-man fielder.. That's what pace does..144 kph"}, {"ball": 17.5, "isHighlight": false, "text": "Aaron to Vinay Kumar,1 wide,he fires this on the pads, but this one is down the leg side"}, {"ball": 17.5, "isHighlight": false, "text": "Aaron to Vinay Kumar,1 run,quick length delivery on off, the batsman dabs it to cover for a quick single"}, {"ball": 17.5, "isHighlight": false, "text": "James: \"Aaron used to be a bit wayward. He seems to have sorted out the accuracy without losing pace. Serious prospect now.\""}, {"ball": 17.6, "isHighlight": false, "text": "Aaron to SA Yadav,1 run,fuller and quicker on off, the batsman digs it out to cover for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda comes in to bowl his last.. He has given only 18 in his three. Very unlike him.."}, {"ball": 18.1, "isHighlight": false, "text": "Dinda to SA Yadav, $$FOUR$$ ,this is full and wide outside off and guess what the batsman does.. Surya sweeps him from there and past midwicket for a boundary.. Extraordinary shot"}, {"ball": 18.2, "isHighlight": false, "text": "Dinda to SA Yadav,2 runs,this one is in the air, but beats the fielder at short fine leg.. It was a slower ball wide outside off and the batsman manages to drag it over his shoulder for a couple"}, {"ball": 18.2, "isHighlight": false, "text": "abhishek: \"hmm i am going to miss 50 from Dinda today :(\""}, {"ball": 18.3, "isHighlight": false, "text": "Dinda to SA Yadav,1 leg bye,he charges down the pitch and likes to repeat the sweep from wide outside off, but misses and gets hit on the pads.. picks up a leg bye to backward point"}, {"ball": 18.4, "isHighlight": false, "text": "Dinda to Vinay Kumar,1 run,bowls a good yorker on off, the batsman can only dig it out for a single to long off"}, {"ball": 18.5, "isHighlight": false, "text": "Dinda to SA Yadav,no run,he is trying that shot too often..It looked good the first time.. not so much now as he attempts a sweep at a wide yorker again and makes no connection.."}, {"ball": 18.6, "isHighlight": false, "text": "Dinda to SA Yadav,1 run,throws his bat at this fuller one and can only manage to push it to cover for a single"}, {"ball": 18.6, "isHighlight": false, "text": "They have hobbled, they have struggled.. but hey.. KKR are closing in on 150..Starc to bowl his last"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to SA Yadav,1 wide,bowls it full and wide and tests the umpire with that one.. doesn't impress him.. it's called a wide"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to SA Yadav,1 leg bye,he wants to thwack everything to the leg side.. it's not really working anymore for him as he gets hit on the pad trying to play that sweep.. gives him a leg-bye"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Vinay Kumar,1 bye,swing and a miss from Vinay.. He was nowhere near the line of the ball, but picks up a bye"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to SA Yadav,2 runs,just chips this one over extra cover and manages to beat the infield to pick up a couple"}, {"ball": 19.3, "isHighlight": false, "text": "John: \"@James but pace without much movement won't be effective in the longer formats....i feel umesh's a better prospect he's got that ability to produce unplayable ball...if umesh can get a bit more consistent India will then have a serious pace bowler\""}, {"ball": 19.4, "isHighlight": false, "text": "Starc to SA Yadav,1 run,short and wide, a touch slower though, the batsman gets an underedge to the keeper, but picks up a single"}, {"ball": 19.5, "isHighlight": false, "text": "Starc to Vinay Kumar,2 runs,this one is fired on the blockhole, but the batsman digs it so hard into the pitch, it bounces over the bowler.. they come back for a second"}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Vinay Kumar, $$OUT$$ ,tries to be cheeky but pays the price... He moves across the stumps to flick the full delivery fine, but only lobs it to short fine leg fielder"}, {"ball": 19.6, "isHighlight": false, "text": "$$R$$ $$Vinay$$ $$Kumar$$ $$c$$ $$Morkel$$ $$b$$ $$Starc$$ $$4$$ $$(14m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "KKR wouldn't mind this at all. After that first ball dismissal of Gambhir, Chris Lynn provided the most important thrust to the innings and added 80 runs with Kallis. But after that, there wasn't much from the other batsmen as Varun Aaron picked up quick wickets towards the end..Over to RCB's batsmen in a few minutes"}], "name": "Royal Challengers Bangalore v Kolkata Knight Riders", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729299.html?innings=1;view=commentary", "match_num": 11}