{"commentary": [{"ball": 0, "isHighlight": false, "text": "Whoa.. they are already here. No time to eat.. Starving commentator types on.. Takawale and Parthiv Patel to open.. Umesh Yadav to start off. Uno slipo in place"}, {"ball": 0.1, "isHighlight": false, "text": "UT Yadav to Patel,no run,good start by the bowler, length delivery on off, 140 kph, the batsman defends it back to the bowler"}, {"ball": 0.2, "isHighlight": false, "text": "UT Yadav to Patel,2 runs,that's the problem pace creates! Parthiv looks to pull a short ball, but is not in control at all. The ball balloons over the square leg fielder.. He is lucky there.. very very lucky"}, {"ball": 0.3, "isHighlight": false, "text": "UT Yadav to Patel,no run,length delivery on off, the batsman defends it off the back foot"}, {"ball": 0.4, "isHighlight": false, "text": "UT Yadav to Patel, $$FOUR$$ ,short and wide, slapped hard through the crowded point region.. Manish Pandey flew to his left, but that was spanked.. no chance for anyone"}, {"ball": 0.5, "isHighlight": false, "text": "UT Yadav to Patel,1 run,length delivery on the stumps, the batsman punches it to mid-on and calls for a quick single as Yusuf takes times to control the ball"}, {"ball": 0.6, "isHighlight": false, "text": "UT Yadav to Takawale,1 wide,length delivery, but this is down the leg side"}, {"ball": 0.6, "isHighlight": false, "text": "ChottaDravid: \"Two wicket-keeper batsman at the crease. AB and Yuvi to follow have also kept wickets. Interesting!\" --- Kohli has also kept wickets in international cricket.."}, {"ball": 0.6, "isHighlight": false, "text": "UT Yadav to Takawale,no run,length delivery outside off, Takawale punches it to cover point"}, {"ball": 0.6, "isHighlight": false, "text": "The towering figure of Morne Morkel comes in.."}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Patel,1 run,back of length delivery outside off, the batsman dabs it to third man for a single"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Takawale,no run,extra bounce does it for Morkel.. It was short and wide and would have been whacked if he was a shorter bowler.. but this one takes off and beats the batsman's cut shot"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Takawale,1 run,stays on the back foot and opens the bat face to run it down to third man"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Patel,no run,short delivery, the batsman rolls his wrists on it as he tries to pull, hits it straight to midwicket"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Patel,no run,that extra bounce.. that menacing stuff.. 149 kph.. Parthiv swings.. meets thin air."}, {"ball": 1.5, "isHighlight": false, "text": "Kapil Devani: \"what baffles me is the long list of bowlers they are carrying. Starc, Dinda, Aaron, Murali, Chahal, Albie. Seems things will be balanced when Gayle comes in for Murali.\""}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Patel,no run,another one of those quick short of length deliveries.. batsman swings, batsman misses"}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to Takawale,no run,length delivery at 143.5 kph, the batsman gets behind the line and defends"}, {"ball": 2.2, "isHighlight": false, "text": "UT Yadav to Takawale,1 run,another length delivery on the stumps, this time Takawale is able to push it to wide mid-on to get off strike"}, {"ball": 2.3, "isHighlight": false, "text": "UT Yadav to Patel, $$FOUR$$ ,fuller length delivery outside off, Parthiv reaches out and slices it over point to find the boundary again.. Doesn't move his feet much, just throws his bat at that"}, {"ball": 2.4, "isHighlight": false, "text": "UT Yadav to Patel,1 run,looks to punch this fuller delivery down the ground, but doesn't get any timing on that.. picks up a quick single to mid-off"}, {"ball": 2.5, "isHighlight": false, "text": "UT Yadav to Takawale,no run,looks to heave this over mid-on but that's too quick for him.. 145.4 kph.. He only manages to hit it as far as mid-on"}, {"ball": 2.6, "isHighlight": false, "text": "UT Yadav to Takawale, $$FOUR$$ ,manages to get his swing down in time.. not the best of timing behind that, but it clears mid-on"}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Patel,1 leg bye,this one is quick too.. hits the batsman on the thigh pad as the batsman looks to clip it to the leg side.."}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,jeez, what timing on that one.. He was opening his stance, the bowler followed him with a length ball, Takawale just flicks him over square leg and that races quickly..."}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Takawale,no run,he corrects the line to outside off and this flies quickly past the outside edge"}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,there is a slip in place but this one flies between the keeper and that fielder.. Uthappa was moving towards the leg side and is surprised as this thick outside edge flies quickly past him"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,now the batsman rubs salt on Morkel's wounds, flicking this length delivery through backward square leg for yet another boundary"}, {"ball": 3.5, "isHighlight": false, "text": "yaswanth: \"INDIA has to seriously invest in Aaron and Umesh!! Especially with next world cup in Australia!!!! They have the pace and aggression to bounce the batsmen out!!!\" --- What about the IPL after that? They need to be saved for that too.."}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Takawale,no run,that's a pacy short ball, the batsman ducks under it and the keeper has to leap to catch that one"}, {"ball": 3.6, "isHighlight": false, "text": "Here is Narine ...."}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Patel,1 run,quicker delivery on off, the batsman chops it behind point for a quick single"}, {"ball": 4.1, "isHighlight": false, "text": "rssampat: \"KKR is paying a very heavy price for not having a regular WK, specially when they have a bowler like Naraine in their ranks. Uthappa by no measure of imagination is a good keeper. At best a stop gap arrangement if your regular gets injured or for the odd game that you want to play a extra Batsmen/bowler\""}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Takawale,no run,flatter and quicker, the batsman defends it to the off side"}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Takawale,no run,he beats him with a quicker one as the batsman plays inside the line.. Robin fails to take that cleanly"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Takawale,no run,quicker one on the stumps, the batsman defends. i don't think he knows which ball is doing what"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Takawale,no run,slightly slower this time, the batsman defends it to backward point"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Takawale,no run,it's the conventional offspinner, the batsman tucks it straight to short fine leg"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel is going to continue intimidating.."}, {"ball": 5.1, "isHighlight": false, "text": "Morkel to Patel,1 run,length delivery on off, the batsman defends it to short cover, but picks up a single"}, {"ball": 5.1, "isHighlight": false, "text": "Sam: \"Extremely wrong decision by Gambhir to bring Narine so early. He should have been saved for Kohli and deVilliers. One over from the trump card wasted.\""}, {"ball": 5.2, "isHighlight": false, "text": "Morkel to Takawale,2 runs,he makes room and looks to swing it over cover, but gets a thick top edge that evades the mid-off fielder.. Gambhir can't reach that one.."}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,it's the best shot Takawale has played today.. He moves to the leg side, gets a 147 kph fuller delivery that he thumps over the bowler's head.. one bounce and four.."}, {"ball": 5.4, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,he is growing in confidence now.. arches back and ramps the short of length delivery over the slip fielder.. Wonderful shot by Takawale"}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Takawale,no run,he stays on the back foot and defends the length delivery to cover point"}, {"ball": 5.6, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,length delivery and Takawale is taking some toll on this bowling now.. he swings across the line and gets enough bat on it to pick up a boundary over wide mid on"}, {"ball": 5.6, "isHighlight": false, "text": "Arvind: \"Takawale is a perfect example of utility player. He has already done his job. team is at 50 odd at the end of 6th over when chasing 150. Now big boys should be able to take it through.\""}, {"ball": 5.6, "isHighlight": false, "text": "Now it's Vinay Kumar.."}, {"ball": 6.1, "isHighlight": false, "text": "Vinay Kumar to Patel, $$FOUR$$ ,who doesn't love a bit of medium pace.! Parthiv certainly does.. he whacks this back of length delivery with a lot of authority to deep midwicket boundary"}, {"ball": 6.2, "isHighlight": false, "text": "Vinay Kumar to Patel,1 run,allows this back of length delivery to come to him before guiding it to third man"}, {"ball": 6.3, "isHighlight": false, "text": "Vinay Kumar to Takawale,2 runs,he strays on the pads and Takawale picks up a couple with a neat clip off his pads, at deep backward square leg"}, {"ball": 6.4, "isHighlight": false, "text": "Vinay Kumar to Takawale,4 leg byes,on the pads again, the batsman doesn't get any bat on it, but he won't mind as this skims of the pads to the boundary"}, {"ball": 6.5, "isHighlight": false, "text": "Vinay Kumar to Takawale,1 run,solid shot off the back foot this time.. He gets up on his toes and punches the back of length delivery to deep cover"}, {"ball": 6.6, "isHighlight": false, "text": "Vinay Kumar to Patel,no run,short delivery outside off, Parthiv looks to guide it over the keeper's head but misses"}, {"ball": 6.6, "isHighlight": false, "text": "GG looks for some inspiration.. throws the ball to Kallis.."}, {"ball": 7.1, "isHighlight": false, "text": "Kallis to Takawale,1 run,length delivery outside off, the batsman guides it to third man for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Kallis to Patel,1 run,he walks across to the off side and whips the length delivery to fine leg for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Andy: \"I have been a fan of morkel, I like the bowler and I think he is very talented but too many times when in the edge of a cliff he just....jumps to a predicted disaster. His inability to be composed and don't let the big overs get to him unacceptable by a player of his calibre\""}, {"ball": 7.3, "isHighlight": false, "text": "Kallis to Takawale, $$FOUR$$ ,slower delivery outside off, the batsman looked to push it towards point but gets a useful little under edge through the vacant slip region.."}, {"ball": 7.4, "isHighlight": false, "text": "Kallis to Takawale, $$OUT$$ ,finally KKR strike! This was the offcutter and Takawale looked to work it away on the leg side, got hit right in front of the middle stump.. Easy decision for the umpire"}, {"ball": 7.4, "isHighlight": false, "text": "$$YV$$ $$Takawale$$ $$lbw$$ $$b$$ $$Kallis$$ $$40$$ $$(33m$$ $$28b$$ $$8x4$$ $$0x6)$$ $$SR:$$ $$142.85$$"}, {"ball": 7.4, "isHighlight": false, "text": "Relief for KKR.. Not really.. Kohli is in next"}, {"ball": 7.5, "isHighlight": false, "text": "Kallis to Kohli,no run,ever so solid.. defends the length ball off the front foot"}, {"ball": 7.6, "isHighlight": false, "text": "Kallis to Kohli,no run,that takes off from back of length and flies past the outside edge.. Kohli was looking to guide it to third man, but he was lucky not to edge it"}, {"ball": 7.6, "isHighlight": false, "text": "Vinay Kumar continues"}, {"ball": 8.1, "isHighlight": false, "text": "Vinay Kumar to Patel, $$OUT$$ ,now it's Parthiv's turn.. He is beaten by the extra bounce on this pitch.. Parthiv wanted to clip it to the leg side, but this slower delivery got big on him and the leading edge just popped up for the cover fielder.."}, {"ball": 8.1, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$c$$ $$Lynn$$ $$b$$ $$Vinay$$ $$Kumar$$ $$21$$ $$(36m$$ $$19b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$110.52$$"}, {"ball": 8.1, "isHighlight": false, "text": "Yuvraj Singh comes in.. one slip in place"}, {"ball": 8.2, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,1 wide,length delivery angled across the batsman, Yuvraj leaves it alone"}, {"ball": 8.2, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,1 run,he gets off the mark with a dabbed single to cover off a length ball"}, {"ball": 8.3, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,he shuffles across and clips the length delivery with ease to deep square leg"}, {"ball": 8.4, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,1 run,not much feet movement from Yuvraj, but he manages to push this length delivery through cover for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,waits an extra fraction of a second, then guides the length ball down to third man"}, {"ball": 8.6, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,no run,length delivery outside off, Yuvraj continues to play with an angled bat, pushes it to point"}, {"ball": 8.6, "isHighlight": false, "text": "GG brings back Morkel to see if he can fetch him a wicket.."}, {"ball": 9.1, "isHighlight": false, "text": "Morkel to Kohli,1 run,back of length delivery, Kohli nudges it to square leg for a single.. Yuvi looks around to check if he wants to come back for a second.. but he doesn't"}, {"ball": 9.1, "isHighlight": false, "text": "One slip in place"}, {"ball": 9.2, "isHighlight": false, "text": "Morkel to Yuvraj Singh,no run,length delivery outside off, again, he pushes this to backward point with an angled bat.."}, {"ball": 9.3, "isHighlight": false, "text": "Morkel to Yuvraj Singh,1 run,length delivery on the pads, lets Yuvraj off the hook as the batsman clips it to fine leg"}, {"ball": 9.4, "isHighlight": false, "text": "Morkel to Kohli,3 runs,easy peasy for Kohli as he whips this length delivery through midwicket to pick up three runs"}, {"ball": 9.5, "isHighlight": false, "text": "Morkel to Yuvraj Singh,no run,short ball comes in and Yuvraj is in a tangle.. he is nowhere near the ball but his position goes completely awry.."}, {"ball": 9.6, "isHighlight": false, "text": "Morkel to Yuvraj Singh,no run,short ball again, he chooses to play the pull belatedly.. gets thick top edge that hits him on his helmet.. the ball doesn't go anywhere. A shadow of a man who used to hit these a long way in the past"}, {"ball": 9.6, "isHighlight": false, "text": "GG wants more pace.. Goes to Umesh Yadav.."}, {"ball": 10.1, "isHighlight": false, "text": "UT Yadav to Kohli,no run,fuller delivery outside off, Kohli misses out on some runs as he drives this straight to cover"}, {"ball": 10.2, "isHighlight": false, "text": "UT Yadav to Kohli,1 run,back of length on off, Kohli dabs it to deep square leg with utmost ease for a single"}, {"ball": 10.2, "isHighlight": false, "text": "time to crank up the pace for Yuvraj.. it's a ruthless world."}, {"ball": 10.3, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh, $$SIX$$ ,no no.. crank up I said.. Umesh bowled it at 135.5 kph.. Yuvraj can still smack those and he does it with style.. That was the shot of the old days, over midwicket and into the stands"}, {"ball": 10.4, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,1 run,he moves to the leg side to make some room, then slices the fuller delivery over point"}, {"ball": 10.4, "isHighlight": false, "text": "Mridul Shandily: \"I don't think it is about GG wanting more pace at this time against Yuvraj and Kohli. It is more about who he wants to save for the death overs. Narine, Kallis and Vinay are better at the death than Umesh and Morkel. \""}, {"ball": 10.5, "isHighlight": false, "text": "UT Yadav to Kohli, $$FOUR$$ ,pace, no pace, spin, no spin, Kohli plays his own game.. He gets a back of length delivery and whacks it over midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "UT Yadav to Kohli,1 run,length delivery wide outside off, the batsman pushes it to deep cover to keep the strike"}, {"ball": 10.6, "isHighlight": false, "text": "Manu: \"The difference between Umesh & Aaron is that, Aaron was consistently bowling around the 144 kmph mark. Umesh is only bowling in the mid 130s and occasionally hitting the 140s.\""}, {"ball": 10.6, "isHighlight": false, "text": "Narine is brought back now.."}, {"ball": 11.1, "isHighlight": false, "text": "Narine to Kohli,1 run,flatter outside off, Kohli stays on the back foot and clips it to deep square leg"}, {"ball": 11.2, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,quicker delivery on the stumps, Yuvraj punches it to mid-on"}, {"ball": 11.3, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,some spin for the bowler, but it's slightly short and Yuvraj manages to push it to midwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,he still can't get it away, pushes it to cover"}, {"ball": 11.5, "isHighlight": false, "text": "Narine to Yuvraj Singh,2 runs,just outside off and this time Yuvraj manages to cut it late to pick up a couple"}, {"ball": 11.6, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,he comes forward and defends the fuller delivery straight down the pitch"}, {"ball": 11.6, "isHighlight": false, "text": "Kallis is called back.."}, {"ball": 12.1, "isHighlight": false, "text": "Kallis to Kohli, $$FOUR$$ ,beautiful! Kohli leans forward and uses his wrists to punch this with precision in the gap at extra cover"}, {"ball": 12.2, "isHighlight": false, "text": "Kallis to Kohli, $$FOUR$$ ,this is even better.. just punches it through the same gap again.. just timing and a bit of placement.."}, {"ball": 12.2, "isHighlight": false, "text": "Kamal: \"But Mridul, if Mr. G does not figure out how to get a wicket or two in the next 3-4 overs, who bowls the death overs may not be so relevant But it is par for the course - most second innings captains lead defensively hoping to win based on batting mistakes...\""}, {"ball": 12.3, "isHighlight": false, "text": "Kallis to Kohli,1 run,allows this one to come in before clipping it to fine leg for a single"}, {"ball": 12.3, "isHighlight": false, "text": "Round the wicket"}, {"ball": 12.4, "isHighlight": false, "text": "Kallis to Yuvraj Singh,no run,length delivery on off, Yuvraj tries to play that push to third man, finds backward point.. no straight bat shots for him"}, {"ball": 12.5, "isHighlight": false, "text": "Kallis to Yuvraj Singh,1 run,this is straighter, allows him to dab it to midwicket for a single"}, {"ball": 12.6, "isHighlight": false, "text": "Kallis to Kohli,no run,fuller delivery on off, wristed straight to midwicket"}, {"ball": 13.1, "isHighlight": false, "text": "Narine to Yuvraj Singh,1 run,he tucks this one to fine leg as the line is slightly leg-sidish.. gives the strike back to Kohli"}, {"ball": 13.2, "isHighlight": false, "text": "Narine to Kohli,1 run,it's the doosra, but Kohli plays it to point off the back foot easily"}, {"ball": 13.3, "isHighlight": false, "text": "Narine to Yuvraj Singh,2 runs,quicker on the stumps, this is short enough and gives the batsman time to punch it to deep midwicket"}, {"ball": 13.4, "isHighlight": false, "text": "Narine to Yuvraj Singh,2 runs,slightly fuller, this time the batsman comes forward, dabs it to point for a single and then picks up an extra as the throw at non-striker's end is not gathered"}, {"ball": 13.5, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,he cuts this one straight to point"}, {"ball": 13.6, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,fuller and wider, draws the batsman forward and beats the bat"}, {"ball": 13.6, "isHighlight": false, "text": "paulymac: \"So many captains in this years IPL keeping their best bowlers back until the game already lost - surely put pressure on up front and create pressure???!! All these captains committing this idiocy have all lost. Best bowlers should face best batsmen.......not highest economy versus best batsmen and lowest economy versus lowest economy batsmen!!\" --- that's what Shoaib Akhtar said yesterday.. Bring Shoaib when Sachin comes out.. Bring Sachin when Shoaib comes out.."}, {"ball": 14.1, "isHighlight": false, "text": "Kallis to Kohli,1 run,drives the fuller delivery to deep extra cover for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Kallis to Yuvraj Singh,no run,poor position from Yuvraj as he looks to turn this length delivery to the leg side, but gets an outside edge to point"}, {"ball": 14.3, "isHighlight": false, "text": "Kallis to Yuvraj Singh,no run,this stays low and beats the bat as the batsman looks to punch it through cover"}, {"ball": 14.4, "isHighlight": false, "text": "Kallis to Yuvraj Singh, $$FOUR$$ ,he looks to make room, but that's a bluff.. The bowler fires it on his pads and all the batsman has to do is to get some bat on it.. he flicks it to deep backward square leg boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Kallis to Yuvraj Singh,1 run,length delivery outside off, he chops it to deep point"}, {"ball": 14.6, "isHighlight": false, "text": "Kallis to Kohli,1 run,length delivery on the stumps, easily nudged to square leg for a single"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Kohli,no run,tosses it up and gets some offspin, Kohli defends it off the back foot"}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Kohli,2 runs,width provided and Kohli is not going to miss out on those, punches it to deep extra cover to pick up a couple"}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Kohli,no run,quicker on the off stump, Kohli defends it off the back foot"}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Kohli, $$FOUR$$ ,poor ball from Narine.. this is a full toss and a high one.. Kohli smashes it over midwicket with ease"}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Kohli, $$OUT$$ ,that's a corker from Narine! It has to be a very good ball to beat someone in the form of his life and it is. This is tossed up further, spins in and beats the inside edge of the bat, flicks the front pad and then takes the off bail .."}, {"ball": 15.5, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$b$$ $$Narine$$ $$31$$ $$(36m$$ $$23b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$134.78$$"}, {"ball": 15.5, "isHighlight": false, "text": "A wicket finally, but it's probably come too late.. Narine has only one ball left.. AB comes in"}, {"ball": 15.5, "isHighlight": false, "text": "Slip and silly point in place"}, {"ball": 15.6, "isHighlight": false, "text": "Narine to de Villiers,1 run,AB goes deep in the crease to work this away to deep midwicket for a single"}, {"ball": 16.1, "isHighlight": false, "text": "Kallis to de Villiers,no run,length delivery on off, the batsman punches it to cover"}, {"ball": 16.2, "isHighlight": false, "text": "Kallis to de Villiers,1 run,a misfield at cover allows AB to pick up a single"}, {"ball": 16.2, "isHighlight": false, "text": "Andrew: \"Narine brilliant as usual but no one else going at below a run a ball...KKR are going to have a problem until they sort that out.\""}, {"ball": 16.3, "isHighlight": false, "text": "Kallis to Yuvraj Singh,no run,he comes round the wicket and bowls length on off, Yuvraj, for once, plays it with a straight bat, but can't beat a diving Kallis"}, {"ball": 16.4, "isHighlight": false, "text": "Kallis to Yuvraj Singh,1 run,length delivery on off, the angled bat comes out again, Yuvraj picks up a single to point"}, {"ball": 16.5, "isHighlight": false, "text": "Kallis to de Villiers,no run,he punches the length delivery straight to midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Good over this.. Now is there a wicket somewhere round the corner?"}, {"ball": 16.6, "isHighlight": false, "text": "Kallis to de Villiers,1 run,shortish outside off, it's slapped powerfully to deep cover"}, {"ball": 16.6, "isHighlight": false, "text": "Vinay Kumar comes in now"}, {"ball": 17.1, "isHighlight": false, "text": "Vinay Kumar to de Villiers,1 run,cramps him for room with a straight length delivery, but AB adjusts to punch it to deep midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,no run,quick short ball to Yuvraj Singh.. he thinks about pulling it, but sways away from it"}, {"ball": 17.3, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,no run,goes round the wicket and bowls a slower one that beats Yuvraj's slog across the line"}, {"ball": 17.4, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh, $$FOUR$$ ,gets a fuller delivery and it provides a release as Yuvraj thumps it over cover for a four"}, {"ball": 17.5, "isHighlight": false, "text": "Vinay Kumar to Yuvraj Singh,1 run,it's a yorker outside off, Yuvraj manages to dig it out to long on for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Back over the wicket"}, {"ball": 17.6, "isHighlight": false, "text": "Vinay Kumar to de Villiers,1 run,short length ball on the body, AB whacks it straight to deep midwicket.. Just a single.. he keeps the strike"}, {"ball": 17.6, "isHighlight": false, "text": "Ajay M: \"Yuvraj in familiar territory! it's been less than 2 weeks since T20WC finals\""}, {"ball": 17.6, "isHighlight": false, "text": "Umesh comes in"}, {"ball": 18.1, "isHighlight": false, "text": "UT Yadav to de Villiers, $$FOUR$$ ,he bowls it full and wide and for someone like AB, it's a freebee.. It's clobbered over mid-off"}, {"ball": 18.1, "isHighlight": false, "text": "Mid-off drops back"}, {"ball": 18.2, "isHighlight": false, "text": "UT Yadav to de Villiers,1 run,this one is good, fired in full on the middle and leg stump, AB digs it out to long on for a single"}, {"ball": 18.2, "isHighlight": false, "text": "Can Yuvraj lay old ghosts to rest?"}, {"ball": 18.3, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,no run,comes round the wicket and fires it full outside off, Yuvi looks to steer it to third man, but misses.."}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,(no ball) 2 runs,he is standing outside off and gets a high full toss, poor bowling this... Yuvraj gets a top-edge towards long-on and gets a couple.. that's three runs"}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh, $$OUT$$ ,and he's gone... ironically to a ball that he timed so well.. Probably his best connection of the day.. It was full and wide and he crashed it over point, but straight to deep point..Gambhir is pumped"}, {"ball": 18.4, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Pathan$$ $$b$$ $$UT$$ $$Yadav$$ $$31$$ $$(49m$$ $$34b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$91.17$$"}, {"ball": 18.4, "isHighlight": false, "text": "Albie Morkel comes out"}, {"ball": 18.5, "isHighlight": false, "text": "UT Yadav to Morkel,1 run,full and wide outside off, the batsman digs it out straight to point and takes off for a single.. A direct hit would have made it interesting.. Manish Pandey misses... AB would have probably made it as well"}, {"ball": 18.6, "isHighlight": false, "text": "UT Yadav to de Villiers,no run,he looks to reverse paddle this full and wide delivery.. makes no connection.. How did it ever come to this.."}, {"ball": 18.6, "isHighlight": false, "text": "Last over.. Nine needed..Vinay has the ball.. This chase was supposed to be an easy one.. how did it ever come to this..Morkel on strike.."}, {"ball": 19.1, "isHighlight": false, "text": "Vinay Kumar to Morkel,1 run,it's a yorker length slower ball from round the wicket, Albie pushes it to long on for a single"}, {"ball": 19.1, "isHighlight": false, "text": "AB now.. tension mounting.. AB goes for a chat with Albie.. GG comes over to talk to Vinay.. Conferences everywhere.. Long-off, long-on in place"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to de Villiers,1 run,he walks all around the pitch before sweeping the length delivery to deep midwicket.. just a single"}, {"ball": 19.2, "isHighlight": false, "text": "7 off 4"}, {"ball": 19.3, "isHighlight": false, "text": "Vinay Kumar to Morkel,1 run,that's a full toss, high full toss outside of.. it's hit in the air towards cover but lands safely.. could have gone outside had he made a proper connection"}, {"ball": 19.3, "isHighlight": false, "text": "serious buzz in the ground..tension writ on Yuvi's face in the dug out"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay Kumar to de Villiers, $$OUT$$ ,this is a blinder! this is madness.. this is the maddest baddest ever catch.. AB did what AB does.. Whacks the short of length delivery to deep midwicket, where Lynn lines himself up for the catch.. but he slips.. Despite that, he somehow straightens his body on the ground, keeps an eye on the ball, arches his body back and takes a catch sitting down.. freakish catch.. KKR are stealing this one.. Lynn is a hero.. watch that catch to believe that.."}, {"ball": 19.4, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$c$$ $$Lynn$$ $$b$$ $$Vinay$$ $$Kumar$$ $$11$$ $$(23m$$ $$12b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$91.66$$"}, {"ball": 19.4, "isHighlight": false, "text": "Pavan: \"Chrisssssss Lynnnnnnn!!!! Spectacular under pressure catch.. It cant get better\""}, {"ball": 19.4, "isHighlight": false, "text": "Nandakiran: \"Man of the Match. Give it to Lynn already. What an incredible catch.\""}, {"ball": 19.5, "isHighlight": false, "text": "Vinay Kumar to Morkel,2 runs,fuller delivery on off, thumped down the ground and they pick up a couple to long on"}, {"ball": 19.5, "isHighlight": false, "text": "Four of last one.."}, {"ball": 19.6, "isHighlight": false, "text": "Vinay Kumar to Morkel,1 run,low full toss, he hasn't timed it. it goes only as far as long off. This is a jailbreak of a monumental standard.."}, {"ball": 19.6, "isHighlight": false, "text": "A week down the line, all we would remember from this match is that catch. We'd remember it for a some time to come. It's etched in my head now. Thanks for all your comments and feedback. Tune in for more tomorrow. Ciao ciao."}, {"ball": 19.6, "isHighlight": false, "text": "\"It was an incredible win,\" says  $$Gautam$$ $$Gambhir$$ . \"We deserved some luck too as we have had a number of these last ball finishes. Once the ball got a little old, it was difficult to hit. Chris scored useful runs, so did Surya. So we had it in mind that once the ball got that old, we had a chance. We were scratchy with the bat, and with the ball, so we need to improve on the areas. The catch was unbelievable and Chris deserved the man of the match for that catch.\""}, {"ball": 19.6, "isHighlight": false, "text": "\"I slipped and I though if i stood up and dropped the catch, it would look very silly, so just stayed down,\" says  $$Chris$$ $$Lynn$$ , who is also the Man of the Match.. for a catch.. how many times do you see that.."}, {"ball": 19.6, "isHighlight": false, "text": "\"We lost that game rather than KKR winning that one,\" says  $$Virat$$ $$Kohli.$$  \"We played some really good cricket to restrict them to a total, built partnerships, but messed up the game in the last few overs\""}, {"ball": 19.6, "isHighlight": false, "text": "KKR have pulled off a blinder.. Give it to Chris Lynn for that mad catch, give it to the last few overs at the death.. give it to tight bowling to an out of form Yuvraj...RCB continue to find ways of falling short.. Gautam Gambhir lets out a cry of relief.. Kohli is emotionless and quietly walks away.. How did they manage to lose this one is beyond me. Narine bowled an excellent spell and got the big wicket of Kohli just before finishing his quota.."}, {"ball": 19.6, "isHighlight": false, "text": "Kiran Gummalla: \"Hats off Vinay. You did it. Brilliant bowling. You did it once and you did it again.\""}, {"ball": 19.6, "isHighlight": false, "text": "Martin Jose: \"Yuvraj lucky to be not facing last few overs..Will anyone blame ABd & A Morkel for slow batting!!!\""}], "name": "Royal Challengers Bangalore v Kolkata Knight Riders", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729299.html?innings=2;view=commentary", "match_num": 11}