{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$2.30$$ $$pm$$  It's sweltering in Dubai as the Daredevils spill out into the middle. Aaron Finch and Shikhar Dhawan are the Sunriers openers. Shahbaz Nadeem's left-arm spin to kick things off. There's a slip in place"}, {"ball": 0, "isHighlight": false, "text": "Satish: \"If you were an IPL owner in the 1980s, who will you choose to be in your team?\" And our debate topic has arrived."}, {"ball": 0, "isHighlight": false, "text": "Tushar Kardile: \"Apart from Venugopal Rao, not a single local player in either team!\""}, {"ball": 0, "isHighlight": false, "text": "Dhawal Atrey: \"de Kock n KP Finally, good enough reason to chuck off work early!! \" $$2.20$$ $$pm$$  As fun as our who's English and who's South African debate is, it's best we put a cap to it right now. Ten minutes to go till start of play and I'm sure we'll get a lot more pertinent topics to discuss. Like the uh... uh.. uh... I got nothin"}, {"ball": 0, "isHighlight": false, "text": "David Lasky: \"'Everyone's welcome... other than KP'\""}, {"ball": 0, "isHighlight": false, "text": "Rayner: \"You can't forget the South African all England fans wish had stayed there; Jade Dernbach!\""}, {"ball": 0, "isHighlight": false, "text": "Dave : \"All this about who is South African or isn't...Ted Dexter was born in Italy. Does that make him Italian? Of course not...\" You just can't discuss KP without igniting a wild debate, it seems. I'm rather enjoying this one though."}, {"ball": 0, "isHighlight": false, "text": "$$2.00$$ $$pm$$ $$KP$$ $$is$$ $$Delhi$$ $$Daredevils$$ $$captain$$ $$and$$ $$he$$ $$is$$ $$out$$ $$at$$ $$the$$ $$toss$$ $$right$$ $$now.$$  His right hand is heavily taped up though.  $$Sunrisers$$ $$Hyderabad$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$will$$ $$bat$$ . \"It's a dry wicket,\" says Dhawan, \"Want a good score and make sure the chase is tough\". Irfan Pathan is out Naman Ojha is in to bolster the batting. Daredevils have opted for Quinton de Kock and Wayne Parnell, and among the domestic boys Laxmi Shukla."}, {"ball": 0, "isHighlight": false, "text": "Bob : \"Why aren't the teams up yet?\"  $$Any$$ $$minute$$ $$now$$  And there we go..."}, {"ball": 0, "isHighlight": false, "text": "anand: \"the main problem for both the teams is openers are not firing. KP opening the innings and facing steyn would be great start for the day\""}, {"ball": 0, "isHighlight": false, "text": "\"Craig Keiswetter is probably a more apt name for your list than Strauss or Prior.\" Everyone's welcome, Dunc. Which is probably England's motto lately"}, {"ball": 0, "isHighlight": false, "text": "We have our first confirmed KP sighting! He's warming up along with the rest of his team."}, {"ball": 0, "isHighlight": false, "text": "\"Duminy smacked Morkel all around the park the other day. It would be interesting to see if he can do the same to Steyn as well.\" Beware the crazy eyes, Sahil"}, {"ball": 0, "isHighlight": false, "text": "James: \"I hate to be picky (well ...) with Anand Bhaskar, but I'm not sure he can count KP twice. Matt Prior is not South African (if anything, he's an Aussie), and Andrew Strauss was simply born in South Africa while his father was working there (on that basis, you'd call Colin Cowdrey an Indian).\" Prior was born in Joburg but I do see that he's played for Victoria. I did not know that..."}, {"ball": 0, "isHighlight": false, "text": "$$1.45$$ $$pm$$  Daredevils have some chinks in their bowling, Sunrisers have been looking for their batting to click, and also get their first points. This and more examined in our  $$preview$$  by Alagappan Muthu"}, {"ball": 0, "isHighlight": false, "text": "Here's anand bhasker t proving how infectious CricIQ has become: \"KP!! Kevin pietersen!!! South African who played for England .. And 10 more there.. Basil D'Oliveira (1966) Tony Greig (1972) Allan Lamb (1982) Ian Greig (1982) Chris Smith (1983) Neal Radford (1986) Robin Smith (1988) Andrew Strauss (2004) Kevin Pietersen (2005) Matt Prior (2007) Jonathan Trott (2009)\""}, {"ball": 0, "isHighlight": false, "text": "James: \"Anzac day today. An additional incentive for Finch and Warner?\""}, {"ball": 0, "isHighlight": false, "text": "$$1.35$$ $$pm$$  The Australians are coming! The Australians are coming! Well, it might be a bit of a late warning considering the exploits of a certain Glenn Maxwell and another Chris Lynn. Sunrisers Hyderabad have a couple of misfiring ones, will it be their day today. Also keep a weather eye out for a South African who played for England but now is plying his trade in T20 leagues around the world."}, {"ball": 0, "isHighlight": false, "text": "------------"}, {"ball": 0, "isHighlight": false, "text": "There are indications that Kevin Pietersen might be playing today. Is he in your  $$Cricinfo$$ $$Fantasy$$ $$XI$$ ?"}, {"ball": 0, "isHighlight": false, "text": "Fifteen questions. Four options. Three lifelines. Three shots a day. Have you tested your  $$CricIQ$$  today? Bragging rights, big prizes and massive recognition are at stake.  $$Play$$ $$now$$ ."}, {"ball": 0.1, "isHighlight": false, "text": "Nadeem to Dhawan,no run,kept to a good length on middle, Dhawan goes back and blocks"}, {"ball": 0.1, "isHighlight": false, "text": "$$4.12$$ $$pm$$  The players are waiting in the middle. M Vijay and Quinton de Kock are the openers."}, {"ball": 0.1, "isHighlight": false, "text": "Nadeem to Dhawan,no run"}, {"ball": 0.2, "isHighlight": false, "text": "Nadeem to Dhawan,no run,flighted a bit more on off stump, but Dhawan is happy to camp on the back foot and chop into the covers"}, {"ball": 0.3, "isHighlight": false, "text": "Nadeem to Dhawan,no run,flatter delivery that goes on with the arm, Dhawan had room but he mistimes the cut"}, {"ball": 0.4, "isHighlight": false, "text": "Nadeem to Dhawan,1 run,angled across him on a shortish length and Dhawan waits on it and cuts through point"}, {"ball": 0.4, "isHighlight": false, "text": "Harsh: \"@satish : King Richards would be the dream catch \""}, {"ball": 0.5, "isHighlight": false, "text": "Nadeem to Finch,no run,flighted and drifting onto the pads, Finch looks to nurdle it around the corner but doesn't connect. Optimistic leg before appeal ensues"}, {"ball": 0.6, "isHighlight": false, "text": "Nadeem to Finch,1 wide,flighted and slid down the pads, Finch goes the sweep and misses again"}, {"ball": 0.6, "isHighlight": false, "text": "Nadeem to Finch, $$FOUR$$ ,flatter and quicker and again, Finch goes back and picks it away. KP chases after it and tries to pull it back gingerly with his injured hand. Doesn't succeed the first time and his slide has pushed the boundary rope back and on the second touch, his feet were beyond where the advertising skirtings were and that's a four"}, {"ball": 0.6, "isHighlight": false, "text": "Dr.Tam: \"My team from 80s won't be complete without Kapil, Viv, Zaheer Abbas,Botham and Imran Khan.\" In the present, it is Mohammed Shami with a slip in place"}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Dhawan,1 leg bye,back of a length on and around middle, Dhawan seems hurried as he looks to push down the ground. Finch calls him through for a single as the ball wanders wide of the keeper"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Finch,1 run,good length ball, tailing in on middle and off. It straightens off the deck and gets an inside edge off a tentative defensive push. Single into the off side"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Dhawan,no run,full and creeping in at him, Dhawan adjusts for it as he clips to mid-on. Kept his front foot out of the way of the bat"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Dhawan,1 wide,that could have been a lovely delivery for the right-hander, but it's Dhawan on strike. Back of a length and down leg"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Dhawan,1 run,fullish and on middle, Dhawan pushes to mid-off nicely"}, {"ball": 1.4, "isHighlight": false, "text": "Sajjad Hyder: \"@Satish: Malcom Marshal would be sure to be in my team\""}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Finch,1 leg bye,length ball angled into him a little too much, flicked behind square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Ramesh: \"#Dr.Tam, How about the gentleman called Sir Richard Hadlee, in the 80's team? \""}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Dhawan, $$FOUR$$ ,width on offer and Dhawan has lashed it over the head of cover. Wasn't really all that short but it's a pretty true pitch with the new ball still in operation and the batsman trusted the pace and bounce and hit through the line"}, {"ball": 1.6, "isHighlight": false, "text": "Parnell comes on"}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Finch,1 run,back of a length and on middle and leg, Finch nudges to short fine leg. Parnell goes down in his followthrough, but is brisk in getting back up"}, {"ball": 2.2, "isHighlight": false, "text": "Parnell to Dhawan, $$FOUR$$ ,shortish and just a shade outside off, Dhawan goes back in his crease and punches it in front of point with an open face. Pierces the gap and the timing takes care of the rest"}, {"ball": 2.3, "isHighlight": false, "text": "Parnell to Dhawan,no run,closes the face of the bat too early on this short of a length delivery, gets the leading edge to point"}, {"ball": 2.4, "isHighlight": false, "text": "Parnell to Dhawan,2 runs,full and a little too straight and Dhawan flicks it away to deep square leg. That's the Jayasuriya shot, not quite the same kind of timing this time though"}, {"ball": 2.5, "isHighlight": false, "text": "Parnell to Dhawan,no run,fullish and around off stump, pushes down the ground to mid-off"}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Dhawan,no run,seeks the blockhole and finds it just about, Dhawan digs it out"}, {"ball": 2.6, "isHighlight": false, "text": "SWAPNIL: \"Seems like no one wants Geoffery Boycott in their team ;)\""}, {"ball": 3.1, "isHighlight": false, "text": "Mohammed Shami to Finch, $$FOUR$$ ,he's thrown caution to the winds and his risk comes off. Mid-off was up and he launches the a length ball over his head. Hadn't timed it anywhere near well and the bat face opened on impact too"}, {"ball": 3.2, "isHighlight": false, "text": "Mohammed Shami to Finch,no run,slower short ball and Finch was completely fooled. It was the offcutter and it bounces over the stumps."}, {"ball": 3.3, "isHighlight": false, "text": "Mohammed Shami to Finch,2 runs,goes fuller on off stump, Finch stands and slaps it down the ground. Comes off the bottom the bat a bit which allows long-off to tap it back into the field"}, {"ball": 3.4, "isHighlight": false, "text": "Mohammed Shami to Finch,no run,good length ball just outside off, Finch comes forward and hits it on the up into the covers"}, {"ball": 3.4, "isHighlight": false, "text": "Rakesh Jain: \"@ SWAPNIL : English has a tour scheduled :P , Unavailable for IPL\""}, {"ball": 3.5, "isHighlight": false, "text": "Mohammed Shami to Finch, $$FOUR$$ ,offcutter again but this time it's short and wide. Finch knows there is no third man and cuts it away to the boundary. Simply done"}, {"ball": 3.5, "isHighlight": false, "text": "Fine leg and third man are up"}, {"ball": 3.6, "isHighlight": false, "text": "Mohammed Shami to Finch,no run,back of a length on off stump, Finch guides it to point and has to send his partner back as he sees the fielder race up to the ball"}, {"ball": 3.6, "isHighlight": false, "text": "Karthic: \"Guys...no IPL without Danny M! ;)\""}, {"ball": 3.6, "isHighlight": false, "text": "MAYANK: \"Ravi Shashtri could have played the role of Sir Jadeja ;)\""}, {"ball": 4.1, "isHighlight": false, "text": "Parnell to Dhawan, $$FOUR$$ ,do not bowl there to him. Short and wide and Dhawan lashes it through point. Too well hit for the fielder inside the circle"}, {"ball": 4.2, "isHighlight": false, "text": "Parnell to Dhawan, $$SIX$$ ,that's over the ropes! It was length and sliding down leg, Dhawan was on his front foot and swiveled to help it on it's way."}, {"ball": 4.3, "isHighlight": false, "text": "Parnell to Dhawan, $$FOUR$$ ,one-bounce four behind point! Parnell is offering freebies and the Sunrisers captain is accepting them gleefully. Shorter and wider than the previous one in the over and Dhawan does not hold back with the cut"}, {"ball": 4.4, "isHighlight": false, "text": "Parnell to Dhawan,1 run,he had about three chances and Tiwary has  $$dropped$$ $$it$$  at poiint. Not the best ball, it was inviting the cut again and Dhawan obliges. The fielder has to step to his left and comes just under his chest. But he juggles it and then down it goes"}, {"ball": 4.5, "isHighlight": false, "text": "Parnell to Finch,no run,good length ball on and around middle, Finch is stuck in the crease as he looks to defend"}, {"ball": 4.6, "isHighlight": false, "text": "Parnell to Finch,no run,full toss on leg stump, Finch can't get it past square leg. Lucky escape"}, {"ball": 4.6, "isHighlight": false, "text": "That's 15 off the over and the curse of the dollies continues."}, {"ball": 4.6, "isHighlight": false, "text": "Jaydev Unadkat has been brought on"}, {"ball": 5.1, "isHighlight": false, "text": "Unadkat to Dhawan,1 run,back of a length on off stump, slower than normal, Dhawan punches in front of point for a single"}, {"ball": 5.1, "isHighlight": false, "text": "BabaZandu: \"Tiwary's drop is the first for the day and 14th for the tourney?\" There's been a few, yes"}, {"ball": 5.2, "isHighlight": false, "text": "Unadkat to Finch,1 run,another slower ball, this one pitched up on off stump. Finch defends with an open face and races across to the other end"}, {"ball": 5.3, "isHighlight": false, "text": "Unadkat to Dhawan,no run,skips down the track but Unadkat has pulled all the pace off it and keeps the batsman honest"}, {"ball": 5.3, "isHighlight": false, "text": "Keeper comes up to the stumps"}, {"ball": 5.4, "isHighlight": false, "text": "Unadkat to Dhawan, $$FOUR$$ ,Why are they feeding his strength? Half-tracker with width and Dhawan has thumped it through point to bring up the fifty"}, {"ball": 5.5, "isHighlight": false, "text": "Unadkat to Dhawan,1 run,pushes him back on middle and leg, Dhawan turns it around to fine leg"}, {"ball": 5.6, "isHighlight": false, "text": "Unadkat to Finch,1 run,fullish offcutter on the stumps, Finch drops and runs and that takes us into the time out"}, {"ball": 5.6, "isHighlight": false, "text": "Don: \"Dhawans just been dropped, I guess that means he's gonna score a 100 today then.\""}, {"ball": 5.6, "isHighlight": false, "text": "\"Hyderabadi batsmen need not score highest runs in tournament to wear an orange cap...they are anyways wearing it all the time \" I'm sure that was high on the priorities of the costume designer, Swaroop RSJ. I remember Kochi saying they chose their wardrobe - a mess of orange and purple - because it was a mix of the two caps. Nadeem's back"}, {"ball": 6.1, "isHighlight": false, "text": "Nadeem to Finch,1 run,good length on off stump, he goes back and pushes into the covers"}, {"ball": 6.2, "isHighlight": false, "text": "Nadeem to Dhawan, $$OUT$$ ,he's gone now and Dhawan cannot believe he has top-edged such an innocuous delivery! It was short and sliding well down leg, should have been pummeled over the fine leg boundary but instead big KP runs back and takes a simple grab over his shoulder. That should tell us something about the durability of his hands"}, {"ball": 6.2, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Pietersen$$ $$b$$ $$Nadeem$$ $$33$$ $$(31m$$ $$22b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 6.2, "isHighlight": false, "text": "David Warner is at No.3 and I'm expecting the customary jinx comment"}, {"ball": 6.3, "isHighlight": false, "text": "Nadeem to Warner,no run,shortish and outside off, Warner is back and punches to point"}, {"ball": 6.4, "isHighlight": false, "text": "Nadeem to Warner,no run, $$dropped$$  by DK! It was a massive edge and so a pretty sizeable deflection. The extra bounce from Nadeem doesn't allow for the punch through the covers that Warner was looking for. That needed to have been a reflex catch"}, {"ball": 6.5, "isHighlight": false, "text": "Nadeem to Warner,1 run"}, {"ball": 6.6, "isHighlight": false, "text": "Nadeem to Finch,no run,shortish and outside off, he backs away and cuts through the covers"}, {"ball": 6.6, "isHighlight": false, "text": "Kahrithik: \"S Dhawan c Pietersen b Nadeem J(inxed) Don 33 (22b 5x4 1x6) SR: 150.00 \" And there we go"}, {"ball": 6.6, "isHighlight": false, "text": "KP brings on JP, starts around the wicket"}, {"ball": 7.1, "isHighlight": false, "text": "Duminy to Warner,1 run,flighted into the pads, Warner clips through midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Duminy to Finch,1 run,pushes it through full on middle, but Finch was content on the back foot as he dabs it into the point region"}, {"ball": 7.3, "isHighlight": false, "text": "Duminy to Warner, $$SIX$$ ,whoa! That's emphatic! Chips down the track and drops this into the second tier behind long-on. Reached the pitch and punished it"}, {"ball": 7.3, "isHighlight": false, "text": "long-on is back now"}, {"ball": 7.4, "isHighlight": false, "text": "Duminy to Warner,no run,flighted on off stump, he defends"}, {"ball": 7.5, "isHighlight": false, "text": "Duminy to Warner,1 run,he's scared the bowler into darting a short ball through and he waits on it and pulls to deep midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Duminy to Finch,1 run,good length ball on and around middle, he backs away and punches to long-off"}, {"ball": 7.6, "isHighlight": false, "text": "Sree: \"Tiwary and Karthik drop their catches, and pietersen catches his. Who was that who is playing with an injured hand?\" In DK's defence, that was a very difficult take"}, {"ball": 8.1, "isHighlight": false, "text": "Nadeem to Finch,no run,holds in the pitch a little more as Finch looks to nudge it through midwicket. Lobs up in the air back to the bowler but he can't get around Warner quick enough to have a chance"}, {"ball": 8.2, "isHighlight": false, "text": "Nadeem to Finch,3 runs,shortish and angled into him, Finch moved outside leg and cuts it behind point. Unadkat was the sweeper and he pulls it back right on the boundary"}, {"ball": 8.3, "isHighlight": false, "text": "Nadeem to Warner,no run,shortish and on middle, Warner exhibits a short-armed pull to square leg"}, {"ball": 8.4, "isHighlight": false, "text": "Nadeem to Warner,no run,pushed through short and on off stump, Warner punches towards extra"}, {"ball": 8.5, "isHighlight": false, "text": "Nadeem to Warner,1 run,he waits a little longer and cuts it dead square to the fielder in the deep"}, {"ball": 8.6, "isHighlight": false, "text": "Nadeem to Finch,1 run,that's been powerfully pulled but Duminy at deep midwicket is a more than handy fielder. Nadeem is not offering anything in the half of the batsman"}, {"ball": 8.6, "isHighlight": false, "text": "stays around to the right-hander"}, {"ball": 9.1, "isHighlight": false, "text": "Duminy to Finch,no run,flighted on leg stump, he skips down the track but gets struck on the pads as he was looking to flick"}, {"ball": 9.2, "isHighlight": false, "text": "Duminy to Finch,1 run,cut away to the sweeper as this was flat and on off stump"}, {"ball": 9.3, "isHighlight": false, "text": "Duminy to Warner,1 run,goes back and works it a little wide of where mid-on would have been. JP has to do the fielding himself"}, {"ball": 9.4, "isHighlight": false, "text": "Duminy to Finch, $$SIX$$ ,I've seen him do that a couple of times. The bowler saw him making room outside leg and fired it wide outside off. But Finch reaches out, the bottom hand comes off the bat and yet he blasts it over extra cover"}, {"ball": 9.5, "isHighlight": false, "text": "Duminy to Finch,1 run,pushed through on middle and leg, nudged away sqyuare"}, {"ball": 9.6, "isHighlight": false, "text": "Duminy to Warner,no run,a little more pitched up on leg stump, Warner blocks"}, {"ball": 9.6, "isHighlight": false, "text": "Yuva Krishna: \"When you look at the Batting and Bowling Line up of Hyderbad..You can keep guessing why they didnt click in the last two matches! Im surely seeing it as a comeback match for them. Explosive batsmen and perfect combination of bowlers.. Why they are in last place??????\""}, {"ball": 9.6, "isHighlight": false, "text": "Tushar: \"Hayden was a chef outside the cricket field, Finch is probably a butcher\" Unadkat's changes of pace has been trusted now"}, {"ball": 10.1, "isHighlight": false, "text": "Unadkat to Finch,1 run,good length ball on off stump, steered down to short third man"}, {"ball": 10.2, "isHighlight": false, "text": "Unadkat to Warner,1 run,down the track and pushed down to long-off"}, {"ball": 10.3, "isHighlight": false, "text": "Unadkat to Finch,1 run,slower ball on off stump, Finch dabs it in front of point and his Australia opening partner was wise to the single"}, {"ball": 10.4, "isHighlight": false, "text": "Unadkat to Warner,no run,cramped for room as he tucks the back of a length ball to midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Midwicket goes back"}, {"ball": 10.5, "isHighlight": false, "text": "Unadkat to Warner,no run,just a little more bounce than Warner thought. He was on the front foot and looking to lash it through the covers but is beaten"}, {"ball": 10.6, "isHighlight": false, "text": "Unadkat to Warner,1 run,another slower ball, on a good length on middle and leg. Warner pushes it down to long-on"}, {"ball": 10.6, "isHighlight": false, "text": "Dishant: \"The way it is going till now this IPL,Delhi are the top contenders to be \"Pune of the year\" this season.\" They're not really ready for that compliment. Shami's back and is searching for wickets"}, {"ball": 11.1, "isHighlight": false, "text": "Mohammed Shami to Warner,1 run,full offcutter on leg stump, Warner finds long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Mohammed Shami to Finch,1 run,full and tailing in on leg, Finch flicks it to deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Mohammed Shami to Warner,1 run,he was walking down the pitch, but Shami bangs it in short. Warner adjusts and unleashes a pull to deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Raghav: \"@Yuva SRH have been sandwiching a mediocre Indian lineup in between some quality players\""}, {"ball": 11.4, "isHighlight": false, "text": "Mohammed Shami to Finch,no run,it's the offcutter again, dug in short. Finch has to wait and even when he pulls he can't beat short fine leg"}, {"ball": 11.5, "isHighlight": false, "text": "Mohammed Shami to Finch,1 run,full and just outside off, Finch clears his front leg and drills into the covers"}, {"ball": 11.6, "isHighlight": false, "text": "Mohammed Shami to Warner,1 run,fullish and on leg stump, Warner keeps his front leg out of the way and slaps it down to long-on. Right off the bottom of the bat"}, {"ball": 11.6, "isHighlight": false, "text": "Laxmi Shukla's first go in this IPL"}, {"ball": 12.1, "isHighlight": false, "text": "Shukla to Warner,no run,good length and on middle and off, Warner stays back and steers it to point"}, {"ball": 12.2, "isHighlight": false, "text": "Shukla to Warner,2 runs,shortish but Warner has to wait ages for it to reach him, pulls to deep midwicket and they scamper across for a well-run couple"}, {"ball": 12.3, "isHighlight": false, "text": "Shukla to Warner,no run,fullish and outside off, Warner can't beat point again"}, {"ball": 12.4, "isHighlight": false, "text": "Shukla to Warner,no run,full and on the pads, Warner can't pick it away"}, {"ball": 12.4, "isHighlight": false, "text": "Srikanth: \"I would like to see Switch hit of warner & Kevin pietersen on the same match. Hope it will happends today.\""}, {"ball": 12.5, "isHighlight": false, "text": "Shukla to Warner,no run,he's keeping things tight here. Warner wants to break free as he backs away to cut the slower, length ball. Point is in the way again"}, {"ball": 12.6, "isHighlight": false, "text": "Shukla to Warner,no run,gets this into the blockhole on off stump, Warner pushes to mid-off. That's an excellent start from Shukla, only two off the over. Warner is 18 off 25. He's frustrated and shows it by tossing his gloves away in disgust"}, {"ball": 13.1, "isHighlight": false, "text": "Parnell to Finch,no run,fullish on off stump, Finch dabs behind point. Pace off the ball is not allowing the batsmen to time the ball"}, {"ball": 13.2, "isHighlight": false, "text": "Parnell to Finch,1 run,backs away and cuts into the covers. Off the bottom of the bat again, despite this being a little short and he'd manufactured some room"}, {"ball": 13.2, "isHighlight": false, "text": "Kapil: \"Not at all smart from Warner really. Struggling here, why not take a 1 and give it to Finch? Looking to smash everything around\""}, {"ball": 13.3, "isHighlight": false, "text": "Parnell to Warner,1 leg bye,he walks at him and gets struck flush on the pads. It was a full toss tailing in. Warner goes for the flick but can't connect. Another opportunity missed"}, {"ball": 13.4, "isHighlight": false, "text": "Parnell to Finch,1 run,full on off stump, Finch drills it down the ground to long-off"}, {"ball": 13.5, "isHighlight": false, "text": "Parnell to Warner,no run,low full toss outside off, Warner bunts it to short cover"}, {"ball": 13.5, "isHighlight": false, "text": "Anish Venkata: \"@Raghav: Mediocre? Are you serious? KL Rahul is a budding youngster who is a future probable member in Indian team. Venu experience in domestic has been abundance. Mishra and Bhuvi are of international repute bowlers. Perhaps, you are being too harsh here.\""}, {"ball": 13.6, "isHighlight": false, "text": "Parnell to Warner, $$FOUR$$ ,miss it once, my fault. Tempt me again, I'll whack you to the square leg boundary. Full toss angling into the pads, Warner finds release with an efficient flick. Time out now"}, {"ball": 13.6, "isHighlight": false, "text": "Anil: \"SRH lost the momentum. The explosive line up is kept quiet. Need to score atleast 160 to make it a contest.\" They do have Darren Sammy waiting in the dug-out. LRS to continue"}, {"ball": 14.1, "isHighlight": false, "text": "Shukla to Finch,2 runs,full and outside off, Finch has laced it wide of long-off for a couple."}, {"ball": 14.2, "isHighlight": false, "text": "Shukla to Finch, $$SIX$$ ,slower ball, picked up and hoisted over long-on. Bent his knees and slogged it away cleanly"}, {"ball": 14.3, "isHighlight": false, "text": "Shukla to Finch, $$FOUR$$ ,and he celebrates that stroke with a bit of cheek. It was shortish and on off stump, Finch waited and waited and chopped it so fine to the third man boundary. That's his fifty"}, {"ball": 14.4, "isHighlight": false, "text": "Shukla to Finch, $$FOUR$$ ,that's the best of the lot! Overpitched outside off and Finch has come down on it with a straight bat and blitzed it through the covers. Just skims away"}, {"ball": 14.5, "isHighlight": false, "text": "Shukla to Finch,1 run,slower ball on and around off stump, Finch dabs it to third man"}, {"ball": 14.6, "isHighlight": false, "text": "Shukla to Warner,2 runs,shortish and outside off, Warner clears his front leg and forehands it down to long-on who has to dive to his right"}, {"ball": 14.6, "isHighlight": false, "text": "Manoj: \"So far in the tournament...its no a great tournament for many Left Handed batters and renowned players like...Gambhir,Mike Hussey, Yuvraj, Warner,Dhawan, Corey Anderson...!! Gayle is yet to prove his fitness...!!\""}, {"ball": 14.6, "isHighlight": false, "text": "Parnell in his final over"}, {"ball": 15.1, "isHighlight": false, "text": "Parnell to Finch,1 run,affords no room with a length ball on leg stump, Finch opens the face to pick up a single into the covers"}, {"ball": 15.2, "isHighlight": false, "text": "Parnell to Warner,2 runs,full toss outside off, Warner lashes it through the covers but there is protection in the deep. The yorkers aren't coming out right for him"}, {"ball": 15.3, "isHighlight": false, "text": "Parnell to Warner,1 run,length and outside off, Warner clears his front leg and thumps it down to long-off"}, {"ball": 15.4, "isHighlight": false, "text": "Parnell to Finch,1 run,low full toss outside off, pushed down to long-off"}, {"ball": 15.4, "isHighlight": false, "text": "Abhishek Ranjan: \"@Anil:your comment acted like a catalyst to set SRH going. :D\""}, {"ball": 15.5, "isHighlight": false, "text": "Parnell to Warner, $$FOUR$$ ,Duminy tries at long-on, rushes to his left and pulls out a desparing dive but this was always heading for the boundary. Full toss in the hitting arc and Warner has dismissed it"}, {"ball": 15.6, "isHighlight": false, "text": "Parnell to Warner,1 run,he's miscued this. It was fullish and outside off, he had got into the shot too early and it ends up a difficult skier around the point region. Tiwary is the man under it but he does not look any degree of comfortable. He had passed it and then has to reaches out with his hands and spills it. That's his second drop"}, {"ball": 15.6, "isHighlight": false, "text": "Nadeem again"}, {"ball": 16.1, "isHighlight": false, "text": "Nadeem to Warner,1 run,finds the blockhole first up on leg stump, dug out to long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Nadeem to Finch,1 run,well bowled this, fired in on the base of middle and keeps Finch to a single into extra cover"}, {"ball": 16.3, "isHighlight": false, "text": "Nadeem to Warner, $$SIX$$ ,this time he misses his length and Warner has swept him mightily into the stands behind square leg. Sunk down into his knees and swung the arms quite freely. That was massive"}, {"ball": 16.4, "isHighlight": false, "text": "Nadeem to Warner,1 run,pushed to long-off as Nadeem hits the yorker perfect this time"}, {"ball": 16.5, "isHighlight": false, "text": "Nadeem to Finch,no run,he's pulling the over back big time. Finch was setting up outside leg and he followed him with a very full delivery. Goes for the sweep but is a little slow on it"}, {"ball": 16.6, "isHighlight": false, "text": "Nadeem to Finch,2 runs,fired in full as he follows the batsman darting outside leg. Finch's footwork this time is good enough to smash it down the ground. Duminy does extremely well at long-on to keep that to two. It was hit very powerfully"}, {"ball": 16.6, "isHighlight": false, "text": "Jaydev Unadkat readies himself for the death overs"}, {"ball": 17.1, "isHighlight": false, "text": "Unadkat to Warner,2 runs,slower ball, dug in short on leg stump. Warner pulls to deep square leg and he decides on a second and makes it rather easily in the end. The throw was a little wayward and though he had slipped a little, Warner is quick enough to be safe"}, {"ball": 17.2, "isHighlight": false, "text": "Unadkat to Warner,1 run,bottom hand comes off the bat as he looks to tear the leather off the ball. Shortish and angled in on off stump, a little too close for the pull and it was the change of pace again"}, {"ball": 17.3, "isHighlight": false, "text": "Unadkat to Finch, $$FOUR$$ ,saw the batsman making room and slips in a slower ball, Finch adjusts well enough and helps it away to the fine leg boundary"}, {"ball": 17.4, "isHighlight": false, "text": "Unadkat to Finch, $$FOUR$$ ,told you he's good at that! Unadkat goes offside as he sees Finch making room, but he flays his bat at the ball and though one of his hands comes off the bat, it is sliced to the point boundary"}, {"ball": 17.5, "isHighlight": false, "text": "Unadkat to Finch, $$FOUR$$ ,the slower ball goes short and Finch has mauled it to the midwicket boundary. Looks like they wont need Sammy today"}, {"ball": 17.6, "isHighlight": false, "text": "Unadkat to Finch, $$SIX$$ ,low full toss outside off, Finch does what he has been doing so often. Backs away and hammers it over the boundary. This time the crowd over extra cover scurries to return the ball"}, {"ball": 17.6, "isHighlight": false, "text": "Raul: \"A perfect time for Warner to get out and give Sammy the last 3 overs and be the Hero...!!! Jinx\""}, {"ball": 17.6, "isHighlight": false, "text": "Shami revs up"}, {"ball": 18.1, "isHighlight": false, "text": "Mohammed Shami to Warner, $$SIX$$ , $$switch$$ $$hit$$ $$warning$$ ! This was a low full toss on off stump, Warner changed his grip and swept it right-handed over short fine leg, which was short third man until a second ago"}, {"ball": 18.2, "isHighlight": false, "text": "Mohammed Shami to Warner,1 run,finds the yorker just outside off and Warner slaps it down the ground for his fifty"}, {"ball": 18.3, "isHighlight": false, "text": "Mohammed Shami to Finch,1 run,searing yorker on middle and leg, Finch inside edges it to his pads and rotates strike"}, {"ball": 18.4, "isHighlight": false, "text": "Mohammed Shami to Warner,2 runs,moves outside leg and carves a low full toss to the sweeper, who fumbles and allows for the second. Shukla was the man there"}, {"ball": 18.5, "isHighlight": false, "text": "Mohammed Shami to Warner,no run,it came off once, but this time the ball sneaks through his legs while he was looking to slog sweep as a right hander. So switch hit tally, one six. one dot"}, {"ball": 18.6, "isHighlight": false, "text": "Mohammed Shami to Warner, $$FOUR$$ ,skips down the ground and belts the full toss down the ground. Murderous hit from Warner"}, {"ball": 18.6, "isHighlight": false, "text": "Manoj: \"@srikanth: Half your switch hitting wish got completed with warner hitting shami for a Six...look out for KP in the 2nd innings...!!\""}, {"ball": 18.6, "isHighlight": false, "text": "Arpit Jain: \"Warner -Finch on for killing....seems like unadkat was preparing for the end and not the end overs\" Last five overs 75 runs and no wickets"}, {"ball": 19.1, "isHighlight": false, "text": "Unadkat to Finch,1 run,finds the yorker as he follows the batsman making room, single down to long-on"}, {"ball": 19.2, "isHighlight": false, "text": "Unadkat to Warner,1 run,skips down the track and turns it into a yorker, flicks it away to deep midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Unadkat to Finch,1 run,that's the slower ball, dragged down short. Finch heaves it down to deep midwicket as well"}, {"ball": 19.4, "isHighlight": false, "text": "Unadkat to Warner,1 run,that's good work from Unadkat. Sends down a yorker that tails in at him while Warner was moving outside leg. Flicked into the leg side again"}, {"ball": 19.5, "isHighlight": false, "text": "Unadkat to Finch,no run,backs away and Unadkat fires it wide outside off, it's too far away for Finch to connect and just inside the wide line too. This has been a brilliant final over"}, {"ball": 19.6, "isHighlight": false, "text": "Unadkat to Finch, $$SIX$$ ,oops! The yorker ends up a full toss and Finch has mauled it over cow corner. Pulls off his helmet and has the look of a man satisfied with his work. Unadkat looks heartbroken with the mistake."}, {"ball": 19.6, "isHighlight": false, "text": "$$4.00$$ $$pm$$  Sunrisers have posted their highest ever total in IPL cricket. And finally their vaunted top-order comes to the party. Finch and Warner stuck it out when the runs were hard to come by and then decided to push the pedal. They moved around in the crease, they trusted their considerable hitting power and have posted a pretty difficult total. Join us in a few minutes to see if KP and the Delhi boys can chase it down"}, {"ball": 19.6, "isHighlight": false, "text": "Raja: \"Some one told SRH lost momentum.... by the end of 13th over. At that time SRH's total is 100 odd runs. they have made 80 or more runs in the last 6. they are aussie players they know how to play at death. :)\""}, {"ball": 19.6, "isHighlight": false, "text": "Karthick: \"That last six from Finch,Is that a missile????\""}, {"ball": 19.6, "isHighlight": false, "text": "Sharma: \"As an Aussie fan, watching this IPL has been a bit bittersweet...why oh why, could the Aussies not pretend the World T20 was the IPL and perform like this?!\""}], "name": "Sunrisers Hyderabad v Delhi Daredevils", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729301.html?innings=1;view=commentary", "match_num": 12}