{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.15$$ $$pm$$  The players are out the middle. M Vijay and Quinton de Kock are the openers. Bhuvi has the ball in hand, has a slip in place"}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to de Kock,1 run,nice length and teasing just outside off. De Kock gets a thick outside edge to deep third man"}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Vijay,no run,the away shape has Vijay worried. He was looking to defend first, then wants to pull his bat away and ends up under edging it to the keeper"}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Vijay,no run,just short of a good length on off stump, Vijay blocks"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Vijay,1 run,comes forward and works it to the left of midwicket. Tight single, but well done in the end"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to de Kock,1 wide,goes full and a little too wide outside off, De Kock doesn't bother with it"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to de Kock,1 run,back of a length and outside off, De Kock taps to point and seeks a single. But Vijay is wary of Warner in that region. Sends him back but the overthrow allows the score to tick"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Vijay,no run,back of a length and outside off, Vijay presents an open face to point"}, {"ball": 0.6, "isHighlight": false, "text": "Dharma: \"Only 4 bowlers for SRH? i feel SRH are a bowler short. Now Sammy has to bowl 4 overs, since there are no part timers.\""}, {"ball": 0.6, "isHighlight": false, "text": "Dale Steyn stares down at his country mate De Kock"}, {"ball": 1.1, "isHighlight": false, "text": "Steyn to de Kock, $$FOUR$$ ,how bout that. It's length on middle and leg and he's slapped it down the ground. Came back at the bowler uppishly but it was struck too well for Steyn to have a chance"}, {"ball": 1.2, "isHighlight": false, "text": "Steyn to de Kock,1 run,back of a length and keeping him tucked up on middle, De Kock works it down to short fine leg"}, {"ball": 1.3, "isHighlight": false, "text": "Steyn to Vijay,no run,a little away shape outside off, Vijay is squared up as he blocks into the covers"}, {"ball": 1.4, "isHighlight": false, "text": "Steyn to Vijay,1 run,fullish and outside off, Vijay eases it to the left of mid-off and he sets off for a single. Steyn was moving to back up and in the process cuts Vijay's path and had that hit direct he would have been out. They shake hands after though, so no harm done"}, {"ball": 1.5, "isHighlight": false, "text": "Steyn to de Kock,1 run,gets a thick outside edge that wanders off to deep third man, away swing off the fuller delivery"}, {"ball": 1.6, "isHighlight": false, "text": "Steyn to Vijay,1 leg bye,back of a length and he's beaten for pace as he looks to flick. De Kock pulls him through for the single as the ball lobs over to point"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Vijay,no run,just back of a good length on off stump, Vijay is kept to a block down the pitch"}, {"ball": 2.1, "isHighlight": false, "text": "aditya b: \"What an opportunity for Pietersen to score a 80-85 not out and win this match and start his free-lancing career in a bang.. I m sure there will few English players ppl watching this match with a lot of interest\""}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Vijay, $$FOUR$$ ,he's good down the ground and this was in the slot. Length with a bit of room to free the arms and Vijay has launched it towards the sightscreen. Quite elegant"}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Vijay,1 run,back of a length and on the body, Vijay works it behind square leg"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to de Kock,1 run,shortish and just outside off, De Kock drops and runs to point but I suspect had Warner's underarmed throw hit he would have been short. Dived and threw in one action, that's wonderful work"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Vijay,2 runs,excellent hands from Vijay. Took it from middle and a wristy flick later the ball was skimming down to the square leg boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to Vijay,no run,length ball outside off, he looks to cart it over midwicket but miscues it"}, {"ball": 2.6, "isHighlight": false, "text": "Ananya: \"Both Vijay and De Kock are due for a big score.... if they chose this day, then DD will have their day. (Hope I am not jinxing)\""}, {"ball": 2.6, "isHighlight": false, "text": "Harlequin: \"@aditya - or a lot of England players hoping he fails. Knowing KP he will score a middling 25 off 18 balls and infuriate everyone\" Venu Rao with his offbreaks"}, {"ball": 3.1, "isHighlight": false, "text": "Venugopal Rao to de Kock,1 run,flighted on leg stump, worked away to the left of mid-on"}, {"ball": 3.2, "isHighlight": false, "text": "Venugopal Rao to Vijay,no run,moves outside leg and creams this flighted ball to mid-off"}, {"ball": 3.3, "isHighlight": false, "text": "Venugopal Rao to Vijay,1 run,this is on a good length and is picked away in front of midwicket. Warner scurries in from deep midwicket and keeps it to a single. That's incredibly good fielding"}, {"ball": 3.4, "isHighlight": false, "text": "Venugopal Rao to de Kock,1 run,tries to open up the off side by making room for himself, but Venu follows him. Cut through point"}, {"ball": 3.5, "isHighlight": false, "text": "Venugopal Rao to Vijay,2 runs,skips down the track and gets a thick leading edge that lobs point and short third man."}, {"ball": 3.6, "isHighlight": false, "text": "Venugopal Rao to Vijay, $$FOUR$$ ,times this to perfection. He backed away and that helped him gain enough room to hoist it over extra cover."}, {"ball": 3.6, "isHighlight": false, "text": "sudha: \"@aditya b: Do you think it is going to be such an easy, coming from some Injury and playing his first match in this IPL, and captioning the side, need to prove his eng team...to-many odds..any odd can dominate him and cause the damage..I feel..."}, {"ball": 4.1, "isHighlight": false, "text": "Steyn to de Kock,1 run,shortish on middle, De Kock taps it behind point"}, {"ball": 4.2, "isHighlight": false, "text": "Steyn to Vijay,no run,shortish and outside off, he steers it to point and forgets it's Warner down there. Swoops on the ball and forces Vijay to back track."}, {"ball": 4.3, "isHighlight": false, "text": "Steyn to Vijay,no run,shortish on middle, Vijay was looking for it to be a little more shorter and gets a bit of leading edge. Doesn't carry to the bowler"}, {"ball": 4.4, "isHighlight": false, "text": "Steyn to Vijay,1 run,shortish and angled into the pads, flicked into midwicket"}, {"ball": 4.5, "isHighlight": false, "text": "Steyn to de Kock,no run,not quite short enough to cut there. Cross-seamer doesn't rise as high and sneaks under the bat. Steyn flashes a smirk at de Kock"}, {"ball": 4.6, "isHighlight": false, "text": "Steyn to de Kock, $$SIX$$ ,he won't be smiling after this. It was full on off stump but De Kock had moved across and flicked it to the long leg boundary. Looked completely at ease playing that"}, {"ball": 4.6, "isHighlight": false, "text": "Karn Sharma's leg spin now"}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Vijay,1 run,nice and tight on leg stump, Vijay picks it away to deep midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to de Kock, $$FOUR$$ ,he was afraid of the batsman charging him and pushes this through short and flat. De Kock though was happily waiting on the back foot and pulls it one-bounce to the square leg boundary"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to de Kock,1 run,think this was the googly, nicely tossed up outside off and De Kock opens the face and picks up a single towards point. Soft hands"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Vijay,no run,flat on middle and Vijay was backing away and cuts to cover"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Vijay,1 wide,this one drifts down the pads, Vijay was looking to collect an easy boundary to fine leg but it was too far to reach"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Vijay,no run,that's more like it. Tossed it up on off stump and keeps the batsman to a defensive"}, {"ball": 5.5, "isHighlight": false, "text": "Prakash: \"that was the first dot ball fIor De Kock. At its pretty important not to have too many dot balls, RCB would have managed to cross the line if Yuvi had not wasted so many dot balls yesterday.\""}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Vijay,no run,slower through the air and flighted on off stump, Vijay comes forward and blocks with an open face"}, {"ball": 5.6, "isHighlight": false, "text": "Senthil : \"Murali Vijay in IPL is a disaster in majority but every season he comes with a knock that wins the game single handedly. CSK used to wait a whole season for that innings how patient are DD? Will it be today for Vijay?\" Darren Sammy comes on"}, {"ball": 6.1, "isHighlight": false, "text": "Sammy to de Kock, $$FOUR$$ ,presents a short one and he's slapped it behind point. It was pretty much the diet Dhawan was given and now Daredevils are getting their fill of it"}, {"ball": 6.1, "isHighlight": false, "text": "Keeper's been standing up and Sammy goes around the wicket"}, {"ball": 6.2, "isHighlight": false, "text": "Sammy to de Kock,no run,shortish and outside off, cut towards point"}, {"ball": 6.3, "isHighlight": false, "text": "Sammy to de Kock,no run,slower ball fools him this time. Full and outside off, he moved to leg and looked to blast it away through extra, gets an inside edge that wanders towards short fine leg"}, {"ball": 6.4, "isHighlight": false, "text": "Sammy to de Kock, $$FOUR$$ ,oh, terrible work from Rao at short fine leg. This was a slow, low full toss which he sweeps. Comes at a lovely bounce to the fielder but he was getting ready to throw before he had control of the ball. Boundary gifted"}, {"ball": 6.5, "isHighlight": false, "text": "Sammy to de Kock,1 run,full and on middle and leg, De Kock works it to deep micdwicket"}, {"ball": 6.6, "isHighlight": false, "text": "Sammy to Vijay, $$FOUR$$ ,walks across and whips it to the left of short fine leg. Sammy's leisurely pace is working for Daredevils here."}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to de Kock,1 run,flighted on off stump, De Kock goes back and works through midwicket."}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Vijay,1 run,they've decided to play him off the back foot. This was on a fullish length on off stump, punched down to long-on"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to de Kock, $$FOUR$$ ,tossed up just outside off, De Kock pulls out a reverse swat and beats short third man. Daredevils' change is paying rich dividends here"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to de Kock,1 run,tossed up outside off, stands deep in the crease and carves it to deep point"}, {"ball": 7.4, "isHighlight": false, "text": "LeO: \"Ross Taylor misses out and de Kock secures a place for this IPL. \""}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Vijay,1 run,teases him with flight outside off, Vijay hammers it down to long-off"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to de Kock, $$FOUR$$ ,slog swept and no one is stopping that. This was flighted on off stump but he shuffles across and connects with elan. That's the time out"}, {"ball": 7.6, "isHighlight": false, "text": "Afzal: \"Playe first 3 games with extra bowler and batting collapse.And today played with exta batsman. Now bowlers choking... Dhawan learning lot of things...\" Here's Amit Mishra, who seems to be SRH's best hope right now"}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to Vijay,no run,lovely flight just outside off, Vijay comes forward and blocks"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to Vijay,1 run,swept off a good length but there is protection at deep square leg"}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to de Kock,no run,flighted outside off, driven into the covers"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to de Kock,1 run,loopy delivery on leg stump, think that was the googly. De Kock clips to long-on"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Vijay,1 run,this was seam-up and bowled from wide of the crease, Vijay lofts it down to long-off"}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to de Kock,no run,there's the googly, spins away from De Kock's cut shot and he's not pleased that it wasn't a wide. Tight call that"}, {"ball": 8.6, "isHighlight": false, "text": "Mudit: \"Vijay taking too many balls (50% dot balls) to make runs .. for a team chasing with over 9rpo its suicidal .. \" here's Bhuvi again"}, {"ball": 9.1, "isHighlight": false, "text": "Kumar to Vijay,no run,that's a lovely ball. Makes Vijay waft at an outswinger pitched on a good length and in the corridor. Soundly beaten"}, {"ball": 9.2, "isHighlight": false, "text": "Kumar to Vijay, $$FOUR$$ ,digs it in quite short and Vijay is late on the hook. Gets a top edge that just about evades the keeper"}, {"ball": 9.3, "isHighlight": false, "text": "Kumar to Vijay,1 run,back of a length and it holds in the pitch a bit, Vijay pushes it down the ground for a well-judged single"}, {"ball": 9.4, "isHighlight": false, "text": "Kumar to de Kock,1 run,full and in the block hole, De Kock sets up for the slog but can't get under it enough. Inside edges to short fine leg"}, {"ball": 9.5, "isHighlight": false, "text": "Kumar to Vijay, $$FOUR$$ ,stand and delivery. It was length on off stump and Vijay has smashed it wide of midwicket. That bottom hand has loads of power"}, {"ball": 9.6, "isHighlight": false, "text": "Kumar to Vijay, $$FOUR$$ ,straight of midwicket again and its the same pick up shot. Back of a length and just outside off, he is well balanced in the crease and finds the boundary"}, {"ball": 10.1, "isHighlight": false, "text": "Mishra to de Kock,1 run,picked the googly by the line of the ball on leg stump, clips the good length ball through to deep midwicket"}, {"ball": 10.2, "isHighlight": false, "text": "Mishra to Vijay, $$SIX$$ ,he's getting it off the middle now. This was tossed up amply on middle, Vijay steps out a touch and stays leg side of the ball to ease this over the ropes at extra cover. Pure class"}, {"ball": 10.3, "isHighlight": false, "text": "Mishra to Vijay,1 run,flatter now and tucking him up on middle, worked away through midwikcet"}, {"ball": 10.4, "isHighlight": false, "text": "Mishra to de Kock,1 run,he saw the batsman setting up for the reverse sweep and goes for the seam-up yorker. De Kock still manages to lace it to point"}, {"ball": 10.5, "isHighlight": false, "text": "Mishra to Vijay,1 run,on a good length and Vijay nudges it to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Mishra to de Kock,2 runs,flighted just outside off, but De Kock waits in the crease and cuts to the man in the deep"}, {"ball": 10.6, "isHighlight": false, "text": "BILLA: \"89 off the last nine... with 10 wickets in hand... DD can take it as a 10 over game and win it comfortably \""}, {"ball": 10.6, "isHighlight": false, "text": "Sahil: \"I just dont get it why Rasool is warming the bench! SRH should pick Irfan and Rasool in playing eleven which gives them some depth in batting and bowling options as well. As good as Venugopal might be in first class cricket, he is not suited to the shortest format of the game.\" Karn Sharma's back"}, {"ball": 11.1, "isHighlight": false, "text": "Sharma to Vijay,1 run,flat delivery on middle, Vijay pulls to deep midwicket"}, {"ball": 11.1, "isHighlight": false, "text": "Vikas: \"Hey... I just went to get coffee from the kitchen, how is Vijay ahead of De Kock? \""}, {"ball": 11.2, "isHighlight": false, "text": "Sharma to de Kock, $$OUT$$ ,tossed up on off stump, De Kock goes for the slog sweep. This has gained considerable height but there is a man in the deep. Aaron Finch camps under it and holds on to a simple chance. Touches gloves with his partner as he walks back"}, {"ball": 11.2, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$c$$ $$Finch$$ $$b$$ $$Sharma$$ $$48$$ $$(47m$$ $$30b$$ $$6x4$$ $$1x6)$$ $$SR:$$ $$160.00$$"}, {"ball": 11.2, "isHighlight": false, "text": "KP strides out to bat, lets see what the big man has in store"}, {"ball": 11.3, "isHighlight": false, "text": "Sharma to Pietersen,no run,lunges forward to block the flighted legspinner outside off"}, {"ball": 11.4, "isHighlight": false, "text": "Sharma to Pietersen,no run,a couple of steps down the track to smother the spin on this tossed up delivery and block into the on side"}, {"ball": 11.5, "isHighlight": false, "text": "Sharma to Pietersen,no run,squares him up on off stump with one that is flat and pushed through on off stump"}, {"ball": 11.6, "isHighlight": false, "text": "Sharma to Pietersen,no run,this one grips the pitch and turns across him to hit his back thigh. Mild appeal but this was way too high"}, {"ball": 11.6, "isHighlight": false, "text": "Anil Raj: \"DD should have kept Left- Right combination. They should have sent in Duminy now who is in good form.\" Darren Sammy returns"}, {"ball": 12.1, "isHighlight": false, "text": "Sammy to Vijay, $$FOUR$$ ,bit more bounce on this and he gets a thick outside edge that sails away to the third man boundary to bring up his fifty. Subdued celebrations though"}, {"ball": 12.2, "isHighlight": false, "text": "Sammy to Vijay, $$OUT$$ ,overpitched just outside off, Vijay gets under it but hasn't gotten the elevation. Hits it hard and flat and straight into the hands of Steyn at long-on. SRH fighting back"}, {"ball": 12.2, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$Steyn$$ $$b$$ $$Sammy$$ $$52$$ $$(52m$$ $$40b$$ $$7x4$$ $$1x6)$$ $$SR:$$ $$130.00$$"}, {"ball": 12.3, "isHighlight": false, "text": "Sammy to Karthik,2 runs,full and wide, DK eases it to the right of a diving point. Gorgeous stroke"}, {"ball": 12.4, "isHighlight": false, "text": "Sammy to Karthik,no run,slower ball, into the block hole. DK punches it down the ground but Sammy's reach is long enough to pull it down"}, {"ball": 12.5, "isHighlight": false, "text": "Sammy to Karthik, $$FOUR$$ ,reverse swept off the back of the bat! Good length ball, he stretches forward and just helps it on its way."}, {"ball": 12.6, "isHighlight": false, "text": "Sammy to Karthik,1 run,fullish on the stumps, flicked away through midwicket"}, {"ball": 13.1, "isHighlight": false, "text": "Sharma to Karthik,1 run,tossed up on off stump, Karn slips in his followthrough and that's a single down to long-off"}, {"ball": 13.2, "isHighlight": false, "text": "Sharma to Pietersen,1 run,drilled into the covers to get off the mark. Loads of power in the stroke as he stays leg side and punches the flighted ball"}, {"ball": 13.3, "isHighlight": false, "text": "Sharma to Karthik,no run,good turn there for Karn. Drifts it in on middle and enjoys some help from the pitch as it rips right across his outside edge"}, {"ball": 13.4, "isHighlight": false, "text": "Sharma to Karthik,1 run,just a little short and DK cuts behind square. There is a sweeper out there though"}, {"ball": 13.5, "isHighlight": false, "text": "Sharma to Pietersen,1 leg bye,drifting in on middle and leg, KP looks to whip it away down leg but doesn't connect as well as he'd like"}, {"ball": 13.6, "isHighlight": false, "text": "Sharma to Karthik,no run,skips down the track but can't beat Dhawan at extra cover. Crowd thinks it's a catch and goes up,"}, {"ball": 13.6, "isHighlight": false, "text": "SriniDasari: \"Karthik oozing with confidence? I haven't seen a reverse being played so cool...to a medium pace bowler. \""}, {"ball": 13.6, "isHighlight": false, "text": "shushank : \"Rs 21.5 crores batting here, an easy win on the cards... :p\""}, {"ball": 14.1, "isHighlight": false, "text": "Mishra to Pietersen,no run,comes down the track but Mishi's pulled the length back and KP has to block"}, {"ball": 14.2, "isHighlight": false, "text": "Mishra to Pietersen,no run,leading edge, but it doesn't carry to the bowler. This was drifted into the pads and he closed the face a little too early in his search for midwicket"}, {"ball": 14.3, "isHighlight": false, "text": "Mishra to Pietersen,1 run,good length ball, turns the other way as he clips through midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Mishra to Karthik,1 run,tossed up outside off, DK moves across and sweeps to deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Mishra to Pietersen,1 run,low full toss on off stump, pushed down the ground for a single"}, {"ball": 14.6, "isHighlight": false, "text": "Mishra to Karthik,2 runs,he's been doing this a lot. Bowls with the seam up and ends up a low full toss which is driven through to deep extra cover"}, {"ball": 14.6, "isHighlight": false, "text": "$$Do$$ $$send$$ $$in$$ $$your$$ $$questions$$ $$for$$ $$the$$ $$Huddle$$ $$and$$ $$the$$ $$best$$ $$ones$$ $$will$$ $$feature$$ $$on$$ $$the$$ $$show.$$  Darren Sammy, with the keeper up"}, {"ball": 14.6, "isHighlight": false, "text": "imran: \"Can somebody remind KP its T20 not Test match???????\""}, {"ball": 15.1, "isHighlight": false, "text": "Sammy to Pietersen,1 run,low full toss, KP punches it down the ground"}, {"ball": 15.2, "isHighlight": false, "text": "Sammy to Karthik,1 run,slower ball on middle, DK shuffles across and laps it. Doesn't bother keeping it down and it wasn't too far away from Rao who was running in from long leg"}, {"ball": 15.3, "isHighlight": false, "text": "Sammy to Pietersen,no run,deceived by the offcutter. It was length too and in the slot to be smacked over the top but KP's swing misses"}, {"ball": 15.4, "isHighlight": false, "text": "Sammy to Pietersen,1 run,overpitched just outside off, belted down to long-off"}, {"ball": 15.4, "isHighlight": false, "text": "Third man and fine leg are up"}, {"ball": 15.5, "isHighlight": false, "text": "Sammy to Karthik,1 run,bit of width outside off on this full delivery and Karthik pummels it down the ground. Drops short of long-off"}, {"ball": 15.6, "isHighlight": false, "text": "Sammy to Pietersen, $$SIX$$ ,slower ball and this time KP has mauled it miles into the crowd! Planted his front leg down and didn't bother with the niceties. Full-blooded swing of the bat and that brings us to the time out"}, {"ball": 15.6, "isHighlight": false, "text": "Still loads of time to  $$send$$ $$in$$ $$questions$$  about this game and the clash between Mumbai and Chennai later on and you could find your name appearing in lights on  $$The$$ $$Huddle$$"}, {"ball": 15.6, "isHighlight": false, "text": "Anil Raj: \"DD's form man Duminy has been wasted here. What can he do when you need 26 of one over and steyn bowling :-)\" Might not come down to as difficult an equation, but point taken. Here is the man himself"}, {"ball": 16.1, "isHighlight": false, "text": "Steyn to Karthik,1 run,good length ball just outside off, DK punches into extra cover and his captain called him through for a suicidal run. Direct hit and he was out, DK had given up"}, {"ball": 16.2, "isHighlight": false, "text": "Steyn to Pietersen, $$FOUR$$ ,just a little too full and KP has lashed it through point. Too fine for the sweeper to have any chance. Guess that's why he wanted the strike, he's feeling he's hitting them well"}, {"ball": 16.3, "isHighlight": false, "text": "Steyn to Pietersen,1 run,full on off stump, KP drills it to the left of mid-off. Sammy dives a little early but he is tall enough to reach his hand out and cut the progress of the ball"}, {"ball": 16.4, "isHighlight": false, "text": "Steyn to Karthik, $$OUT$$ ,slower ball on off stump, he goes for a slog but doesn't connect well enough. Rahul is at deep midwicket and holds on to a straight forward catch"}, {"ball": 16.4, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Rahul$$ $$b$$ $$Steyn$$ $$15$$ $$(20m$$ $$14b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$107.14$$"}, {"ball": 16.5, "isHighlight": false, "text": "Steyn to Pietersen, $$OUT$$ ,Sammy pulls out the chainsaw after clinging on to a flat, hard hit from Pietersen. Steyn is on a hat-trick. It was full and KP moved his front leg to give himself room, he struck it well but has pinned down the man in the deep"}, {"ball": 16.5, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$c$$ $$Sammy$$ $$b$$ $$Steyn$$ $$16$$ $$(26m$$ $$17b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$94.11$$"}, {"ball": 16.5, "isHighlight": false, "text": "Tiwary is the new batsman, wonder if he remembers those dropped catches"}, {"ball": 16.6, "isHighlight": false, "text": "Steyn to Tiwary,1 run,good length ball with a hint of away shape, Tiwary gets an outside edge that wanders down to third man"}, {"ball": 16.6, "isHighlight": false, "text": "SRH in trouble, call Steyn. He's changed the complexion of this game, but can the rest back him up. It's 49 off 18 and here's Mishi"}, {"ball": 17.1, "isHighlight": false, "text": "Mishra to Tiwary,no run,googly, tossed up just outside off. He mistimes a drive into the covers"}, {"ball": 17.2, "isHighlight": false, "text": "Mishra to Tiwary, $$SIX$$ ,races down the track and smashes this over long-on. That's a pretty big blow in the context of the game"}, {"ball": 17.3, "isHighlight": false, "text": "Mishra to Tiwary,1 run,flighted outside off, he hacks it away to deep midwicket"}, {"ball": 17.3, "isHighlight": false, "text": "JPD has to finish another game for Daredevils"}, {"ball": 17.4, "isHighlight": false, "text": "Mishra to Duminy, $$SIX$$ ,oh my! He shuffled across and slog swept the flighted delivery into the stands behind midwicket. That was a majestic hit"}, {"ball": 17.5, "isHighlight": false, "text": "Mishra to Duminy,(no ball) 1 run,he's overstepped on the googly, JP steers it behind point for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Mishra to Tiwary,2 runs,tossed up outside off, Tiwary launches it over the top of extra cover but he has not timed it at all"}, {"ball": 17.6, "isHighlight": false, "text": "Mishra to Tiwary,1 run,shortish and outside off, Tiwary has no intention of getting in line and cuts. Goes aerial and away to the sweeper"}, {"ball": 17.6, "isHighlight": false, "text": "Dhawan, Sammy and Steyn are in the midst of a conference"}, {"ball": 18.1, "isHighlight": false, "text": "Steyn to Tiwary,no run,back of a length, he swings off his feet and misses extravagantly outside off. Shades of that last over against NZ in the World T20"}, {"ball": 18.2, "isHighlight": false, "text": "Steyn to Tiwary, $$FOUR$$ ,this was full and outside off, Tiwary walks across and laps him to the right of short fine leg. That's a very brave shot, considering he was almost taking his eyes off the ball"}, {"ball": 18.3, "isHighlight": false, "text": "Steyn to Tiwary,1 run,that's a terrific ball seeking the base of middle, Tiwary clips it through to midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Vikas: \"ok, this isnt cool man... everytime I go to the kitchen, something changes in the game. I went to the kitchen with KP and DK on the crease. \""}, {"ball": 18.4, "isHighlight": false, "text": "Steyn to Duminy, $$FOUR$$ ,JP is in red hot form! This was short and wide and he hoists it over point. Last time he took to Morkel, now it's Steyn"}, {"ball": 18.5, "isHighlight": false, "text": "Steyn to Duminy,1 run,low full toss just outside off, JP steers it to extra cover for a single"}, {"ball": 18.6, "isHighlight": false, "text": "Steyn to Tiwary,1 run,finds the yorker on leg stump, Tiwary was backing away and gets a thick outside edge that goes down to deep third man. They've taken the single. JP will not be on strike, with 20 off 6 required"}, {"ball": 18.6, "isHighlight": false, "text": "Ratna (SRH Supp: \"Vikas Kitchen Again please... I smell Split milk.....\" Bhuvi has to soak in all the pressure now. Dhawan is in deep conversation with him. Tiwary is pacing at the batsman's end. Long-off is back, fine leg is up"}, {"ball": 19.1, "isHighlight": false, "text": "Kumar to Tiwary,1 run,slower ball well outside off, Tiwary reaches out and pushes it into the covers. Had he left that it would have been a wide"}, {"ball": 19.1, "isHighlight": false, "text": "Around the wicket"}, {"ball": 19.2, "isHighlight": false, "text": "Kumar to Duminy,1 leg bye,what a time to bowl a yorker! JP's in immense form and yet he's been duped. Goes for the whack through the on side and gets stuck on the back boot"}, {"ball": 19.3, "isHighlight": false, "text": "Kumar to Tiwary, $$FOUR$$ ,goes for the yorker again but this was a full toss with ample width, Tiwary has skipped down the track and smashed it over point. What a shot!"}, {"ball": 19.4, "isHighlight": false, "text": "Kumar to Tiwary,1 run,comes down again but the low full toss can only be hit down to long-off"}, {"ball": 19.4, "isHighlight": false, "text": "Rohan Naik: \"Goregaon: One Kumar did it yeaterday, lets see how well the other do today!!\" Two sixes to tie the game"}, {"ball": 19.5, "isHighlight": false, "text": "Kumar to Duminy, $$SIX$$ ,he walks down and smashes the low full toss over long-off! JP Duminy, hit one more of those and we have our first Super Over of the IPL"}, {"ball": 19.6, "isHighlight": false, "text": "Kumar to Duminy,2 runs,gets in the yorker on off stump, JP can only punch it all along the ground to long-off. Steyn gets the ball and doesn't even bother throwing."}, {"ball": 19.6, "isHighlight": false, "text": "So there we go, the first thriller is done but it's a double-header today so do shift over and tune into the action at Chennai Super Kings v Mumbai Indians. This is Alagappan Muthu saying sayonara"}, {"ball": 19.6, "isHighlight": false, "text": "$$Aaron$$ $$Finch$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Nice, slow start to the tournament. Remained positive and in this kind of format when we get on a winning streak it can last. The wicket we knew would be hard for the new batters and we made a conscious effort to bat long. It's T20, you cant win them all as long as we can win them when it counts we're happy\""}, {"ball": 19.6, "isHighlight": false, "text": "\"Finally we are off the mark, Great feeling to win and we needed it to boost our confidence. We knew we had the people and we just needed to click,\" Dhawan says, \"Started off with a great partnership and Aaron and Warner too us through. Moody is very fit and gives his beautiful lectures and we have mentors to motivate the players. Anyday, me [on the winner of the contest of moustaches with Ravi Jadeja]\""}, {"ball": 19.6, "isHighlight": false, "text": "\"Great game of cricket,\" says Pietersen. \"Very close. Not that far off [from getting a win]. Quinny and Vijay started well but credit to Finchy, he played fantastically and Warner also chipped in. He doesn't like being lethargic in the first six overs. Says they have to get into the game early and take the momentum. \"Hand is good as gold, proved in the dismissal. Shouldn't have hit it that far. Fantastic to be back. Just have to get over the line in a couple of the nailbiters and will be back\""}, {"ball": 19.6, "isHighlight": false, "text": "Prashant: \"There is no point blaming KP and Co batting at the moment.. The total was huge to chase! Need to focus on bowling department! \""}, {"ball": 19.6, "isHighlight": false, "text": "$$5.45$$ $$pm$$  They have over 9 an over to chase, but their best batsman has faced only seven balls in the innings. Daredevils need to chalk out a better strategy than that. The openers laid a decent platform, but an out of form KP and a lack of acceleration in the death set up Sunrisers' first win of the season"}], "name": "Sunrisers Hyderabad v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729301.html?innings=2;view=commentary", "match_num": 12}