{"commentary": [{"ball": 0, "isHighlight": false, "text": "Hussey and Tare walk out to open for MI. Raina walks up to Hussey while he is taking guard and the former team-mates have a friendly chat, grinning all the while"}, {"ball": 0, "isHighlight": false, "text": "$$Rohit$$ $$Sharma$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$Mumbai$$ $$Indians$$ $$will$$ $$bat$$"}, {"ball": 0, "isHighlight": false, "text": "One change for MI. Jasprit Bumrah is out for CM Gautam"}, {"ball": 0, "isHighlight": false, "text": "CSK are unchanged"}, {"ball": 0, "isHighlight": false, "text": "100th IPL game for both Dhoni and Rohit"}, {"ball": 0, "isHighlight": false, "text": "ItsNotJustCrick: \"I don't understand why Ben Dunk isn't playing! Player of the tournament in the BBL, Mumbai need to take more risks with their batting line up. Glenn Maxwell is a case in point, didn't get the opportunity at MI because of a cautious approach.\""}, {"ball": 0, "isHighlight": false, "text": "Jayan Karthik: \"Ben Dunk will be, he will be the star performer.. But not this year. Some other team will buy him and bring the best out of him.. No kidding ;)\""}, {"ball": 0, "isHighlight": false, "text": "$$5.45pm$$  Daredevils have gone down narrowly to Sunrisers, and we now move on to Chennai Super Kings v Mumbai Indians, whose previous match was six days ago. Toss in fifteen minutes"}, {"ball": 0, "isHighlight": false, "text": "surendra: \"MI is missing Maxwell badly... might be cursing themselves for not retaining him...\" Might?"}, {"ball": 0, "isHighlight": false, "text": "----------- Kieron Pollard is out of form. Ravindra Jadeja is coming into your own. Have you rung in the changes in your  $$Cricinfo$$ $$Fantasy$$ $$XI$$ ?"}, {"ball": 0, "isHighlight": false, "text": "Fifteen questions. Four options. Three lifelines. Three shots a day. Have you tested your  $$CricIQ$$  today? Bragging rights, big prizes and massive recognition are at stake.  $$Play$$ $$now$$ ."}, {"ball": 0.1, "isHighlight": false, "text": "Pandey to Hussey,no run,good length ball straightening on the pad, he times it well but finds square leg"}, {"ball": 0.2, "isHighlight": false, "text": "Pandey to Hussey,1 run,Hussey has to dive early, he worked a back of a length ball square on the leg side and set off, direct hit would have been tight"}, {"ball": 0.3, "isHighlight": false, "text": "Pandey to Tare,1 run,holds the line on a good length, and is punched solidly, but Raina at cover dives to his right and keeps them to one"}, {"ball": 0.4, "isHighlight": false, "text": "Pandey to Hussey,no run,just outside off to the left-hander now, he moves forward and pushes it away"}, {"ball": 0.5, "isHighlight": false, "text": "Pandey to Hussey,no run,wants to pull this 134.6 kph delivery, it is not short enough and Hussey is beaten outside off"}, {"ball": 0.6, "isHighlight": false, "text": "Pandey to Hussey,no run,good line, good length ball ending on middle, Hussey defends it to short extra cover"}, {"ball": 1.1, "isHighlight": false, "text": "Hilfenhaus to Tare, $$FOUR$$ ,that is very well placed, Hilfenhaus swings this length ball away at 138 kph, Tare follows it and opens the face to guide it between cover-point and backward point, it was in the air but just wide of a diving Raina"}, {"ball": 1.2, "isHighlight": false, "text": "Hilfenhaus to Tare,no run,length ball pushed back"}, {"ball": 1.3, "isHighlight": false, "text": "Hilfenhaus to Tare, $$FOUR$$ ,and again, he picks the same gap, short of a length ball, hops to get on top of the bounce and punches it sweetly through point"}, {"ball": 1.4, "isHighlight": false, "text": "Hilfenhaus to Tare,1 run,on the pad now and worked through square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Hilfenhaus to Hussey,no run,Hussey tries to pull a length ball again, probably expecting it to swing in, but it moves away a tad to beat him outside off"}, {"ball": 1.6, "isHighlight": false, "text": "Hilfenhaus to Hussey, $$OUT$$ ,superb delivery hits top of off, good length, pitches around middle, Hussey looks to defend from the crease, the ball seams away past the outside edge to hit the stumps"}, {"ball": 1.6, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Hilfenhaus$$ $$1$$ $$(8m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$14.28$$"}, {"ball": 1.6, "isHighlight": false, "text": "Promotion for Corey Anderson"}, {"ball": 2.1, "isHighlight": false, "text": "Pandey to Tare,no run,beaten, sharp swing away from the right-hander, he follows the back of a length ball from the crease, and misses it"}, {"ball": 2.2, "isHighlight": false, "text": "Pandey to Tare, $$FOUR$$ ,more width this time, 135 kph, back of a length, Tare crashes it through extra cover"}, {"ball": 2.3, "isHighlight": false, "text": "Pandey to Tare, $$FOUR$$ ,this is pitched up now, but still enough room outside off, Tare times the drive through cover, reaching out a bit to adjust for the swing"}, {"ball": 2.4, "isHighlight": false, "text": "Pandey to Tare,no run,attacks a shortish and wide one, is beaten"}, {"ball": 2.5, "isHighlight": false, "text": "Pandey to Tare,1 run,short of a length into the body, nudged on the leg side for one"}, {"ball": 2.6, "isHighlight": false, "text": "Pandey to Anderson,no run,how close was that length ball to off stump as it straightened, quite brave leave from Anderson"}, {"ball": 2.6, "isHighlight": false, "text": "Ashwin comes on"}, {"ball": 3.1, "isHighlight": false, "text": "Ashwin to Tare,no run,tossed up fullish one leg, worked straight to midwicket"}, {"ball": 3.2, "isHighlight": false, "text": "Ashwin to Tare,1 run,again he times it well, full delivery angled across from round the stumps, he reverse sweeps but finds short third man"}, {"ball": 3.3, "isHighlight": false, "text": "Ashwin to Anderson,1 run,length ball angled into the pad, Anderson opens up and turns it in front of square on leg"}, {"ball": 3.4, "isHighlight": false, "text": "Ashwin to Tare,2 runs,flat delivery straightens outside off and is cut, but he hasn't timed it well this time"}, {"ball": 3.5, "isHighlight": false, "text": "Ashwin to Tare,no run,punched off the back foot, McCullum at extra cover stops it"}, {"ball": 3.6, "isHighlight": false, "text": "Ashwin to Tare,1 run,comes out and chips it down to long on"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Tare,no run,walks out to a back of a length ball and has a swipe, thick under edge goes to short fine leg"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Tare,no run,sees some width on this back of a length ball and goes hard at it, but misses"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Tare,no run,he looks in excellent touch, punches a length ball off the back foot, it flies to cover"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Tare, $$OUT$$ ,but he's gone now, he's tried to force a length ball over mid-on, but mishit it, and the fielder has plenty of time to take the dolly"}, {"ball": 4.4, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$Raina$$ $$b$$ $$Sharma$$ $$23$$ $$(19m$$ $$19b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$121.05$$"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Sharma,no run,comes forward to a pitched up ball and pushes to mid on"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Sharma,1 run,allows a length ball to come on outside off, and softly runs it to backward point for one"}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Sharma,no run,tossed up full on middle and off, he presses forward to push it down the track"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Sharma,1 run,good length ball worked off the pad to square leg"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Anderson, $$FOUR$$ ,quicker and angled in to the pad, Anderson manages to get some bat on it, and it races fine down the leg side"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Anderson,no run,straightening on middle, he goes back and punches to mid on"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Anderson,no run,reaches forward and drives on the bounce to extra cover"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Anderson,no run,comes forward and nudges to midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Raghu Ifmr: \"Can never ever understand what is going on in that head of MSD.. Taking out Hilfy from the attack right after he picks a wicket.. I am not gonna question him or make an attempt to understand his tactics. Just gonna sit back and enjoy what he does\""}, {"ball": 6.1, "isHighlight": false, "text": "Sharma to Sharma,no run,gets forward to a length ball but backward point comes in to prevent any chance of a single"}, {"ball": 6.2, "isHighlight": false, "text": "Sharma to Sharma,no run,hits that good length again just outside off, punched to mid off"}, {"ball": 6.3, "isHighlight": false, "text": "Sharma to Sharma,no run,looks to punch this length ball through the covers but cannot time it at all"}, {"ball": 6.4, "isHighlight": false, "text": "Sharma to Sharma,no run,this comes in a bit now from just back of a length, Rohit dabs it to backward point"}, {"ball": 6.5, "isHighlight": false, "text": "Sharma to Sharma,2 runs,a slower ball on off, but they've done well with this, nudged it in front of square leg, Dhoni goes after it, and they have time to come back for the second"}, {"ball": 6.6, "isHighlight": false, "text": "Sharma to Sharma, $$FOUR$$ ,they get something from the over, this is fuller outside off, Rohit bends and is able to scoop it to the fine leg boundary"}, {"ball": 6.6, "isHighlight": false, "text": "Anmoal: \"For MI to succeed they need Rohit to bat through the innings and stop throwing his wicket away. Hope he takes a cue from Vijay and Dhawan and bats responsibly today.\""}, {"ball": 7.1, "isHighlight": false, "text": "Raina to Anderson,no run,length ball on off, forced back to the bowler"}, {"ball": 7.2, "isHighlight": false, "text": "Raina to Anderson,1 run,nudged off the the pad to the right of Ashwin at short fine leg"}, {"ball": 7.3, "isHighlight": false, "text": "Raina to Sharma,1 run,very full delivery knocked down to long on"}, {"ball": 7.4, "isHighlight": false, "text": "Raina to Anderson,no run,driven to extra cover"}, {"ball": 7.5, "isHighlight": false, "text": "Raina to Anderson, $$FOUR$$ ,takes a couple of steps out, Raina drags it short, and Anderson pulls it just over midwicket's jump"}, {"ball": 7.6, "isHighlight": false, "text": "Raina to Anderson,1 run,turned to midwicket"}, {"ball": 8.1, "isHighlight": false, "text": "Pandey to Anderson,no run,a length ball angled across the left-hander, who attacks it only to be beaten"}, {"ball": 8.2, "isHighlight": false, "text": "Pandey to Anderson,1 run,drags a short of a length ball down to long on"}, {"ball": 8.3, "isHighlight": false, "text": "Pandey to Sharma,1 run,holds its line outside off and climbs from back of a length, is guided to third man"}, {"ball": 8.4, "isHighlight": false, "text": "Pandey to Anderson,no run,in the blockhole at 135.2, swings in late to beat his attempted big drive, wasn't far from off stump too"}, {"ball": 8.5, "isHighlight": false, "text": "Pandey to Anderson,1 run,late inswing again, takes this through midwicket, Anderson was looking for that big off drive again"}, {"ball": 8.6, "isHighlight": false, "text": "Pandey to Sharma,no run,Rohit now has a swing and a miss outside off, excellent over from Ishwar Pandey"}, {"ball": 8.6, "isHighlight": false, "text": "Time out"}, {"ball": 8.6, "isHighlight": false, "text": "Gaurav Manchand: \"No matter, how many specialist bowlers Dhoni has in the playing 11, he would always use part-timers.\""}, {"ball": 9.1, "isHighlight": false, "text": "Raina to Anderson,1 run,length ball darted in to the pad, worked in front of square"}, {"ball": 9.2, "isHighlight": false, "text": "Raina to Sharma,no run,straightish on middle and off, pushed back"}, {"ball": 9.3, "isHighlight": false, "text": "Raina to Sharma,1 run,walks out and pushes past extra cover's dive to wide long off"}, {"ball": 9.4, "isHighlight": false, "text": "Raina to Anderson,1 run,knocked down to long off"}, {"ball": 9.5, "isHighlight": false, "text": "Raina to Sharma,1 run,slight spin from outside off, punched hard to long off"}, {"ball": 9.6, "isHighlight": false, "text": "Raina to Anderson, $$SIX$$ ,Anderson finishes the over with a skip down the track and muscles the ball high over long off"}, {"ball": 10.1, "isHighlight": false, "text": "Hilfenhaus to Sharma, $$SIX$$ ,nicely done, Rohit moves across to a full delivery and flicks it high over midwicket, it crashes right into the rope"}, {"ball": 10.2, "isHighlight": false, "text": "Hilfenhaus to Sharma,1 run,back of a length outside off at 135.7 kph, calmly dabbed to third man"}, {"ball": 10.3, "isHighlight": false, "text": "Hilfenhaus to Anderson,1 run,just back of a length, it hurries on even as he drags it down to long on"}, {"ball": 10.4, "isHighlight": false, "text": "Hilfenhaus to Sharma,1 run,short of a length, guided to backward point, who has a go at the striker's end and misses"}, {"ball": 10.5, "isHighlight": false, "text": "Hilfenhaus to Anderson,2 runs,slower one almost works, Anderson swings hard and skies it , three men converge on it at midwicket but it eludes them all"}, {"ball": 10.6, "isHighlight": false, "text": "Hilfenhaus to Anderson,1 run,punched to the sweeper for a single"}, {"ball": 11.1, "isHighlight": false, "text": "Ashwin to Anderson,1 run,bowled full on off stump, he stretches forward and pushes it to long off"}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Sharma,no run,flatter length ball turned in front of square leg, fielder comes in quickly and Rohit has to get back"}, {"ball": 11.3, "isHighlight": false, "text": "Ashwin to Sharma,1 run,works a fuller one past the bowler to long on"}, {"ball": 11.4, "isHighlight": false, "text": "Ashwin to Anderson,1 run,goes back to a 96 kph length ball and knocks it to long on"}, {"ball": 11.5, "isHighlight": false, "text": "Ashwin to Sharma,no run,angled full across the right-hander, who drives it to extra cover"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin to Sharma,1 run,good length ball on middle at 97.2 kph, turned square to leg"}, {"ball": 11.6, "isHighlight": false, "text": "Febin: \"Chahal, Sanju, Pandey are the best uncapped players for me till this match.\""}, {"ball": 12.1, "isHighlight": false, "text": "Raina to Sharma,1 run,quick and flat, Rohit pulls, does not get hold of it, but beats midwicket's dive"}, {"ball": 12.2, "isHighlight": false, "text": "Raina to Anderson,1 run,backs away to a pitched up 98.2 kph ball and cracks it to the off side, McCullum goes racing across to his left and half-stops it, then gets up to stop it and throw it at the non-striker's"}, {"ball": 12.3, "isHighlight": false, "text": "Raina to Sharma, $$FOUR$$ ,Rohit comes down the track and uses the pace on this shortish one to time the cut behind point"}, {"ball": 12.4, "isHighlight": false, "text": "Raina to Sharma, $$SIX$$ ,drops it short and Rohit slogs it hard over deep square leg"}, {"ball": 12.5, "isHighlight": false, "text": "Raina to Sharma,1 run,punched off the back foot to wide long off"}, {"ball": 12.6, "isHighlight": false, "text": "Raina to Anderson,2 runs, $$dropped$$ , Anderson skips out and smashes straight to Raina, who goes down on the ground as the missile hits his fingers and flies at the umpire"}, {"ball": 13.1, "isHighlight": false, "text": "Ashwin to Sharma,2 runs"}, {"ball": 13.2, "isHighlight": false, "text": "Ashwin to Sharma,no run,leans forward and pushes the full delivery to extra cover"}, {"ball": 13.3, "isHighlight": false, "text": "Ashwin to Sharma,1 run,pitches leg and spins in slightly, is worked square"}, {"ball": 13.3, "isHighlight": false, "text": "Saif: \"The only reason Dhoni is not bringing in Jadeja is because Jadeja isn't a good bowler against left handers and Anderson might take him on. \""}, {"ball": 13.4, "isHighlight": false, "text": "Ashwin to Anderson,1 run,Anderson wants the second after working this through midwicket, but the fielder from the deep runs in to keep them to one"}, {"ball": 13.5, "isHighlight": false, "text": "Ashwin to Sharma,1 run,punched off the back foot to long off"}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin to Anderson,1 run,has a go at this 99 kph full delivery but drags it off the inner part of the bat to long on"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja brought on finally"}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Anderson,2 runs,backs away to one outside off and cuts it over point"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to Anderson, $$FOUR$$ ,hammered, picks it from wide outside off stump and slogs it into the straight boundary, past long on's dive"}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to Anderson,1 run,widish length ball at 96 kph, Anderson pummels it off the back foot to long off"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Sharma,2 runs,drives the full one with the spin through extra cover, and comes back for the second as sweeper runs around"}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Sharma, $$FOUR$$ ,too wide, Rohit waits and places the cut just past backward point, bounces in front of the fielder even as he dives and rushes past"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Sharma,1 run,could have been another one, bouncing outside off stump, Rohit cuts it on the bounce to short third man"}, {"ball": 14.6, "isHighlight": false, "text": "Manu Ajmani: \"I don't want to jinx it, but its very refreshing to see Rohit taking the responsibility and pacing his innings to get back to form. His mindset is completely different when he is the captain. Hopefully he can score big today, learn from this innings and be very valuable for the Indian team in future.\""}, {"ball": 15.1, "isHighlight": false, "text": "Sharma to Sharma,1 run,a slower one wide outside off, he underedges an attempted cut to third man"}, {"ball": 15.2, "isHighlight": false, "text": "Sharma to Anderson, $$OUT$$ ,direct hit from Ashwin at extra cover gets Anderson, he drilled this full delivery straight to the fielder and went for the single, replays show he is inches short"}, {"ball": 15.2, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$run$$ $$out$$ $$39$$ $$(55m$$ $$31b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$125.80$$"}, {"ball": 15.2, "isHighlight": false, "text": "Time out"}, {"ball": 15.3, "isHighlight": false, "text": "Sharma to Sharma,1 run,Rohit's missed out here, this was a wide length ball, third man was up, but his weak dab has found the fielder"}, {"ball": 15.4, "isHighlight": false, "text": "Sharma to Pollard,1 run,back of a length, turned behind square leg"}, {"ball": 15.5, "isHighlight": false, "text": "Sharma to Sharma,1 run,cannot get another slower length away, taps it to point"}, {"ball": 15.6, "isHighlight": false, "text": "Sharma to Pollard,1 run,ends the over with yet another slower one, and it is only nudged on the leg side for one"}, {"ball": 16.1, "isHighlight": false, "text": "Pandey to Pollard,no run,a low full toss outside off, Pollard swings and misses"}, {"ball": 16.2, "isHighlight": false, "text": "Pandey to Pollard,1 run,opens the face and runs this back of a length ball towards point"}, {"ball": 16.3, "isHighlight": false, "text": "Pandey to Sharma,1 run,Pandey gets in the yorker, it's dug out to the off side"}, {"ball": 16.3, "isHighlight": false, "text": "Pollard has a change of pads"}, {"ball": 16.4, "isHighlight": false, "text": "Pandey to Pollard, $$FOUR$$ ,that is one bounce into the MI dugout at fine leg, he bends forward to a full delivery on the stumps and lifts it high in that region"}, {"ball": 16.5, "isHighlight": false, "text": "Pandey to Pollard,1 run,swung hard down to Raina at long on"}, {"ball": 16.6, "isHighlight": false, "text": "Pandey to Sharma,no run,drives an overpitched widish one straight to short extra cover"}, {"ball": 17.1, "isHighlight": false, "text": "Hilfenhaus to Pollard,1 run,a slower length ball on the pad, turned to short fine leg"}, {"ball": 17.2, "isHighlight": false, "text": "Hilfenhaus to Sharma,1 run,sends in a 137 kph yorker on middle and leg, Rohit squeezes it down the ground and reaches a fifty in his 100th IPL match"}, {"ball": 17.2, "isHighlight": false, "text": "Round the wicket"}, {"ball": 17.3, "isHighlight": false, "text": "Hilfenhaus to Pollard,1 run,angled full across him, he drives off a thick edge to the sweeper"}, {"ball": 17.4, "isHighlight": false, "text": "Hilfenhaus to Sharma, $$OUT$$ ,very slow short ball at only 97.5 kph, Rohit has to try and create his own momentum on the pull, but only manages to drag it tamely to deep midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$Smith$$ $$b$$ $$Hilfenhaus$$ $$50$$ $$(60m$$ $$41b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$121.95$$"}, {"ball": 17.5, "isHighlight": false, "text": "Hilfenhaus to Pollard,1 run,139 kph bouncer from round the stumps, he hasn't got hold of the hook and it loops to square leg"}, {"ball": 17.6, "isHighlight": false, "text": "Hilfenhaus to Rayudu,1 run,backs away to leg and swings an overpitched ball to long on"}, {"ball": 17.6, "isHighlight": false, "text": "Manasseh Anand: \"This is the problem for MI in promoting Corey A. Now, they have a rusty Pollard and no other Power hitters to come in the last 2+ overs!!!\""}, {"ball": 18.1, "isHighlight": false, "text": "Sharma to Rayudu, $$OUT$$ ,another slower one produces another wicket, 105 kph length ball outside off from Mohit, Rayudu slogs it to Raina at long on, who moves to his left to take it"}, {"ball": 18.1, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Raina$$ $$b$$ $$Sharma$$ $$1$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 18.2, "isHighlight": false, "text": "Sharma to Pollard,1 run,107.9 kph, slow and full, he cannot get under it and drags it to deep midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Sharma to Gautam,1 run,moves across to this good length ball but can only work it close to the pitch on leg"}, {"ball": 18.3, "isHighlight": false, "text": "Raghu: \"Mumbai have the weakest plus out of form batting line-up this IPL.\""}, {"ball": 18.4, "isHighlight": false, "text": "Sharma to Pollard, $$OUT$$ ,slower and lethal from CSK continues, 103 kph back-of-the-hand length ball just outside off, Pollard slogs, only gets a thin inside edge that hits off"}, {"ball": 18.4, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$b$$ $$Sharma$$ $$12$$ $$(19m$$ $$11b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$109.09$$"}, {"ball": 18.5, "isHighlight": false, "text": "Sharma to Harbhajan Singh,no run,now a 141.5 kph yorker outside off to the new batsman, what a bowling display from CSK, Harbhajan misses"}, {"ball": 18.6, "isHighlight": false, "text": "Sharma to Harbhajan Singh, $$OUT$$ ,they cannot do anything with these slower ones, Harbhajan tries to cut this length ball over point, finds the man with a palpably mistimed shot"}, {"ball": 18.6, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$c$$ $$McCullum$$ $$b$$ $$Sharma$$ $$0$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "Three strikes in that 19th over. Terrific effort from Mohit Sharma"}, {"ball": 19.1, "isHighlight": false, "text": "Hilfenhaus to Gautam, $$FOUR$$ ,Gautam reverse-sweeps this full ball going across him past short third man"}, {"ball": 19.2, "isHighlight": false, "text": "Hilfenhaus to Gautam,1 run,now walks outside off and swings this length ball over square leg, there is a man in the deep there"}, {"ball": 19.2, "isHighlight": false, "text": "Hilfenhaus stays round the stumps"}, {"ball": 19.3, "isHighlight": false, "text": "Hilfenhaus to Khan,1 run,yorker on middle, Zaheer is backing away and drags it to deep midwicket"}, {"ball": 19.4, "isHighlight": false, "text": "Hilfenhaus to Gautam,1 run,Raina races in from extra cover, dives forward, takes the ball but immediately shakes his head, and raises his hands saying he is not sure it carried, replays show it bounced just before he took it, MI avoid losing another wicket to a mishit off a slower ball"}, {"ball": 19.5, "isHighlight": false, "text": "Hilfenhaus to Khan, $$SIX$$ ,94.3 kph, slower and slower from Hilfenhaus, he swings the shortish ball over deep midwicket"}, {"ball": 19.6, "isHighlight": false, "text": "Hilfenhaus to Khan,1 bye,misses this full one outside off and they sneak in a bye"}, {"ball": 19.6, "isHighlight": false, "text": "Mumbai slipping from 109 for 2 to 141 for 7 against CSK's assortment of slower ones. It was Ashwin's direct hit to nail Anderson that started it"}], "name": "Chennai Super Kings v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729303.html?innings=1;view=commentary", "match_num": 13}