{"commentary": [{"ball": 0, "isHighlight": false, "text": "Slight tinge of green on the pitch, but it's likely to be a good pitch for batting. We are all set to go. Yogesh Takawale and Parthiv Patel are in the middle..Stuart Binny to start off"}, {"ball": 0, "isHighlight": false, "text": "$$2.00$$ $$pm$$   $$Rajasthan$$ $$Royals$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$will$$ $$bowl.$$  They have made two changes - Karun Nair has come in for Kulkarni and Richardson has come for Faulkner. Bangalore would have batted first anyway. They have made two changes as well - Ravi Rampaul and Sachin Rana have come in for Varun Aaron and Muralitharan. So still no Gayle."}, {"ball": 0, "isHighlight": false, "text": "\"What has happened to RCB? Varun Aaron was RCB's best bowler in the last match and now they drop him,\" Ashwin, I suspect his workload is being managed. This is RCB's second game in three days - and they have another one in two days time against KXIP. Aaron doesn't have a great history when it comes to fitness. Makes sense to keep him fresh for Maxwell."}, {"ball": 0, "isHighlight": false, "text": "$$1.45$$ $$pm$$  Hello and welcome to our coverage of the battle royale - Royal Challengers v Rajasthan Royals. Not too long ago RCB's juggernaut was halted by an a mad catch from Chris Lynn, they were strolling to their third successive win before that. That moment may have inspired KKR, but it doesn't take away the fact that RCB batsmen fluffed that chase. Probably what they need is a shot of Gayle. Royals, on the other hand, are never easy to gauge. They do their little things under the radar and stay afloat in the table without anyone realising it. Can they do better than the last match against CSK? Some runs from Watson will be welcomed, and some wickets from Faulkner.."}, {"ball": 0, "isHighlight": false, "text": "Bilal Sheikh: \"Rajasthan should drop AM Nayar bring Unmukt Chand in palying11 so team will become very strong in batting line up already team lot allrounders in their playing11\""}, {"ball": 0, "isHighlight": false, "text": "Two more days left in Powerplay 1 of CricIQ. It's time to get a hang of things and prepare for the challenges ahead. Tens of thousands of new questions coming your way.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  continues..."}, {"ball": 0.1, "isHighlight": false, "text": "Binny to Patel,1 run,swings this one into the pads, the batsman flicks it to deep midwicket to open his account"}, {"ball": 0.2, "isHighlight": false, "text": "Binny to Takawale,no run,immediately gets some nice shape outside off, the batsman lets it go through"}, {"ball": 0.3, "isHighlight": false, "text": "Binny to Takawale,no run,fuller this time, the batsman doesn't come out fully, defends it to cover"}, {"ball": 0.4, "isHighlight": false, "text": "Binny to Takawale, $$OUT$$ ,early strike for Binny! Takawale didn't look in any hurry till the last ball, but he decides to show some aggression against the gentle medium pace. He clears his front leg and attempts to launch this over mid-on, but that nice shape on the ball means it kisses the outside edge and ends up with the keeper"}, {"ball": 0.4, "isHighlight": false, "text": "$$YV$$ $$Takawale$$ $$c$$ $$†Samson$$ $$b$$ $$Binny$$ $$0$$ $$(3m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 0.4, "isHighlight": false, "text": "Early outing for Kohli"}, {"ball": 0.5, "isHighlight": false, "text": "Binny to Kohli, $$OUT$$ ,this is two in two! Very poor running from Patel there. Kohli dabbed the full delivery to cover point and called for a single, but Parthiv was slow to respond to a late call. He was well short when the throw from Rahane came to the keeper. More of Kohli's mistake actually, because Patel was responding to his call.."}, {"ball": 0.5, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$run$$ $$out$$ $$1$$ $$(4m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "Big loss for RCB - Parthiv was their man in form"}, {"ball": 0.5, "isHighlight": false, "text": "Yuvraj Singh is in.. One slip in place"}, {"ball": 0.6, "isHighlight": false, "text": "Binny to Yuvraj Singh,no run,leaves the first ball alone as it slides away at an angle"}, {"ball": 0.6, "isHighlight": false, "text": "MrGarreth: \"I know Bangalore are blessed with a strong top order, but how the likes of Patel, Takawale and Yuvraj come ahead of AB is unfathomable to me. Basically what it means is at the end of the season AB will have faced less deliveries than all those guys. Can't get my head around that. Yes AB can bat anywhere but he is absolutely wasted when he is at 5\" --- looks like he will be in early today anyway"}, {"ball": 0.6, "isHighlight": false, "text": "Southee now.."}, {"ball": 1.1, "isHighlight": false, "text": "Southee to Kohli,1 run,pushes it full outside off, easily driven to the sweeper at deep cover"}, {"ball": 1.2, "isHighlight": false, "text": "Southee to Yuvraj Singh,no run,beats the bat as Yuvraj pushes at the length delivery inside the line"}, {"ball": 1.2, "isHighlight": false, "text": "Two slips now.."}, {"ball": 1.3, "isHighlight": false, "text": "Southee to Yuvraj Singh,no run,bowls it full and wide, Yuvraj watches this one go through to the keeper"}, {"ball": 1.4, "isHighlight": false, "text": "Southee to Yuvraj Singh,2 runs,he starts walking down the pitch but is lucky to get an inside edge off the yorker.. That swung into him and went to fine leg. It would have been a half-volley had he stayed in the pitch"}, {"ball": 1.5, "isHighlight": false, "text": "Southee to Yuvraj Singh,no run,play and a miss! the bowler appeals for a caught behind but there is no edge. Yuvraj pushes at the length ball tamely and is beaten"}, {"ball": 1.6, "isHighlight": false, "text": "Southee to Yuvraj Singh,1 run,bowls it straight on the stump, Yuvraj dabs it to mid-off and keeps the strike"}, {"ball": 1.6, "isHighlight": false, "text": "The bearded Kane Richardson comes in"}, {"ball": 2.1, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$OUT$$ ,he strikes first ball! Yuvraj's year of misery continues..it's only bowled at 130 kph and just short of length outside off.. Yuvraj just hangs his bat at that one and sends the outside edge straight to the second slip fielder. That was a really poor attempt and the ball was not even that fast as he made it look"}, {"ball": 2.1, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Smith$$ $$b$$ $$Richardson$$ $$3$$ $$(7m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$42.85$$"}, {"ball": 2.2, "isHighlight": false, "text": "Richardson to de Villiers, $$OUT$$ ,now AB! What's happening! You don't expect such loose shots from AB. Another tame delivery just outside off and AB has a lazy waft at that one, ends up chopping it on to his stumps"}, {"ball": 2.2, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Richardson$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 2.2, "isHighlight": false, "text": "AB came, AB saw, AB chopped it on.. Richardson on a  $$hat-trick$$"}, {"ball": 2.2, "isHighlight": false, "text": "Sachin Rana to face the hat-trick ball"}, {"ball": 2.3, "isHighlight": false, "text": "Richardson to Rana,1 run,back of length delivery, he edges it through the third slip region.. They had two slips there.. Smith at second slip has his hands on his head"}, {"ball": 2.4, "isHighlight": false, "text": "Richardson to Kohli,no run,he comes forward and defends the length ball solidly to point"}, {"ball": 2.5, "isHighlight": false, "text": "Richardson to Kohli, $$FOUR$$ ,shortish delivery, Kohli is no Yuvi.. he gets back and whacks it past midwicket, all along the ground"}, {"ball": 2.6, "isHighlight": false, "text": "Richardson to Kohli,1 run,short of length delivery wide outside off, Kohli keeps strike by steering this one to third man"}, {"ball": 2.6, "isHighlight": false, "text": "rudranil: \"Bangalore's bench strength look stronger now...gayle, aaron, muralitharan. There was an interview with Aaron before match, he promised 150 Kph today, guess it was for nets!\""}, {"ball": 3.1, "isHighlight": false, "text": "Southee to Kohli,no run,length delivery outside off, Kohli, who has a big role now, defends this one to point"}, {"ball": 3.1, "isHighlight": false, "text": "Ramesh Srivats on twitter: Hey RCB, what is this 1/2, 5/4 and all. This is a cricket match, not a Bangalore coffee shop."}, {"ball": 3.2, "isHighlight": false, "text": "Southee to Kohli,no run,another length delivery on off, the batsman stays calm and defends it to off"}, {"ball": 3.2, "isHighlight": false, "text": "Tushar: \"This is good recovery from VK and Rana, they have now scored more than half the runs, without losing a wicket\""}, {"ball": 3.3, "isHighlight": false, "text": "Southee to Kohli,no run,he has to play the waiting game, defends the back of length delivery down the pitch"}, {"ball": 3.3, "isHighlight": false, "text": "bikesh: \"Again no blaming to Yuvraj because Ab got out early too!!! Lucky him\""}, {"ball": 3.4, "isHighlight": false, "text": "Southee to Kohli,1 run,some room outside off, Kohli punches this to deep cover to pick up a single"}, {"ball": 3.4, "isHighlight": false, "text": "DM: \"All the talk about Yuvraj but seriously what on Earth has AB been doing? All through the T20WC and here he's got praised as the best batsman in his prime but done nothing of muchsubstance. In T20wc he just played 1 good knock against the worst bowling/Fielding side of the tournament. In this IPL he's done nothing. Against MI Parthiv was the man. Against KKR , AB couldn't chase 12 from 9 or 6 from 4 whereas yuvi in 4 matches has pastured 1 match winning knock and one run a ball 30 in a 140 chase. What is AB doing????\""}, {"ball": 3.5, "isHighlight": false, "text": "Southee to Rana,no run,he waits on the back foot and defends the back of length delivery to point"}, {"ball": 3.5, "isHighlight": false, "text": "Nik: \"Given this situation, they'd rather have Rana than Varun. An extra batsman now is definitely needed.\""}, {"ball": 3.6, "isHighlight": false, "text": "Southee to Rana,no run,fires this one on the blockhole, Sachin digs it out somehow"}, {"ball": 4.1, "isHighlight": false, "text": "Richardson to Kohli,1 run,back of length outside off, the batsman glides this to third man for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Richardson to Rana,1 run,now Rana picks up a single to third man, gliding this past the second slip fielder"}, {"ball": 4.3, "isHighlight": false, "text": "Richardson to Kohli,no run,length delivery on the stumps, the batsman defends it down the pitch"}, {"ball": 4.4, "isHighlight": false, "text": "Richardson to Kohli,1 run,back of length outside off, Kohli stays on the back foot and steers this to third man"}, {"ball": 4.5, "isHighlight": false, "text": "Richardson to Rana,no run,looks to leave this one, but is late to get his bat out of the way.. He is lucky that this drops down before reaching gully"}, {"ball": 4.6, "isHighlight": false, "text": "Richardson to Rana,1 run,too straight this time, Rana goes on the back foot and whips this to deep square leg for a single"}, {"ball": 4.6, "isHighlight": false, "text": "Rahul: \"@DM: Agreed that AB hasn't been his real self, but the defense against Yuvi is certainly not acceptable. He has been in a terrible form. That match winning knock was just a one-off outing for him. His prime seems to be long gone now, whereas we are now seeing a completely new AB. It may not be his best, but he's still far better than Yuvi now.\""}, {"ball": 4.6, "isHighlight": false, "text": "Watson brings himself on.."}, {"ball": 5.1, "isHighlight": false, "text": "Watson to Rana,no run,bowls it full outside off, the batsman pushes it to cover point off the front foot"}, {"ball": 5.1, "isHighlight": false, "text": "Yogesh Rajput: \"This is typical Rajasthan team pattern...pick any player who is playing from rajasthan for the first time will definitely knock in that match..earlier these players were yusuf, amit singh, vikramjeet, tambe etc. and today it's Richardson !!\""}, {"ball": 5.2, "isHighlight": false, "text": "Watson to Rana,1 wide,short and wide outside off, unlucky to be called a wide actually.. that passed well inside the marker.. No wonder Watson is amused"}, {"ball": 5.2, "isHighlight": false, "text": "Watson to Rana, $$OUT$$ ,now Watson strikes! This is not too different from how AB got out.. He tries to punch this short of length delivery through cover, there is no room, and he ends up chopping this on to the stumps.."}, {"ball": 5.2, "isHighlight": false, "text": "$$S$$ $$Rana$$ $$b$$ $$Watson$$ $$3$$ $$(14m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$37.50$$"}, {"ball": 5.2, "isHighlight": false, "text": "We are still in Powerplay and we have Albie here.. two slips in place"}, {"ball": 5.3, "isHighlight": false, "text": "Watson to Morkel,no run,shout of lbw as this one shapes in. Albie shouldn't have gone back to that one, he is lucky .. as that looked out"}, {"ball": 5.4, "isHighlight": false, "text": "Watson to Morkel, $$FOUR$$ ,that's better, he moves forward and drives this past the non-striker .. no stopping that"}, {"ball": 5.5, "isHighlight": false, "text": "Watson to Morkel,1 leg bye,back of length on the pads, the batsman looks to flick, but gets hit on the thigh pad"}, {"ball": 5.6, "isHighlight": false, "text": "Watson to Kohli,no run,teases Kohli with a wide outswinger, the batsman doesn't take the bait"}, {"ball": 5.6, "isHighlight": false, "text": "Ankur Chaturved: \"Last time these two sides played in a neutral country RR was shot out for 58 with Kumble taking 5 wickets.. Time for pay-back?\""}, {"ball": 6.1, "isHighlight": false, "text": "Richardson to Morkel,no run,fuller delivery on off, Albie comes forward and punches it to mid-on"}, {"ball": 6.2, "isHighlight": false, "text": "Richardson to Morkel,1 run,goes deep in his crease and pushes the back of length delivery in the gap at midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Richardson to Kohli,no run,short of length and Kohli flat bats it down the pitch, Richardson gets a hand and prevents giving away any runs"}, {"ball": 6.4, "isHighlight": false, "text": "Richardson to Kohli,1 run,he comes forward and drives this on the up through cover, but Watson has placed a man in the deep"}, {"ball": 6.4, "isHighlight": false, "text": "Roshan: \"Why are people doubting AB all of a sudden? He recently broke the record for the most fifties in consecutive Tests and played fantastically in the recent Test series against Australia. Test match form is the mark of a great batsman - it doesn't matter how well you play in the IPL.\""}, {"ball": 6.5, "isHighlight": false, "text": "Richardson to Morkel,no run,back of length rising delivery, Albie stays in the crease and defends it to point"}, {"ball": 6.6, "isHighlight": false, "text": "Richardson to Morkel,2 runs,he flicks this fine off his hips and gets a couple as Tambe fumbles the ball at fine leg"}, {"ball": 7.1, "isHighlight": false, "text": "Watson to Kohli,no run,length delivery on off, the batsman stays in the crease and defends it down the pitch"}, {"ball": 7.2, "isHighlight": false, "text": "Watson to Kohli,1 bye,this one has cut him in half! Kohli moved down the pitch to smash this through cover, but that darted in from the pitch"}, {"ball": 7.3, "isHighlight": false, "text": "Watson to Morkel,no run,length delivery wide outside off, Morkel throws his bat at that one and misses"}, {"ball": 7.4, "isHighlight": false, "text": "Watson to Morkel,no run,length delivery wide outside off again, this time he lets it go through"}, {"ball": 7.5, "isHighlight": false, "text": "Watson to Morkel,no run,he is no hurry, lets this one go through to the keeper again"}, {"ball": 7.6, "isHighlight": false, "text": "Watson to Morkel,no run,this one is chopped too as the batsman looks to push it to cover, but luckily for him, it's towards the slips, not stumps"}, {"ball": 7.6, "isHighlight": false, "text": "Tambe comes in now"}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to Kohli,no run,tossed up and full, Kohli looks to smash it down the ground, but doesn't get any timing.. back to the bowler"}, {"ball": 8.2, "isHighlight": false, "text": "Tambe to Kohli,1 run,floated on the middle stump, the batsman drives it inside out to deep cover"}, {"ball": 8.3, "isHighlight": false, "text": "Tambe to Morkel,no run,flighted delivery on off stump, Albie comes forward and smothers the spin"}, {"ball": 8.4, "isHighlight": false, "text": "Tambe to Morkel, $$OUT$$ ,this is falling apart.. still only 28 on the board! Albie was so patient till now, but it runs out as he tries to launch this slow flighted delivery out of the ground, only manages the toe of the bat and it lobs gently for Steven Smith at mid-off"}, {"ball": 8.4, "isHighlight": false, "text": "$$JA$$ $$Morkel$$ $$c$$ $$Smith$$ $$b$$ $$Tambe$$ $$7$$ $$(14m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$53.84$$"}, {"ball": 8.4, "isHighlight": false, "text": "RCB's disaster continues. The umpires have signalled the time-out... Kohli is soon running out of partners.. At some stage he will have to just go all out on attack.. Starc is here."}, {"ball": 8.5, "isHighlight": false, "text": "Tambe to Kohli, $$FOUR$$ ,full and flighted, this is a classic Kohli shot! Wristy, whacked through extra cover, beats the man at deep cover easily"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to Kohli,1 run,floated up on the middle, Kohli keeps strike with a push to long off"}, {"ball": 9.1, "isHighlight": false, "text": "Southee to Kohli, $$FOUR$$ ,he is not going to wait, this Kohli.. He charges down the pitch and chips the length delivery over mid-on"}, {"ball": 9.2, "isHighlight": false, "text": "Southee to Kohli,1 run,he shuffles across the crease and clips this to deep square leg, but there is just a single there"}, {"ball": 9.3, "isHighlight": false, "text": "Southee to Starc,2 runs,short ball from Southee, Starc pulls it down to deep backward square leg"}, {"ball": 9.4, "isHighlight": false, "text": "Southee to Starc, $$FOUR$$ ,this is a smart shot! No risk in this at all. Just comes forward and chips it over mid-off with ease"}, {"ball": 9.4, "isHighlight": false, "text": "Danish Patel: \"I have a feeling that Kohli is going to top score for RCB today!\" --- well done Danish"}, {"ball": 9.5, "isHighlight": false, "text": "Southee to Starc,no run,quicker and on the pads, Starc looks to clip it to the leg side but gets hit on the pads"}, {"ball": 9.6, "isHighlight": false, "text": "Southee to Starc,1 leg bye,full and on the boots, again Starc misses his flick, but picks up a leg bye to fine leg"}, {"ball": 10.1, "isHighlight": false, "text": "Tambe to Starc,1 run,floated full and wide outside off, Starc stretches forward and drags it to long on for a single"}, {"ball": 10.2, "isHighlight": false, "text": "Tambe to Kohli,no run,he is bowling this slow today, the batsman comes forward and defends"}, {"ball": 10.3, "isHighlight": false, "text": "Tambe to Kohli, $$OUT$$ ,this is the end! Now Kohli hits it straight to midwicket. Short and on any other day, this would have disappeared out of the ground, but Kohli seems to have been infected by the same bug that his hit the rest of his mates..Gets hit high on the pad and lobs it straight to the fielder, who takes an easy catch. Da"}, {"ball": 10.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Southee$$ $$b$$ $$Tambe$$ $$21$$ $$(51m$$ $$25b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$84.00$$"}, {"ball": 10.3, "isHighlight": false, "text": "21 he has scored.. Danish may still be right by the end of this innings"}, {"ball": 10.4, "isHighlight": false, "text": "Tambe to Rampaul,no run,tossed up and on off, the batsman defends it towards point"}, {"ball": 10.5, "isHighlight": false, "text": "Tambe to Rampaul,1 run,bowls the googly, but this is bowled very very slow, Rampaul waits on the back foot before punching it to deep cover"}, {"ball": 10.6, "isHighlight": false, "text": "Tambe to Starc,no run,quicker now, the batsman pushes it to cover"}, {"ball": 10.6, "isHighlight": false, "text": "Just realised there are still nine overs to come.."}, {"ball": 10.6, "isHighlight": false, "text": "Shagird: \"I think Watson should continue giving over to NEW bowlers. Except Southee, all bowlers got wicket in first over. Try Bhatia and Smith, they will also get wickets and RCB done and dusted. What a day for RR.\" --- Richardson comes back for now"}, {"ball": 11.1, "isHighlight": false, "text": "Richardson to Rampaul,no run,back of length delivery on the stumps, the batsman defends it off the back foot"}, {"ball": 11.2, "isHighlight": false, "text": "Richardson to Rampaul,no run,slides this across the left-hander, who has a poke, but misses"}, {"ball": 11.2, "isHighlight": false, "text": "rssampat: \"Ravi Rampaul is much under rated with the bat and he is a mighty handy with the bat. Time for the tail to WAG?? Stranger things have happened in cricket and it would not surprise me all that much if these two put on a 50 run partnership from here on.\""}, {"ball": 11.3, "isHighlight": false, "text": "Richardson to Rampaul,no run,he throws his bat at this angled delivery, trying to guide it to third-man, misses it.. Much like Yuvraj"}, {"ball": 11.4, "isHighlight": false, "text": "Richardson to Rampaul,1 run,back of length delivery on off, he dabs it to backward point for a single"}, {"ball": 11.5, "isHighlight": false, "text": "Richardson to Starc,2 runs,three men converging under this skier!  It lands safely between the three.. Tambe, Southee and Rahane there.. no one calls.. It was a big top edge that landed at deep point.. Where is Smith? Surely he would have taken this"}, {"ball": 11.6, "isHighlight": false, "text": "Richardson to Starc,1 run,punches this aerially to mid-on for a single"}, {"ball": 12.1, "isHighlight": false, "text": "Tambe to Starc,no run,this is a beautiful wrong'un.. Tossed up, grips the surface, then turns away to beat the bat"}, {"ball": 12.2, "isHighlight": false, "text": "Tambe to Starc,1 run,he waits on the back foot and pushes this to deep point for a single"}, {"ball": 12.2, "isHighlight": false, "text": "harshil: \"I m very impressed with d young leggie tambe :):p got dhoni the other day and now kohli ..! Way to go..!!\""}, {"ball": 12.3, "isHighlight": false, "text": "Tambe to Rampaul,1 run,short ball this time, the batsman pulls but is lucky he hasn't timed this well, it falls just short of Richardson at deep midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Tambe to Starc,2 runs,looks to sweep and gets an underedge to fine leg"}, {"ball": 12.5, "isHighlight": false, "text": "Tambe to Starc,no run,bowls the slider this time, the batsman defends it off the back foot"}, {"ball": 12.5, "isHighlight": false, "text": "Raj Chandra: \"After winning three prestigious domestic championships this season none of the KAR players get selected into the RCB side. That says a lot about the team management's brain behind scouting.\""}, {"ball": 12.6, "isHighlight": false, "text": "Tambe to Starc,no run,this is full and outside off, the batsman looks to drive but plays inside the line of that.."}, {"ball": 12.6, "isHighlight": false, "text": "Ishan Jain: \"Its a royal encounter. One bowling in a royal manner, other collapsing in a royal manner.\""}, {"ball": 12.6, "isHighlight": false, "text": "Chetan Joshi: \"Looks like it would be better if Vijay Mallya himself comes and bats for Bangalore. The way his team is playing, he could do a better job himself.\""}, {"ball": 12.6, "isHighlight": false, "text": "Rajat Bhatia comes in for the first time"}, {"ball": 13.1, "isHighlight": false, "text": "Bhatia to Rampaul,no run,bowls length outside off, 107 kph, the batsman defends it to the off side"}, {"ball": 13.2, "isHighlight": false, "text": "Bhatia to Rampaul,1 run,fuller delivery, slower from Bhatia, the batsman though drags it to deep midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Anuj Kulkarni: \"This is why Rajasthan Royals have been consistently successful so far in IPL. They don't just rely on big names but they explore Indian as well as overseas talents. No outstanding bowling, this game is just the outcome of conglomeration of well-composed efforts from everyone!\""}, {"ball": 13.3, "isHighlight": false, "text": "Bhatia to Starc, $$FOUR$$ ,bowls the offcutter, but look at Starc, he chops this beautifully between backward point and short third man.. Only a tiny tiny gap there.. They have gone past the lowest IPL score now"}, {"ball": 13.4, "isHighlight": false, "text": "Bhatia to Starc,1 run,bowls almost a flighted offspinner, the batsman clubs it to wide long-on for a single"}, {"ball": 13.5, "isHighlight": false, "text": "Bhatia to Rampaul,1 run,another one of those slow offcutters, Rampaul punches it to long on"}, {"ball": 13.6, "isHighlight": false, "text": "Bhatia to Starc, $$OUT$$ ,Binny catches this one on the second attempt! He bowls this one wide outside off, gives the batsman invitation to go for cut, which he does. But he hits it straight to Binny at point.. it pops out of his hand in the first instance, but as he falls, he manages to hold on to it"}, {"ball": 13.6, "isHighlight": false, "text": "$$MA$$ $$Starc$$ $$c$$ $$Binny$$ $$b$$ $$Bhatia$$ $$18$$ $$(27m$$ $$16b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 13.6, "isHighlight": false, "text": "Shagird: \"Am I reading Watson's mind or Cricinfo has conveyed my previous message to Watson?? Bhatia, NEW bowler, wicket in first over.."}, {"ball": 14.1, "isHighlight": false, "text": "Tambe to Rampaul,2 runs,another top edge, this time it's just over mid-off.. It's Smith there.. he back pedals, runs after it, twists.. but still can't make it"}, {"ball": 14.2, "isHighlight": false, "text": "Tambe to Rampaul, $$SIX$$ ,yes, use those full-tosses please, Rampaul gets a juicy one that is smashed through midwicket"}, {"ball": 14.3, "isHighlight": false, "text": "Tambe to Rampaul, $$OUT$$ ,fun and games over now, Rampaul looks to smash it over the infield, but only manages a toe-end.. This lobs for the cover fielder"}, {"ball": 14.3, "isHighlight": false, "text": "$$R$$ $$Rampaul$$ $$c$$ $$Southee$$ $$b$$ $$Tambe$$ $$13$$ $$(19m$$ $$13b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 14.3, "isHighlight": false, "text": "Last man comes in.."}, {"ball": 14.4, "isHighlight": false, "text": "Tambe to Dinda,no run,full and flighted, defended down the pitch"}, {"ball": 14.5, "isHighlight": false, "text": "Tambe to Dinda,no run,he goes back to pull this to the leg side, gets hurried by the skidder"}, {"ball": 14.6, "isHighlight": false, "text": "Tambe to Dinda, $$OUT$$ ,this is over! The batsman had no clue about this googly.. He played back to it and was hit right in front."}, {"ball": 14.6, "isHighlight": false, "text": "$$AB$$ $$Dinda$$ $$lbw$$ $$b$$ $$Tambe$$ $$0$$ $$(4m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 14.6, "isHighlight": false, "text": "Omnishambles. This was supposed to be a good pitch but RCB have collapsed to the  $$third-lowest$$ $$total$$  in the IPL. The less it's written about their batting, the better. Fantastic effort from the bowlers. Pravin Tambe taking 4 for 20, his best figures in the IPL"}, {"ball": 14.6, "isHighlight": false, "text": "Jose: \"@Danish: Any prediction for RR? Please share your 'feel\"; please.\""}, {"ball": 14.6, "isHighlight": false, "text": "Danish: \"@ Jose and everybody else waiting for my feelings, I will surely tell after 10 overs ;)..ofcourse if match lasts till then\""}, {"ball": 14.6, "isHighlight": false, "text": "Husam: \"Whats a parody? Most expensive batting line up being shot out by least expensive bowling line up.\""}, {"ball": 14.6, "isHighlight": false, "text": "Abhijit Kundu: \"it is an easy chase for Rajasthan, unless they make mistake like Bangalore. Pitch reading is most important. Stay on the pitch, runs will come easily. Do not go after balls. Should wait for decent ball to score.\""}, {"ball": 14.6, "isHighlight": false, "text": "Sunil Pandey: \"Now only Rajnikanth can win the match with the blessing for Aloknath ji\""}], "name": "Rajasthan Royals v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729305.html?innings=1;view=commentary", "match_num": 14}