{"commentary": [{"ball": 0, "isHighlight": false, "text": "Alright. Here they come.. Not a huge task ahead and they would hope to finish it easily. Karun Nair to open with Rahane"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Rahane,no run,length delivery outside off, some inward movement but easily left alone by Rahane"}, {"ball": 0.1, "isHighlight": false, "text": "two slips in place"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Rahane, $$FOUR$$ ,the idea was right - he bowled it full and got the swing - but the direction was not. It was on the pads and Rahane flicks it fine down the leg side"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Rahane,1 wide,now he overcorrects, this is full and very wide outside off"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Rahane, $$FOUR$$ ,this is beautifully punched through mid-off, almost a test-match shot.. He punches this without any fuss, just a push, and mid-off was well wide"}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Rahane,no run,comes forward and drives this to cover"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Rahane,no run,back of length on the stumps this time, Rahane waits and defends it to midwicket"}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Rahane,2 runs,leans back and carves this short of length delivery through backward point, the fielder at third man does well to prevent the boundary"}, {"ball": 0.6, "isHighlight": false, "text": "Rampaul comes in now"}, {"ball": 0.6, "isHighlight": false, "text": "CricCat: \"Manish pandey, Uthappa, Vinay Kumar , Stuart binny, Rahul, Gautham ..now Karun Nair...Karnataka boys are carrying form of Ranji, irani trophy to IPL...and RCB does't have single player from that team....As a bangalorean I am tossing up between RR or KKR to support... \""}, {"ball": 1.1, "isHighlight": false, "text": "Rampaul to Nair,no run,bowls a beautiful first delivery, it seams away after pitching on length and beats the bat"}, {"ball": 1.2, "isHighlight": false, "text": "Rampaul to Nair,no run,looks to punch this wide delivery through off and gets an inside edge, but he is luckier than AB, as this bounces over the stumps"}, {"ball": 1.3, "isHighlight": false, "text": "Rampaul to Nair,1 run,back of length on the body, the batsman dabs it to wide mid-on for a single"}, {"ball": 1.4, "isHighlight": false, "text": "Rampaul to Rahane,1 run,he stays on the back foot, drops this one towards points and calls for a quick single"}, {"ball": 1.5, "isHighlight": false, "text": "Rampaul to Nair,no run,he comes forward and pushes the length delivery to the crowded off-side field"}, {"ball": 1.6, "isHighlight": false, "text": "Rampaul to Nair,no run,another good outswinger, flies past the outside edge as Karun looks to push it to off"}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Rahane, $$FOUR$$ ,stylish! He stands up and crunches this off the back foot through the tiny gap at cover point. It was a length delivery with only a little bit of width"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Rahane,no run,he bowls this closer to off, the batsman defends it off"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Rahane,no run,another one that could have gone for a boundary, but Rahane crashes this straight to Kohli at cover point. Starc is not getting the movement, but he is serving up width"}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Rahane, $$FOUR$$ ,superb pull shot now! Starch shortens his length and Rahane swivels in quick time to power over midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Rahane,1 run,back of length on off this time, Rahane hops and drops it towards third man"}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Nair,2 runs,full and on the pads, Karun chips it over midwicket without much timing, but picks up a single nonetheless"}, {"ball": 3.1, "isHighlight": false, "text": "Rampaul to Rahane,no run,length delivery wide outside off, Rahane lets it go through. It stays a touch low this time"}, {"ball": 3.2, "isHighlight": false, "text": "Rampaul to Rahane,no run,stays low again, hits the toe of the bat as Rahane looks to push it to extra cover"}, {"ball": 3.2, "isHighlight": false, "text": "Narbavi: \"Criccat's comment reminds me something that happened in 2011 when there was a big auction after the first 3 seasons. RCB's owners strangely retained only Kohli despite the local crowd having developed a good rapport with the likes of Dravid, Uthappa, Steyn, Pandey, Ross Taylor etc and everyone started taking aim at Mr. Mallya's son on Twitter because RCB had a very poor start to the season. Then Gayle replaced the injured Nannes and started taking the tournament by storm which made them forget everything and cheer the team again.\""}, {"ball": 3.3, "isHighlight": false, "text": "Rampaul to Rahane,2 runs,could this be the first wicket! No, this leading edge just evades the point fielder. The batsman closed the face too early"}, {"ball": 3.4, "isHighlight": false, "text": "Rampaul to Rahane,1 run,back of length on the stumps, the batsman dabs it to square leg for a single"}, {"ball": 3.5, "isHighlight": false, "text": "Rampaul to Nair,1 run,length delivery on the stumps, Karun pushes it softly towards midwicket for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Rampaul to Rahane,no run,bangs this one short and Rahane sways away from the line"}, {"ball": 4.1, "isHighlight": false, "text": "Starc to Nair,3 runs,nicely punches it in the gap at midwicket, it was aerial, but right between the fielders"}, {"ball": 4.2, "isHighlight": false, "text": "Starc to Rahane,no run,that check punch! He plays it so well.. That raced to the extra cover fielder. Had it been in the gap, that would have raced through"}, {"ball": 4.2, "isHighlight": false, "text": "Samson the Sanju is the new man"}, {"ball": 4.3, "isHighlight": false, "text": "Starc to Rahane, $$OUT$$ ,super delivery! This one is angled across the batsman and deviates just enough to catch the outside edge. Rahane has to go, but he has already done more than 40% of the job"}, {"ball": 4.3, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$†Patel$$ $$b$$ $$Starc$$ $$23$$ $$(19m$$ $$19b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$121.05$$"}, {"ball": 4.4, "isHighlight": false, "text": "Starc to Samson,no run,comes forward and defends this length delivery solidly to off"}, {"ball": 4.5, "isHighlight": false, "text": "Starc to Samson,no run,fires this one down the leg side, some interest from behind the stumps as it flicked something on the way.. not the bat though"}, {"ball": 4.6, "isHighlight": false, "text": "Starc to Samson,1 leg bye,tucks the short of length delivery behind square to pick up a single"}, {"ball": 4.6, "isHighlight": false, "text": "Rajan: \"... And 23 out of 71 is more than 40%? Where did learn your maths???\" --- 31-run stand out of 71.. Luckily, I didn't go to the same school as you"}, {"ball": 5.1, "isHighlight": false, "text": "Rampaul to Samson,no run,length delivery on the stumps, defended down the pitch"}, {"ball": 5.2, "isHighlight": false, "text": "Rampaul to Samson,1 run,back of length delivery, Sanju gets on top of the bounce and dabs it to third man"}, {"ball": 5.3, "isHighlight": false, "text": "Rampaul to Nair,1 run,slightly slower this time from Rampaul, the batsman flicks it fine with ease"}, {"ball": 5.3, "isHighlight": false, "text": "Senthil : \"Its Good for RCB and Kohli this game came at the start of the tournament they can brush this aside and group together. This is Good for Kohli as a captain and as well as a batsman. some one like Dhoni has been in these situations and known how to stage comebacks for his team.\""}, {"ball": 5.4, "isHighlight": false, "text": "Rampaul to Samson,1 run,  $$OUT$$ ,another rising delivery, the batsman gets on top of it and drops it towards backward square leg. He tries to sneak a second one as the fielder is placed deep, but the throw comes in and finds Samson short of the crease."}, {"ball": 5.4, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$run$$ $$out$$ $$2$$ $$(6m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 5.4, "isHighlight": false, "text": "Still no Watson or Smith.. Nayar it is"}, {"ball": 5.5, "isHighlight": false, "text": "Rampaul to Nayar,1 wide,short delivery first up, but it's ill-directed, down the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Rampaul to Nayar,no run,he hops on his toes and drops the back of length delivery to cover"}, {"ball": 5.6, "isHighlight": false, "text": "Rampaul to Nayar,no run,back of length delivery on off, the batsman defends it off the back foot"}, {"ball": 6.1, "isHighlight": false, "text": "Starc to Nair,no run,floats it full and wide, draws the batsman into a loose drive and beats the bat"}, {"ball": 6.2, "isHighlight": false, "text": "Starc to Nair,no run,back of length delivery on the stumps, the batsman defends it to midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Starc to Nair, $$OUT$$ ,what's happening here! Nair slashes at this short and wide one and gets a thick outside edge to the keeper. Easy catch for Parthiv.. Kohli is pumped. Strange sort of period this.."}, {"ball": 6.3, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$c$$ $$†Patel$$ $$b$$ $$Starc$$ $$8$$ $$(32m$$ $$12b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 6.3, "isHighlight": false, "text": "Finally Watson walks out.. Kohli continues to attack with two slips"}, {"ball": 6.4, "isHighlight": false, "text": "Starc to Watson,no run,fuller on the pads, Watson drives it to midwicket off the front foot. Some buzz in the crowd now"}, {"ball": 6.5, "isHighlight": false, "text": "Starc to Watson,no run,super delivery! Parthiv and first slip go up immediately as the catch is taken by the keeper, but Starc has his hands on the head.. this one zipped past the outside edge."}, {"ball": 6.6, "isHighlight": false, "text": "Starc to Watson, $$FOUR$$ ,fuller delivery, Watson comes forward and punches it straight down the ground.."}, {"ball": 6.6, "isHighlight": false, "text": "Watson has a few things to say to Parthiv about that appeal as they cross at the end of the over.. Players crowd near the pitch, but they disperse before tempers flare"}, {"ball": 7.1, "isHighlight": false, "text": "Rampaul to Nayar,no run,circumspect cricket here, the batsman has a loose poke at an angled delivery, gets beaten"}, {"ball": 7.2, "isHighlight": false, "text": "Rampaul to Nayar,no run,length delivery outside off, this time he leaves it alone with ease"}, {"ball": 7.3, "isHighlight": false, "text": "Rampaul to Nayar, $$FOUR$$ ,comes forward and punches the length delivery on the up.. the mid-off is standing wide and he has no chance to cut this off"}, {"ball": 7.4, "isHighlight": false, "text": "Rampaul to Nayar,1 run,length delivery on off, the batsman opens the face of the bat to run it down to third man"}, {"ball": 7.5, "isHighlight": false, "text": "Rampaul to Watson,no run,he comes forward and defends the length delivery to cover"}, {"ball": 7.5, "isHighlight": false, "text": "Sam: \"Watson should not become so cocky on his good days. He should learn something from the team mentor, Dravid, who is called a legend not just for his runs but also for his perpetual humility.\""}, {"ball": 7.6, "isHighlight": false, "text": "Rampaul to Watson,1 run,length delivery on the pads, he dabs it softly to the right of midwicket for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Both Rampaul and Starc have bowled out their quota.."}, {"ball": 7.6, "isHighlight": false, "text": "Here's Chahal now..One slip in place"}, {"ball": 8.1, "isHighlight": false, "text": "Chahal to Watson,no run,tossed up delivery on the stumps, the batsman comes forward and defends"}, {"ball": 8.2, "isHighlight": false, "text": "Chahal to Watson,no run,he comes down the pitch and defends this length delivery"}, {"ball": 8.3, "isHighlight": false, "text": "Chahal to Watson,no run,flatter delivery this time, the batsman goes back and punches this to midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Chahal to Watson,no run"}, {"ball": 8.5, "isHighlight": false, "text": "Chahal to Watson,no run,bowls the slider, had Watson in a bit of a spot as he was going back and didn't expect it to come in.. Manages to get some bat on it"}, {"ball": 8.6, "isHighlight": false, "text": "Chahal to Watson,no run,he bowls a maiden now as he tosses this up outside off, Watson doesn't attempt a shot"}, {"ball": 8.6, "isHighlight": false, "text": "Joshua: \"Watson can be a brilliant cricketer, but both his body and mind let him down. Learning new things is not his strong suit.\""}, {"ball": 8.6, "isHighlight": false, "text": "One slip in place as Dinda comes in"}, {"ball": 9.1, "isHighlight": false, "text": "Dinda to Nayar,no run,length delivery just outside off, the batsman punches it to mid-on"}, {"ball": 9.2, "isHighlight": false, "text": "Dinda to Nayar,1 run,cracks this to point off the front foot, but the fielder manages to get a hand to prevent the boundary"}, {"ball": 9.2, "isHighlight": false, "text": "SD: \"I don't know if Watson needs to play to be a legend. If being aggressive and a bit of banter on the pitch are what fire him, then he should keep playing that way. He has a fantastic player in his own right. Same with Kohli. Not every person is the same, after all, and not everyone plays cricket to have a place in the cricketing pantheon.\""}, {"ball": 9.3, "isHighlight": false, "text": "Dinda to Watson,1 run,looks to push the length ball to the off side, but gets an inside edge to midwicket.. A sloppy throw gives them an extra run"}, {"ball": 9.4, "isHighlight": false, "text": "Dinda to Nayar,no run,beats the outside edge with an angled delivery. That had some extra bounce on it too"}, {"ball": 9.5, "isHighlight": false, "text": "Dinda to Nayar,no run,looks to pull the shorter bouncer, but goes through with his shot too early, is beaten"}, {"ball": 9.6, "isHighlight": false, "text": "Dinda to Nayar,no run,defends the length delivery to mid-off.."}, {"ball": 9.6, "isHighlight": false, "text": "aalhad kulkarni: \"Ah! 11 more overs like this one and the game's in the bag for RCB, isn't it?\""}, {"ball": 10.1, "isHighlight": false, "text": "Chahal to Watson,no run,some spin for Chahal this time, Watson defends it off the back foot"}, {"ball": 10.2, "isHighlight": false, "text": "Chahal to Watson, $$SIX$$ ,that's more like him! He takes a step down and hammers the fuller delivery straight over the umpire's head"}, {"ball": 10.3, "isHighlight": false, "text": "Chahal to Watson,no run,stretches forward and defends the fuller delivery to the leg side"}, {"ball": 10.4, "isHighlight": false, "text": "Chahal to Watson,no run,slightly short outside off, and because it stays low, the batsman is not able to hit it over the leg side, toe-ends it to mid-on"}, {"ball": 10.5, "isHighlight": false, "text": "Chahal to Watson,1 run,goes back and punches the back of length delivery to deep cover"}, {"ball": 10.6, "isHighlight": false, "text": "Chahal to Nayar,no run,stretches forward and defends the fuller delivery to the off side"}, {"ball": 11.1, "isHighlight": false, "text": "Dinda to Watson,no run,looks to cut the short of length delivery through off, but finds the man at cover point"}, {"ball": 11.2, "isHighlight": false, "text": "Dinda to Watson,2 runs,too straight this time, Watson clips it to deep midwicket to pick up a quick couple"}, {"ball": 11.3, "isHighlight": false, "text": "Dinda to Watson,no run,fires it full at the base of off stump, Watson digs it out to mid-off"}, {"ball": 11.4, "isHighlight": false, "text": "Dinda to Watson,3 runs,he sees the bowler rolls his fingers on this and launches it over extra cover.. Doesn't time it very well. But hello hello.. What has Nayar been doing? He is too late to turn for the third and he has to dive full length to try and get in. He has been saved by a frame."}, {"ball": 11.5, "isHighlight": false, "text": "Dinda to Nayar,no run,short of length delivery on off, he defends it off the back foot"}, {"ball": 11.6, "isHighlight": false, "text": "Dinda to Nayar,1 run,fuller delivery on the stumps, Nayar picks up his seventh run with a flick to fine leg"}, {"ball": 12.1, "isHighlight": false, "text": "Chahal to Nayar,no run,tossed up delivery outside off, the batsman comes forward and defends"}, {"ball": 12.2, "isHighlight": false, "text": "Chahal to Nayar,1 run,sweeps this from well outside the off but finds the man at deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Chahal to Watson,no run,flighted and on the middle and off line, the batsman comes forward and defends"}, {"ball": 12.4, "isHighlight": false, "text": "Chahal to Watson, $$SIX$$ ,reaches out and smashes the flighted one over the cow corner! This was wide outside off and he has dragged it for a 90 m hit"}, {"ball": 12.5, "isHighlight": false, "text": "Chahal to Watson, $$OUT$$ ,oh no! Watson tries to repeat the shot but is nowhere near the pitch of the delivery, only manages a big top edge to AB at cover. Chahal continues to impress - he slowed this one down intentionally"}, {"ball": 12.5, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Chahal$$ $$24$$ $$(29m$$ $$24b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 12.5, "isHighlight": false, "text": "Stuart Binny comes in.."}, {"ball": 12.6, "isHighlight": false, "text": "Chahal to Nayar,3 runs,he didn't read that googly at all, he edges it past the lone slip fielder to pick up three runs and register a win.. Not the best way to bring it, but this has been that kind of a match"}, {"ball": 12.6, "isHighlight": false, "text": "That's all from us. Time to move over to the next match - Kings XI v KKR.. Catch you over there."}, {"ball": 12.6, "isHighlight": false, "text": "\"It's was great way for us to bounce back after that loss against Chennai\" says  $$Shane$$ $$Watson$$ . \"He (Tambe) is very skillful and reads the batsman's mind very well. He is very cagey bowler, I play him a lot of the nets. this pitch was slightly drier than the last time we played here.\""}, {"ball": 12.6, "isHighlight": false, "text": "$$Pravin$$ $$Tambe$$  is the Man of the Match"}, {"ball": 12.6, "isHighlight": false, "text": "\"Looks like we didn't arrive on the field today,\" says  $$Virat$$ $$Kohli$$ . \"It was  one of those days that we need to forget quickly. The pressure created by Royals was extended over a long time. When you lose wicket every over, it builds up pressure. When I batted, I felt it was a good wicket, but that's what happens when you lose wickets.\""}, {"ball": 12.6, "isHighlight": false, "text": "\"It's probably the most grass i will see for the next month,\" says  $$Mitchell$$ $$Starc$$ , the purple cap holder. \"We needed wickets, but unfortunately not enough runs on the board.\""}, {"ball": 12.6, "isHighlight": false, "text": "Watson gets a cheque for hitting two sixes, Ajinkya Rahane gets an award for keeping calm while running out Parthiv Patel."}, {"ball": 12.6, "isHighlight": false, "text": "After moving at snail's pace, the match finally ends. Just 141 runs scored for the loss of 14 wickets in 28 overs.The star of the day was Pravin Tambe for his four wickets, but a strange day for the batsmen. No one really looked comfortable today."}, {"ball": 12.6, "isHighlight": false, "text": "Sam: \"Just imagine how Gayle is going to exact revenge the next time these sides meet. :)\""}, {"ball": 12.6, "isHighlight": false, "text": "Sharma: \"Will be interesting to see how Maxwell plays on this pitch..especially against the turn of Narine...\""}], "name": "Rajasthan Royals v Royal Challengers Bangalore", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729305.html?innings=2;view=commentary", "match_num": 14}