{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$6.30$$ $$pm$$  KKR spill out into the field. Virender Sehwag, as cool as ever, walks out with Cheteshwar Pujara. Game time, people. Gambhir is at the other end of the spectrum, taking great effort to get his field in order. Umesh Yadav set to steam in, with a slip in place"}, {"ball": 0, "isHighlight": false, "text": "Abdul: \"I hope Sehwag blasts off today!! Been waiting far too long to see the man fire!\" Well, we'll know one way or the other in just a few minutes"}, {"ball": 0, "isHighlight": false, "text": "Harish: \"Why has Mandeep Singh not been given a chance?? what Pujara was doing at top order??? I want to remind to all of you guys that there is a player called Manan Vohra(retained player) warming the bench.\" It's hard to get into that top six. The three international players are pretty much set, then there's Viru and Pujara and the keeper Saha."}, {"ball": 0, "isHighlight": false, "text": "ram: \"will kkr ever drop yusuf? does he hit sixes in practice? what is ensuring his selection?\""}, {"ball": 0, "isHighlight": false, "text": "Ozee: \"I don't think picking chawla is a good move....even though he may have a good googly....but Punjab has got a bunch of right handers....and with the ball coming in.....its doing to be easy to whack it into the leg side.\""}, {"ball": 0, "isHighlight": false, "text": "\"As a KXIP's fan I am quite happy to hear that Piyush Chawla is playing. In fact Miller and Maxwell should be happy too.\" Stats back you up, Ravinder. Before this tournament, Chawla has conceded 94 sixes, second behind another leggie Amit Mishra. The thing is he has a terrific googly that puts batsmen who are not familiar with him in big trouble"}, {"ball": 0, "isHighlight": false, "text": "Mahesh: \"Why did KXIP retain Manan Vohra and not giving him the place in playing XI..???\""}, {"ball": 0, "isHighlight": false, "text": "Adithya: \"What is Gambhir thinking? Doesn't he care that all of us now have to take out Vinay from our fantasy teams? :P \" Maybe he's just getting back at you for teasing him about his tournament so far?"}, {"ball": 0, "isHighlight": false, "text": "$$6.00$$ $$pm$$ $$Kolkata$$ $$Knight$$ $$Riders$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bowl.$$ $$Piyush$$ $$Chawla$$ $$is$$ $$in$$ $$for$$ $$Vinay$$ $$Kumar$$  in a horses for courses move and the attack was getting one-dimensional. Boundaries are also bigger in Abu Dhabi. Gambhir says he's proud of the fight his team have shown so far and says whatever help is there will be available up front and in the night the ball might come on better to the bat"}, {"ball": 0, "isHighlight": false, "text": "Punjab, who are unchanged, are happy to bat. The pitch changes a bit from the day to night games, says George Bailey"}, {"ball": 0, "isHighlight": false, "text": "Narbavi: \"So have you already decided that KKR will stick with Morne despite him leaking runs off late? I think they should pick Cummins for this game!!\" I'd actually prefer to see them both steaming in with the new ball."}, {"ball": 0, "isHighlight": false, "text": "$$5.50$$ $$pm$$  Maxwell has been hiding Kings XI's batting so far, but he'll have his task cut out against a challenging Knight Riders attack. If he keeps out Sunil Narine, there's Morne Morkel lurking. How will his compatriots fare if the law of averages catch up with him is what Rachna Shetty asks in her  $$preview$$ . This is how things are as they stand, the  $$points$$ $$table$$"}, {"ball": 0, "isHighlight": false, "text": "Sushil: \"Gambhir should not open today..!! he is certainly short of confidence he should allow Bisla to open with Jack!!\""}, {"ball": 0, "isHighlight": false, "text": "\"Gambhir is just one duck away form becoming the official brand ambassador of Audi....:P :D\" That's a teensy bit mean, isn't it Ozee? But then again, Gauti tends to do best when he's countering criticism"}, {"ball": 0, "isHighlight": false, "text": "Amit: \"Johnson bowling on this track & Gambhir playing 1st ball. Are we going to see 4th duck or Gambhir playing well against him??\" Considering how distraught he was after being dismissed in the last game, I wouldn't count out a comeback. And yes, I'm addicted to alliteration"}, {"ball": 0, "isHighlight": false, "text": "Mazhar: \"Hey guys, missed the action of the 1st match in tv...is the pitch playing bad or both team's batters underperformed?..anyway, it will be big test for maxwell tonight against Narine..hope they play with some tactics behind them so that pujara plays out most of narine's deliveries..that will definitely play in favor of KXIP as maxwell will definitely cash in on other bowlers for sure.\" There was a little help early on, but it wasn't a minefield by any means. Just feckless batting."}, {"ball": 0, "isHighlight": false, "text": "$$5.40$$ $$pm$$  A rather subdued affair in the afternoon, but things are about to kick into high gear. It's table-toppers Kings XI Punjab taking on a resurgent Kolkata Knight Riders. And even Chris Lynn's gravity-defying grab has ejected the one thing that's run rampant in the IPL"}, {"ball": 0, "isHighlight": false, "text": "SV: \"The stage is perfectly set for Maxwell to play another \"MAXWELL innings\" and make batting look easy on a pitch where Royals and RCB batsman have struggled.\""}, {"ball": 0, "isHighlight": false, "text": "---------------------"}, {"ball": 0, "isHighlight": false, "text": "Two more days left in Powerplay 1 of CricIQ. It's time to get a hang of things and prepare for the challenges ahead. Tens of thousands of new questions coming your way.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  continues..."}, {"ball": 0.1, "isHighlight": false, "text": "UT Yadav to Pujara,no run,flirts with an outswinger outside off, rather tame effort from Pujara and he's beaten first up"}, {"ball": 0.2, "isHighlight": false, "text": "UT Yadav to Pujara,no run,persists with a fuller length after seeing the ball dart around. Pujara presses forward and finds mid-off"}, {"ball": 0.3, "isHighlight": false, "text": "UT Yadav to Pujara, $$FOUR$$ ,width on offer and he's drilled it through the covers. That's what he said he wanted to concentrate on, using proper cricket shots to collect his runs. Batting outside his crease too"}, {"ball": 0.4, "isHighlight": false, "text": "UT Yadav to Pujara,no run,straightened a touch on middle and off, Pujara blocks with a straight bat. Lovely full length again"}, {"ball": 0.5, "isHighlight": false, "text": "UT Yadav to Pujara,2 runs,back of a length on off stump, Pujara tucks it around the corner and gets a couple. These two aren't the quickest and Pujara had to stretch"}, {"ball": 0.6, "isHighlight": false, "text": "UT Yadav to Pujara,1 run,that's trademark Pujara. Short and outside off, he waits on the back foot and cracks it to point. Diving effort needed to stop that"}, {"ball": 0.6, "isHighlight": false, "text": "Abhimanyu: \"Much has been talked about Maxwell vs Narine. I think Viru vs Narine would be an interesting contest too, provided he stays at the crease until Narine comes out for a bowl. Remember the match when he hit 219? He thrashed Narine all over the park. Moreover, Narine once said that Viru is one of the players who reads his balls easily.\""}, {"ball": 0.6, "isHighlight": false, "text": "Raghu: \"Pujara has given a good support to Sehwag, Maxwell & Miller & has better strike-rate than most of destructive bastmen of his IPL.\""}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Pujara,1 no ball,Morkel, you absolute beauty! Cuts Pujara in half with an inswinger that was pitched short of a length. The movement was prodigious and the umpire reckons it's been gloved before lobbing up into the hands of the keeper. Only one problem though, he's overstepped by several inches. So not only is there no wicket, it's a free hit. The glove was off the bat as well, so it shouldn't have beeen out in the first place"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Pujara,1 run,back of a length and outside off, Pujara swats it down the throat of mid-off but it's a free hit and he treats himself to a single"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Sehwag,no run,fullish on middle and leg, Sehwag doesn't move much as he nudges into midwicket"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Sehwag,no run,thuds into Sehwag a lot quicker than he expects. It was back of a length and darts in off the pitch, Sehwag is up on his toes looking to block but is struck high on the pads."}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Sehwag, $$OUT$$ ,stays dead still and pushes away from the body. The fullish delivery is inside edged onto pad and skews out towards point. They want the single but Pandey swoops in from point and hits direct. Pujara is caught short. So from celebrating the overthow going to the boundary, Punjab are one down"}, {"ball": 1.4, "isHighlight": false, "text": "$$CA$$ $$Pujara$$ $$run$$ $$out$$ $$8$$ $$(9m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 1.4, "isHighlight": false, "text": "Saha is in at No.3, much to the chagrin of the Maxwell fans"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Saha,no run,bouncer to start off and Saha drops his wrists and sways inside the line"}, {"ball": 1.5, "isHighlight": false, "text": "Wadud: \"Pujara out 3 times in one ball !!!!\""}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Saha,no run,that's a brute! This time the bouncer follows Saha as he sways inside the line. Does exceptionally well jerk away and not get hit. Morkel is enjoying this pitch"}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,straying on the pads but Viru cannot pick it away. Struck on the pads and it wanders away"}, {"ball": 2.2, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,shortish delivery on his hips, Sehwag clips to square leg"}, {"ball": 2.2, "isHighlight": false, "text": "Rahul: \"Saha is the nightwatchman from KXIP!! :P\""}, {"ball": 2.3, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,back of a length with a bit of width, Sehwag stands up tall and punches to cover point"}, {"ball": 2.4, "isHighlight": false, "text": "UT Yadav to Saha,1 run,shuffles across his stumps to whip the back of a length delivery off middle to deep fine leg"}, {"ball": 2.5, "isHighlight": false, "text": "UT Yadav to Sehwag, $$FOUR$$ ,stand and deliver! Takes us back to his glory days as he pummels a fuller delivery offering him ample room to free his hands. Bounces about an inch from the extra cover boundary"}, {"ball": 2.6, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,tucks him up with a back of a length delivery on the pads, Sehwag looks to glance it fine but it brushes his thigh pad and goes to the keeper"}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Saha,no run,he's bowling a terrific length here. Digs into the pitch and gets the ball to jag back into the batsman. Saha is cramped for room and has to pull off the bottom hand while he adjusts to defend"}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Saha,2 runs,this is a swirler and Yadav racing in from deep third man has  $$spilled$$  it. Plays a nothing shot to a shortish delivery on middle, gets a thick leading edge that soars up in the air. He gets both hands to it but it pops out. Camera pans to a pensive Lynn"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Saha, $$FOUR$$ ,whoa! Seems it wasn't so much of a nothing shot this time. Attempts it again and though he gets it high on the bat, it is picked away to the long leg boundary"}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Saha,no run"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Saha, $$SIX$$ ,this is into the grass banks behind long leg! It was length and Saha swung for all his worth. Did not time it, in fact the bat turned on impact but he gets enough height on it for the trajectory to take it beyond the boundary"}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Saha,1 run,back of a length and on middle, nudges it through to square leg"}, {"ball": 3.6, "isHighlight": false, "text": "Raghu Ifmr: \"Just getting a feeling that Sehwag has lost his famous Hand-eye coordination which is in main gift. In the old days anything on those pads would have gone out the ground..\""}, {"ball": 3.6, "isHighlight": false, "text": "Sahil: \"Cant understand this defensive mindset of Bailey. Even though a wicket fell early, Maxwell would have been the best bet. It would have confused Gambhir too in whether to bring Narine early into the attack or not. If not Maxwell, Bailey could have promoted himself up the order. You dont want Saha in when Pujara is already there at the other end.\" I assume you sent this comment before the last over"}, {"ball": 4.1, "isHighlight": false, "text": "Kallis to Saha, $$OUT$$ ,Kallis and his golden arm strikes! Saha was walking right across his stumps and is found in front of middle and leg. Starts with a full one that tails in just a touch, Saha was playing a little around his front pad and pays the price"}, {"ball": 4.1, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$lbw$$ $$b$$ $$Kallis$$ $$14$$ $$(11m$$ $$10b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 4.1, "isHighlight": false, "text": "Glenn Maxwell takes guard and surveys the field. Or is the boundaries?"}, {"ball": 4.2, "isHighlight": false, "text": "Kallis to Maxwell,1 leg bye,on a good length, Maxi shuffles across and picks it away into the square leg region"}, {"ball": 4.3, "isHighlight": false, "text": "Kallis to Sehwag,1 leg bye,shortish and outside off but Sehwag has moved outside off and looks to pull off one foot, doesn't connect properly and has to settle for a single behind square leg"}, {"ball": 4.4, "isHighlight": false, "text": "Kallis to Maxwell,no run,fullish and on the pads, Maxi pushes to mid-on"}, {"ball": 4.5, "isHighlight": false, "text": "Kallis to Maxwell,2 runs,what happened there?! It was dug in short and he was looking to duck under it but the bat was propped straight up. Periscoped it beyond the reach of short fine leg"}, {"ball": 4.6, "isHighlight": false, "text": "Kallis to Maxwell,1 wide,slides this one down the leg side, Maxi can't glance it away"}, {"ball": 4.6, "isHighlight": false, "text": "Kallis to Maxwell, $$FOUR$$ ,there we go. Skips down the track while making a bit of room, Kallis tried to put this out of his reach but just ends up giving all the room necessary for him to slap it through extra cover"}, {"ball": 4.6, "isHighlight": false, "text": "Badri: \"KXIP losing 2 early wickets is nothing spl. Hopefully we will now get to see some Maxi/Sehwag spl... #fingerscrossed\" Sunil Narine now"}, {"ball": 4.6, "isHighlight": false, "text": "vadi: \"Past Maxwell and Future Shewag at the crease\""}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Sehwag,2 runs,goes after him straight away, sees a little bit of flight and lofts him with an open face. Not too well timed though"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Sehwag, $$SIX$$ ,slog swept and this has Sehwag written all over it! On middle and he lunges forward and with that big backlift, he's murdered it over deep midwicket"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Sehwag,no run,pushed through just outside off, Sehwag wants to hit it inside out through extra but it beats the outside edge"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Sehwag,1 run,moves around in the crease to try and fox the bowler, who tosses it up on middle. Nudged through midwicket. Well bowled that"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Maxwell, $$FOUR$$ ,first ball against Narine and he's reverse swept him to the point boundary! It was in the slot and Maxi's power comes to the fore again"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Maxwell,1 run,prodded rather calmly down to long-on. Was in the air a little as he failed to reach the pitch"}, {"ball": 5.6, "isHighlight": false, "text": "Adway Lele: \"I'm in office & hungry. I was planning to take a break suddenly Maxwell is in. Now, I'm unable to unglue myself from screen.\""}, {"ball": 6.1, "isHighlight": false, "text": "Kallis to Maxwell,1 run,fullish and outside off, Maxi looks to hack it through midwicket but gets an inside edge through to deep fine leg"}, {"ball": 6.2, "isHighlight": false, "text": "Kallis to Sehwag,1 run,full on middle, Sehwag clips it and those wrists have enough power to find deep midwikcet"}, {"ball": 6.3, "isHighlight": false, "text": "Kallis to Maxwell,no run,sneaks in a short ball and it had a little more oomph behind it. Nice height on it as Maxi looks to hook and misses. Pretty close to being called a wide too"}, {"ball": 6.4, "isHighlight": false, "text": "Kallis to Maxwell,1 run,back of a length, nudges it into the fine leg region and races down seeking a couple. Sehwag though has only jogged across to the other end"}, {"ball": 6.5, "isHighlight": false, "text": "Kallis to Sehwag,1 run,length and outside off, he looks to pull it but doesn't account for the slower pace. Gets an inside edge that hits his toes and stops beside the wickets. Maxi calls him through for a single"}, {"ball": 6.5, "isHighlight": false, "text": "Yash: \"I'm going to use my fingers to count Maxi's dot balls. Should be enough...\""}, {"ball": 6.6, "isHighlight": false, "text": "Kallis to Maxwell,1 run,goes down and thumps a length ball from Kallis to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "Morkel in for his third, this is an aggressive move from Gauti"}, {"ball": 7.1, "isHighlight": false, "text": "Morkel to Maxwell,1 run,that's a mis-hit. He was advancing and Morkel pushes it wide. Gets it off the toe and it goes straight up. But falls well short of the on-rushing deep third man"}, {"ball": 7.2, "isHighlight": false, "text": "Morkel to Sehwag,no run,back of a length and on the stumps, Sehwag backs away and cuts. Little more bounce than he thought and he's beaten"}, {"ball": 7.3, "isHighlight": false, "text": "Morkel to Sehwag,1 run,fires a yorker that was seeking the base of middle, Sehwag does well to dig it out to mid-off"}, {"ball": 7.4, "isHighlight": false, "text": "Morkel to Maxwell, $$OUT$$ ,leg stump cartwheels and KKR erupt! He was moving well across outside off to try and pick it away fine. But this is a gorgeous yorker from Morkel and when he doesn't hit, it's timber. Gamble pays off. Maxi has been playing extravagant shots to great results, but this was just a little too much"}, {"ball": 7.4, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$b$$ $$Morkel$$ $$15$$ $$(14m$$ $$12b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 7.4, "isHighlight": false, "text": "There's the other 'M'an in form. David Miller takes guard"}, {"ball": 7.5, "isHighlight": false, "text": "Morkel to Miller,no run,meets him with a short ball at 146.9 kph and Miller is rammed on the glove. This is definitely Mornzilla"}, {"ball": 7.6, "isHighlight": false, "text": "Morkel to Miller,1 run,back of a length on leg, Miller works it away towards square leg"}, {"ball": 7.6, "isHighlight": false, "text": "Aalhad Kulkarni: \"Law of averages hurting Maxwell!! Will it help Sehwag and Gambhir?\" Kallis moves around the wicket"}, {"ball": 8.1, "isHighlight": false, "text": "Kallis to Miller,no run,full on off stump, pushes down the ground with a straight bat"}, {"ball": 8.2, "isHighlight": false, "text": "Kallis to Miller,1 run,fullish on off stump, Miller is forward and drills it down to long-off. Made such a good sound off the bat"}, {"ball": 8.2, "isHighlight": false, "text": "Raghu Ifmr: \"I am just gonna go ahead and say it, putting all my Gambhir biases away. He has been THE most attacking captain in this IPL so far. Not waiting for anything to happen, always making things happen. \""}, {"ball": 8.3, "isHighlight": false, "text": "Kallis to Sehwag,1 run,carves it to third man with an open face as Kallis delivers a shortish one with a little room"}, {"ball": 8.4, "isHighlight": false, "text": "Kallis to Miller, $$FOUR$$ ,heaved past mid-on. It was length and he pushed his weight forward and gets it more off the inside edge than anything"}, {"ball": 8.5, "isHighlight": false, "text": "Kallis to Miller, $$FOUR$$ ,makes up for it with a top-class cover drive. Leans into the overpitched delivery outside off and scythes it through the infield"}, {"ball": 8.6, "isHighlight": false, "text": "Kallis to Miller,2 runs,good length ball on and around off stump, Miller works it wide of long-on and they scamper across for a couple and that brings us to a time out"}, {"ball": 8.6, "isHighlight": false, "text": "Ananth: \"When was the last time we saw Sehwag play 9 overs for just 18 runs!!! \""}, {"ball": 8.6, "isHighlight": false, "text": "Anand: \"Sehwag playing responsibly is another dangerous prospect. KKR should use Narine right now rather than in later.\" Piyush Chawla has a point to prove today"}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to Sehwag,1 run,a little short to start off and Sehwag stays back and pulls to long-on. On the bright side there is a bit of turn out there for him"}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Miller,2 runs,short again and Miller waits on the back foot to see which way it turns. Doesn't, so he punches it past a diving short cover"}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Miller,no run,tossed up googly, misreads it as he goes for a slog sweep. Gets struck on the back pad, but the leg before shout was in vain as it was going past off stump"}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to Miller, $$OUT$$ ,there's another tactical victory for Gauti. Miller races down to the googly and slogs it. Gets it right off the bottom of the bat and Morkel, the tallest bloke in the park, collects a safe, jogging catch at long-on"}, {"ball": 9.4, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$c$$ $$Morkel$$ $$b$$ $$Chawla$$ $$14$$ $$(12m$$ $$10b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to Sehwag,1 run,loopy legspinner outside off, Sehwag is forward and slaps it through to the sweeper"}, {"ball": 9.5, "isHighlight": false, "text": "George Bailey is in with his side in considerable trouble"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Bailey,1 run,tossed up outside off, turned away down to long-on"}, {"ball": 9.6, "isHighlight": false, "text": "Ankur Shrestha: \"Great stuff from KKR. Now they just need to bring in Narine to create a little pressure and they might get their wickets\" Actually it's all pace, Umesh Yadav now"}, {"ball": 10.1, "isHighlight": false, "text": "UT Yadav to Bailey,1 run,shortish and outside off, Bailey pulls with authority to deep midwicket"}, {"ball": 10.2, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,back of a length and outside off, Sehwag opens the face on impact and punches it through to the sweeper"}, {"ball": 10.3, "isHighlight": false, "text": "UT Yadav to Bailey,no run,hurried into him and Bailey was caught midway through a short-armed jab. Manages to push it down to long-on"}, {"ball": 10.4, "isHighlight": false, "text": "UT Yadav to Bailey, $$FOUR$$ ,that's gorgeously placed. Bowling short is giving Bailey enough time to rock back and pull it well square of long leg"}, {"ball": 10.5, "isHighlight": false, "text": "UT Yadav to Bailey,1 run,fullish and outside off, Bailey taps and runs into the off side"}, {"ball": 10.6, "isHighlight": false, "text": "UT Yadav to Sehwag, $$FOUR$$ ,it's Sehwag's turn this time. This was full and on the pads, Sehwag flicks to the right of long leg. Wonderful timing"}, {"ball": 10.6, "isHighlight": false, "text": "rssampat: \"Sehwag consistently threatining to find form and looks like he is just 1 innings away from a big one, Maxwell in superlative form, Miller & Bailey as solid as we have seen anything in the IPL so far, Pujara chipping in and holding 1 end up and a dangerous lower order with Mitchell, Patel who can hit the ball hard and long. PKX1 look a dangerous outfit to mess with most times and might go all the way with one or the other batsmen putting up his hand every time and each a match winner in his own right.\""}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to Bailey,no run,tossed right up on off stump, Bailey was looking to wind up but decides against it"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to Bailey,1 run,stays back and punches down to long-on. it was full enough to come forward but I suspect Bailey likes using his back foot"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Sehwag,no run,flighted just outside off, Sehwag doesn't bother with his feet and pushes into the covers"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Sehwag, $$FOUR$$ ,another Sehwag special! Backs away after he sees the ball short and cuts it behind point. Opened the face just enough to bisect the two men in the area"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to Sehwag,1 run,flighted onto the pads, Sehwag nurdles it behind square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to Bailey,1 run,gives the googly a bit of air, Bailey hasn't picked it as he looks to drive through the covers. Gets an inside edge through square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Sandeep: \"Is Gambhir new Ganguly ... great captaincy, not getting runs out of bat, out of Indian team & everyone wants to see him back in it. \""}, {"ball": 11.6, "isHighlight": false, "text": "Narine's back with a slip"}, {"ball": 12.1, "isHighlight": false, "text": "Narine to Bailey,no run,nervous start from Bailey as he goes back to block a bit of a legbreak"}, {"ball": 12.2, "isHighlight": false, "text": "Narine to Bailey,no run,wanders down the track and tentatively nudges to the right of the bowler"}, {"ball": 12.3, "isHighlight": false, "text": "Narine to Bailey,no run,stays rooted to the crease as he blocks the delivery. He's not reading him off the fingers"}, {"ball": 12.4, "isHighlight": false, "text": "Narine to Bailey,1 run,a little too short that time and Bailey escapes with a push to long-on"}, {"ball": 12.5, "isHighlight": false, "text": "Narine to Sehwag,2 runs,evades Pandey at cover. This was a leading edge as Narine tempts him with a flighted delivery. Sehwag clears his front leg but mistimes the stroke"}, {"ball": 12.6, "isHighlight": false, "text": "Narine to Sehwag,2 runs,pushed through and it's clipped down to long-on"}, {"ball": 12.6, "isHighlight": false, "text": "Varun: \"Raghu - Thats exactly why the KKR team management has retained him. They obviously didn't retain him as a batsman when he didn't even have a good domestic season behind him. They retained him as a captain because as a captain, he's aggressive, knows how to utilize his bowlers in the best possible way and knows how to make things happen. If he doesn't fire with the bat, he'll do enough with his captaincy. Delhi made THE biggest mistake by not retaining him after the 3rd season, the price for which they are still paying.\""}, {"ball": 13.1, "isHighlight": false, "text": "Chawla to Bailey,1 run,stays low but since he was already camped on the back foot he's able to chop it down to the sweeper"}, {"ball": 13.2, "isHighlight": false, "text": "Chawla to Sehwag,1 run,skips down the track and looks to swipe at it. Gets a thick inside edge that trickles down towards short fine leg"}, {"ball": 13.3, "isHighlight": false, "text": "Chawla to Bailey,no run,Bailey advances now, but it's pushed through and he has to adjust and wears it on the pads"}, {"ball": 13.4, "isHighlight": false, "text": "Chawla to Bailey, $$OUT$$ ,the frustration gets to him. Tossed up on middle and Bailey slams him down the ground. It's a big boundary there and Morkel is patrolling it. Takes a reverse cup supremely comfortably"}, {"ball": 13.4, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$c$$ $$Morkel$$ $$b$$ $$Chawla$$ $$11$$ $$(13m$$ $$15b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$73.33$$"}, {"ball": 13.5, "isHighlight": false, "text": "Chawla to Sehwag,2 runs,shortish and turning away, Sehwag pulls to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Chawla to Sehwag, $$OUT$$ ,googly goes through and Sehwag looks woefully at his middle stump that's taken a battering. Foxed him all ends up and with his penchant for lead feet, Sehwag and his feeble prod bad no choice. That's also the time out"}, {"ball": 13.6, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$b$$ $$Chawla$$ $$37$$ $$(65m$$ $$30b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$123.33$$"}, {"ball": 13.6, "isHighlight": false, "text": "waqar: \"Honeymoon over. Reality begins for Kings\""}, {"ball": 13.6, "isHighlight": false, "text": "Kallis to bowl out, Rishi Dhwan and Akshar Patel are quite new at the crease"}, {"ball": 14.1, "isHighlight": false, "text": "Kallis to Dhawan,1 run,back of a length, he taps it past the outstretched right hand of point"}, {"ball": 14.2, "isHighlight": false, "text": "Kallis to Patel,1 run,short ball and Patel, who is named 'Axar' in the back of his shirt, isn't too comfortable. Pulls quite late and it goes to the left of mid-on"}, {"ball": 14.3, "isHighlight": false, "text": "Kallis to Dhawan,no run,leans into a lovely drive to point. Dhawan looking like he belongs as he eases a good length ball, but fails to find the gap"}, {"ball": 14.4, "isHighlight": false, "text": "Kallis to Dhawan, $$FOUR$$ ,strays on the pads and he's clipped it away to the fine leg boundary. Nicely done"}, {"ball": 14.5, "isHighlight": false, "text": "Kallis to Dhawan,1 run,shortish and outside off, he hacks it down towards midwicket. Slower ball foils his timing"}, {"ball": 14.5, "isHighlight": false, "text": "Trishanth diwat: \"@rssampat, you jinxed the whole tournament for kings XI now\""}, {"ball": 14.6, "isHighlight": false, "text": "Kallis to Patel,1 run,fullish and outside off, he pushes to mid-off and collects a well-run single"}, {"ball": 14.6, "isHighlight": false, "text": "rssampat: \"2 inexperienced players at the crease. GG should bowl out Naraine as he can pick up a wicket or two now and then Morkel can be brought back to fire at the tail. This holding back instead of attacking is simply giving away runs for free. Even if Kallis or Yadav are bowling at the death, they could be bowling to a No:10 or 11 who could cause least damage instead of these batsmen swing away in the slog\" Chawla to bowl out"}, {"ball": 15.1, "isHighlight": false, "text": "Chawla to Patel,1 run,flighted on middle, turned away into the midwicket region and Chawla himself races after it"}, {"ball": 15.2, "isHighlight": false, "text": "Chawla to Dhawan,no run,rocks back and cuts into the covers, but Yusuf throws himself to his right and keeps it to nothing. That was timing quite well"}, {"ball": 15.3, "isHighlight": false, "text": "Chawla to Dhawan,no run,teases him outside off, Dhawan chases it and taps it to point. That would have been a wide"}, {"ball": 15.4, "isHighlight": false, "text": "Chawla to Dhawan,1 run,gorgeous loop on this and he is lured into a push through the covers. Goes uppishly but it is too far to the left of Yusuf"}, {"ball": 15.5, "isHighlight": false, "text": "Chawla to Patel,1 run,flighted on middle, he sweeps confidently to deep square leg"}, {"ball": 15.6, "isHighlight": false, "text": "Chawla to Dhawan,no run,pushed through on leg stump, Dhawan pushes forward to block but gets struck on the pads. No appeal as it would have been going down"}, {"ball": 15.6, "isHighlight": false, "text": "Here's Narine, still with a slip"}, {"ball": 16.1, "isHighlight": false, "text": "Narine to Patel,1 run,tosses it up outside off, Patel drives down to long-on"}, {"ball": 16.1, "isHighlight": false, "text": "Tushar: \"Still remember Balaji's sixes against Pak in 2004... Are we gonna see some today??!! The way KXI are playing, cant rule out the possibility\" Think Mitch has a better chance"}, {"ball": 16.2, "isHighlight": false, "text": "Narine to Dhawan,1 run,shortish and outside off, Dhawan pulls down to long-on"}, {"ball": 16.3, "isHighlight": false, "text": "Narine to Patel,no run,this turns away from him, Patel stays back and dabs to short third man"}, {"ball": 16.4, "isHighlight": false, "text": "Narine to Patel,1 run,waits on his back foot and turns it away through square leg. Didn't look completely convincing"}, {"ball": 16.5, "isHighlight": false, "text": "Narine to Dhawan,no run,little nibble away and Dhawan can only defend it back to the bowler"}, {"ball": 16.6, "isHighlight": false, "text": "Narine to Dhawan,1 run,set up for the slog sweep on the off stump, but Narine pulled his length back. Carts it along the ground to deep midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "vj: \"140 is good enough to defend in this pitch, these two are very good domestic players with Johnson to follow\" Morkel comes back for his final over. Three overs 1-18"}, {"ball": 17.1, "isHighlight": false, "text": "Morkel to Dhawan,no run,and straight away he's too quick for him. Backed away and looks to work through midwicket, but the back of a length ball goes through him to the keeper"}, {"ball": 17.2, "isHighlight": false, "text": "Morkel to Dhawan,no run,backs away and slaps the length ball to mid-off"}, {"ball": 17.3, "isHighlight": false, "text": "Morkel to Dhawan, $$FOUR$$ ,this was short but was tagged with a bit of width and Dhawan has backed away and forehands it over mid-on. Punjab need a few of those"}, {"ball": 17.4, "isHighlight": false, "text": "Morkel to Dhawan,3 runs,he succeeds in doing what Maxi failed. Walks across and scoops Morkel over fine leg. It wasn't quite the yorker though, in fact it was the perfect length to help on its way. But you have to be brave to try that against a 150kph bowler"}, {"ball": 17.5, "isHighlight": false, "text": "Morkel to Patel,no run,145kph, shortish and outside off, he looks to steer it down to third man. Misses"}, {"ball": 17.5, "isHighlight": false, "text": "Dr.Purnesh: \"@VJ : reminder, Mitch is not currently in his best form like in the Ashes...\" Think he was talking about Mitch's batting"}, {"ball": 17.6, "isHighlight": false, "text": "Morkel to Patel,1 run,gets this to rise up around his chest, Patel is back and up on his toes as he nudges into midwicket region"}, {"ball": 17.6, "isHighlight": false, "text": "Narine into his last over"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Patel, $$OUT$$ ,it happened like clockwork. Lured him out of his crease with a flighted delivery, but it pitches and turns across him. Patel had no clue as he wafts at it. No connection made and the keeper whips off the bails. All too easy"}, {"ball": 18.1, "isHighlight": false, "text": "$$AR$$ $$Patel$$ $$st$$ $$†Uthappa$$ $$b$$ $$Narine$$ $$7$$ $$(19m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$70.00$$"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson comes out and taps the pitch before he gets ready"}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Johnson, $$OUT$$ ,through him first ball! Reaches forward but he has a big gap between bat and pad as he played down the wrong line. The ball turns in and off stump is knocked back"}, {"ball": 18.2, "isHighlight": false, "text": "$$MG$$ $$Johnson$$ $$b$$ $$Narine$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.2, "isHighlight": false, "text": "Two slips in, Narine on a hat-trick"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Balaji,no run,tossed up on off stump, lunges forward and blocks"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Balaji, $$OUT$$ ,that's three in the over! Balaji goes for a sweep across the line and is caught in front of middle. This pitched on a good length and skidded onto him, strikes on the knee-roll and that's a pretty easy decision for Umpire Dharmasena"}, {"ball": 18.4, "isHighlight": false, "text": "$$L$$ $$Balaji$$ $$lbw$$ $$b$$ $$Narine$$ $$0$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.4, "isHighlight": false, "text": "rssampat: \"Naraine is simply too much for the lower batsmen and specially on a helpful pitch, he simply becomes unplayable.\""}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Sandeep Sharma,no run,pushed through on a good length, Sharma pokes outside off and is comfortably beaten"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Sandeep Sharma,1 run,strays on the pads and this is turned away in front of square leg"}, {"ball": 19.1, "isHighlight": false, "text": "UT Yadav to Sandeep Sharma,no run,fullish and outside off, that's a Test match length and he beats Sharma's uncertain push"}, {"ball": 19.2, "isHighlight": false, "text": "UT Yadav to Sandeep Sharma,1 run,hurries him on middle and leg, manages to push down the ground for a single"}, {"ball": 19.2, "isHighlight": false, "text": "Siva Kumar: \"Problem for Punjab is that they don't have a world class spinner in their ranks who can fox the batsmen. That could make things easy for KKR.\""}, {"ball": 19.3, "isHighlight": false, "text": "UT Yadav to Dhawan,2 runs,clears his front leg and carves the length ball over point. Couple to deep third man"}, {"ball": 19.4, "isHighlight": false, "text": "UT Yadav to Dhawan,1 run,low full toss on off stump, slapped away through the covers."}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Sandeep Sharma,1 bye,offcutter on off stump, he swings and misses but the nonstriker rushes across and pinches a single"}, {"ball": 19.6, "isHighlight": false, "text": "UT Yadav to Dhawan,no run,walks all across his stumps and goes for a slog sweep, but the good length ball is too quick for him and it sails through to the keeper"}, {"ball": 19.6, "isHighlight": false, "text": "$$8.05$$ $$pm$$  How bout that for efficiency. Morne Morkel stormed in the early part of the innings and the lift and pace he got from this deck put Kings XI in all sorts of trouble. Maxwell and Miller both failed and Sunil Narine had a bit of fun with the tail. But still 132 is not quite a pushover total, let's see how KKR fare in the chase."}, {"ball": 19.6, "isHighlight": false, "text": "\"I start fresh every game,\" says  $$Narine$$  as he is presented the purple cap. \"how you react to pressure and try to build momentum. Big boundaries help in the death overs. [Is the pitch offering help?] It's about time we get something for us, it's a batsman's game\""}, {"ball": 19.6, "isHighlight": false, "text": "Rishabh Prajapa: \"thats all KXI punjab without Maxwell and Miller?????????\""}, {"ball": 19.6, "isHighlight": false, "text": "Sandeep: \"Good tactics by Gauti!!! Pick players to play well against their old teams. Vinay Kumar against RCB and Chawla against Punjab... \""}], "name": "Kolkata Knight Riders v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729307.html?innings=1;view=commentary", "match_num": 15}