{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.15pm$$  They are roping the outfield as there is a bit of dew out there. Surprise move by KKR,  $$Gambhir$$ $$doesn't$$ $$open$$ . It is Kallis and Manish Pandey."}, {"ball": 0, "isHighlight": false, "text": "Shuvam : \"As a KKR fan, I hope history doesn't repeat itself. I remember that match at Eden Gardens in 2012, where Punjab were resricted to 130-odd(Narine took a 5-for), and KKR failed to chase it, falling 2 runs short. Gauti publicly criticised his players after that defeat. Surely lightning can't strike twice.\""}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Pandey,1 wide,Sandeep Sharma starts with a wild delivery down the leg side"}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,swinging yorker on off stump, 126kph, dug out towards cover"}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,cuts back in a long way, short of length ball pitching outside off and curling back a long way, Pandey going for the cut but surprised by the movement"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,the ball curl in towards the stumps once more, Pandey was down the track hoping to counter the movement but can't get bat properly on it, ball rolls towards midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,another dot ball, not much movement this time, Pandey looks to drive through the off, thick inside edge onto the pads"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to Pandey,2 runs,chopped down towards third man, should have been a single but a slight mistake from Balaji allows the second"}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to Pandey, $$FOUR$$ ,well outside offstump, Pandey reaches out for that and plays in uppishly towards cover point, there are fielders prowling there but this one is wide of them and he gets a boundary"}, {"ball": 0.6, "isHighlight": false, "text": "Here's the main man, Mitchell Johnson."}, {"ball": 1.1, "isHighlight": false, "text": "Johnson to Kallis,no run,starts with a 145.6kph swinging low full toss on off stump, Kallis gets his bat down in time"}, {"ball": 1.2, "isHighlight": false, "text": "Johnson to Kallis,no run,Kallis didn't have much of any idea about that, he was looking to thump that through the covers, but edges it and isn't sure where the ball is, Kallis looks towards backward point but the ball is dribbling in front of him"}, {"ball": 1.2, "isHighlight": false, "text": "Kallis pulls off at the very last moment, distracted by SpiderCam."}, {"ball": 1.3, "isHighlight": false, "text": "Johnson to Kallis, $$FOUR$$ ,doesn't seem to have affected him though, pulls out one of those exquisite cover drive, past a diving Geroge Bailey, all along the ground"}, {"ball": 1.4, "isHighlight": false, "text": "Johnson to Kallis,no run,full ball on off stump, driven towards point this time, can't find the gap"}, {"ball": 1.5, "isHighlight": false, "text": "Johnson to Kallis,no run,pitched up once more, 150kph, driven crisply towards cover but can't get the placement right again"}, {"ball": 1.6, "isHighlight": false, "text": "Johnson to Kallis,no run,another drive, this time a length ball, doesn't beat short cover"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Pandey,2 runs,walks at the fullish delivery on off stump and outside edges it to deep third man"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,tries to do it again, but this time he gets a bit more lift and Pandey's push connects only with air. Nicely away swing being generated"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Pandey,no run,back of a length on middle, Pandey stays back and blocks"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Pandey, $$OUT$$ ,that's been given! This time it's the indipper and Pandey was pushing down the wrong line. A lovely length from the bowler, he knows his strength is swing and sticks to it. Half-push forward and is struck around the knee-roll."}, {"ball": 2.4, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$lbw$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$8$$ $$(11m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 2.4, "isHighlight": false, "text": "Gautam Gambhir strides out at No. 3. He had a pretty decent outing as captain, but how will he do with the bat. Two slips in"}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Gambhir,no run, $$dropped$$  by the bowler! Gambhir survives! Played too early as he came forward to the good length ball straightening its line. Gets a leading edge that Sharma just about gets the fingertips to as he dives to hsi right"}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to Gambhir,no run,fullish and curling in slightly, Gauti blocks tentatively"}, {"ball": 3.1, "isHighlight": false, "text": "Johnson to Kallis,no run,throws his bat at a back of a length delivery angled across him, beats him well before he went into the shot"}, {"ball": 3.2, "isHighlight": false, "text": "Johnson to Kallis,no run,this time it's full but the result is the same. Kallis chases it and is beaten outside off"}, {"ball": 3.2, "isHighlight": false, "text": "Shambhu : \"Gambhir, 3 ducks- 3 wins, So for KKR to win, Gambhir needs to score a duck.. Go Go Gambhir :)\""}, {"ball": 3.3, "isHighlight": false, "text": "Johnson to Kallis,1 run,shortish and outside off, he pulls down to long leg and a single, very awkward shot though. Gauti v Mitch now"}, {"ball": 3.4, "isHighlight": false, "text": "Johnson to Gambhir,no run,137kph, predictably it;s the short ball to start off. Only it's outside off and he sways inside the line"}, {"ball": 3.5, "isHighlight": false, "text": "Johnson to Gambhir,1 run,he's off the mark in the IPL! Mitch has his hands in his head as he delivers a full delivery on the pads. Clips to long leg"}, {"ball": 3.6, "isHighlight": false, "text": "Johnson to Kallis, $$FOUR$$ ,third time's the charm and he helped himself by stepping down the track and hoisting it over extra cover. Powerful shot"}, {"ball": 4.1, "isHighlight": false, "text": "Sandeep Sharma to Gambhir, $$OUT$$ ,not a duck this time, but is that enough of a silver lining for the KKR captain though. Oh, but wait we're checking the bowler's front foot now. It was a length ball on middle, Gambhir cleared his front leg and looked to slash it through the covers. The bat face turns on impact and he holes out to short extra cover"}, {"ball": 4.1, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$Patel$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$1$$ $$(9m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$"}, {"ball": 4.1, "isHighlight": false, "text": "Chris Lynn takes strike, with a slip and a silly mid-on"}, {"ball": 4.2, "isHighlight": false, "text": "Sandeep Sharma to Lynn,no run,back of a length and outside off, pushes back to the bowler"}, {"ball": 4.3, "isHighlight": false, "text": "Sandeep Sharma to Lynn,no run,shortish and outside off, taps it into the covers"}, {"ball": 4.4, "isHighlight": false, "text": "Sandeep Sharma to Lynn,no run,just short of a good length but Lynn slaps it to short cover. That was crunched"}, {"ball": 4.5, "isHighlight": false, "text": "Sandeep Sharma to Lynn,no run,back of a length on off stump, he presents a straight bat"}, {"ball": 4.5, "isHighlight": false, "text": "Dave: \"There's a difference between being out of form and actually being past it... I feel Gambhir is the latter \""}, {"ball": 4.6, "isHighlight": false, "text": "Sandeep Sharma to Lynn,no run,back of a length and outside off, Lynn punches down the ground"}, {"ball": 4.6, "isHighlight": false, "text": "himanshu: \"Shambu:- Only 2 wins out of 3 ducks..they lost to delhi . Yes i am from Delhi..:-)\""}, {"ball": 4.6, "isHighlight": false, "text": "Karthik: \"At least Gambhir is getting out without wasting balls unlike \"other\" left hand batsman\" Balaji into the attack now"}, {"ball": 5.1, "isHighlight": false, "text": "Balaji to Kallis, $$OUT$$ ,and he strikes straight away! Punjab are making a fight of this! This was a good length ball outside off, Kallis goes forward and unleashes one of his square drives. But he fails to keep it to ground and Maxwell makes no mistake"}, {"ball": 5.1, "isHighlight": false, "text": "$$JH$$ $$Kallis$$ $$c$$ $$Maxwell$$ $$b$$ $$Balaji$$ $$9$$ $$(27m$$ $$11b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$81.81$$"}, {"ball": 5.1, "isHighlight": false, "text": "Robin Uthappa is in early again. Has a gully in place"}, {"ball": 5.1, "isHighlight": false, "text": "Nilesh: \"Gauti can be a computer wiz...deaing with binary digits 0 & 1...\""}, {"ball": 5.2, "isHighlight": false, "text": "Balaji to Uthappa, $$FOUR$$ ,full but angling down leg, Uthappa moves across and clips it to the fine leg boundary. Well played"}, {"ball": 5.3, "isHighlight": false, "text": "Balaji to Uthappa,no run,fullish on off stump, comes forward and pushes into the covers"}, {"ball": 5.4, "isHighlight": false, "text": "Balaji to Uthappa,no run,fullish and in the channel, Uthappa is forward and defends"}, {"ball": 5.5, "isHighlight": false, "text": "Balaji to Uthappa,no run,opens the blade to guides this fuller delivery outside off to point"}, {"ball": 5.6, "isHighlight": false, "text": "Balaji to Uthappa,1 run,stays back and guides this shortish ball with a bit of room down to third man"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin: \"Everyone is mauling their previous teams Dwayne Smith,Piyush Chawla,Vinay Kumar and now Balaji.\" Rishi Dhawan has been called on"}, {"ball": 6.1, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,full toss tailing in, Uthappa clips it to deep midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Dhawan to Lynn,1 wide,a little too wide outside off to connect with and the umpire agrees"}, {"ball": 6.2, "isHighlight": false, "text": "Dhawan to Lynn,no run,good length ball outside off, Lynn blocks down the pitch"}, {"ball": 6.3, "isHighlight": false, "text": "Dhawan to Lynn,1 run,not quite short enough, but he does go for a pull off the front foot. Gets a bit of an inside edge to score his first runs today"}, {"ball": 6.4, "isHighlight": false, "text": "Dhawan to Uthappa,no run,fullish on off stump, he comes forward and blocks with bat and pad close"}, {"ball": 6.5, "isHighlight": false, "text": "Dhawan to Uthappa,no run,gets a little bit of nip outside off, Uthappa lunges forward with half a bat and is beaten"}, {"ball": 6.6, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,lashed over the covers. He comes down the track and though Dhawan tried to put it beyond his reach outside off, Uthappa manages to strike it off the bottom of the bat. There is a man in the deep though"}, {"ball": 6.6, "isHighlight": false, "text": "sabari: \"@ Ashwin, Happily Hussey , Vijay havent yet. CSK fan here\""}, {"ball": 6.6, "isHighlight": false, "text": "Rishabh Prajapa: \"Opening & Scoring heavily in domestic still batting so down in IPL when team is opening with Part time openers & not Uthappa.\" Axar (according to his jersey at least) Patal into the attack"}, {"ball": 7.1, "isHighlight": false, "text": "Patel to Uthappa,no run,tossed up on off stump, defended"}, {"ball": 7.2, "isHighlight": false, "text": "Patel to Uthappa,no run,pushed through and it doesn't turn, Uthappa is on the back foot and pushes to mid-on"}, {"ball": 7.3, "isHighlight": false, "text": "Patel to Uthappa,no run,straightens just a touch as Uthappa shuffles across and blocks"}, {"ball": 7.4, "isHighlight": false, "text": "Patel to Uthappa,2 runs,reaches forward and laps the flighted delivery over the keeper"}, {"ball": 7.5, "isHighlight": false, "text": "Patel to Uthappa,no run,think this was the arm ball, on a good length and skidding on. Uthappa who was backing away for a cut, just about connects"}, {"ball": 7.6, "isHighlight": false, "text": "Patel to Uthappa,1 run,this one drifts down leg and Uthappa clips to deep midwicket and that will be the time out"}, {"ball": 7.6, "isHighlight": false, "text": "Maha: \"Robin needs to bat till the end if KKR want to win this match\" He's definitely setting up for it"}, {"ball": 7.6, "isHighlight": false, "text": "The outfield was being roped again, lets see if the bowlers will have trouble against the dew."}, {"ball": 8.1, "isHighlight": false, "text": "Dhawan to Uthappa,no run,good length ball on off stump, defended off the front foot"}, {"ball": 8.2, "isHighlight": false, "text": "Dhawan to Uthappa,1 leg bye,steps down the track, but he gets it to seam in late. Strikes him on the pad and they sneak a single in front of point"}, {"ball": 8.3, "isHighlight": false, "text": "Dhawan to Lynn, $$FOUR$$ ,that's what you do when you get down the track. It was converted into a length delivery and his footwork also enabled him to free his arms. Slapped to the left of mid-off"}, {"ball": 8.4, "isHighlight": false, "text": "Dhawan to Lynn,1 run,back of a length, he goes forward and drills it through the covers. Hitting on the up but his connection is quite sweet"}, {"ball": 8.4, "isHighlight": false, "text": "anand bhasker t: \"Is this things nicely setup for Chris Lynn to play a maxie or a miller here?? \""}, {"ball": 8.5, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,fullish on off stump, pushed down the ground to rotate strike"}, {"ball": 8.6, "isHighlight": false, "text": "Dhawan to Lynn,1 wide,a little too much effort into that. Sends a back of a length delivery a little too far outside off"}, {"ball": 8.6, "isHighlight": false, "text": "Dhawan to Lynn,no run,pulls the bottom hand off the bat as he hits the short of a good length delivery down to mid-off. Might have been a little too early on the shot"}, {"ball": 9.1, "isHighlight": false, "text": "Patel to Uthappa,no run,flatter trajectory, but it still invites him forward to block down the pitch"}, {"ball": 9.2, "isHighlight": false, "text": "Patel to Uthappa,2 runs,on a good length, but Uthappa is quick to make some room and lofts it over extra cover. Lovely stroke"}, {"ball": 9.3, "isHighlight": false, "text": "Patel to Uthappa,1 run,goes ofr a little bit of innovation here as he goes for a reverse sweep off a quicker delivery on leg stump. Only manages a single to fine leg"}, {"ball": 9.4, "isHighlight": false, "text": "Patel to Lynn,no run,full on middle, Lynn presents a dead bat"}, {"ball": 9.5, "isHighlight": false, "text": "Patel to Lynn,no run,backs away to launch it over mid-off, but he plays inside the line"}, {"ball": 9.6, "isHighlight": false, "text": "Patel to Lynn,1 run,pushed through on middle, Lynn heaves it along the ground to deep midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "SD: \"To be honest, that was unexpected from Kallis. He should have known better than that. Gambhir looks as if he wants to avoid spending time out in the middle. Someone could remind him of what Ponting did for Mumbai last year. If KKR keep batting like this, they won't get very far, and will keep being a big letdown to their bowlers. \" Balaji is back, his last five wickets are of overseas players and Punjab need Lynn's wicket"}, {"ball": 10.1, "isHighlight": false, "text": "Balaji to Lynn,no run,good length ball, Lynn comes forward and punches into the covers"}, {"ball": 10.2, "isHighlight": false, "text": "Balaji to Lynn,1 run,length ball, comes forward and swings it away past mid-on"}, {"ball": 10.3, "isHighlight": false, "text": "Balaji to Uthappa,1 leg bye,back of a length on middle, Uthappa is across on off stump and dabs a single into the middle of the pitch"}, {"ball": 10.4, "isHighlight": false, "text": "Balaji to Lynn, $$FOUR$$ ,heaves it over short fine leg and it has enough to reach the boundary. Saw it on a length and outside off, moved across and swipes it over the infield"}, {"ball": 10.5, "isHighlight": false, "text": "Balaji to Lynn,1 run,goes wide of the crease and provides length again, Lynn slogs it to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Balaji to Uthappa,no run,looks to steer it down to third man but the back of a length delivery outside off beats him"}, {"ball": 10.6, "isHighlight": false, "text": "Yeshwanth: \"That's some confdence these two batsmen have. Or is t sillyness? The next 5 overs will answer that.\" Required rate's on the march towards double figures"}, {"ball": 11.1, "isHighlight": false, "text": "Patel to Lynn, $$OUT$$ ,the stumps are in disarray! It was quick and flat and Lynn's expansive hit down the ground amounts to worse than nothing. Punjab's players are skipping about here"}, {"ball": 11.1, "isHighlight": false, "text": "$$CA$$ $$Lynn$$ $$b$$ $$Patel$$ $$13$$ $$(32m$$ $$18b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$72.22$$"}, {"ball": 11.1, "isHighlight": false, "text": "rssampat: \"It just might be a brave idea to send in Chawla at the fall of a wicket here as he can really hit the ball a long way over the ropes and plays spinners well and he might just play a blazing little cameo which can ease the pressure of the run rate bringing it down.\" KKR disagree. It's Yusuf Pathan"}, {"ball": 11.2, "isHighlight": false, "text": "Patel to Pathan,1 run,good length ball on off stump, turned away through midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Patel to Uthappa, $$FOUR$$ ,uses the pace of the bowler there. it was on a length and he carefully come forward and reverse swept it fine of the short third man fielder"}, {"ball": 11.4, "isHighlight": false, "text": "Patel to Uthappa,1 leg bye,goes for the orthodox one this time, a little lap around the corner. Akshar appeals for leg before and he should feel aggrieved because that hit him in line and low enough to hit the stumps"}, {"ball": 11.5, "isHighlight": false, "text": "Patel to Pathan,no run,good lnegth ball on the stumps, defended"}, {"ball": 11.6, "isHighlight": false, "text": "Patel to Pathan,1 run,flighted on off stump, he steps forward and drives to long-off"}, {"ball": 11.6, "isHighlight": false, "text": "anand bhasker t: \"Today it was a great day for spinners, already taken 11 wickets till now..and giving runs less than 6 RPO .. (only narine at 6, others less than 5 RPO) OMG!! btw i'm writing other wicket for spinner! 12 Now!!!\""}, {"ball": 12.1, "isHighlight": false, "text": "Dhawan to Pathan,1 run,slower ball, Pathan is forward and tucks it through midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,another legcutter just outside off, Uthappa steers it to deep third man"}, {"ball": 12.3, "isHighlight": false, "text": "Dhawan to Pathan, $$OUT$$ ,this stays low after darting in at the pads. Pathan was trying to flick across the line and has been judged leg before. Would have clipped leg stump"}, {"ball": 12.3, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$lbw$$ $$b$$ $$Dhawan$$ $$3$$ $$(5m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 12.3, "isHighlight": false, "text": "Suryakumar Yadav has played some bright cameos, but can he last long enough to pull KKR out of trouble"}, {"ball": 12.4, "isHighlight": false, "text": "Dhawan to SA Yadav,2 runs,full and outside off, he moves outside off and clips to behind square leg"}, {"ball": 12.5, "isHighlight": false, "text": "Dhawan to SA Yadav,1 run,comes down the track, but the length of this has been pulled back. Yadav steals a leg bye"}, {"ball": 12.6, "isHighlight": false, "text": "Dhawan to Uthappa, $$OUT$$ ,legcutter outside off. Uthappa dabs into the covers and sets off. But Bailey swoops in, picks up and throws in one motion and has hit the base of the stumps. Uthappa had almost given up"}, {"ball": 12.6, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$run$$ $$out$$ $$19$$ $$(35m$$ $$27b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$70.37$$"}, {"ball": 12.6, "isHighlight": false, "text": "Piyush Chawla walks out, with the requited rate over 10"}, {"ball": 13.1, "isHighlight": false, "text": "Patel to SA Yadav,1 run,goes back and pushes to long-on"}, {"ball": 13.2, "isHighlight": false, "text": "Patel to Chawla,1 leg bye,comes down the track and looks to whip through midwicket, skids onto him a little too quickly and has to settle for a leg bye to point"}, {"ball": 13.3, "isHighlight": false, "text": "Patel to SA Yadav,1 run,flat on leg stump, punched to long-on. Patel's doing a pretty good job here"}, {"ball": 13.4, "isHighlight": false, "text": "Patel to Chawla, $$OUT$$ ,races down the track and he looks for a loft it over the covers. But this goes on with the arm and the keeper pulls off a smart stumping"}, {"ball": 13.4, "isHighlight": false, "text": "$$PP$$ $$Chawla$$ $$st$$ $$†Saha$$ $$b$$ $$Patel$$ $$0$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 13.4, "isHighlight": false, "text": "Sunil Narine is at No.9. Has a slip in"}, {"ball": 13.4, "isHighlight": false, "text": "Sohel: \"Can Calcutta beat RCB's score of 70\""}, {"ball": 13.5, "isHighlight": false, "text": "Patel to Narine,1 run,another one that skids into him, Narine pushes down the ground"}, {"ball": 13.6, "isHighlight": false, "text": "Patel to SA Yadav,no run,looks to force it down the ground, but cant get it past the bowler"}, {"ball": 14.1, "isHighlight": false, "text": "Dhawan to Narine,1 leg bye,big change of pace there. Narine was complete with his flick over leg by the time the ball hits his back pad. Big appeal, but the fuller delivery had pitched outside leg"}, {"ball": 14.2, "isHighlight": false, "text": "Dhawan to SA Yadav,1 run,steps down the track and pushes the back of a length delivery to long-on"}, {"ball": 14.3, "isHighlight": false, "text": "Dhawan to Narine,1 run,opens the face and runs the shortish ball to third man"}, {"ball": 14.4, "isHighlight": false, "text": "Dhawan to SA Yadav,2 runs,beats the dive of a deepish mid-off. It was shortish again but Yadav skips down the track and slaps it down the ground"}, {"ball": 14.4, "isHighlight": false, "text": "Dew seems to get getting on the ball now, but KKR might be a little too deep in the quicksand"}, {"ball": 14.5, "isHighlight": false, "text": "Dhawan to SA Yadav,3 runs,shortish and outside off, Yadav dabs it to short third man who is slow to get down. Balaji's misfield ends up giving three"}, {"ball": 14.6, "isHighlight": false, "text": "Dhawan to Narine,1 run,good length ball, goes back and looks to heave it down the ground. Absolutely no timing on the shot"}, {"ball": 14.6, "isHighlight": false, "text": "Mitch is back"}, {"ball": 15.1, "isHighlight": false, "text": "Johnson to Narine,2 runs,backs away and slices the full delivery off middle stump to deep point"}, {"ball": 15.2, "isHighlight": false, "text": "Johnson to Narine,1 run,short ball on leg stump, Narine shuffles across and works it down to long leg"}, {"ball": 15.3, "isHighlight": false, "text": "Johnson to SA Yadav, $$SIX$$ ,away she goes over the square leg boundary. He picked the slower ball early, walked across and swiped it over the head of the fielder"}, {"ball": 15.4, "isHighlight": false, "text": "Johnson to SA Yadav,1 run,back to his usual pace, but this time Yadav sways inside the line and ramps it to third man"}, {"ball": 15.5, "isHighlight": false, "text": "Johnson to Narine,no run,tests the middle of the deck with a 141kph delivery. Narine doesn't want anything to do with it"}, {"ball": 15.6, "isHighlight": false, "text": "Johnson to Narine, $$OUT$$ ,off stump is uprooted and Johnson roars! Goes full and Narine was backing away and looking to loft it over the covers. The batsman misses, Johnson hits. Bet he remembered Narine making a fool of him in the first innnings. That's the time out now"}, {"ball": 15.6, "isHighlight": false, "text": "$$SP$$ $$Narine$$ $$b$$ $$Johnson$$ $$6$$ $$(11m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$75.00$$"}, {"ball": 15.6, "isHighlight": false, "text": "KKRFan: \"I wonder at the approach adopted by Kallis.. In the previous 3 matches I have not seen him even making an attempt to accelerate the innings in first 10 overs.. Whereas today when he needed to stay calm, he was creating room every alternate ball..\""}, {"ball": 16.1, "isHighlight": false, "text": "Balaji to SA Yadav,1 run,slower ball foils Surya's hopes of timing this over the top. just short of a good length and he wanted to give himself some room. The slap over the covers ends up at long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Balaji to UT Yadav,no run,beats him outside of as he bowls just back of a length. Umesh was not keen to get in line and threw his bat at it"}, {"ball": 16.3, "isHighlight": false, "text": "Balaji to UT Yadav,1 run,this was on a good length on off stump, Umesh opens the face towards third man"}, {"ball": 16.3, "isHighlight": false, "text": "Kuldeep: \"@KKRFan: The pitch being on the slower side, run-scoring was going to be difficult later on against the slower bowlers. So today he was trying to get an early start against the seamers to keep RRR manageable against the slower bowlers!!\""}, {"ball": 16.4, "isHighlight": false, "text": "Balaji to SA Yadav, $$FOUR$$ ,he's tremendously good with that shot. Picks it on a length and drops it into the boundary at square leg. Dragged it from outside off, but this time his timing was perfect"}, {"ball": 16.5, "isHighlight": false, "text": "Balaji to SA Yadav,2 runs,skips down the track to a length ball and lofts it over mid-off. Struck it off the bottom of the bat and long-on runs around to keep it to two"}, {"ball": 16.6, "isHighlight": false, "text": "Balaji to SA Yadav,1 wide,short of a good length, but it's a little too far outside off. A little tough on the bowler, that was almost inside the wide line"}, {"ball": 16.6, "isHighlight": false, "text": "Balaji to SA Yadav,1 run,keeps strike as he nudges the good length ball straight of midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "paul: \"Finding the overall quality of this years IPL very poor in comparison to say the Big Bash where the batting, fielding and bowling is of a much higher and consistent standard. Captains there also know what they are doing and you wouldn't score almost 4 ducks and still be getting a game either!!\""}, {"ball": 16.6, "isHighlight": false, "text": "38 off 18, can KKR rise from the dead another time? Sandeep Sharma from around the wicket"}, {"ball": 17.1, "isHighlight": false, "text": "Sandeep Sharma to SA Yadav, $$FOUR$$ ,swept to the square leg boundary! That was a rocket! It was fullish and he had to drag it from outside off again, but this slow pitch doesn't seem to be affecting him"}, {"ball": 17.2, "isHighlight": false, "text": "Sandeep Sharma to SA Yadav, $$FOUR$$ ,goes a little shorter this time and Surya gets a lucky glove to the third man boundary. Went down on one knee to lap him to fine leg, but he'll settle for what he gets"}, {"ball": 17.2, "isHighlight": false, "text": "GG: \"With a specialist batsman yadav still there playing at a strike rate of 200 and reqd rate being 12, i think the game is still on. One over, 20 runs and its anybody's game\""}, {"ball": 17.3, "isHighlight": false, "text": "Sandeep Sharma to SA Yadav, $$OUT$$ ,that's the end of that then. Back of a length and outside off, he looks to force the pace with a loft over the off side. Hits him a little too high on the bat and cover makes no mistake. Fooled by the shorter ball"}, {"ball": 17.3, "isHighlight": false, "text": "$$SA$$ $$Yadav$$ $$c$$ $$Johnson$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$34$$ $$(29m$$ $$17b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "KKR give Suyra a warm welcome back, Sandeep switches back over"}, {"ball": 17.4, "isHighlight": false, "text": "Sandeep Sharma to UT Yadav,1 run,fuller on off stump, swung away wide of mid-on"}, {"ball": 17.4, "isHighlight": false, "text": "Morne Morkel in at No.11"}, {"ball": 17.5, "isHighlight": false, "text": "Sandeep Sharma to Morkel,2 runs,lifts the back of a length delivery over midwicket. Cramped for room but still manages to clear the infield"}, {"ball": 17.5, "isHighlight": false, "text": "Ravinder: \"This guy S Yadav needs promotion in the KKR batting order. Well played Surya!\""}, {"ball": 17.6, "isHighlight": false, "text": "Sandeep Sharma to Morkel,1 run,short ball angled in again, Morkel goes back and swivel pulls to fine leg"}, {"ball": 17.6, "isHighlight": false, "text": "Mitch comes back"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to Morkel,1 wide,that's a yorker gone wrong. Ends up a low full toss that sneaks down leg"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to Morkel,1 run,rushes back to his mark, over-rate is 11.2. Back of a length and outside off, Morkel steers it down to third man"}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to UT Yadav, $$OUT$$ ,slower ball cleans up middle stump. It was full, Umesh was not interested in getting in line as he offers a terrible excuse of a shot. Rooted to the crease and soundly beaten as he played inside the line"}, {"ball": 18.2, "isHighlight": false, "text": "$$UT$$ $$Yadav$$ $$b$$ $$Johnson$$ $$2$$ $$(15m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 18.2, "isHighlight": false, "text": "Two low scorers today, they were bound to show up. Join us tomorrow for for another busy day at the IPL, until then this is Alagappan Muthu, sneaking away"}, {"ball": 18.2, "isHighlight": false, "text": "$$Sandeep$$ $$Sharma$$ $$is$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"It's a big moment for me, enjoying a lot, Expressing myself. When I'm playing I'm very serious, outside the rope I'm very funny. With the new ball, I swing it really well and I want the new ball and I'm happy for the faith shown in me\""}, {"ball": 18.2, "isHighlight": false, "text": "\"Bowlers were outstanding. Probably left 20 or 30 short on a tough wickets but we knew we had a chance if we took early wickets,\"  $$George$$ $$Bailey$$  \"It's hard to weigh it, but we probably got it wrong. We left it too much to do for the tail enders. Needed me or Viru or Miller to stay there. It's good to see Sandeep develop, he's got great confidence in what he wants to do which makes my job easier\""}, {"ball": 18.2, "isHighlight": false, "text": "\"The bowlers did a fantastic job, we should have chased it down,\" says  $$Gautam$$ $$Gambhir$$ , \"it was chasable with the kind of dew on the ground. Morne is an aggressive bowler and so far he's been brilliant. Surya looks a very talented cricketer and he'll get many more opportunities and at a better number\""}, {"ball": 18.2, "isHighlight": false, "text": "$$9.55$$ $$pm$$  Kings XI have been accused of being light on the bowling front, but a slower pitch and an out of form KKR line-up proved just the tonic they needed. Sandeep Sharma and Mitchell Johnson managed some early inroads, Akshar Patel was both effective and miserly. KKR have a big problem with their batting, starting with their captain Gautam Gambhir and their finisher Yusuf Pathan and they might be forced to make some brave decisions soon"}], "name": "Kolkata Knight Riders v Kings XI Punjab", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729307.html?innings=2;view=commentary", "match_num": 15}