{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$2.25$$ $$pm$$  It's Sharjah's final day of the IPL and Daredevils and Mumbai Indians are dead even on 6-6. Change at the top of the order:  $$Rohit$$ $$Sharma$$ $$and$$ $$Aditya$$ $$Tare$$  stride out to the middle. Shahbaz Nadeem, as usual, will kick things off for Daredevils, with a slip in place"}, {"ball": 0, "isHighlight": false, "text": "Vinay: \"It's because they invested so much in hussey. 5cr is a lot and they want to give him chances to come good. DD are actually the best side to face if out of form. Look at Yuvraj, can't get a run anywhere else, match winning 50 against us. And bringing in someone makes little difference. Remember Viv Richards was brought in last year for us. Nothing changed.\" And yet somehow that didn't apply to Glenn Maxwell last year"}, {"ball": 0, "isHighlight": false, "text": "muzzam: \"I feel \" Mumbai's Ben Dunk\" will be next season Maxwell!!\""}, {"ball": 0, "isHighlight": false, "text": "Shahed: \"SRT, Kumble, Robin, Wright, Rhodes and now Ricky. Why do you need that many? Anyhow, despite all that wisdom at their disposal, the MI do not pick the Big Bash league top batsman (Ben Dunk) !! Disappointing.\""}, {"ball": 0, "isHighlight": false, "text": "It's the last ball of Powerplay 1. Can you hit a six to squeeze into the top end of the  $$CricIQ$$  leaderboard? If you can't, there's always next time... Powerplay 2 kicks off tomorrow. New challenge, new winners - it could be you.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  continues..."}, {"ball": 0, "isHighlight": false, "text": "$$2.00$$ $$pm$$ $$Mumbai$$ $$Indians$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bat$$  \"It looks a good track and they want to put runs on the board,\" says Rohit Sharma. KP was 50-50 with the tosses so he's not bothered. Both sets of bowlers have their work cut out [on the pitch].  $$Mumbai$$ $$are$$ $$unchanged$$  and have worked out some plans regarding the batting and hope they come off today. Daredevils have one change with  $$Kedar$$ $$Jadhav$$ $$coming$$ $$in$$ $$for$$ $$Manoj$$ $$Tiwary$$"}, {"ball": 0, "isHighlight": false, "text": "Tushar: \"Its amazing how people were claiming that return of KP as a captain would boost morale of the team(they could take only 1 wicket), but inclusion of De Kock actually made all the difference... De Kock did what Aggarwal couldn't do, and Shukla did what every other Delhi bowler was doing anyway.\""}, {"ball": 0, "isHighlight": false, "text": "Harsh: \"I think, Mumbai Indians plays well only in India. Apart from IPL 1st season, they reached knockout /play off of every season of IPL & CL which were played in India. And they were out of Group Stage in IPL 2, CL 2010 & 2012, which were played in South Africa.\""}, {"ball": 0, "isHighlight": false, "text": "$$Kieron$$ $$Pollard$$  says he is still feeling his way back into cricket after a long time sidelined by injury. He is conscious of Mumbai's poor form but says they still have 11 games left and the team is still gelling well and a turnaround is not too far off"}, {"ball": 0, "isHighlight": false, "text": "\"I feel that Rohit and Hussey should swap places. Huss could provide much more value in the middle overs than at the top where he is being forced to go after the bowling,\" proposes Chinmay \"Given his lack of form, it could be worth a try for him to get him in the middle.\""}, {"ball": 0, "isHighlight": false, "text": "Jose: \"Hope, too many cooks don't spoil the broth for Mumbai\" At three down, I bet they wouldn't be looking at that idiom too seriously"}, {"ball": 0, "isHighlight": false, "text": "In the wake of the highly observant fans we have for today's evening game, let me try and sneak in the distraction of Rachna Shetty's  $$preview$$ . How will Daredevils use JP Duminy? Will Mumbai Indians shake their team up? Click, read, leave me and my typos in peace"}, {"ball": 0, "isHighlight": false, "text": "Danish Patel: \"I don't know whom you've missed, I do know whom you've counted twice :)\" So I have a soft spot for Jumbo. Deal with it, or maybe not considering I've taken care of it"}, {"ball": 0, "isHighlight": false, "text": "$$1.30$$ $$pm$$  Two stuttering batting line-ups take centre stage for the first evening match in Sharjah. Delhi Daredevils and Mumbai Indians are still on the hunt for form and we have news that  $$Ricky$$ $$Ponting$$ $$has$$ $$been$$ $$roped$$ $$in$$ $$as$$ $$an$$ $$adviser$$  for the final two matches in the UAE. I bet they can make an XI out of the support staff: Tendulkar, Kumble, Rhodes, Wright, Robin Singh... have I missed anyone?"}, {"ball": 0.1, "isHighlight": false, "text": "Nadeem to Sharma,1 run,flighted on middle, Rohit nudges straight of midwicket"}, {"ball": 0.2, "isHighlight": false, "text": "Nadeem to Tare,1 run,goes back and pushes through to deep midwicket. A little more flatter on middle"}, {"ball": 0.3, "isHighlight": false, "text": "Nadeem to Sharma,1 run,flighted on leg, Rohit eases it along the ground to deep midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Nadeem to Tare,2 wides,drifting down leg and though his half-sweep and half-scoop misses"}, {"ball": 0.4, "isHighlight": false, "text": "Nadeem to Sharma,1 run,flighted on off stump to compensate and Rohit pushes down to long-off"}, {"ball": 0.5, "isHighlight": false, "text": "Nadeem to Tare,no run,pushed through on the pads, clipped to square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Nadeem to Tare,1 run,goes back and whips it from outside off down to long-on. Nadeem continues with his flatter trajectory"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami from the other end, with a slip as well"}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Tare,1 leg bye,back of a length and darts in off the deck, Tare is late on his flick and settles for a leg bye towards point"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Sharma,1 run,142kph, shortish on middle, Rohit gets a little bit of inside edge onto his thigh pad and they race through as the ball dribbles down the pitch"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Tare,1 run,on a good length on middle, Tare pushes down to mid-on"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Sharma, $$OUT$$ ,more seam into him and Rohit wants a quick single after dabbing it into leg. But Shami has seen an opportunity, darted across, picked up with one hand and aimed base of middle. Rohit was miles out."}, {"ball": 1.4, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$run$$ $$out$$ $$4$$ $$(7m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Tare, $$FOUR$$ ,it was short but Tare has no problem taking care of it. Pulls over the short fine leg fielder and he's got enough on it to reach the boundary"}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Tare,no run,just back of a length and outside off, dabbed towards point"}, {"ball": 1.6, "isHighlight": false, "text": "Corey Anderson is back up at No.3. JP Duminy from around the wicket"}, {"ball": 2.1, "isHighlight": false, "text": "Duminy to Anderson,no run,flighted on and around off stump, comes forward to block"}, {"ball": 2.2, "isHighlight": false, "text": "Duminy to Anderson,no run,backs away and punches into the covers. It was on a good length and came on with the arm"}, {"ball": 2.3, "isHighlight": false, "text": "Duminy to Anderson,1 run,tossed up on leg, goes forward nudged to mid-on"}, {"ball": 2.4, "isHighlight": false, "text": "Duminy to Tare,1 run,a little too short and he sets up for the cut. Doesn't beat point"}, {"ball": 2.5, "isHighlight": false, "text": "Duminy to Anderson,no run,comes down the track as he goes for the swipe down the ground. Duminy gets it to dip a little and he's struck on the back pad"}, {"ball": 2.6, "isHighlight": false, "text": "Duminy to Anderson,no run,this time he's trapped in his crease but the good length ball would have skid down leg to foil that leg before appeal"}, {"ball": 2.6, "isHighlight": false, "text": "Faisal: \"The curse of the opening slot continues for MI\""}, {"ball": 2.6, "isHighlight": false, "text": "Wayne Parnell, they're tossing the ball to everyone here"}, {"ball": 3.1, "isHighlight": false, "text": "Parnell to Tare,1 wide,shortish and down leg, terrible start"}, {"ball": 3.1, "isHighlight": false, "text": "Parnell to Tare,no run,fullish on middle, he gets it off the inside half of the bat to mid-on. Parnell searching for inswing."}, {"ball": 3.2, "isHighlight": false, "text": "Parnell to Tare, $$OUT$$ ,deep midwicket steadies himself under it and takes it easily. It was short around the off stump, Tare shifted back and swung seeking to clear the boundary but QDK ran to his left and completes a straightforward take"}, {"ball": 3.2, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$de$$ $$Kock$$ $$b$$ $$Parnell$$ $$8$$ $$(15m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 3.2, "isHighlight": false, "text": "Ambati Rayudu is the new batsman. Looks like Huss is being kept back"}, {"ball": 3.3, "isHighlight": false, "text": "Parnell to Rayudu,no run,pulls all the pace off this good length ball on middle and leg, Rayudu was deceived and gets struck on the thigh"}, {"ball": 3.4, "isHighlight": false, "text": "Parnell to Rayudu,no run,back of a length and slid across the right-hander, Rayudu opens the face to point"}, {"ball": 3.4, "isHighlight": false, "text": "Tushar: \"Since it is clear now that opening slot is kinda jinxed, MI can send Zaheer and Bhajji to open. And i'm pretty sure if they click, they'll get some quick runs too...\""}, {"ball": 3.5, "isHighlight": false, "text": "Parnell to Rayudu, $$FOUR$$ ,sees fine leg a little square and he's taken advantage of a fulller ball on leg stump. Flicked calmly to the boundary"}, {"ball": 3.6, "isHighlight": false, "text": "Parnell to Rayudu,no run,fullish and just a shade outside off, Rayudu is forward and pushes down to mid-off"}, {"ball": 4.1, "isHighlight": false, "text": "Duminy to Anderson,1 run,tossed up onto the pads, works it through midwicket"}, {"ball": 4.2, "isHighlight": false, "text": "Duminy to Rayudu,2 runs,good footwork there from Rayudu! Just a shade short and he moved back and punched it in front of point."}, {"ball": 4.3, "isHighlight": false, "text": "Duminy to Rayudu,1 run,flighted on middle, Rayudu comes forward to steers towards point"}, {"ball": 4.4, "isHighlight": false, "text": "Duminy to Anderson,1 run,deep midwicket gets another work out as Duminy goes full and on the pads"}, {"ball": 4.5, "isHighlight": false, "text": "Duminy to Rayudu,1 run,this turns off the deck and cramps Rayudu as he was trying to cut. Has to adjust and pushes to long-on"}, {"ball": 4.5, "isHighlight": false, "text": "Rajan Raya : \"Was that fastest hundred a blind hitting from Anderson? Or he isn't a quality batsman I was thinking about? Can somebody tell me what is correct…I am confused the way he is playing at the moment. \""}, {"ball": 4.6, "isHighlight": false, "text": "Duminy to Anderson, $$FOUR$$ ,tossed up outside off, Anderson is down on one-knee and sweeps along the ground to the square leg boundary. Smothered any turn on it and muscled it away"}, {"ball": 4.6, "isHighlight": false, "text": "Mohammed Shami is back"}, {"ball": 5.1, "isHighlight": false, "text": "Mohammed Shami to Rayudu,no run,more movement into the batsman and Rayudu manages an inside edge and the ball doesn't wander past his boots"}, {"ball": 5.2, "isHighlight": false, "text": "Mohammed Shami to Rayudu,1 run,short ball on middle, Rayudu leaps up and nudges into the leg side. Anderson is quick to set off and pulls out a big dive to save himself from Shami's throw"}, {"ball": 5.2, "isHighlight": false, "text": "anand bhasker t: \"Aditya tare is a promising batsman and a good hitter at the top... but he always wants to hit every ball in his mind and finally goes off with nothing great in his bag!.. \""}, {"ball": 5.3, "isHighlight": false, "text": "Mohammed Shami to Anderson,no run,shortish and outside off, pulled the pace off it. Anderson dabs into the covers"}, {"ball": 5.4, "isHighlight": false, "text": "Mohammed Shami to Anderson, $$FOUR$$ ,one-bounce and clatters into the midwicket boundary. Shami's move to go around the wicket and dig it in short backfires as it sits up and Anderson cashes in with a thumping pull"}, {"ball": 5.5, "isHighlight": false, "text": "Mohammed Shami to Anderson,1 run,back of a length and outside off, Anderson is content with a single to point"}, {"ball": 5.6, "isHighlight": false, "text": "Mohammed Shami to Rayudu,no run,fullish on off stump, perhaps straightening a touch. Rayudu comes forward and blocks"}, {"ball": 5.6, "isHighlight": false, "text": "Jaydev Unadkat comes on after the powerplay"}, {"ball": 6.1, "isHighlight": false, "text": "Unadkat to Anderson,1 run,tucks him up for room with a shortish delivery, Anderson nudges towards midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Unadkat to Rayudu,1 run,digs it into the middle of the pitch, but it is pulled comfortably to deep midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Unadkat to Anderson,no run,walks at him and pushes the fuller delivery towards midwicket. Slower ball off the back of the hand makes him think twice"}, {"ball": 6.3, "isHighlight": false, "text": "Keeper comes up"}, {"ball": 6.4, "isHighlight": false, "text": "Unadkat to Anderson, $$OUT$$ ,rank long hop and Anderson has thumped it straight to deep midwicket! Unadkat raises his hands in triumph and Anderson is in disbelief. The pull was quite well timed, but like Tare he picked the only fielder there"}, {"ball": 6.4, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$de$$ $$Kock$$ $$b$$ $$Unadkat$$ $$13$$ $$(23m$$ $$14b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$92.85$$"}, {"ball": 6.4, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 6.4, "isHighlight": false, "text": "Pradyot: \"@rajan raya It will be quite harsh.you should see that innings. it was not blind hitting. Problem is he is not quite matured to play in all types of condition.just give him few more innings and see the magic.\""}, {"ball": 6.4, "isHighlight": false, "text": "Michael Hussey comes in at No.5. Mumbai need him to find form today. A wide slip in place"}, {"ball": 6.5, "isHighlight": false, "text": "Unadkat to Hussey,1 run,back of a length and angled into him, clipped through square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Unadkat to Rayudu,1 run,slower, shorter ball. Rayudu is wise to it and nudges behind square leg"}, {"ball": 6.6, "isHighlight": false, "text": "chandrahasa: \"for a moment i was thougt de kock was keeper and delhi bowlers were bowling superbly, but then came to know that he is at deep midwicket and batsmen are playing poorly\""}, {"ball": 6.6, "isHighlight": false, "text": "JPD again, around the stumps"}, {"ball": 7.1, "isHighlight": false, "text": "Duminy to Rayudu,no run,good length ball on off stump, defended"}, {"ball": 7.2, "isHighlight": false, "text": "Duminy to Rayudu,no run,flightede outside off, Rayudu was looking to drive through the covers but ends up inside edging it"}, {"ball": 7.3, "isHighlight": false, "text": "Duminy to Rayudu,no run,poor choice of shot and Rayudu is lucky his off stump is still intact. Flighted on off stump and he goes for the sweep. This went on with the arm to fool him"}, {"ball": 7.4, "isHighlight": false, "text": "Duminy to Rayudu,no run,and loads of turn this time. Good length ball on middle and off and as Rayudu rocks back to cut, he's cramped for room and has to block"}, {"ball": 7.5, "isHighlight": false, "text": "Duminy to Rayudu,1 run,flighted outside off, he eases it down to long-off"}, {"ball": 7.5, "isHighlight": false, "text": "Huss gets a slip to the part-time spinner"}, {"ball": 7.6, "isHighlight": false, "text": "Duminy to Hussey,no run,lovely line from JP. Tossed up on middle and it's defended calmly"}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem returns"}, {"ball": 8.1, "isHighlight": false, "text": "Nadeem to Rayudu,1 run,skips down the track and pushes down to long-on"}, {"ball": 8.2, "isHighlight": false, "text": "Nadeem to Hussey,1 run,low full toss on leg stump, Huss clips to deep midwicket"}, {"ball": 8.3, "isHighlight": false, "text": "Nadeem to Rayudu,1 run,he was afraid of Rayudu coming down the track again. Drags it short and he slaps it through the covers"}, {"ball": 8.4, "isHighlight": false, "text": "Nadeem to Hussey,1 run,flighted on off stump, Huss pushes into the covers and short extra is not quick enough to stop the single"}, {"ball": 8.5, "isHighlight": false, "text": "Nadeem to Rayudu,no run,a little more round-arm this time as he comes down the track. Goes on with the arm and hits him on the pads while he goes for the flick"}, {"ball": 8.6, "isHighlight": false, "text": "Nadeem to Rayudu, $$OUT$$ ,picks out long-on! It was flighted on off stump and he steps out and decided to go for the big one. Heaves it over the top but connects off the toe. Simple catch"}, {"ball": 8.6, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Shukla$$ $$b$$ $$Nadeem$$ $$14$$ $$(26m$$ $$21b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 8.6, "isHighlight": false, "text": "Kieron Pollard is out in the middle, possibly with more overs than he or Mumbai would like to deal with. Parnell has been brought back. Short balls, anyone?"}, {"ball": 9.1, "isHighlight": false, "text": "Parnell to Hussey,no run,yep, but Hussey's pull is a little late. Gets struck on the body"}, {"ball": 9.2, "isHighlight": false, "text": "Parnell to Hussey,no run,back of a length on off stump, Huss works towards midwicket"}, {"ball": 9.3, "isHighlight": false, "text": "Parnell to Hussey,1 run,ventures down the track and nudges the back of a length delivery behind square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Syed Akram: \"Once in the previous seasons players like rayudu and other get the enough time because of top order batsman used to performed well, but this season almost all players getting chances to bat like gully cricket where we used to fight for batting.\""}, {"ball": 9.4, "isHighlight": false, "text": "Parnell to Pollard,1 run,turned away through square leg for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Parnell to Hussey,1 run,picked away off his hips and pulls, albeit not well, to deep fine leg"}, {"ball": 9.6, "isHighlight": false, "text": "Parnell to Pollard,no run,there's the tester. Makes Pollard jerk his head aside as the bouncer sails over middle. Good ball"}, {"ball": 9.6, "isHighlight": false, "text": "Ayush Gupta: \"If Pollard And Hussey stays at the crease for 5 overs now,Mumbai could atleast reach 155-165\""}, {"ball": 10.1, "isHighlight": false, "text": "Nadeem to Hussey,no run,flighted on middle, Huss opts for the reverse sweep but he can't get it beyond point"}, {"ball": 10.2, "isHighlight": false, "text": "Nadeem to Hussey,1 run,goes deep in his crease and whips the length ball away to deep midwicket. That's MI's 50"}, {"ball": 10.2, "isHighlight": false, "text": "Slip in place. Pollard against spin, expect fireworks"}, {"ball": 10.3, "isHighlight": false, "text": "Nadeem to Pollard,no run,flighted on middle, nudges to mid-on"}, {"ball": 10.4, "isHighlight": false, "text": "Nadeem to Pollard,no run,opens the blade and taps the shortish delivery towards backward point"}, {"ball": 10.5, "isHighlight": false, "text": "Nadeem to Pollard,no run,pulls him forward with a tossed up delivery on off stump, defended"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to Pollard,1 run,works it through square leg as he stays back to a delivery he probably could have come forward"}, {"ball": 10.6, "isHighlight": false, "text": "Naren: \"The only way MI can make playoffs to play SRT, Ponting, Kumble :-)\""}, {"ball": 11.1, "isHighlight": false, "text": "Parnell to Pollard,no run,pokes outside off with half and bat and he's beaten. Good length ball pushed across him. Polly looking out of touch"}, {"ball": 11.2, "isHighlight": false, "text": "Parnell to Pollard,1 run,gets a thick outside edge as he inches out of his crease. Parnell drags it short to not let him get under it. Push down the ground ends up at third man"}, {"ball": 11.3, "isHighlight": false, "text": "Parnell to Hussey,no run,wants a single, but Pollard sends him back. It was a fuller delivery on middle. He flicks a little too early and gets a leading edge into the covers. Just about makes his ground"}, {"ball": 11.4, "isHighlight": false, "text": "Parnell to Hussey,no run,129kph, saw him dancing down and gives him notice with a well directed short one. Huss doesn't have any room to work with and ducks under it"}, {"ball": 11.5, "isHighlight": false, "text": "Parnell to Hussey,no run,short ball on middle, but the slower pace means he mistimes the pull. Gets an inside edge that goes nowhere"}, {"ball": 11.6, "isHighlight": false, "text": "Parnell to Hussey,1 wide,and far too often he bowls that delivery. Too full and way down the leg side"}, {"ball": 11.6, "isHighlight": false, "text": "Parnell to Hussey,1 run,full delivery pushed to mid-off and he hares across to retain strike"}, {"ball": 11.6, "isHighlight": false, "text": "artur: \"@ayushgupta 155-165? I think they'll be just happy getting to 130\""}, {"ball": 11.6, "isHighlight": false, "text": "Shukla to bowl now"}, {"ball": 12.1, "isHighlight": false, "text": "Shukla to Hussey,1 run,full on middle, Hussey pushes down the ground for a single"}, {"ball": 12.2, "isHighlight": false, "text": "Shukla to Pollard,no run,wanders down the pitch to heave it over square leg. It was a length ball which nips in just a touch to beat the stroke and hit him on the back pad, but the appeal is useless as he was struck outside off"}, {"ball": 12.3, "isHighlight": false, "text": "Shukla to Pollard,no run,spears it in on middle and leg, Pollard almost falls over himself while looking to clip through midwicket. Gets struck quite low on the pads and the pitch map says it was hit in line and might have crashed into the stumps"}, {"ball": 12.4, "isHighlight": false, "text": "Shukla to Pollard,no run,just short of a good length, Pollard blocks"}, {"ball": 12.5, "isHighlight": false, "text": "Shukla to Pollard, $$FOUR$$ ,belted down the ground as he got under the fuller ball outside off. Shukla leaps up to try and catch it but it was just struck too hard"}, {"ball": 12.6, "isHighlight": false, "text": "Shukla to Pollard,no run,he screams out in anger as he missed a full delivery tailing onto the pads. Shows how out of form he is, that was there to be whipped through midwicket."}, {"ball": 12.6, "isHighlight": false, "text": "Undertaker: \"Hey Cricinfo can u report about what is going ouside the ground because what's going inside the ground is not worth my time\" That's sort of beyond my job description, mate."}, {"ball": 12.6, "isHighlight": false, "text": "Unadkat for his second over"}, {"ball": 13.1, "isHighlight": false, "text": "Unadkat to Hussey,1 run,slower delivery bowled full and a shade outside off, Huss steers it behind point"}, {"ball": 13.2, "isHighlight": false, "text": "Unadkat to Pollard,1 run,dabs the back of a length delivery towards point and races across for a single. Beats the throw, but just about"}, {"ball": 13.3, "isHighlight": false, "text": "Unadkat to Hussey,1 run,fires it in full on middle, Huss clips to deep midwicket"}, {"ball": 13.3, "isHighlight": false, "text": "goes around to Pollard"}, {"ball": 13.4, "isHighlight": false, "text": "Unadkat to Pollard,1 run,clipped calmly off his toes as Unadkat angles it full and straight"}, {"ball": 13.5, "isHighlight": false, "text": "Unadkat to Hussey, $$OUT$$ ,what a beauty! This is a loopy, slower yorker off the back of the hand. Huss had to wait ages and ages and ages but when he finally jams the bat down he misses and gets his off stump pegged"}, {"ball": 13.5, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Unadkat$$ $$10$$ $$(20m$$ $$18b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$55.55$$"}, {"ball": 13.5, "isHighlight": false, "text": "CM Gautam is the new batsman, Unadkat moves around again"}, {"ball": 13.6, "isHighlight": false, "text": "Unadkat to Gautam,no run,fullish on off stump, steps forward to block"}, {"ball": 13.6, "isHighlight": false, "text": "sasmiel karado: \"looking at the present form and situation of the Mumbai team it is quite clear that Sachin's presence in the team does make a big difference.....\""}, {"ball": 14.1, "isHighlight": false, "text": "Nadeem to Pollard,1 run,good length ball on middle, he goes back and flicks through midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Nadeem to Gautam,no run,flighted delivery, gets a bit of turn to take the outside edge towards point"}, {"ball": 14.3, "isHighlight": false, "text": "Nadeem to Gautam,1 run,flighted just a bit outside off, he sweeps to deep square leg. Loads of effort for little result"}, {"ball": 14.4, "isHighlight": false, "text": "Nadeem to Pollard,1 run,skids onto him and he just barely makes contact to get a single. Arm ball rushes him"}, {"ball": 14.5, "isHighlight": false, "text": "Nadeem to Gautam,3 runs,skips down the track and lifts him over the covers. Lovely footwork to reach the pitch and QDK helps him out with a lazy misfield on the boundary"}, {"ball": 14.6, "isHighlight": false, "text": "Nadeem to Pollard,no run,flighted on middle, he comes forward to block. Gets an inside edge towards midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Manu: \"Only 5 boundaries hit till now notable thing I guess\" Mohammed Shami is back"}, {"ball": 15.1, "isHighlight": false, "text": "Mohammed Shami to Gautam,no run,shuffles across to clip the back of a length delivery through midwicket. Struck a little too high on the pads, optimistic appeal"}, {"ball": 15.2, "isHighlight": false, "text": "Mohammed Shami to Gautam,2 runs,short ball with a bit of room and it is the slower ball too, Gautam cuts over the cover field but there is protection in the deep"}, {"ball": 15.3, "isHighlight": false, "text": "Mohammed Shami to Gautam,1 run,fullish and outside off, he skips down the track and slashes over point"}, {"ball": 15.4, "isHighlight": false, "text": "Mohammed Shami to Pollard,1 run,slower ball dupes him again. It was short of a good length and outside off, swings away and gets an inside edge to deep square leg"}, {"ball": 15.5, "isHighlight": false, "text": "Mohammed Shami to Gautam,1 run,walks across and heaves the length ball to deep square leg"}, {"ball": 15.5, "isHighlight": false, "text": "dhiraj: \"@sasmiel karado: Rather than sachin's presence, it is the absence of smith, maxwell and johnson which is making the difference.\""}, {"ball": 15.6, "isHighlight": false, "text": "Mohammed Shami to Pollard, $$SIX$$ ,gets under it and it sails into the stands beyond long-on. It was length and Pollard waded into it, a full swing of the bat and his inherent power made it a foregone conclusion"}, {"ball": 16.1, "isHighlight": false, "text": "Unadkat to Gautam,1 run,slower short ball, Gautam uses soft hands to drop it around point. Sees Pollard racing down the pitch and sets off for the single"}, {"ball": 16.2, "isHighlight": false, "text": "Unadkat to Pollard,1 run,full and angled in at him as Unadkat continues around to the right-handers, Pollard uses his wrists and it has enough power in it to almost carry to deep square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Unadkat to Gautam, $$FOUR$$ ,one-bounce four over extra! Uses his feet against Unadkat's slower ball and unleashes a full swing of the arms"}, {"ball": 16.3, "isHighlight": false, "text": "Sandeep : \"That six is like water in the desert for MI :P\""}, {"ball": 16.4, "isHighlight": false, "text": "Unadkat to Gautam, $$FOUR$$ ,why is he batting so low down the order! It was fullish on middle, but Gautam has reverse flicked it to the third man boundary."}, {"ball": 16.5, "isHighlight": false, "text": "Unadkat to Gautam,4 leg byes,sets up for another reverse swat but this time Unadkat directs the slower ball down leg to prevent him from carrying through with the stroke. But it clips his thigh pad and sneaks off to deep fine leg"}, {"ball": 16.6, "isHighlight": false, "text": "Unadkat to Gautam,no run, $$dropped$$  by DK. It was the slower ball to which Gautam was skipping down to. Looked to steer it down to third man but got too fine an edge. He dives to his right but shells it"}, {"ball": 17.1, "isHighlight": false, "text": "Parnell to Pollard,no run,looks to heave it into the next town, but the pull shot is a little too soon in coming down on the slower ball"}, {"ball": 17.2, "isHighlight": false, "text": "Parnell to Pollard,no run,full and wide outside off, Pollard looks to smack it over extra. Misses and he also loses control of the bat. Just bursts out of his grip and lands somewhere behind him"}, {"ball": 17.3, "isHighlight": false, "text": "Parnell to Pollard,(no ball) 1 run,low full toss on off stump, Pollard slogs it to deep midwicket. But the more important detail is that Parnell has overstepped"}, {"ball": 17.3, "isHighlight": false, "text": "Free hit ball coming up"}, {"ball": 17.3, "isHighlight": false, "text": "Parnell to Gautam, $$FOUR$$ ,fullish and outside off, Gautam was deep in his crease and lofts it over the head of mid-off. Just has enough power in the stroke to reach the ropes"}, {"ball": 17.4, "isHighlight": false, "text": "Parnell to Gautam,no run,shortish and outside off, he looks to cut but is beaten"}, {"ball": 17.4, "isHighlight": false, "text": "Shahed: \"Time for the Pollard effect? A couple of overs with 20+ in each could see 140 up for MI.\""}, {"ball": 17.5, "isHighlight": false, "text": "Parnell to Gautam,no run,looks to drag it from well outside off, but gets a thick inside edge. It was short and angled well across him, Gautam goes for the pull and mistimes it"}, {"ball": 17.6, "isHighlight": false, "text": "Parnell to Gautam,no run,back of a length and outside off, he was looking to help it over third man but doesn't connect"}, {"ball": 17.6, "isHighlight": false, "text": "Shahed: \"Gautam (today by MI) and Surya Kumar Yadav (yesterday by KKR) - a case of team thinktank being unaware of the talent at hand.\" Shami to finish off"}, {"ball": 18.1, "isHighlight": false, "text": "Mohammed Shami to Pollard,no run,full toss tailing in, Pollard's flick ends up as an outside edge into the covers. Instinctively looks for a single, but has to be sent back"}, {"ball": 18.2, "isHighlight": false, "text": "Mohammed Shami to Pollard,1 run,length from Shami, belted down the ground"}, {"ball": 18.3, "isHighlight": false, "text": "Mohammed Shami to Gautam,1 run,fullish and outside off, Gautam drives to mid-off for a single"}, {"ball": 18.4, "isHighlight": false, "text": "Mohammed Shami to Pollard,1 run,  $$OUT$$ ,he's lost grip of the bat while heaving at a fuller ball on middle and leg. Should only have been a single down to deep midwicket and calls a bewildered Gautam through for a non-existent double. Good throw from the deep sees Mumbai's top-scorer well short"}, {"ball": 18.4, "isHighlight": false, "text": "$$CM$$ $$Gautam$$ $$run$$ $$out$$ $$22$$ $$(35m$$ $$18b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$122.22$$"}, {"ball": 18.5, "isHighlight": false, "text": "Mohammed Shami to Pollard, $$FOUR$$ ,low full toss on the hips, Pollard accepts the offering with a whip that thuds into the fine leg boundary"}, {"ball": 18.6, "isHighlight": false, "text": "Mohammed Shami to Pollard, $$SIX$$ ,here we go! This is up on the roof! It was overpitched outside off, Pollard plants his front foot down and massacres it straight over the top."}, {"ball": 19.1, "isHighlight": false, "text": "Unadkat to Harbhajan Singh,no run,slower delivery pushed across him, Bhajji looks to slog to cow corner and misses"}, {"ball": 19.2, "isHighlight": false, "text": "Unadkat to Harbhajan Singh,no run,sets up for another maul over midwicket, but the fuller ball beats him again. Pollard calls him up for a chat"}, {"ball": 19.3, "isHighlight": false, "text": "Unadkat to Harbhajan Singh, $$FOUR$$ ,this time he goes over the off side and the decision proves fruitful. Full delivery lashed over extra cover."}, {"ball": 19.4, "isHighlight": false, "text": "Unadkat to Harbhajan Singh, $$SIX$$ ,length and outside off, Bhajji goes back and pulverises it over the midwicket boundary. That could rival Pollard's big ones"}, {"ball": 19.5, "isHighlight": false, "text": "Unadkat to Harbhajan Singh,1 leg bye,full toss on off stump, Bhajji looks midwicket again but misses. Appeal for leg before as he is hit full on the boot, but the ump says that was missing off."}, {"ball": 19.5, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$retired$$ $$hurt$$ $$10$$ $$(7m$$ $$5b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Bhajji is walking off the field! Zak rushes out with a big smile on his face, guess he's as surprised as me. Guess Unadkat's pace was too much for him"}, {"ball": 19.6, "isHighlight": false, "text": "Unadkat to Pollard,1 run,full and outside off, Pollard slaps it through to deep cover but it's only a single"}, {"ball": 19.6, "isHighlight": false, "text": "$$4.10$$ $$pm$$  Mumbai's batting troubles continue despite a shake-up to the batting order. A slow deck kept Daredevils' bowlers in the game and a bit of a blitz from Kieron Pollard, who looked quite scratchy early on, and CM Gautam in the final five overs took them towards a total above six an over. He believes Mumbai's bowling can pull off something special, but Unadkat is confident of Daredevils chasing this down easily"}], "name": "Delhi Daredevils v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729309.html?innings=1;view=commentary", "match_num": 16}