{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.20$$ $$pm$$  Quinton de Kock and M Vijay are out in the middle. Mumbai Indians pull out their biggest gun in Lasith Malinga. Lone slip in place"}, {"ball": 0.1, "isHighlight": false, "text": "Malinga to de Kock,no run,curls in off a fuller length on middle, De Kock pushes down to mid-on"}, {"ball": 0.2, "isHighlight": false, "text": "Malinga to de Kock,no run,generates some late inward movement again but QDK is good enough to present a dead bat"}, {"ball": 0.3, "isHighlight": false, "text": "Malinga to de Kock,1 run,jams his bat down on an almost yorker outside off, gets a single to the right of mid-off"}, {"ball": 0.4, "isHighlight": false, "text": "Malinga to Vijay,no run,another of his productive variations. It's the offcutter on off stump, Vijay can only block"}, {"ball": 0.4, "isHighlight": false, "text": "Kshitij: \"Is Bhajji ok?\" He's the one at slip"}, {"ball": 0.5, "isHighlight": false, "text": "Malinga to Vijay,1 run,tails away late and Vijay gets a thick outside edge on the yorker to get off the mark with a single to deep third man"}, {"ball": 0.6, "isHighlight": false, "text": "Malinga to de Kock, $$FOUR$$ ,flicked past a diving square leg. Strays in line and De Kock treats himself to a nice, compact looking flick and his timing is very good"}, {"ball": 0.6, "isHighlight": false, "text": "Pragyan Ojha from the other end. Slip in"}, {"ball": 1.1, "isHighlight": false, "text": "Ojha to Vijay, $$FOUR$$ ,inches away outside leg and eases the flighted delivery over extra cover. Lovely shot"}, {"ball": 1.2, "isHighlight": false, "text": "Ojha to Vijay,no run,fired in on middle, Vijay blocks down the pitch"}, {"ball": 1.3, "isHighlight": false, "text": "Ojha to Vijay,no run,this time he runs down the wicket and unleashes a terrible slog. Gets an inside edge onto his pads"}, {"ball": 1.4, "isHighlight": false, "text": "Ojha to Vijay,1 run,a little turn away from the bat as he holds his length back, Vijay taps it behind point"}, {"ball": 1.4, "isHighlight": false, "text": "Ankur: \"DD just need to play out Malinga and go after others. Playing this with the basics right will surely get them over the line\" Long and Midwicket are the deep fielders"}, {"ball": 1.5, "isHighlight": false, "text": "Ojha to de Kock,1 run,flighted on off stump, De Kock pushes down the ground for a single"}, {"ball": 1.5, "isHighlight": false, "text": "KP and DK are padded up"}, {"ball": 1.6, "isHighlight": false, "text": "Ojha to Vijay,no run,flighted on middle but Vijay again moves beside the ball but this time he nudges into the covers"}, {"ball": 1.6, "isHighlight": false, "text": "Zak replaces Malinga. Slip still in"}, {"ball": 2.1, "isHighlight": false, "text": "Khan to de Kock,no run,goes full on off stump, De Kock jams it down to mid-off"}, {"ball": 2.2, "isHighlight": false, "text": "Khan to de Kock,1 run,shortish and outside off, De Kock taps it into the covers. Rayudu displays some ordinary skills to give away the single"}, {"ball": 2.3, "isHighlight": false, "text": "Khan to Vijay,no run,fullish and outside off, Vijay steps forward and blocks towards point"}, {"ball": 2.4, "isHighlight": false, "text": "Khan to Vijay,no run,drives to mid-off as he comes forward to the fuller delivery on the stumps"}, {"ball": 2.5, "isHighlight": false, "text": "Khan to Vijay,1 run,this good length ball seems to have held up on the pitch a little more. Vijay was early on the flick and it lobs up in the air but lands quite safely in front of midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "Khan to de Kock,no run,stays beside the fuller delivery outside off and drives into the covers"}, {"ball": 2.6, "isHighlight": false, "text": "Bhajji comes on now. No slips"}, {"ball": 3.1, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 run,doesn't offer much flight and Vijay pushes down towards long-on"}, {"ball": 3.2, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,teases him with a slower, flighted delivery outside off, De Kock was lured into an expansive drive through the covers and is beaten"}, {"ball": 3.3, "isHighlight": false, "text": "Harbhajan Singh to de Kock, $$FOUR$$ ,backs away and lifts the dart into the pads over the covers. A little quicker than the last ball and he used it to calmly send it packing"}, {"ball": 3.4, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,goes for the sweep this time and since he was playing against the turn, he misses it"}, {"ball": 3.5, "isHighlight": false, "text": "Harbhajan Singh to de Kock,3 runs,stays beside the ball and drills this along the ground and long-off has a lot of running to do. Pollard is the man who raced across and kicked it back in the field of play"}, {"ball": 3.5, "isHighlight": false, "text": "rahul: \"i hope they take this as a chance to boost their net runrate nd not just an easy win!\""}, {"ball": 3.6, "isHighlight": false, "text": "Harbhajan Singh to Vijay,no run,flighted on middle, Vijay keeps it out"}, {"ball": 4.1, "isHighlight": false, "text": "Malinga to de Kock,1 run,offcutter just outside off, De Kock waits on it and plays with soft hands towards point"}, {"ball": 4.2, "isHighlight": false, "text": "Malinga to Vijay,2 wides,that's a rare sight! Aside from the ball wandering away from the keeper's gloves and hitting the helmet, it was a yorker gone way down leg from Malinga. Five penalty runs then, in addition to the wide"}, {"ball": 4.2, "isHighlight": false, "text": "Malinga to de Kock,no run,another slower ball, full on off stump. Inches forward and blocks with soft hands"}, {"ball": 4.3, "isHighlight": false, "text": "Malinga to de Kock,no run,the third slower ball of the over and De Kock is right behind it"}, {"ball": 4.4, "isHighlight": false, "text": "Malinga to de Kock,no run,yorker on off stump, De Kock presents an open face to push it into the covers"}, {"ball": 4.5, "isHighlight": false, "text": "Malinga to de Kock,no run,chops the slower delivery off the inside edge but Mumbai are not lucky enough for it to knock over the stumps"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga to de Kock,no run,fullish and on off stump, De Kock drills it to cover"}, {"ball": 5.1, "isHighlight": false, "text": "Harbhajan Singh to Vijay,no run,stays back and punches the good length ball back at the bowler. QDK who was backing up had to dive back into his ground"}, {"ball": 5.2, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 leg bye,nowhere near short enough to pull, plus it was angled into him to cramp him up. Vijay gets struck on the thigh pad and picks up a single behind point"}, {"ball": 5.2, "isHighlight": false, "text": "slip for De Kock and he goes around the wicket"}, {"ball": 5.3, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,flighted just outside off, he taps it into the covers"}, {"ball": 5.4, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,goes for a wild sweep, but this skids off the deck and beats him comprehensively"}, {"ball": 5.5, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,goes on with the arm this time and De Kock's cut shot is horribly mistimed"}, {"ball": 5.6, "isHighlight": false, "text": "Harbhajan Singh to de Kock,no run,backs away and looks to cut past point, but the flatter delivery follows him and he can't find the gap"}, {"ball": 5.6, "isHighlight": false, "text": "Corey Anderson revs up"}, {"ball": 6.1, "isHighlight": false, "text": "Anderson to Vijay,no run,back of a length, steered towards backward point"}, {"ball": 6.2, "isHighlight": false, "text": "Anderson to Vijay,1 run,fullish and outside off, Vijay pushes it down to mid-off and it would have been a tight single, only Zak underarms the throw"}, {"ball": 6.3, "isHighlight": false, "text": "Anderson to de Kock,1 run,full and outside off, drives it wide of mid-off for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Harry: \"Why wasn't hitting the helmet behind keeper declared for 5 runs?\" It was, that's why the score is 32"}, {"ball": 6.4, "isHighlight": false, "text": "Anderson to Vijay,1 run,QDK is too eager and he would have been well short of his ground had Rohit thrown the stumps down direct from short cover. There was no single there after Vijay pushed forward and nudged into the off side, but the overthrow gives the single in the end"}, {"ball": 6.5, "isHighlight": false, "text": "Anderson to de Kock, $$OUT$$ ,what a ripper from Hussey at point! It was cut pretty well and he had to dive full length and low to his left. Holds on with two hands and QDK has to walk back."}, {"ball": 6.5, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$c$$ $$Hussey$$ $$b$$ $$Anderson$$ $$16$$ $$(27m$$ $$24b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 6.5, "isHighlight": false, "text": "JP Duminy is in at No.3"}, {"ball": 6.6, "isHighlight": false, "text": "Anderson to Duminy,2 runs,fullish and outside off, JP gets a thick inside edge to mid-on to get off the mark. Pollard takes aim at the keeper's end and gives away an overthrow"}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 run,pushed through on the pads, Vijay clips behind square leg"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Duminy,no run,loopy delivery on off stump, JP steps forward to block"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Duminy,2 runs,tossed up outside off, JP drills it through the covers and picks up a well-run couple"}, {"ball": 7.3, "isHighlight": false, "text": "Venkatesh Wadaw: \"DD has got good combination of player names this time. JP - KP and DK-QDK :P\""}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,skips down the track and works it down to mid-on"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Vijay, $$FOUR$$ ,the doosra ends up a little too short and Vijay went deep in his crease and chopped it behind point. Rayudu was the sweeper but he had too much work to do"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 run,clipped away through midwicket to retain strike"}, {"ball": 7.6, "isHighlight": false, "text": "Senthil: \"Time for M Vijay to open up and accelerate before it became too late. The good thing is though they send Duminy early on perhaps to keep the left-right combination going. \" No, JP is in grand form and they want to capitalise"}, {"ball": 8.1, "isHighlight": false, "text": "Ojha to Vijay,1 run,tossed up on middle, Vijay flicks to long-on"}, {"ball": 8.1, "isHighlight": false, "text": "Long-off comes up inside the circle"}, {"ball": 8.2, "isHighlight": false, "text": "Ojha to Duminy,no run,stays back to punch the good length ball to mid-off"}, {"ball": 8.3, "isHighlight": false, "text": "Ojha to Duminy,1 run,comes down the track to nudge it straight of midwicket, but Rohit cuts across and keeps it to one with a sprawling dive"}, {"ball": 8.4, "isHighlight": false, "text": "Ojha to Vijay,no run,flighted on off stump, kept out"}, {"ball": 8.5, "isHighlight": false, "text": "Ojha to Vijay,no run,a little bit of turn and Vijay has to open the face of his bat as he pushes to point"}, {"ball": 8.6, "isHighlight": false, "text": "Ojha to Vijay,2 runs,whips off his knees for a couple to deep square leg and that will be the time out"}, {"ball": 8.6, "isHighlight": false, "text": "Bhajji to bowl out, goes around"}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,a tad short and he rocks back to punch it to deep point"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 run,flighted just outside off, Vijay was backing away and dabs it through cover point"}, {"ball": 9.2, "isHighlight": false, "text": "Brian: \"Just letting everyone know that Liverpool v Chelsea has started.\" Just what a slow game needed. Short cover and slip in place now"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,flighted outside off but JP lunges forward and laps it to short fine leg"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to Vijay,1 run,opens the face to tap the good length delivery angling in at him towards short third man"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Duminy,2 runs,loopy doosra outside off, JP chops it behind point to collect a couple to the man in the deep"}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to Duminy,no run,gets a lovely bit of bounce as he beats Duminy's poke towards point."}, {"ball": 9.6, "isHighlight": false, "text": "Akash: \"Probably Mumbai Indians are so loyal that they are planning and waiting to win their first match in Indian soil.\""}, {"ball": 9.6, "isHighlight": false, "text": "Anderson's back"}, {"ball": 10.1, "isHighlight": false, "text": "Anderson to Vijay,1 run,length ball, picked away off the back foot to long-on"}, {"ball": 10.1, "isHighlight": false, "text": "Around the wicket to the left-hander"}, {"ball": 10.2, "isHighlight": false, "text": "Anderson to Duminy,1 run,full on the legs, Duminy flicks away to deep square leg"}, {"ball": 10.3, "isHighlight": false, "text": "Anderson to Vijay, $$FOUR$$ ,thumped down the ground. Vijay's good when he's hitting straight. It was an offcutter pushed quite full and he slices it powerfully"}, {"ball": 10.4, "isHighlight": false, "text": "Anderson to Vijay,1 run,just back of a length and it is steered behind point"}, {"ball": 10.5, "isHighlight": false, "text": "Anderson to Duminy,1 leg bye,works the shortish delivery off his hips towards long leg"}, {"ball": 10.6, "isHighlight": false, "text": "Anderson to Vijay, $$FOUR$$ ,mid-off leaps up and sticks out his right hand, but Vijay's loft has beaten him. It was length and angled across him. Launched into the stroke and succeeds in getting it to the ropes"}, {"ball": 10.6, "isHighlight": false, "text": "rahul: \"i hope that DD take this game to the last over and lose just so that they learn how you are supposed to bat second in low scoring games!\""}, {"ball": 11.1, "isHighlight": false, "text": "Ojha to Duminy,1 run,skips down the track and works the length ball away towards square leg"}, {"ball": 11.2, "isHighlight": false, "text": "Ojha to Vijay, $$SIX$$ ,flighted but it was in the slot and Vijay has slog swept it over the square leg boundary. Lovely hit"}, {"ball": 11.3, "isHighlight": false, "text": "Ojha to Vijay,2 runs,tossed up outside off and Vijay eases it over the covers. Stays beside the ball and drives confidently"}, {"ball": 11.4, "isHighlight": false, "text": "Ojha to Vijay,1 run,good length just outside off, Vijay pushes down to long-off"}, {"ball": 11.5, "isHighlight": false, "text": "Ojha to Duminy,no run,beaten by flight as Ojha pulls this back after seeing JP skipping down the track. Can;t connect with the flick"}, {"ball": 11.6, "isHighlight": false, "text": "Ojha to Duminy,1 run,flatter ball on off stump, JP punches to long-on"}, {"ball": 11.6, "isHighlight": false, "text": "Rohit Sharma has brought himself on"}, {"ball": 12.1, "isHighlight": false, "text": "Sharma to Duminy,1 run,flighted on off stump, pushed down the ground to long-off"}, {"ball": 12.1, "isHighlight": false, "text": "Bhajji has done his four overs and gone off the field"}, {"ball": 12.2, "isHighlight": false, "text": "Sharma to Vijay, $$OUT$$ ,off stump knocked back as Vijay goes for an awful slog. Nothing particularly threatening about the delivery, the batsman just went for too optimistic a stroke. Underestimated Rohit, I suppose"}, {"ball": 12.2, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$b$$ $$Sharma$$ $$40$$ $$(53m$$ $$34b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$117.64$$"}, {"ball": 12.2, "isHighlight": false, "text": "KP walks out, windmilling his bat around"}, {"ball": 12.3, "isHighlight": false, "text": "Sharma to Pietersen,no run,gets him in a tangle straight away. It was pushed through on middle and KP covers his stumps and blocks"}, {"ball": 12.4, "isHighlight": false, "text": "Sharma to Pietersen,no run,nudges the good length ball towards midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Sharma to Pietersen,2 runs,tossed up on middle and leg, KP looks to paddle it around the corner but doesn't connect too well. Ends up getting a couple though since long leg was too deep"}, {"ball": 12.6, "isHighlight": false, "text": "Sharma to Pietersen,no run,flighted on off stump, he moves forward and pushes to mid-on"}, {"ball": 13.1, "isHighlight": false, "text": "Ojha to Duminy,no run,goes back to a good length ball and pushes back to the bowler"}, {"ball": 13.2, "isHighlight": false, "text": "Ojha to Duminy,1 run,gets a bottom edge on the reverse sweep and they take a single to backward point"}, {"ball": 13.2, "isHighlight": false, "text": "Slip in"}, {"ball": 13.3, "isHighlight": false, "text": "Ojha to Pietersen,1 run,pushed through outside off, stays back and chops it towards the sweeper"}, {"ball": 13.4, "isHighlight": false, "text": "Ojha to Duminy,1 run,skips down the track and drives to long-on"}, {"ball": 13.5, "isHighlight": false, "text": "Ojha to Pietersen,1 run,looped up on middle as he moves outside leg. Slices it through point. Struck uppishly but it lands safely"}, {"ball": 13.6, "isHighlight": false, "text": "Ojha to Duminy,1 run,goes back and taps it down to long-off"}, {"ball": 14.1, "isHighlight": false, "text": "Sharma to Duminy,1 run,goes back to the length ball and clips through to deep midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Sharma to Pietersen, $$SIX$$ ,take that! Advances down the track and launches the length ball straight over the top."}, {"ball": 14.3, "isHighlight": false, "text": "Sharma to Pietersen, $$FOUR$$ ,pushed through outside off and KP has slashed it through the covers. Waited on it just a touch and opened the face to make sure long-off had no chance"}, {"ball": 14.4, "isHighlight": false, "text": "Sharma to Pietersen, $$FOUR$$ ,flighted on middle, he thumps it down the ground. Anderson races to his left from long-on and looked to slap it back inside the field but is unsuccessful"}, {"ball": 14.5, "isHighlight": false, "text": "Sharma to Pietersen,1 run,goes back to the fuller delivery and opens the face to pick up a single in front of point"}, {"ball": 14.6, "isHighlight": false, "text": "Sharma to Duminy,1 run,swipes towards square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Malinga is back now. He has two left"}, {"ball": 15.1, "isHighlight": false, "text": "Malinga to Duminy,no run,slower ball on leg stump, Duminy keeps it out"}, {"ball": 15.2, "isHighlight": false, "text": "Malinga to Duminy, $$OUT$$ ,caught in the covers! Slices a fuller ball with an open face and he picks out the fielder. Mumbai rejoice. Is this going to turn out into a low-scoring thriller too? Tune in after the time out"}, {"ball": 15.2, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$c$$ $$sub$$ $$(AV$$ $$Wankhade)$$ $$b$$ $$Malinga$$ $$19$$ $$(37m$$ $$24b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$79.16$$"}, {"ball": 15.2, "isHighlight": false, "text": "DK is the new batsman"}, {"ball": 15.3, "isHighlight": false, "text": "Malinga to Karthik,2 runs,inswinging yorker ends up a low full toss and he clips between the two midwickets"}, {"ball": 15.4, "isHighlight": false, "text": "Malinga to Karthik,no run,walks down and almost yorks himself as he looks to push through the off side. Gets a thick inside edge that evades leg stump"}, {"ball": 15.5, "isHighlight": false, "text": "Malinga to Karthik, $$OUT$$ ,Mumbai dug-out and the fans have woken up! Rayudu at short midwicket has pulled off another important catch and Malinga magic seems inevitable. It was full on middle and he's just clipped it straight to the fielder"}, {"ball": 15.5, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Rayudu$$ $$b$$ $$Malinga$$ $$2$$ $$(2m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 15.5, "isHighlight": false, "text": "Kedar Jadhav gets his first hit of the tournament, KP called him \"exciting\""}, {"ball": 15.6, "isHighlight": false, "text": "Malinga to Jadhav,no run,yorker just outside off, he keeps it out"}, {"ball": 15.6, "isHighlight": false, "text": "21 off 24 required, and KP's still out there. Zak in for his second over, starts around"}, {"ball": 16.1, "isHighlight": false, "text": "Khan to Pietersen,no run,back of a length and outside off, cut into the covers"}, {"ball": 16.2, "isHighlight": false, "text": "Khan to Pietersen,1 run,fires in full on off stump, he slices it with an open face towards the sweeper"}, {"ball": 16.3, "isHighlight": false, "text": "Khan to Jadhav, $$FOUR$$ ,picked away off his legs. Walks across to the length ball and helps it on it's way. Mistake from Zak, capitalised. Hands on his hips time for the bowler"}, {"ball": 16.4, "isHighlight": false, "text": "Khan to Jadhav,no run,a little room outside off and it's chopped towards point. Huss misfields but it doesn't prove costly"}, {"ball": 16.5, "isHighlight": false, "text": "Khan to Jadhav,1 run,back of a length and outside off, he lets it come on and steers it to deep third man"}, {"ball": 16.6, "isHighlight": false, "text": "Khan to Pietersen,1 run,Anderson makes good ground but it falls short of his big dive forward. KP mistimes a loft down the ground off a length delivery. Gets it off a thick inside edge"}, {"ball": 16.6, "isHighlight": false, "text": "nanda: \"rohit should not had bowled the second over, 40 runs from 6 overs, malinga should had been given the over there to try turn the table \""}, {"ball": 17.1, "isHighlight": false, "text": "Malinga to Pietersen,1 run,offcutter on off stump, KP clips to midwicket"}, {"ball": 17.1, "isHighlight": false, "text": "short midwicket in for Jadhav"}, {"ball": 17.2, "isHighlight": false, "text": "Malinga to Jadhav,1 run,gets in a yorker on middle, jams it down the ground for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Malinga to Pietersen,2 runs,seeks the yorker on middle and leg, KP glances it down to deep fine leg and though the fielder dived early, he is able to keep it to a couple"}, {"ball": 17.4, "isHighlight": false, "text": "Malinga to Pietersen,no run,full on off stump, KP pushes to mid-off"}, {"ball": 17.5, "isHighlight": false, "text": "Malinga to Pietersen,1 run,full toss outside off, KP flicks it down to long-on for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Malinga to Jadhav,1 run,offcutter ends up a full toss which is flicked to deep square leg"}, {"ball": 18.1, "isHighlight": false, "text": "Khan to Jadhav,1 run,dug in short and Jadhav's hook doesn't connect well. Ends up just behind square leg"}, {"ball": 18.2, "isHighlight": false, "text": "Khan to Pietersen,1 run,another short ball and it's a good one too. KP's late on the hook and he gets a bit of a top edge that evades midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Khan to Jadhav,no run,goes length now and Jadhav swings wildly, misses"}, {"ball": 18.4, "isHighlight": false, "text": "Khan to Jadhav,2 runs,fullish and outside off, he opens the face and steers it between cover and point"}, {"ball": 18.5, "isHighlight": false, "text": "Khan to Jadhav, $$FOUR$$ ,four to fine leg and that's the game in the bag. Walks across to off stump and clips the length ball with some class. Mumbai have crashed into their fourth loss in a row and those hand shakes and pats on the back would have negligible effect"}, {"ball": 18.5, "isHighlight": false, "text": "That's all we have for you from this game, but action from the Super Kings and Sunrisers match will be coming at you in a few. This is Alagappan Muthu signing off."}, {"ball": 18.5, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Actually the wicket was playing a little slow. Wanted to take my time and finish the game for my team, but unfortunately couldn't do that. Had been hitting the ball well in the domestics as well and hopefully I can pull off a few wins for Delhi. Great grounds, great crowds. Good fun\""}, {"ball": 18.5, "isHighlight": false, "text": "\"Absolutely happy. 50-50 on the toss, our bowlers were magnificent. Quite a difficult wicket to bat on. The boys showed some good application,\" Kevin Pietersen says. \"That's sub-contnient wicket, I thought the way M Vijay played. Goodness me, what a player. We need to keep doing the right things and more often than not we'll be successful\""}, {"ball": 18.5, "isHighlight": false, "text": "\"Batting [was the problem] 126 was not a score we were looking for. We needed to post something for the bowlers to defend,\" says  $$Rohit$$ $$Sharma$$ . \"We need to work there definitely, said at the toss as well. We tried everything possible, we changed the batting line up but didn't work. We are looking forward to going to Bombay and playing but I hope the batters will step up here in our last game in Dubai\""}, {"ball": 18.5, "isHighlight": false, "text": "Senthil: \"MI should take some hard decisions including dropping of Mike Hussey and Corey Anderson despite both them being their most expensive buy at the auction. But I found it hard to replace them with their current squad as only Ben Dunk can replace Hussey and it won't be still good enough, really they have 1 too many overseas fast bowlers instead of an overseas all rounders. I can't see MI qualifying for Playoff this season despite it moves to India sooner\""}, {"ball": 18.5, "isHighlight": false, "text": "$$5.55$$ $$pm$$  Mumbai Indians just did not have enough on the board. Delhi Daredevils contrived to make it tougher than it should have been. The bowling is a good positive for KP's side. They exploited a slower wicket wonderfully well and will also be pleased with Vijay's form. Mumbai have a multitude of questions to answer though"}], "name": "Delhi Daredevils v Mumbai Indians", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729309.html?innings=2;view=commentary", "match_num": 16}