{"commentary": [{"ball": 0, "isHighlight": false, "text": "Aaron Finch to face, Shikhar Dhawan at the non-striker's end. Ben Hilfenhaus to open the bowling for CSK."}, {"ball": 0, "isHighlight": false, "text": "$$6.30$$ $$pm$$  It's nearly game time. Ravi: \"@Senthil - CSK with Best swing bowlers in IPL ? Do you think Steyn and Bhuvi are not amongst the best swing bowlers in IPL?\""}, {"ball": 0, "isHighlight": false, "text": "rssampat: \"The SRH tail starts at No:4 for this game!!! What the SRH needed was to have picked up a solid Indian batsman to play at No:4/5 and an Allrounder. Irfan Pathan is a spent force and can neither be dangerous with the ball not can be a threat with the bat. By the way; where are the Indian all rounder's??? Any good or promising one's??\""}, {"ball": 0, "isHighlight": false, "text": "Siva: \"@Neeraj, presently the teams are going by big names.. all big names are making big money, whether they play well or not!!\""}, {"ball": 0, "isHighlight": false, "text": "Ramprashad : \"I think SRH made a mistake by batting first. They may fail miserably trying to post a challenging score for the mighty CSK batting lineup in this pitch that is not batsman-friendly.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$6.10$$ $$pm$$  Shikhar Dhawan has won the toss and  $$Sunrisers$$ $$Hyderabad$$  will bat first. MS Dhoni said CSK wanted to bat first as well, but does not expect the pitch to change much."}, {"ball": 0, "isHighlight": false, "text": "The Super Kings are unchanged. Sunrisers have strengthened their bowling - bringing in Ishant Sharma for Naman Ojha, who had replaced Irfan Pathan in the previous game. The shorter batting line-up will increase pressure on Sunrisers' top three."}, {"ball": 0, "isHighlight": false, "text": "Senthil: \"Batting first is the way to go for SRH, since the ball swings a lot under the lights and CSK has the best 3 swing bowlers that any team can field in the IPL.\""}, {"ball": 0, "isHighlight": false, "text": "Kshitij: \"Sunrisers should play somebody like Ishant in their XI.Their pace bowling attack clearly needs a first change pacer to be more venomous.\""}, {"ball": 0, "isHighlight": false, "text": "Atit Agrawal: \"Ishant and venoumous? When did that happen? SRH just lost the match by choosing Ishant. Dhoni must be grinning.\""}, {"ball": 0, "isHighlight": false, "text": "Danish: \"Hope Pathan plays, he's much better than Venogopal Rao with bat and gives an extra bowling option in the middle overs. Rasool isn't a bad option either..\""}, {"ball": 0, "isHighlight": false, "text": "CS: \"Irfan Pathan could bolster the Sunrisers side. Whats up with him? He did not play the last few games. Is he injured?\" I think he just wasn't very good."}, {"ball": 0, "isHighlight": false, "text": "$$5.50$$ $$pm$$  Good evening and welcome to our ball-by-ball coverage of the second game of the day, between Chennai Super Kings and Sunrisers Hyderabad in Sharjah. I'm George Binoy, your commentator for the game."}, {"ball": 0, "isHighlight": false, "text": "CSK are second in the league, with three wins in four games, and will go level on points with league toppers Kings XI Punjab if they win today. Sunrisers Hyderabad - with one win from three games - need a victory to stay in touch with the teams making an early break for the top four spots. Check out  $$how$$ $$all$$ $$the$$ $$teams$$ $$stand$$  at present."}, {"ball": 0, "isHighlight": false, "text": "The game will probably be decided by how well Sunrisers' top three - Dhawan, Finch and Warner - fare against CSK's bowlers. If they fail, I don't see much of a challenge from the rest."}, {"ball": 0, "isHighlight": false, "text": "Mac: \"Since their squad is so unbalanced, the key to success for Hyderabad is to do exactly what they did last game- Rely on the top 3 and only lose one wicket in the innings!\""}, {"ball": 0, "isHighlight": false, "text": "Gautham: \"CSK should test the Bench strength ! Give the No.1 T20 bowler Badree a chance !!\""}, {"ball": 0, "isHighlight": false, "text": "Neeraj: \"Big Name or Form. what should be the criteria to choose playing 11?\""}, {"ball": 0, "isHighlight": false, "text": "**"}, {"ball": 0, "isHighlight": false, "text": "It's the last ball of Powerplay 1. Can you hit a six to squeeze into the top end of the  $$CricIQ$$  leaderboard? If you can't, there's always next time... Powerplay 2 kicks off tomorrow. New challenge, new winners - it could be you.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  continues..."}, {"ball": 0.1, "isHighlight": false, "text": "Hilfenhaus to Finch,1 run,good length on middle, Finch stays in his crease and jams his bat down on the ball, closing the face a touch to play the ball between square leg and midwicket"}, {"ball": 0.2, "isHighlight": false, "text": "Hilfenhaus to Dhawan,no run,good length on middle, bending into the left-hander, Dhawan stays in his crease and defends on the leg side"}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to Dhawan,no run,banged in short, Dhawan seems to have been taken by surprise, he is rooted to the crease and managed to pull his gloves out of the line just in time"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Dhawan, $$FOUR$$ ,too short and there's width too, Dhawan cashes in with a fierce cut off the back foot, he hit that so hard it bounced over the fielder at point and raced to the boundary"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to Dhawan,1 run,steered to third man for a single"}, {"ball": 0.6, "isHighlight": false, "text": "Hilfenhaus to Finch,2 leg byes,length ball on the pads, glanced off the back foot behind square"}, {"ball": 0.6, "isHighlight": false, "text": "kartik: \"This match will be a great competition between the bowlers of both sides: Ishant (Bounce), Bhuvi (Swing), Steyn (Complete!) & two Leggies (Mishra- orthodox, Karn Sharma- top spin) vs Ishwar (Bounce), Mohit (Swing). Hilfenhaus (Pace) & Ashwn (offie) & Jadeja ( left arm spin)!! Gotta Love it!!!\""}, {"ball": 0.6, "isHighlight": false, "text": "Ishwar Pandey from over the wicket."}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Dhawan,1 run,good length on leg and middle, cramping Dhawan for room, he plays it close on the leg side and runs, there's a direct hit at the bowler's end but Dhawan is safe"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Finch,no run,Finch strides down the pitch like Hayden used to do, Pandey sees him coming and shortens the length and denies him room, Finch defends"}, {"ball": 1.2, "isHighlight": false, "text": "Dhoni stands up to the stumps to prevent Finch from walking at the bowler."}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Finch, $$FOUR$$ ,this time he stays back, makes room by moving towards leg, and slams a length ball flat over the infield at cover, he hit that really hard"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Finch,1 run,pushed towards cover for a single"}, {"ball": 1.4, "isHighlight": false, "text": "Shreekanth: \"@r s sampat : The SRH tail starts at no. 4?? Sir you must be joking to call KL Rahul and Darren Sammy tailenders.\""}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Dhawan,no run,Dhawan pushed at that a bit too early and played it uppishly towards cover"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Dhawan,1 run,a fuller ball on middle and off, Dhawan comes forward and drives towards wide mid-off"}, {"ball": 2.1, "isHighlight": false, "text": "Hilfenhaus to Dhawan,no run,short of a length and there's no room to work with for Dhawan as he tries to pull, ends up playing a short arm jab that doesn't beat midwicket"}, {"ball": 2.2, "isHighlight": false, "text": "Hilfenhaus to Dhawan, $$OUT$$ ,he's tried that shot again and he's gone! Dhawan swivelled to pull a short of a length delivery and hit it straight to Mithun Manhas at midwicket. Once again he was cramped for room"}, {"ball": 2.2, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Manhas$$ $$b$$ $$Hilfenhaus$$ $$7$$ $$(9m$$ $$9b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$77.77$$"}, {"ball": 2.3, "isHighlight": false, "text": "Hilfenhaus to Warner,no run,a fullish ball on the pads but Warner misses out, tried to flick it but did not make contact"}, {"ball": 2.4, "isHighlight": false, "text": "Hilfenhaus to Warner, $$OUT$$ ,a huge appeal for lbw and the umpire gives him out after a while! Hilfenhaus' appeal was long and convincing! That's a shocking decision. The ball pitched short of a length well outside leg stump and struck Warner way too high on the pads too. He tried to force it through midwicket and missed. Warner looks quite bewildered at the decision and has every right to be. He was off his toes when the ball hit the top of his pad. Not out on every count."}, {"ball": 2.4, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$lbw$$ $$b$$ $$Hilfenhaus$$ $$0$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 2.5, "isHighlight": false, "text": "Hilfenhaus to Rahul,1 run,nudged off the pads towards the leg side for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Hilfenhaus to Finch,no run,punched off the back foot towards point"}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Rahul,1 run,Rahul stays in his crease and tucks the ball neatly off his hips towards deep square leg"}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Finch,4 leg byes,a poor ball with the keeper standing up, full and on the pads, Finch misses the glance but the ball brushes his pads and runs to the fine leg boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to Finch,1 run,good length on middle and leg, Finch stays in his crease and dabs the ball towards midwicket"}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to Rahul,no run,defended on the front foot towards cover"}, {"ball": 3.4, "isHighlight": false, "text": "Kamal: \"Someone should write a research paper on that dismissal.\""}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to Rahul,1 run,played on the leg side for a single"}, {"ball": 3.5, "isHighlight": false, "text": "Mudhabir: \"This SRH line-up has 3 star batsmen. Dhawan , Finch and Warner. They must be spread out in the batting order like Finch should open, Dhawan at 3 and Warner at 5 followed by Sammy at 6. Surely the batting order will look more stable.\""}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to Finch, $$FOUR$$ ,more easy stuff on the pads, a full toss this time, Finch connects and sends the ball speeding to the fine leg boundary"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Rahul,no run,good length from Mohit first up, from over the wicket, Dhoni is still standing up to the stumps, Rahul stays in his crease and blocks"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Rahul,no run,good length on middle, Rahul stays back and defends on the off side"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Rahul, $$FOUR$$ ,shorter length with just a bit of width, cut hard off the back foot and through the gap between two fielders at point"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Rahul,no run,Rahul stays back and dabs a good length ball close on the off side, he wants a single but Finch yells his disapproval"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Rahul,no run,punched crisply off the front foot but can't beat cover"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Rahul,1 run,a slower ball around off stump, Rahul keeps strike by opening the face to steer towards third man"}, {"ball": 4.6, "isHighlight": false, "text": "Raghu Ifmr: \"Why aren't SRH using Srikanth Anirudha. He did well at CSK, opened lot of times, even won a game for us against RR coming at 7 in one match. They could use him as an attacking opener and spread out the main 3..\""}, {"ball": 4.6, "isHighlight": false, "text": "Lokesh Kaza: \"Seriously, what on earth was that decision? It was miles away from being out on both counts. It could well be a match-altering decisions. Very unimpressed as an SRH fan.\""}, {"ball": 4.6, "isHighlight": false, "text": "R Ashwin from round the wicket ..."}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Rahul,1 run,played to long on for a single"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Finch,1 run,pitches outside leg stump from round the wicket - unattractive line, this is - Finch swats it to short fine leg"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Rahul,1 run,played off the pads in front of square leg"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Finch,no run,a fuller length outside leg from round the wicket, Finch chips it on the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Finch,1 leg bye,Finch tries to sweep this line but fails to make contact"}, {"ball": 5.5, "isHighlight": false, "text": "Senthil: \"Ashwin is going to be carted around by Aaron Finch. I still remembering the super over in CL 2010\""}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Rahul,1 run,defended on the front foot"}, {"ball": 5.6, "isHighlight": false, "text": "Ravindra Jadeja from round the wicket ..."}, {"ball": 6.1, "isHighlight": false, "text": "Jadeja to Rahul,1 run,played on to the off side for a single"}, {"ball": 6.2, "isHighlight": false, "text": "Jadeja to Finch,1 run,played off the back foot towards deep cover"}, {"ball": 6.3, "isHighlight": false, "text": "Jadeja to Rahul,no run,driven firmly into the covers where the fielder makes a sharp stop"}, {"ball": 6.4, "isHighlight": false, "text": "Jadeja to Rahul, $$SIX$$ ,whoa! That's on the roof at deep midwicket. Rahul gets down low, winds up and unleashes a powerful slog-sweep to great effect"}, {"ball": 6.5, "isHighlight": false, "text": "Jadeja to Rahul,1 run,nudged on the front foot towards point for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja to Finch,1 run,pushed on front of point for another single"}, {"ball": 6.6, "isHighlight": false, "text": "Raghu: \"Rahul looks composed. Feel it's great opportunity to announce himself in IPL too. \""}, {"ball": 6.6, "isHighlight": false, "text": "Dwayne Smith from over the wicket ..."}, {"ball": 7.1, "isHighlight": false, "text": "Smith to Finch,2 runs,Finch drives and opens the face to steer a length ball behind point"}, {"ball": 7.2, "isHighlight": false, "text": "Smith to Finch,no run,tries to works the ball off his pads but makes no contact"}, {"ball": 7.3, "isHighlight": false, "text": "Smith to Finch,no run,length ball around off stump, cut firmly but straight to point"}, {"ball": 7.4, "isHighlight": false, "text": "Smith to Finch,1 run,in the blockhole, Finch jams his bat down on it and hits it hard into the ground, the ball bounces high over the bowler's head and goes down the ground"}, {"ball": 7.5, "isHighlight": false, "text": "Smith to Rahul,1 run,worked off the pads through midwicket, where McCullum puts on a great show in the field"}, {"ball": 7.6, "isHighlight": false, "text": "Smith to Finch, $$FOUR$$ ,a short ball on the pads, a poor finish, Finch swivels and pulls behind square to find the boundary"}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Rahul,1 run,Rahul leans forward and nudges the ball through midwicket"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Finch,no run,defended on the front foot towards the off side"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Finch, $$FOUR$$ ,short with some width outside off, Finch waits in his crease and then finds the gap between two men at point with a ferocious cut"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Finch,1 run,nudged off the pads through square, Dhoni chases after it"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Rahul,no run,Rahul tries to play a reverse sweep and fails to make proper contact, the ball lobs over Dhoni off the toe of the bat, the orthodox shots were working for him"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Rahul,1 run,driven through cover for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Suman Dustakar: \"Sad to see indian openers failing in IPL. Dhawan, Rohit, Vijay, Sehwag, Gambhir. Not even single player who is consistent?\""}, {"ball": 8.6, "isHighlight": false, "text": "Fourthumpire: \"Srh isn't spreading out their big three because they all are top order batsmen and may not perform well lower.They should have bought more sensibly at the auction. \""}, {"ball": 9.1, "isHighlight": false, "text": "Ashwin to Rahul,no run,pitches outside leg from round the wicket and hits the pads after Rahul misses the pull"}, {"ball": 9.2, "isHighlight": false, "text": "Ashwin to Rahul,1 run,pitches a long way outside leg, Rahul stays back and works the ball on the leg side"}, {"ball": 9.3, "isHighlight": false, "text": "Ashwin to Finch,no run,pitches in line with the stumps this time and slides across Finch, who stays back and plays towards point"}, {"ball": 9.4, "isHighlight": false, "text": "Ashwin to Finch,1 run,back outside leg stump, Finch nudges behind square"}, {"ball": 9.5, "isHighlight": false, "text": "Ashwin to Rahul,no run,worked off the pads towards midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin to Rahul,1 run,straighter line on middle, driven on the front foot through extra cover"}, {"ball": 9.6, "isHighlight": false, "text": "pavan: \"Looks like Ashwin forgot that he is an offspinner....Haven't seen him pitching any ball outside off stump for a while now...\""}, {"ball": 10.1, "isHighlight": false, "text": "Smith to Rahul,1 run,played through point, where Raina makes a half stop"}, {"ball": 10.2, "isHighlight": false, "text": "Smith to Finch,1 run,played off the back foot in front of point"}, {"ball": 10.3, "isHighlight": false, "text": "Smith to Rahul, $$OUT$$ ,he's smashed that, hit it well, but picked out the fielder on the deep midwicket boundary! The ball was short and Rahul pulled hard, the ball flew flat and straight to Ishwar Pandey, who barely had to move to take the catch"}, {"ball": 10.3, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$c$$ $$Pandey$$ $$b$$ $$Smith$$ $$25$$ $$(30m$$ $$27b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$92.59$$"}, {"ball": 10.3, "isHighlight": false, "text": "Venugopal Rao is the new batsman ..."}, {"ball": 10.4, "isHighlight": false, "text": "Smith to Venugopal Rao,no run,tries to drive but is beaten"}, {"ball": 10.5, "isHighlight": false, "text": "Smith to Venugopal Rao,4 byes,that's full and wide outside off stump, Rao tries to drive but misses. The ball swung away from the right-hander too and beat Dhoni as well!"}, {"ball": 10.6, "isHighlight": false, "text": "Smith to Venugopal Rao,1 run,nudged off the pads towards square leg"}, {"ball": 11.1, "isHighlight": false, "text": "Jadeja to Venugopal Rao,1 run,swept towards deep backward square leg for a single"}, {"ball": 11.2, "isHighlight": false, "text": "Jadeja to Finch,1 run,punched off the back foot towards extra cover, the fielder at cover dives to cut off the shot but ends up pushing the ball towards mid-on and concedes a single"}, {"ball": 11.3, "isHighlight": false, "text": "Jadeja to Venugopal Rao,1 run"}, {"ball": 11.4, "isHighlight": false, "text": "Jadeja to Finch,1 run,bowled with a round arm action and the ball angles down leg side, paddled towards the man at short fine leg"}, {"ball": 11.5, "isHighlight": false, "text": "Jadeja to Venugopal Rao,1 run,worked off the pads towards square leg, Dhoni sprints after the ball himself"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja to Finch,1 run,that darted into the right-hander from over the wicket, Finch was good enough to dab it out towards cover"}, {"ball": 12.1, "isHighlight": false, "text": "Pandey to Finch,1 run,short of a length outside off, cut off the back foot towards third man"}, {"ball": 12.2, "isHighlight": false, "text": "Pandey to Venugopal Rao,1 run,played with an open face towards third man again"}, {"ball": 12.3, "isHighlight": false, "text": "Pandey to Finch,no run,defending on the front foot towards point"}, {"ball": 12.4, "isHighlight": false, "text": "Pandey to Finch,1 run,stays back and cuts the ball late towards third man"}, {"ball": 12.5, "isHighlight": false, "text": "Pandey to Venugopal Rao,1 run,driven on the front foot towards deep cover"}, {"ball": 12.6, "isHighlight": false, "text": "Pandey to Finch, $$FOUR$$ ,a full ball on off and middle, Finch backs away towards leg to create driving space and drills the ball powerfully to the cover boundary"}, {"ball": 12.6, "isHighlight": false, "text": "Anantha: \"I remember V Rao and Suresh Raina played together as new entrants into the team under Greg Chappell. V Rao, played some terrific innings in that disastrous 1st Season for DC. It's time for him to play an anchor role around the big hitters in the team and use his experience to good effect.\""}, {"ball": 13.1, "isHighlight": false, "text": "Ashwin to Venugopal Rao,1 run,pitched on leg stump from round the wicket, driven to long on for a single"}, {"ball": 13.2, "isHighlight": false, "text": "Ashwin to Finch,no run,pitches well outside leg, Finch sweeps but can't beat short fine leg"}, {"ball": 13.3, "isHighlight": false, "text": "Ashwin to Finch,1 run,nudged off the pads behind square"}, {"ball": 13.4, "isHighlight": false, "text": "Ashwin to Venugopal Rao,1 run,Rao slog sweeps to deep midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Ashwin to Finch,1 run,a full ball outside leg, Finch reaches for it and nudges in front of square"}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin to Venugopal Rao,1 wide,that's bowled down leg side and a wide is called after Rao misses the glance"}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin to Venugopal Rao,1 run,Dhoni appeals for a run out but I think Finch is safe. Rao dropped the ball close on the off side and ran, Finch sprinted through as well. The throw came high to Dhoni who whipped off the bails in a flash"}, {"ball": 14.1, "isHighlight": false, "text": "Sharma to Venugopal Rao,2 runs,driven on the up through cover"}, {"ball": 14.1, "isHighlight": false, "text": "Phani: \"Ashwin definitely is not playing in the spirit of game. He might not get hit. But he will not earn the respect of fans or players either.\" Assume Phani is talking about his round the wicket ploy."}, {"ball": 14.2, "isHighlight": false, "text": "Sharma to Venugopal Rao,1 run,dropped close on the off side for a single"}, {"ball": 14.3, "isHighlight": false, "text": "Sharma to Finch,1 run,Finch steps out of his crease (Dhoni is standing back) and nudges the ball off his hips in front of square leg"}, {"ball": 14.4, "isHighlight": false, "text": "Sharma to Venugopal Rao,1 run,short of a length outside off, Rao steers towards third man"}, {"ball": 14.5, "isHighlight": false, "text": "Sharma to Finch,1 run,good length on off and middle, Finch plays with a straight bat an runs the single after the ball passes Mohit"}, {"ball": 14.5, "isHighlight": false, "text": "Sandeep Sundar: \"Ashwin's line is a very good ploy! He has cut out so many cute shots - reverse sweep, switch hits etc with this line - of course unless he is bowling to that freak - Maxwell!\""}, {"ball": 14.6, "isHighlight": false, "text": "Sharma to Venugopal Rao, $$OUT$$ ,driven on the up and straight to mid-off, that's the end of Rao. He made good contact with the shot but did not get enough height on it, the ball traveled flat and dead straight to Dwayne Smith"}, {"ball": 14.6, "isHighlight": false, "text": "$$Y$$ $$Venugopal$$ $$Rao$$ $$c$$ $$Smith$$ $$b$$ $$Sharma$$ $$13$$ $$(17m$$ $$15b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$86.66$$"}, {"ball": 14.6, "isHighlight": false, "text": "That dismissal might not be the worst thing for Sunrisers, it will bring Darren Sammy to the middle."}, {"ball": 14.6, "isHighlight": false, "text": "sree: \"Both teams seem to be content with the flow of this match. Hyd seem content with getting a score around 140, which they feel they can defend with their attack. And chennai seem content to restrict hyd to around 140, which they feel their batting can easily make. So, the real fight is in the next half of the match.\""}, {"ball": 14.6, "isHighlight": false, "text": "vj: \"@phani, spirit of game?, when batsmen uses reverse sweep , switch hit , bowler can bowl this line and increase pressure.\""}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Finch,1 wide,Finch misses the sweep after the ball pitches extremely wide outside leg, Ashwin looks surprised that it was called wide, he thought it hit something"}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Finch,no run,Finch closes the face too early and gets a leading edge towards cover"}, {"ball": 15.2, "isHighlight": false, "text": "Ashwin to Finch,2 runs,a rare delivery with width outside off from Ashwin, Finch dabs to fine leg"}, {"ball": 15.3, "isHighlight": false, "text": "Ashwin to Finch,no run,wide outside leg again but Finch fails to make proper contact with the sweep, ends up playing it tamely to short fine leg"}, {"ball": 15.4, "isHighlight": false, "text": "Ashwin to Finch,1 run,defended on the off side"}, {"ball": 15.5, "isHighlight": false, "text": "Ashwin to Sammy,no run,nudged off the pads on the leg side"}, {"ball": 15.6, "isHighlight": false, "text": "Ashwin to Sammy,no run,Sammy gets beaten by one that slides across him, he was looking to defend on the front foot and was beaten outside off"}, {"ball": 15.6, "isHighlight": false, "text": "Manoj Ravichand: \"@Phani: Please do not drag the spirit of cricket into this. I don't think bowling from around the stumps is such a sin. In this day and age where batsmen keep coming up with heavier bats and new innovations to smash any bowling attack, we should be praising Ashwin for coming up with a good tactic to stem the flow of runs. This isn't test cricket where he is expected to be attacking and take wickets.\""}, {"ball": 16.1, "isHighlight": false, "text": "Hilfenhaus to Finch,no run,Finch fails to make contact as he tries to nudge the ball through square leg"}, {"ball": 16.2, "isHighlight": false, "text": "Hilfenhaus to Finch,no run,Finch backs away outside leg to make room but Hilfenhaus follows him and cramps him for room with his excellent length, Finch pulls but fails to connect properly"}, {"ball": 16.3, "isHighlight": false, "text": "Hilfenhaus to Finch,1 leg bye,a full ball from round the wicket, Finch tries to drill the ball through midwicket but misses and is hit on the pad"}, {"ball": 16.4, "isHighlight": false, "text": "Hilfenhaus to Sammy, $$FOUR$$ ,Hilfenhaus misses his length and delivers a full toss, Sammy bashes it right back over his head, one bounce and over the straight boundary"}, {"ball": 16.5, "isHighlight": false, "text": "Hilfenhaus to Sammy,no run,good length outside off stump, Sammy tries to stay back and steer behind point but is beaten"}, {"ball": 16.6, "isHighlight": false, "text": "Hilfenhaus to Sammy,1 run,Sammy lunges for a wide one and carves it down to third man, reaches the fielder on the first bounce"}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Sammy,1 run,Sammy stays back and tries to pull but mistimes it on the leg side"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Finch, $$OUT$$ ,Mohit's bowled another batsman with one of those back-of-the-hand slower balls. Finch was done heaving across the line by the time the ball arrived. Middle stump took a beating. Finch goes without finding high gear"}, {"ball": 17.2, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$b$$ $$Sharma$$ $$44$$ $$(72m$$ $$45b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$97.77$$"}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to KV Sharma,1 run,Karn Sharma hooks his first ball towards fine leg, it falls well short of Ashwin"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Sammy,1 run,Sammy pulls the ball powerfully towards cow corner, where McCullum attacks the ball swiftly and collects the ball with one hand and fires the throw in to prevent the second. Terrific fielding."}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to KV Sharma,1 run,played to deep midwicket for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Sammy,1 run,Sammy stays back and pushes a slower ball in front of point"}, {"ball": 17.6, "isHighlight": false, "text": "Danny: \"Finch's strike rate is as a result of this horribly top heavy order, once two of the top three have gone, all freedom is lost.\""}, {"ball": 18.1, "isHighlight": false, "text": "Hilfenhaus to Sammy, $$FOUR$$ ,Sammy has stayed back and whipped a fullish ball fiercely off his pads to the backward square leg boundary, he hit that so powerfully for a one-bounce four"}, {"ball": 18.2, "isHighlight": false, "text": "Hilfenhaus to Sammy,1 wide,that's extremely wide down leg side, going to have to bowl that again"}, {"ball": 18.2, "isHighlight": false, "text": "Hilfenhaus to Sammy,no run,that's an extremely slow ball on off stump, Sammy begins to wind up but then adjusts in the nick of time to try and cut it, he gets a faint outside edge that takes the ball past off stump and on the bounce to Dhoni"}, {"ball": 18.3, "isHighlight": false, "text": "Hilfenhaus to Sammy,1 run,another slower one, length on off stump, hit down the ground to long off for a single"}, {"ball": 18.4, "isHighlight": false, "text": "Hilfenhaus to KV Sharma, $$SIX$$ ,Karn Sharma has hooked Hilfenhaus out of the ground! Tremendous shot. Hilfenhaus banged it in short and Karn just swung hard off the back foot"}, {"ball": 18.5, "isHighlight": false, "text": "Hilfenhaus to KV Sharma, $$SIX$$ ,over cover this time! Karn has clobbered it, getting under a full ball and driving it high and far, into the crowd!"}, {"ball": 18.6, "isHighlight": false, "text": "Hilfenhaus to KV Sharma,2 runs,he's mis-hit this in the air towards long-on, Dwayne Smith runs in from the boundary and  $$drops$$ $$it$$ . Two more to Sunrisers. That was a sitter. Plenty of time, a nice height, it simply popped out."}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Sammy,1 run,hit hard towards long-on for a single"}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to KV Sharma,1 run,makes room to hit the ball through the off side but gets an inside edge that takes it through midwicket"}, {"ball": 19.2, "isHighlight": false, "text": "Mukul: \"No innings is complete in the IPL until someone drops a sitter!\""}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Sammy, $$SIX$$ ,a slower one but the length was too short, Sammy sat back and waited for it, before unleashing a tremendous pull flat over the midwicket boundary"}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Sammy,1 run,nearly in the blockhole, Sammy drives it towards long on, where McCullum is so quick that he cuts off the second run"}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to KV Sharma,1 bye,Sammy sprints through and dives after Karn missed the full ball outside off stump, Dhoni missed the stumps with his underarm throw"}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Sammy,2 runs,a full ball outside off stump, Sammy can't get under it and so he drives the ball towards wide long off, where Raina keeps it down to just two ..."}, {"ball": 19.6, "isHighlight": false, "text": "$$8.10$$ $$pm$$  So Sunrisers finish with 145 for 5. They would have wanted more but they won't be too disappointed with that effort after losing Dhawan and Warner cheaply. It's a fighting score but CSK's line-up is formidable."}], "name": "Sunrisers Hyderabad v Chennai Super Kings", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729311.html?innings=1;view=commentary", "match_num": 17}