{"commentary": [{"ball": 0, "isHighlight": false, "text": "Badri: \"This is not the first time CSK is chasing 140 odd in this tournament but the worrying factor is the bowling lineup that they are against.. CSK will need something special from smith and baz up the order.. \""}, {"ball": 0, "isHighlight": false, "text": "Sagar: \"Fair to say SRH are 20 short... their bowlers need to find their 2013 mojo to defend..\""}, {"ball": 0, "isHighlight": false, "text": "Dwayne Smith and Brendon McCullum are out there to face Dale Steyn. smith will face."}, {"ball": 0.1, "isHighlight": false, "text": "Steyn to Smith,no run,good length on off and middle, defended with a straight bat back to Steyn"}, {"ball": 0.2, "isHighlight": false, "text": "Steyn to Smith,2 runs,Smith stays in his crease and punches the ball on the up through point, that would have got a lot closer to the boundary it it had not been Warner after it"}, {"ball": 0.3, "isHighlight": false, "text": "Steyn to Smith,no run,played with an open face to Warner at point"}, {"ball": 0.4, "isHighlight": false, "text": "Steyn to Smith, $$FOUR$$ ,a length ball outside off, Smith presses forward and hits on the up through the line, he ends up slicing the ball over cover point. Warner will not be catching up with that"}, {"ball": 0.5, "isHighlight": false, "text": "Steyn to Smith,no run,good length around off, Smith stays in his crease and defends on the off side"}, {"ball": 0.6, "isHighlight": false, "text": "Steyn to Smith,no run,hit with a lot of power but Warner is in the way at point, Smith has found his timing right away"}, {"ball": 0.6, "isHighlight": false, "text": "Bhuvneshwar Kumar from over the wicket ..."}, {"ball": 1.1, "isHighlight": false, "text": "Kumar to McCullum,1 run,squared him up with a good length ball that pitched on middle and moved away from the right-hander, McCullum got an outside edge that flew behind point to third man"}, {"ball": 1.2, "isHighlight": false, "text": "Kumar to Smith,no run,Smith moves forward and pushes a good length ball to mid-on"}, {"ball": 1.3, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,Smith pulls one that is not that short and gets a bottom edge that misses the stumps and beats the keeper. Lucky break for Smith. That was very close to the stumps"}, {"ball": 1.4, "isHighlight": false, "text": "Kumar to Smith,no run,defended watchfully on the off side"}, {"ball": 1.5, "isHighlight": false, "text": "Kumar to Smith,1 leg bye,strays on to the pads this time, Smith misses the flick but they run a leg bye"}, {"ball": 1.5, "isHighlight": false, "text": "ram: \"SRH have got the best opening bowling pair and most attacking spinners. They don't have that decent fifth bowler and even sammy is not consistent to rely upon.\""}, {"ball": 1.6, "isHighlight": false, "text": "Kumar to McCullum,no run,that's a bad ball and he's lucky to escape without being hit for four. Bhuvneshwar strayed on to the pads and McCullum's glance went straight to the fielder at short fine leg"}, {"ball": 2.1, "isHighlight": false, "text": "Steyn to Smith,no run,good length outside off, the ball holds its line and beats Smith's outside edge"}, {"ball": 2.1, "isHighlight": false, "text": "Steyn's got something in his eye. Seems okay now, though."}, {"ball": 2.2, "isHighlight": false, "text": "Steyn to Smith,1 leg bye,a full ball on the pads, Smith fails to connect with the flick and runs another leg bye. Not a very good ball"}, {"ball": 2.3, "isHighlight": false, "text": "Steyn to McCullum,no run,good length and straight, defended off the back foot towards the bowler"}, {"ball": 2.4, "isHighlight": false, "text": "Steyn to McCullum, $$SIX$$ ,the fielder on the deep midwicket boundary leaps with one hand outstretched over his head but the ball clears him! It was Rao, and he was not on the edge of the boundary. Steyn had banged it in short and McCullum played a powerful hook. Steyn is unhappy and tells the fielder in no uncertain terms that he should have been right on the boundary. It might have beaten him even if he was"}, {"ball": 2.5, "isHighlight": false, "text": "Steyn to McCullum,no run,played on the up towards cover point"}, {"ball": 2.6, "isHighlight": false, "text": "Steyn to McCullum,1 run,nudged off the pads on the leg side"}, {"ball": 2.6, "isHighlight": false, "text": "Karn Sharma to bowl legspin from over the wicket, inside the Powerplay."}, {"ball": 3.1, "isHighlight": false, "text": "KV Sharma to McCullum,1 run,McCullum leans forward and nudges the ball towards square"}, {"ball": 3.2, "isHighlight": false, "text": "KV Sharma to Smith,1 run,driven towards long on for a single"}, {"ball": 3.3, "isHighlight": false, "text": "KV Sharma to McCullum,2 runs,McCullum steps out and lofts the legspinner straight over his head, the ball seems to be going over the boundary for a one-bounce four but Finch sprints and lunges to snatch the ball just before it passes him"}, {"ball": 3.4, "isHighlight": false, "text": "KV Sharma to McCullum,no run,defended on the front foot"}, {"ball": 3.5, "isHighlight": false, "text": "KV Sharma to McCullum,no run,defended on the leg side off the front foot"}, {"ball": 3.6, "isHighlight": false, "text": "KV Sharma to McCullum,1 run,played towards midwicket"}, {"ball": 4.1, "isHighlight": false, "text": "Kumar to McCullum, $$FOUR$$ ,that is some shot! The length was good and the ball came into the right-hander, McCullum stayed back and some how managed to square drive the ball so hard into the ground that it bounced over the fielder at point. He played that inside out almost"}, {"ball": 4.2, "isHighlight": false, "text": "Kumar to McCullum,no run,pushed off the front foot towards point"}, {"ball": 4.3, "isHighlight": false, "text": "Kumar to McCullum,no run,a slightly slower delivery and McCullum mis-times the slap off the back foot to cover point"}, {"ball": 4.4, "isHighlight": false, "text": "Kumar to McCullum,no run,a length ball around off, McCullum drives on the up off the back foot but mis-times it to cover"}, {"ball": 4.5, "isHighlight": false, "text": "Kumar to McCullum,1 run,McCullum swings hard at a short of a length ball once again but mis-times it, Sammy has been placed on the deep midwicket boundary and the ball falls short of him"}, {"ball": 4.6, "isHighlight": false, "text": "Kumar to Smith, $$SIX$$ ,Smith's sent that into the stands beyond long leg, the length was on the shorter side and Smith swiveled and made great contact. Not the best line to bowl when fine leg is in the circle"}, {"ball": 5.1, "isHighlight": false, "text": "KV Sharma to McCullum, $$FOUR$$ ,McCullum charges the spinner, makes room by moving outside leg, and smashes the ball over mid-off for a one-bounce four. He got to the pitch nicely"}, {"ball": 5.2, "isHighlight": false, "text": "KV Sharma to McCullum,1 leg bye,misses the slog sweep this time but Smith calls him through for a leg bye"}, {"ball": 5.3, "isHighlight": false, "text": "KV Sharma to Smith,no run,pushed off the back foot to point"}, {"ball": 5.4, "isHighlight": false, "text": "KV Sharma to Smith, $$FOUR$$ ,pitches outside leg, Smith gets down low and plays a powerful slog sweep, the ball flies just out of reach of Steyn at square leg and races to the boundary"}, {"ball": 5.5, "isHighlight": false, "text": "KV Sharma to Smith,1 run,driven hard to long on for a single"}, {"ball": 5.6, "isHighlight": false, "text": "KV Sharma to McCullum,1 run,McCullum leans forward and clips the ball through square for a single. CSK have done phenomenally well in the Powerplay and are well on course ..."}, {"ball": 5.6, "isHighlight": false, "text": "Sinbad: \"Chennai would miss playing in the UAE. Every game was like a home game for them in terms of crowd support.\" Nothing like what Chepauk will be like though!"}, {"ball": 5.6, "isHighlight": false, "text": "Amit Mishra from over the wicket ..."}, {"ball": 6.1, "isHighlight": false, "text": "Mishra to McCullum,1 run,McCullum strides forward and pushes the ball towards point"}, {"ball": 6.2, "isHighlight": false, "text": "Mishra to Smith,1 run,slides on to the pads, bowled flat and quick, Smith nudges behind square for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Mishra to McCullum,1 run,dabbed short of the man at midwicket for a quick run"}, {"ball": 6.4, "isHighlight": false, "text": "Mishra to Smith,1 run,played off the back foot through cover"}, {"ball": 6.5, "isHighlight": false, "text": "Mishra to McCullum,1 run,hit off the back foot towards long on"}, {"ball": 6.5, "isHighlight": false, "text": "Abdullah: \"Mumbai vs Chennai had more Mumbai support in Dubai. The stadium was more blue than yellow. It was a pity that the game was boring\""}, {"ball": 6.6, "isHighlight": false, "text": "Mishra to Smith,1 run,Smith stays back and punches the ball to long on"}, {"ball": 6.6, "isHighlight": false, "text": "Ishant Sharma from over the wicket ..."}, {"ball": 7.1, "isHighlight": false, "text": "I Sharma to Smith,no run,a length ball outside off stump, Smith swings really hard across the line and inside edges it on to his leg"}, {"ball": 7.2, "isHighlight": false, "text": "I Sharma to Smith, $$SIX$$ ,how on earth has that carried over the cow corner boundary? Smith checked his shot once he realised it was a slower length ball. There was no follow through at all after he pushed at it on the up. It cleared the boundary comfortably"}, {"ball": 7.3, "isHighlight": false, "text": "I Sharma to Smith,no run,he gets beaten outside off by one that holds its line"}, {"ball": 7.4, "isHighlight": false, "text": "I Sharma to Smith,no run,a short of a length around leg stump, Smith ducks under it"}, {"ball": 7.5, "isHighlight": false, "text": "I Sharma to Smith,no run,Ishant does well to get down low on his follow through and field the ball after Smith pushed firmly with a straight bat"}, {"ball": 7.6, "isHighlight": false, "text": "I Sharma to Smith, $$SIX$$ ,banged in short and Smith has banged it flat and hard over the square leg boundary, a poor ball and Smith's quick hands are on display again"}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to McCullum,no run,tossed up nicely outside off, McCullum tries to drive through cover but gets an inside edge on the leg side"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to McCullum, $$FOUR$$ ,too short, McCullum goes back and pulls the ball hard to find the square leg boundary"}, {"ball": 8.2, "isHighlight": false, "text": "Joseph: \"... But there are only two games in Chepauk at the league stage. Hopefully CSK will feel home at Ranchi\""}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to McCullum,no run,the googly, McCullum fails to read it and is cramped for room as he goes back to cut, mis-times it"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to McCullum,1 run,McCullum sweeps to long leg for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Smith,1 run,nudged off the pads towards midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to McCullum,1 run,McCullum gets down on one knee and sweeps to deep backward square"}, {"ball": 8.6, "isHighlight": false, "text": "Sridhar: \"Required rate"}, {"ball": 8.6, "isHighlight": false, "text": "Steyn's back for his third over, Sunrisers desperate for a wicket."}, {"ball": 9.1, "isHighlight": false, "text": "Steyn to McCullum,1 run,a full ball outside off, McCullum drills it past mid-off but long-on runs across to cut it off, there's a lot of dew on the outfield"}, {"ball": 9.2, "isHighlight": false, "text": "Steyn to Smith,no run,in the blockhole, Smith does well to keep it out"}, {"ball": 9.3, "isHighlight": false, "text": "Steyn to Smith,no run,good length on off stump, pushed from the crease towards point"}, {"ball": 9.4, "isHighlight": false, "text": "Steyn to Smith,1 run,a length ball just outside off, Smith waits in his crease and cuts the ball firmly to third man, Ishant fields"}, {"ball": 9.5, "isHighlight": false, "text": "Steyn to McCullum,no run,a full ball around off stump, driven to cover for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Sanket: \"CSK's strength is that they have so many players who can win them a game single handedly on their day. Smith, McCullum, Raina, Faf, Dhoni, Jadeja, Ashwin and the list goes on. They never out of the game for the same reason, whether their openers get out cheaply or their bowlers cost them more runs. This is where Punjab or even RCB lack. All the teams have star players but lot of them lack match winners like CSK. That precisely makes CSK favorites for this IPL.\""}, {"ball": 9.6, "isHighlight": false, "text": "Steyn to McCullum,1 run,another full ball on middle and leg, flicked through midwicket for a single"}, {"ball": 9.6, "isHighlight": false, "text": "Sandeep Sundar: \"You may play 5 or 6 bowlers, you may have world class bowlers in your lineup who could swing, bounce, bully or deceive. Nothing matters when they are up against formidable hitters in good form - like these two in a T20 game! The game becomes brutally one-sided!\""}, {"ball": 9.6, "isHighlight": false, "text": "Karn Sharma from over the wicket ..."}, {"ball": 10.1, "isHighlight": false, "text": "KV Sharma to McCullum,1 run,cut hard off the back foot to deep point"}, {"ball": 10.2, "isHighlight": false, "text": "KV Sharma to Smith,2 runs,Smith drills the ball down the ground and long off and long on almost get into a tangle fielding the ball, Steyn gets it cleanly in the end"}, {"ball": 10.3, "isHighlight": false, "text": "KV Sharma to Smith,1 run,that's the googly and the batsman just manages to keep it out"}, {"ball": 10.4, "isHighlight": false, "text": "KV Sharma to McCullum, $$SIX$$ ,up and over, McCullum makes room to hit inside out and drives the ball cleanly over the extra-cover boundary"}, {"ball": 10.4, "isHighlight": false, "text": "Badri: \"This is the most sensible innings that Smith has played this tournament. He has been cautious while dealing with a guy like Steyn.. impressive that!!!\""}, {"ball": 10.5, "isHighlight": false, "text": "KV Sharma to McCullum, $$OUT$$ ,bowled him! The length was too full to cut, the line was too straight to cut, it was the googly too. McCullum went back in a flash but was beaten. The ball hit off and middle stump"}, {"ball": 10.5, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$b$$ $$KV$$ $$Sharma$$ $$40$$ $$(47m$$ $$33b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$121.21$$"}, {"ball": 10.5, "isHighlight": false, "text": "The break through is probably too late for Sunrisers though. Raina is the new batsman"}, {"ball": 10.6, "isHighlight": false, "text": "KV Sharma to Raina,no run,defended on the front foot"}, {"ball": 11.1, "isHighlight": false, "text": "I Sharma to Smith,no run,Smith mows across the line but gets beaten outside off stump"}, {"ball": 11.2, "isHighlight": false, "text": "I Sharma to Smith, $$FOUR$$ ,a stunning square drive, a length ball disappears to the point boundary, Smith's timing has been outstanding tonight"}, {"ball": 11.3, "isHighlight": false, "text": "I Sharma to Smith,1 run,pushed off the front foot towards mid-on for a single"}, {"ball": 11.4, "isHighlight": false, "text": "I Sharma to Raina,1 run,moves back and across and nudges the ball towards midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "I Sharma to Smith,2 runs,Warner is electric at mid-off, he dives full length to cut off a powerfully struck ball, it was nearly past him and he had to leap backwards to his left. There's an overthrow because no one was backing up Warner's throw"}, {"ball": 11.6, "isHighlight": false, "text": "I Sharma to Smith,1 run,Smith plays the ball to long on to bring up another half-century ... he's been terrific at the start of the season"}, {"ball": 12.1, "isHighlight": false, "text": "Mishra to Smith,no run,defended on the off side"}, {"ball": 12.2, "isHighlight": false, "text": "Mishra to Smith, $$SIX$$ ,that's a long hop and it's been punished. Smith rocks back and pulls the ball easily over deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Mishra to Smith,no run,nudged on the leg side for a single, Smith begins to run but gets sent back, Mishra sprints to the ball and Smith has to dive to make his ground"}, {"ball": 12.3, "isHighlight": false, "text": "Umang: \"Why did MI let go D Smith and bought M Hussey? Didn't Smith win so many matches for them last season?\""}, {"ball": 12.4, "isHighlight": false, "text": "Mishra to Smith,1 run,worked off the pads on the leg side"}, {"ball": 12.5, "isHighlight": false, "text": "Mishra to Raina,no run,defended to cover on the front foot"}, {"ball": 12.6, "isHighlight": false, "text": "Mishra to Raina,1 run,driven on the front foot to long off for a single"}, {"ball": 13.1, "isHighlight": false, "text": "I Sharma to Raina, $$SIX$$ ,Raina has pressed on to the front foot and punched through the line, the outcome is that a length ball goes flying over the long-on boundary"}, {"ball": 13.2, "isHighlight": false, "text": "I Sharma to Raina,2 runs,moves back and across to work the ball off the pads in front of square leg"}, {"ball": 13.2, "isHighlight": false, "text": "Ramprashad : \"MI Auction Team are in the process of digging a big pit to hide their faces and themselves. The problem is Smith is not in a mood to let them relax even for a minute.\""}, {"ball": 13.3, "isHighlight": false, "text": "I Sharma to Raina, $$FOUR$$ ,a short ball down leg side, even Raina can play this easily, swivelling and helping it along to the fine leg boundary"}, {"ball": 13.4, "isHighlight": false, "text": "I Sharma to Raina,no run,defended from the crease on the leg side"}, {"ball": 13.5, "isHighlight": false, "text": "I Sharma to Raina,no run,played back to the bowler"}, {"ball": 13.6, "isHighlight": false, "text": "I Sharma to Raina, $$OUT$$ ,caught on the sweeper boundary. Raina charges and aims to hit straight but ends up slicing a length ball to Rao. An easy catch. Ishant's front foot is fine too."}, {"ball": 13.6, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Venugopal$$ $$Rao$$ $$b$$ $$I$$ $$Sharma$$ $$14$$ $$(14m$$ $$10b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 14.1, "isHighlight": false, "text": "KV Sharma to Dhoni,1 run,Dhoni - helmetless - nudges off the front foot on the leg side"}, {"ball": 14.2, "isHighlight": false, "text": "KV Sharma to Smith, $$SIX$$ ,tossed up outside off stump, Smith gets down on one knee and swipes with tremendous power, slamming the ball far over the long-on boundary"}, {"ball": 14.3, "isHighlight": false, "text": "KV Sharma to Smith,1 run,swung off the front foot to deep square leg"}, {"ball": 14.4, "isHighlight": false, "text": "KV Sharma to Dhoni,1 run,Dhoni steps out and pushes the ball to long on"}, {"ball": 14.5, "isHighlight": false, "text": "KV Sharma to Smith,1 run,played to deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Ashwin: \"Guess everyone has forgot what really went at the auction. MI did BID for Smith, Maxwell. Once they couldn't afford, they bowed out. It's not as if they sat and let them go. When those who left the team performs and the team doesn't do well, people lashes out. What about Johnson? Tiwary didn't do too well when RCB got him from MI. Then, they ridiculed RCB for paying huge sums. How fickle minded we are! How easily we arrive at conclusions! \""}, {"ball": 14.6, "isHighlight": false, "text": "KV Sharma to Dhoni,no run,defended on the front foot"}, {"ball": 15.1, "isHighlight": false, "text": "Kumar to Smith,1 run,driven to long on for a single"}, {"ball": 15.2, "isHighlight": false, "text": "Kumar to Dhoni,1 run,Dhoni moves across and works the ball off his pads through midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Ramprashad : \"CSK Auction Team will be keeping the head high every time they see Hussey, Murali and Morkel not performing well as they predicted.\""}, {"ball": 15.3, "isHighlight": false, "text": "Kumar to Smith, $$OUT$$ ,caught at long-off! Warner comes charging in and tumbles after holding a well-judged catch on the run. It was a low full toss and Smith didn't hit it as cleanly as he has been doing all evening. He's all but won CSK the game though"}, {"ball": 15.3, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Warner$$ $$b$$ $$Kumar$$ $$66$$ $$(70m$$ $$46b$$ $$4x4$$ $$5x6)$$ $$SR:$$ $$143.47$$"}, {"ball": 15.3, "isHighlight": false, "text": "Sundar: \"@Ashwin: There was a little something called retention before the auction happened. MI chose Harbhajan and Pollard (Who have done nothing of note) instead of Maxwell and/or Dwayne Smith. So, yes, they do need to dig that big hole someone was talking about earlier.\""}, {"ball": 15.4, "isHighlight": false, "text": "Kumar to Dhoni,1 leg bye,Dhoni gets hit on the pad as he tries to work the ball on the leg side, they run a leg bye after the ball goes on the off side"}, {"ball": 15.5, "isHighlight": false, "text": "Kumar to du Plessis, $$OUT$$ ,caught behind! Faf's gone first ball. He tries to drive away from his body at a good length delivery that seams away. A healthy edge that carries comfortably to the keeper Rahul"}, {"ball": 15.5, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$c$$ $$†Rahul$$ $$b$$ $$Kumar$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 15.5, "isHighlight": false, "text": "Jadeja is the new batsman."}, {"ball": 15.6, "isHighlight": false, "text": "Kumar to Jadeja,no run,good length around off, Jadeja plays it to Sammy, who is standing at gully"}, {"ball": 15.6, "isHighlight": false, "text": "Steyn to bowl his final over ..."}, {"ball": 16.1, "isHighlight": false, "text": "Steyn to Dhoni,1 run,punched off the back foot through cover"}, {"ball": 16.2, "isHighlight": false, "text": "Steyn to Jadeja,1 run,Jadeja jumps across his stumps and works the ball off his pads through square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Steyn to Dhoni,no run,good length on off stump, defended back to the bowler"}, {"ball": 16.4, "isHighlight": false, "text": "Steyn to Dhoni,1 run,Dhoni sprints the single, taking on Finch at mid-off, superb running after pushing the ball slowly to the fielder"}, {"ball": 16.5, "isHighlight": false, "text": "Steyn to Jadeja,no run,short of a length around off, played off the back foot to backward point"}, {"ball": 16.6, "isHighlight": false, "text": "Steyn to Jadeja,1 run,short of a length on the hips, Jadeja glances to long leg to ensure Steyn ends the game wicketless"}, {"ball": 17.1, "isHighlight": false, "text": "Kumar to Jadeja,1 run,Jadeja charges but mis-times the shot to long-on, he was looking to go high over midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Kumar to Dhoni,no run,Dhoni steps out but is beaten by the length and gets hit on the pad, Jadeja begins to run the leg bye but Bhuvneshwar gets to the ball quickly to prevent it"}, {"ball": 17.3, "isHighlight": false, "text": "Kumar to Dhoni,1 run,driven off the back foot to deep cover for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Thileeban: \"Now, Dhoni's aim is to take it to the last over \""}, {"ball": 17.4, "isHighlight": false, "text": "Kumar to Jadeja,1 run,round the wicket into the left-hander, Jadeja drives on the front foot to long off"}, {"ball": 17.5, "isHighlight": false, "text": "Kumar to Dhoni,1 run,poor fielding at point, the ball was cut straight to Karn Sharma but he fumbled it, he's now wiping it furiously with a towel so I think it is pretty wet from the dew"}, {"ball": 17.6, "isHighlight": false, "text": "Kumar to Jadeja,1 run,once again he fumbles the ball at backward point, allowing the single"}, {"ball": 18.1, "isHighlight": false, "text": "I Sharma to Jadeja,1 run,Jadeja steps out but is cramped for room by a short of a length delivery, he manages to get some bat on it to play it on the leg side"}, {"ball": 18.2, "isHighlight": false, "text": "I Sharma to Dhoni,1 run,a full toss from round the wicket, driven to long on for a single"}, {"ball": 18.3, "isHighlight": false, "text": "I Sharma to Jadeja, $$OUT$$ ,he's been bowled! The length was a bit too full to stay back to. The line was too straight to try and steer towards point. There was a gap between bat and pad and Ishant went straight through it to hit middle stump. the ball actually nipped back into the left-hander, grazed the thigh and then hit the stumps"}, {"ball": 18.3, "isHighlight": false, "text": "$$RA$$ $$Jadeja$$ $$b$$ $$I$$ $$Sharma$$ $$6$$ $$(13m$$ $$9b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 18.3, "isHighlight": false, "text": "Can Ishant bowl three dots at Manhas?"}, {"ball": 18.3, "isHighlight": false, "text": "Lokesh Kaza: \"A last minute twist in the tale perhaps?\""}, {"ball": 18.4, "isHighlight": false, "text": "I Sharma to Manhas,no run,he's bowled the first dot ball. Good length outside off, it holds its line and beats Manhas' tame prod. No footwork"}, {"ball": 18.5, "isHighlight": false, "text": "I Sharma to Manhas,no run,that's the second dot ball! Ishant shortens his length and gets it to move away a touch. Manhas swishes without moving his feet and is beaten outside off again"}, {"ball": 18.6, "isHighlight": false, "text": "I Sharma to Manhas,2 runs,Manhas manages to get an inside edge on the ball to send it towards fine leg. The fielder cannot prevent the second and so Dhoni will have strike for the final over"}, {"ball": 18.6, "isHighlight": false, "text": "Well, it should have never come to six off the final over, but with Dhoni on strike CSK are clear favourites. Mishra to bowl the final over. Sammy has not bowled in the innings."}, {"ball": 19.1, "isHighlight": false, "text": "Mishra to Dhoni,1 run,Dhoni stays back and works the ball to long on, giving Manhas the hot seat."}, {"ball": 19.1, "isHighlight": false, "text": "Surely Dhawan has to bring his field in to keep Manhas on strike by denying him singles?"}, {"ball": 19.2, "isHighlight": false, "text": "Mishra to Manhas,1 run,he's cut that straight to point and Dhoni has set off, it was the googly, there should have been a run out at the bowler's end but the throw was too hard for Mishra to collect and it missed"}, {"ball": 19.3, "isHighlight": false, "text": "Mishra to Dhoni, $$FOUR$$ ,that's it. All over. Dhoni slams a full toss to the square leg boundary. A poor ball, the dew might have had something to do about it."}, {"ball": 19.3, "isHighlight": false, "text": "$$10$$ $$pm$$  Chennai Super Kings have scored their fourth win in five games, drawing level with league leaders Kings XI Punjab, who have four wins in four games. Sunrisers are second from bottom now, with only one win in four games."}, {"ball": 19.3, "isHighlight": false, "text": "Shikhar Dhawan: \"We never knew that dew was going to come tonight, the ball got wet and out spinners could not grip it. It was coming nicely on to the bat. In the first innings the wicket was dry and the ground was dry so the ball was stopping on the batsman, it was difficult to hit the ball. We planned to get 150 but we did not know dew was going to come ... not going to take the credit away from them. They batted well.\""}, {"ball": 19.3, "isHighlight": false, "text": "Harry: \"Good tactics from CSK by not loosing any wickets to Steyn. He would have been pumped up if he had got one.\""}, {"ball": 19.3, "isHighlight": false, "text": "MS Dhoni: \"I think the game really changed once they changed the ball, when the ball was not wet it started doing things until it got wet again. It was a decent total, the dew got worse, the opposition bowlers weren't able to execute plans. We would have batted first as well, so a good toss to lose. Overall we are playing good cricket, everyone has contributed, not everyone in our top seven has been tested, openers doing a fantastic job.\" He has high praise for the Sharjah crowd, they were out in force today."}, {"ball": 19.3, "isHighlight": false, "text": "Dwayne Smith is the Man of the Match for his 66 from 46 balls. Smith: \"The plan was to stay calm and be positive, don't worry about anything, we can catch up anytime. Try to get as much runs early up and make it easier for the other guys. Very good guys in CSK, very good staff, it's brilliant.\""}, {"ball": 19.3, "isHighlight": false, "text": "Thank you for all your emails today. That's all I've got for you. We'll be back on the IPL treadmill tomorrow. Cheers."}], "name": "Sunrisers Hyderabad v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729311.html?innings=2;view=commentary", "match_num": 17}