{"commentary": [{"ball": 0, "isHighlight": false, "text": "Welcome back. Pujara on strike to Starc, and the small target will allow him to play his eye in. Sehwag at the non-striker's end."}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Pujara,no run,Length ball wide of off stump, angled across from left-arm over. Pujara pokes with no feet, beaten."}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Pujara,no run,bit of inward movement, Pujara defends into the off side off the back foot."}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Pujara,no run,Once again, Pujara throws his hands at a wide ball without really getting across with his front foot. Beaten again."}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Pujara,no run,another ball wide of off stump, left alone."}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Pujara,no run,takes a couple of steps down the pitch, plays an inswinging delivery into the leg side with a straight bat."}, {"ball": 0.5, "isHighlight": false, "text": "I'm just here for the cheerleaders, a banner in the crowd says."}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Pujara,2 runs,Nice little push between point and cover, gets forward and opens his face a touch."}, {"ball": 0.6, "isHighlight": false, "text": "Albie now."}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Sehwag,1 run,Shortish, wide-ish. Sehwag opens his face and guides it to the off-side sweeper."}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Pujara,1 run,Back of a length, on the pads, tucked away square on the leg side."}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Sehwag,1 run,Misfield at point as Sehwag punches one off the back foot. It's Kohli, and the ball slips through his legs."}, {"ball": 1.3, "isHighlight": false, "text": "Kohli's facial expression hasn't changed since that lbw decision against him."}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Pujara,1 wide,Slower ball, slips well down the leg side."}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Pujara, $$FOUR$$ ,Drifts onto the pads, Pujara whips it away with a lot of bottom hand, flies away to the left of fine leg."}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Pujara,no run,Another leg-side ball. Pujara misses out this time, off his pad to Parthiv, who takes it well diving to his left."}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Pujara,1 wide,What's happening here? Albie's just not got his direction going. Another one slides down the leg side."}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Pujara,1 run,Overcompensates. Short and wide, but Pujara's uppercut goes straight to third man, on the bounce."}, {"ball": 1.6, "isHighlight": false, "text": "shushank : \"Seeing pujara getting beaten without moving his feet... I am really worried that the glamour of limited over cricket has taken over him... we really don't want to lose a quality test batsman to this cash rich IPL.. :x\""}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Pujara,no run,Wide of off stump again. This seems to be a plan from Starc. Pujara lets it go."}, {"ball": 2.1, "isHighlight": false, "text": "Arvind: \"I think there should be a 'Money-Back Guarantee' for the owners. They should sign a contract with players,who sell over 2 crores, will 'atleast' do 'this' much to which both the parties should sign on.\""}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Pujara,1 run,Full, outside off, shapes in slightly. Pujara leans into it and eases the ball into the covers."}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Sehwag,no run,Full and straight, pings a leaden-footed Sehwag on the base of his pads, but the inswing would have taken it down the leg side."}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Sehwag,1 run,Low full-toss on off stump, pushed to deep cover."}, {"ball": 2.4, "isHighlight": false, "text": "Don: \"@Shushank - Dont worry, i doubt a life time of training is gonna be overwritten by a season of T20\""}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Pujara,no run,Short and wide. Pujara is a good cutter, but he misses out this time, grabs too eagerly at it and is beaten."}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Pujara,no run,Back of a length, on off stump, played straight to point with an open bat-face."}, {"ball": 2.6, "isHighlight": false, "text": "Here's Varun Aaron. He's looked pretty good this season, much more accurate than he has been in the past. Let's see how he goes here."}, {"ball": 3.1, "isHighlight": false, "text": "Aaron to Sehwag,2 runs,Back of a length, middle and off, Sehwag twirls his wrists to send it scurrying past midwicket."}, {"ball": 3.2, "isHighlight": false, "text": "Aaron to Sehwag, $$FOUR$$ ,Full, wide, bit of shape away. Sehwag crouches low and places it past point for four. Lovely hands."}, {"ball": 3.3, "isHighlight": false, "text": "Aaron to Sehwag,1 run,Onto the batsman's hips, tucked away to deep backward square leg."}, {"ball": 3.4, "isHighlight": false, "text": "Aaron to Pujara,no run,Length ball, shapes away a touch from off stump, defended into the off side."}, {"ball": 3.4, "isHighlight": false, "text": "\"What has a person got to do to get his/her comments published ?\" Hope there's a bit of a lull in play, Swagath Subrama."}, {"ball": 3.5, "isHighlight": false, "text": "Aaron to Pujara,no run,Bouncer, well-directed, fizzes past Pujara as he tries to hook."}, {"ball": 3.6, "isHighlight": false, "text": "Aaron to Pujara,1 run,Played away behind square with an open face off the back foot."}, {"ball": 3.6, "isHighlight": false, "text": "Dinda comes on."}, {"ball": 4.1, "isHighlight": false, "text": "Dinda to Pujara, $$OUT$$ ,He's gone! Leans back and tries to steer it to third man, ends up edging it to the keeper."}, {"ball": 4.1, "isHighlight": false, "text": "$$CA$$ $$Pujara$$ $$c$$ $$†Patel$$ $$b$$ $$Dinda$$ $$10$$ $$(20m$$ $$18b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$55.55$$"}, {"ball": 4.1, "isHighlight": false, "text": "A lot of discussion among commenters about the impact of IPL on batting techniques. Pujara clearly didn't look comfortable playing that T20 shot."}, {"ball": 4.2, "isHighlight": false, "text": "Dinda to Saha,no run,Short, angling away, left alone."}, {"ball": 4.3, "isHighlight": false, "text": "Dinda to Saha,1 run,Short and wide, steered away to third man."}, {"ball": 4.4, "isHighlight": false, "text": "Dinda to Sehwag, $$FOUR$$ ,walks across to a middle-stump ball and half-pulls, fine leg was in the circle."}, {"ball": 4.5, "isHighlight": false, "text": "Dinda to Sehwag, $$FOUR$$ ,Stunning. Whips a back-of-a-length ball from outside off stump in front of midwicket."}, {"ball": 4.6, "isHighlight": false, "text": "Dinda to Sehwag,no run,Defended off the back foot to point."}, {"ball": 5.1, "isHighlight": false, "text": "Aaron to Saha,no run,angling in, tight on off stump. Punched into the off side."}, {"ball": 5.2, "isHighlight": false, "text": "Aaron to Saha,no run,slips down the leg side. This seems to be contagious."}, {"ball": 5.3, "isHighlight": false, "text": "Aaron to Saha,1 run,Short, slightly wide of off stump. Saha stays leg-side of the ball and chops down on it to place it behind point."}, {"ball": 5.4, "isHighlight": false, "text": "Aaron to Sehwag,1 run,back and across, worked to square leg. Slightly slow getting to the bowler's end, but Chahal's throw missed. Direct hit would have done for him."}, {"ball": 5.5, "isHighlight": false, "text": "Aaron to Saha, $$OUT$$ ,What a catch! Mitchell Starc, running to his left from fine leg, takes it coolly in his stride, inches from the rope, as Saha plays a pick-up shot off a length ball on leg stump."}, {"ball": 5.5, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$c$$ $$Starc$$ $$b$$ $$Aaron$$ $$2$$ $$(7m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 5.6, "isHighlight": false, "text": "Aaron to Sehwag,no run,Good short ball, rising towards the rib-cage. Sehwag jumps off his feet to keep it down."}, {"ball": 5.6, "isHighlight": false, "text": "On comes Chahal, economy rate of 5.89 this season. How will he go against Sehwag and Maxwell?"}, {"ball": 6.1, "isHighlight": false, "text": "Chahal to Maxwell,2 runs,Short ball first up, flicked into the midwicket region."}, {"ball": 6.2, "isHighlight": false, "text": "Chahal to Maxwell,1 run,short and wide, cut straight to the sweeper."}, {"ball": 6.3, "isHighlight": false, "text": "Chahal to Sehwag,1 run,googly, short once again, flicked into the leg side."}, {"ball": 6.4, "isHighlight": false, "text": "Chahal to Maxwell,no run,fuller now, flighted. Maxwell misses the slog sweep but only a half-hearted lbw appeal. The ball was clearly headed down the leg side."}, {"ball": 6.5, "isHighlight": false, "text": "Chahal to Maxwell,2 runs,Flicked once more, Yuvraj runs from long on, has to go past the ball to pick it up with his left hand, gives the batsmen enough time to run two. Kohli isn't happy."}, {"ball": 6.6, "isHighlight": false, "text": "Chahal to Maxwell,1 run,skids on, inside edge runs away towards square leg."}, {"ball": 6.6, "isHighlight": false, "text": "Vigneshwar: \"Sehwag running twos.. You gotta give it to maxwell :P\""}, {"ball": 7.1, "isHighlight": false, "text": "Aaron to Maxwell, $$OUT$$ ,Starc takes another! Maxwell pulls, but doesn't hit it too cleanly, and Starc has to run in from the ropes and dive forward to cup it inches from the ground."}, {"ball": 7.1, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Starc$$ $$b$$ $$Aaron$$ $$6$$ $$(6m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 7.2, "isHighlight": false, "text": "Aaron to Sehwag, $$FOUR$$ ,blockhole ball on leg stump. It looked like Sehwag was trying to jam his bat down to keep it out, but it morphed into a flick at the last moment and flew away to the square leg boundary."}, {"ball": 7.3, "isHighlight": false, "text": "Aaron to Sehwag,1 run,worked into the leg side off the back foot."}, {"ball": 7.3, "isHighlight": false, "text": "Miller on strike for the first time."}, {"ball": 7.4, "isHighlight": false, "text": "Aaron to Miller,no run,Short, rising ball. Gets on his toes to defend, and keeps it down even though he wasn't really in control."}, {"ball": 7.5, "isHighlight": false, "text": "Aaron to Miller,1 run,Steered behind point off the front foot."}, {"ball": 7.5, "isHighlight": false, "text": "Sabari: \"Was starc asking the crowd to roar louder? He sure wanna be fired up for RCB to pull this one\""}, {"ball": 7.6, "isHighlight": false, "text": "Aaron to Sehwag,1 wide,short, down the leg side, Sehwag misses with an attempted flick-sweep."}, {"ball": 7.6, "isHighlight": false, "text": "RoshanUttam: \"Will Glenn Maxwell end up to be the Dinesh Karthik of this year? 3 good games and suddenly fails the rest of the season.\" Slightly premature prediction, no?"}, {"ball": 7.6, "isHighlight": false, "text": "Aaron to Sehwag,4 leg byes,whoa. Sehwag ducks into a bouncer, and the ball bounces off his helmet and races away to the fine third-man boundary."}, {"ball": 8.1, "isHighlight": false, "text": "Chahal to Miller,no run,Googly turning from middle to off. Miller didn't look too confident as he defended into the off side."}, {"ball": 8.2, "isHighlight": false, "text": "Chahal to Miller,1 run,Legbreak this time, but only a little bit of turn. Enough to get the inside edge as Miller prods forward."}, {"ball": 8.3, "isHighlight": false, "text": "Chahal to Sehwag,2 runs,Sehwag shows how it's done, going deep in his crease and punching it wristily to long on."}, {"ball": 8.4, "isHighlight": false, "text": "Chahal to Sehwag,no run,beaten as he tries to cut a legbreak that turns quite sharply."}, {"ball": 8.5, "isHighlight": false, "text": "Chahal to Sehwag,1 run,short again, and Sehwag pulls to long on."}, {"ball": 8.6, "isHighlight": false, "text": "Chahal to Miller,1 run,comes forward and pushes down to long off. TIme for a time-out."}, {"ball": 8.6, "isHighlight": false, "text": "Slightly cryptic from Suhail: \"Sehwag = Footworks , Sprint Not Well Work As Footbal Player BUT HIS Head Is Scoring Like Zidane.....\""}, {"ball": 8.6, "isHighlight": false, "text": "Prabhakaran R: \"did anyone notice it?? Maxwell screamed before Kohli when he was given LBW... and when Maxwell got out, Kohli ran to him and gave it back !!\""}, {"ball": 8.6, "isHighlight": false, "text": "Starc returns for his third"}, {"ball": 9.1, "isHighlight": false, "text": "Starc to Miller,1 wide,He was bowling wide outside off to the right-handers, and ends up bowling the same angle to the left-handed Miller."}, {"ball": 9.1, "isHighlight": false, "text": "Starc to Miller,3 wides,even wider down the leg side and Parthiv had no chance to collect it behind the stumps, gets a vital bit of webbing on it to stop it from running away to the boundary."}, {"ball": 9.1, "isHighlight": false, "text": "Starc to Miller,no run,better. Straight, denies Miller room, defended back to the bowler."}, {"ball": 9.2, "isHighlight": false, "text": "Starc to Miller,2 runs,Bit of an inside edge down to Yuvraj, who misfields at deep backward square leg as he tries to pick up with one hand."}, {"ball": 9.3, "isHighlight": false, "text": "Starc to Miller,no run,pushed straight to point off the front foot. Kohli has a shy at the bowler's end, but misses. Sehwag was in anyway."}, {"ball": 9.3, "isHighlight": false, "text": "\"just one doubt. sehwag did not offer a shot on that ball from varun arron but still it given as 4 byes ? why?? \" He was taking evasive action, plabanluee."}, {"ball": 9.4, "isHighlight": false, "text": "Starc to Miller,1 run,Short, but not short enough. Miller checks his pull towards midwicket."}, {"ball": 9.5, "isHighlight": false, "text": "Starc to Sehwag,no run,Good ball, back of a length on middle and off, moves away a touch after pitching. Defended off the back foot."}, {"ball": 9.6, "isHighlight": false, "text": "Starc to Sehwag,no run,ducks safely under the bouncer, Starc has a bit of a chirp and Sehwag says something as well."}, {"ball": 10.1, "isHighlight": false, "text": "Chahal to Miller,1 run,driven to long off"}, {"ball": 10.2, "isHighlight": false, "text": "Chahal to Sehwag,no run,slow, flighted ball outside off. Sehwag goes for a big shot over cover, and is beaten by the turn."}, {"ball": 10.2, "isHighlight": false, "text": "Suhail: \"After 121 comments Today I Got 1st One Published. THANKZ CRICINFO\""}, {"ball": 10.3, "isHighlight": false, "text": "Chahal to Sehwag,1 run,More of a skidder this time, and Sehwag watchfully plays it into the off side with soft hands."}, {"ball": 10.4, "isHighlight": false, "text": "Chahal to Miller, $$FOUR$$ ,Shorter, quicker, and Miller gives himself room to slap it in front of point."}, {"ball": 10.5, "isHighlight": false, "text": "Chahal to Miller,no run,better length, Miller comes forward, defends."}, {"ball": 10.6, "isHighlight": false, "text": "Chahal to Miller,1 run,googly again, Miller doesn't pick it and gets a leading edge down to long off."}, {"ball": 10.6, "isHighlight": false, "text": "Sridhar: \"Such a joy watching sehwag play. Those flicks off the pads, those creamers through the offside, solid defense without the feet moving a bit. Hope to see him in Indian colors. One final chance may be.\""}, {"ball": 10.6, "isHighlight": false, "text": "Albie comes back after a poor first over. Umpire signals dead ball as he runs through the crease, Miller isn't ready yet."}, {"ball": 11.1, "isHighlight": false, "text": "Morkel to Miller,no run,Short, pulled straight to Gayle at square leg."}, {"ball": 11.2, "isHighlight": false, "text": "Morkel to Miller,2 runs,slower ball on leg stump, worked down to deep midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Morkel to Miller, $$FOUR$$ ,Short, pulled away into the big gap to long on's left."}, {"ball": 11.4, "isHighlight": false, "text": "Morkel to Miller, $$FOUR$$ ,Short again, pulled again, squarer this time. This is poor bowling from Albie."}, {"ball": 11.4, "isHighlight": false, "text": "Round the wicket now"}, {"ball": 11.5, "isHighlight": false, "text": "Morkel to Miller, $$FOUR$$ ,Change of angle doesn't help too much. Drifts down the leg side, and Miller only has to help it along behind square."}, {"ball": 11.6, "isHighlight": false, "text": "Morkel to Miller,no run,Short again, but a bit more pace, and Miller is struck on the body as he tries to tuck it into the leg side."}, {"ball": 11.6, "isHighlight": false, "text": "Chahal's been economical, but RCB need a wicket here."}, {"ball": 12.1, "isHighlight": false, "text": "Chahal to Sehwag,1 run,Full, on leg stump, chipped down to long-on."}, {"ball": 12.2, "isHighlight": false, "text": "Chahal to Miller, $$OUT$$ ,lovely delivery. Googly tossed up outside off, and Miller follows it with his hands, trying to hit it square but only managing an outside edge to Parthiv, who takes a good sharp catch."}, {"ball": 12.2, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$c$$ $$†Patel$$ $$b$$ $$Chahal$$ $$26$$ $$(27m$$ $$20b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$130.00$$"}, {"ball": 12.2, "isHighlight": false, "text": "It's time for George Bailey, Punjab's captain."}, {"ball": 12.3, "isHighlight": false, "text": "Chahal to Bailey,no run,Another googly, Bailey is struck on the pads way down the leg side."}, {"ball": 12.4, "isHighlight": false, "text": "Chahal to Bailey,1 run,swept down to deep backward square"}, {"ball": 12.5, "isHighlight": false, "text": "Chahal to Sehwag,2 runs,tossed up again, like that ball that had beaten Sehwag earlier, but he checks his shot this time and places it to the right of a wide-ish long-off."}, {"ball": 12.6, "isHighlight": false, "text": "Chahal to Sehwag, $$OUT$$ ,Chahal gets another! Parthiv gets in the act again as Sehwag tries to cut a legbreak. Replays suggest there was no outside edge, though."}, {"ball": 12.6, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$†Patel$$ $$b$$ $$Chahal$$ $$32$$ $$(66m$$ $$26b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$123.07$$"}, {"ball": 12.6, "isHighlight": false, "text": "Rishi Dhawan in now. He hasn't really had an opportunity to show off his batting ability, but now he has a difficult situation to steer his team out of. Punjab need 37 from 42. Dinda returns to the attack."}, {"ball": 13.1, "isHighlight": false, "text": "Dinda to Bailey,1 run,Short, outside off, Bailey tries to pull but hits it off the bottom of his bat down to a diving mid-off."}, {"ball": 13.2, "isHighlight": false, "text": "Dinda to Dhawan,no run,Not short enough for the pull, and Dhawan gets a thick inside edge onto his pads."}, {"ball": 13.3, "isHighlight": false, "text": "Dinda to Dhawan,no run,Good angle, cramping the batsman for room. Defended off the back foot."}, {"ball": 13.4, "isHighlight": false, "text": "Dinda to Dhawan,no run,slower bouncer, beats the batsman who aims a hopeful pull at it."}, {"ball": 13.4, "isHighlight": false, "text": "Idrees Kanchwal: \"I said it before and I will say it again Dinda will decide the fate of the game for RCB\""}, {"ball": 13.5, "isHighlight": false, "text": "Dinda to Dhawan, $$FOUR$$ ,Short, not too much room outside off stump, but Dhawan slashes it away off the front foot and times it beautifully to send it screaming past third man haring to his right."}, {"ball": 13.6, "isHighlight": false, "text": "Dinda to Dhawan,no run,Straight, close to the blockhole, defended back to the bowler."}, {"ball": 13.6, "isHighlight": false, "text": "Prabahth: \"Ah! The difference in reactions between Sehwag and Kohli after being the victims of umpiring errors! Maturity is the word!\""}, {"ball": 13.6, "isHighlight": false, "text": "Siddarth: \"Really disappointed to see Parthiv appeal in such a manner against his India senior Sehwag when there was clearly no edge :/\""}, {"ball": 14.1, "isHighlight": false, "text": "Yuvraj Singh to Bailey,1 run,a touch short from Yuvraj to start, spinning away, luckily for Yuvraj it is not put away, chopped towards sweeper cover"}, {"ball": 14.2, "isHighlight": false, "text": "Yuvraj Singh to Dhawan, $$FOUR$$ ,cleverly done by R Dhawan, playing it very late there, outside off and that is glided past slip for four"}, {"ball": 14.3, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,no run,defended off the front foot to the off side"}, {"ball": 14.4, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,2 runs,short and wide once more from Yuvraj, guided towards deep point"}, {"ball": 14.5, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,no run,loopy fuller ball, driven firmly but straight at Kohli at short cover"}, {"ball": 14.6, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,1 run,short once more from Yuvraj, spinning down leg, helped along towards deep backward square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Oh dear, another injury for Varun Aaron? Hopefully it is just a cramp. He's had a horrific injury record in the last 3-4 years. Aaron has hobbled off the field. Will he return if RCB need him?"}, {"ball": 15.1, "isHighlight": false, "text": "Starc to Dhawan,no run,shortish and wide, 142.4kph, bottom edge as Dhawan looks to scythe that through the off, bounces through towards the keeper, Parthiv dives to his right to collect that"}, {"ball": 15.2, "isHighlight": false, "text": "Starc to Dhawan,1 run,powerfully struck, but doesn't beat AB at cover point. AB doesn't collect the ball cleanly on the first attempt, recovers superbly and fires it in towards the non-striker's end, a direct hit and that was a wicket"}, {"ball": 15.3, "isHighlight": false, "text": "Starc to Bailey,no run,solidly defended towards the off side"}, {"ball": 15.4, "isHighlight": false, "text": "Starc to Bailey,1 run,pitched up and that is guided towards backward point for a single"}, {"ball": 15.4, "isHighlight": false, "text": "Mahesh Yadav: \"Good thinking by George Bailey giving most of the strike to R Dhawan and playing around. \""}, {"ball": 15.5, "isHighlight": false, "text": "Starc to Dhawan,no run,full and wide outside off, Dhawan plays and misses"}, {"ball": 15.6, "isHighlight": false, "text": "Starc to Dhawan,2 runs,full and slanting in from round the wicket, whipped towards deep midwicket for a quick two"}, {"ball": 15.6, "isHighlight": false, "text": "Gagan: \"Thanks to IPL for providing opportunities for Indian players like Rishi Dhawan as he may have never got the exposure while playing for small states like Himachal. Really good player, would like to see him in Indian cricket team\""}, {"ball": 16.1, "isHighlight": false, "text": "Yuvraj Singh to Bailey,1 run,length ball heading for middle and leg, driven inside-out towards extra cover"}, {"ball": 16.2, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,1 run,full ball and that is driven towards cover for a single"}, {"ball": 16.2, "isHighlight": false, "text": "Karthik: \"Ridiculous for Bailey to come in at 6. Completely wasted. And they retained Manan Vohra to warm the bench? Mandeep Singh and Gurkeerat Singh were superb for Punjab last season, yet they can't get a game?! Pujara is a like a rabbit in headlights in this format.\" Team is winning every game this season, and still so many complaints?"}, {"ball": 16.3, "isHighlight": false, "text": "Yuvraj Singh to Bailey,no run,chopped towards backward point"}, {"ball": 16.4, "isHighlight": false, "text": "Yuvraj Singh to Bailey,1 run,driven towards long-off for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Yuvraj Singh to Dhawan,1 run,full ball on the pads, clipped towards square leg"}, {"ball": 16.6, "isHighlight": false, "text": "Yuvraj Singh to Bailey,1 run,length ball outside off, driven towards long-off for a single, sensible cricket from Kings XI here"}, {"ball": 17.1, "isHighlight": false, "text": "Dinda to Bailey,1 run,short of length ball outside off, driven in front of point for a single"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Dhawan,1 run,slower, full ball on the pads, 101kph, driven towards long-on for one more, Kings XI know they don't need to do anything fancy here, and they aren't"}, {"ball": 17.3, "isHighlight": false, "text": "Dinda to Bailey,1 run,another single, pushed towards long-on"}, {"ball": 17.4, "isHighlight": false, "text": "Dinda to Dhawan,1 run,slower bouncer this time, pulled towards deep square for one more"}, {"ball": 17.5, "isHighlight": false, "text": "Dinda to Bailey,1 run,pitched up and outside off, driven towards long-off for one more, Kings XI playing this like it is the middle overs of an ODI"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda to Dhawan,no run,length ball on off stump, pushed back towards the bowler"}, {"ball": 17.6, "isHighlight": false, "text": "Peeyush: \"Smart Cricket. Rather getting carried away by the glory of 20-20 cricket's bashing game they are just keeping the scorecard ticking. Brilliant.\""}, {"ball": 17.6, "isHighlight": false, "text": "Varun Aaron is back on the field, and is set to bowl now."}, {"ball": 18.1, "isHighlight": false, "text": "Aaron to Bailey, $$FOUR$$ ,starts with a really poor delivery, angling it down the leg side, fine leg in the ring, easy for Bailey to help along for four"}, {"ball": 18.2, "isHighlight": false, "text": "Aaron to Bailey,1 run,full ball outside off, searching for the yorker, jammed towards the off side"}, {"ball": 18.3, "isHighlight": false, "text": "Aaron to Dhawan,no run,Dhawan looking to smear that through the leg side, connects well, but Gayle dives to his left to cut that off"}, {"ball": 18.4, "isHighlight": false, "text": "Aaron to Dhawan,1 run,length ball on off stump, thumped towards long-on for a single, four more to go"}, {"ball": 18.4, "isHighlight": false, "text": "Juvenal: \"I think Punjab should bring Mandeep Singh for Saha & Gurkeerat Singh for Pujara...Mandeep can open the batting with Sehwag & Gurkeerat Singh at one down will make a formidable batting order.... \""}, {"ball": 18.5, "isHighlight": false, "text": "Aaron to Bailey,(no ball) 1 run,high full toss, too high, Bailey guides it down towards third man for a single"}, {"ball": 18.5, "isHighlight": false, "text": "Aaron to Dhawan, $$FOUR$$ ,five in five for Kings XI, they complete a perfect UAE leg, Dhawan hammers the shortish ball to the wide long-on boundary,  Vijay Mallya is deflated,  Bailey and Dhawan are overjoyed, Kings XI have now won eight in a row starting from last season, the longest streak in the IPL"}, {"ball": 18.5, "isHighlight": false, "text": "Siva: \"Nice to see once dangerous Indian chaps Sehwag and Yuvraj turned out to be the leading scores for their teams.\""}, {"ball": 18.5, "isHighlight": false, "text": "$$Virat$$ $$Kohli:$$  \"When you lose momentum in this format, it is difficult to come back. In these two matches, we have tried different things, they haven't come off. I've told Chahal and Aaron to keep attacking all the time.\""}, {"ball": 18.5, "isHighlight": false, "text": "$$Rishi$$ $$Dhawan:$$  \"We have a good team, the confidence is high. The wicket was helpful today, Sandeep Sharma gave us a good start today, I focussed on the basics. My confidence increases by playing with seniors like Sehwag, I'm learning several things from it.\""}, {"ball": 18.5, "isHighlight": false, "text": "Abhi: \"I agree with some suggestions here. Though KXIP is on a great winning streak, its time for them to try out their bench strength. This will keep the squad up, in case of any later injury in their playing XI. I am sure this will not be perceived as pressing the panic button, but a sensible decision of testing the team strength.\""}, {"ball": 18.5, "isHighlight": false, "text": "$$Presentation$$ $$ceremony:$$"}, {"ball": 18.5, "isHighlight": false, "text": "Chris Gayle is brilliant, he wins an award for most sixes, and from a line-up of people waiting to hand out prizes, he goes to the closest person and tries to take a trophy. Smiles all around as Gayle realises that's the Man of the Match award."}, {"ball": 18.5, "isHighlight": false, "text": "$$George$$ $$Bailey:$$  \"Confidence is a really big thing, we are working well as a unit. Low totals can be tricky, but Viru in the middle you know you'll get the boundaries.\""}, {"ball": 18.5, "isHighlight": false, "text": "The Man of the Match is  $$Sandeep$$ $$Sharma$$ : \"I'm feeling lucky that I'm winning back-t-oback Man of the Match awards, I'm feeling awesome. I've seen Gayle playiing many times, hitting many other bowlers, it was an awesome moment (to get him bowled).\""}, {"ball": 18.5, "isHighlight": false, "text": "Thanks everyone for joining in today, on behalf of Karthik Krishnaswamy and the rest of the Cricinfo gang, this is Siddarth Ravindran signing out. G'night!"}], "name": "Kings XI Punjab v Royal Challengers Bangalore", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729313.html?innings=2;view=commentary", "match_num": 18}