{"commentary": [{"ball": 0, "isHighlight": false, "text": "Rahane to take strike, Nair at the other end. Vinay Kumar to bowl"}, {"ball": 0, "isHighlight": false, "text": "$$Toss:$$ $$Watson$$ $$wins$$ $$and$$ $$Royals$$ $$will$$ $$bat$$"}, {"ball": 0, "isHighlight": false, "text": "For RR, Iqbal Abdulla and James Faulkner are in for Abhishek Nayar and Tim Southee. For KKR, Shakib Al Hasan and Manvinder Bisla are in for Chris Lynn and Yusuf Pathan. Also, Vinay Kumar has replaced Umesh Yadav"}, {"ball": 0, "isHighlight": false, "text": "Gambhir says he would have bowled. He is expecting dew and does not want his spinners to suffer under lights. Watson says it is a drier surface and will not change much during the game."}, {"ball": 0, "isHighlight": false, "text": "Kp: \"KKR made a wise choice by dropping the out of form yusuf and its time for the captain to prove his worth.\""}, {"ball": 0, "isHighlight": false, "text": "Udit: \"RR are changing their team regularly n brilliantly. This is the only team which has a solid tested bench-strength particularly in bowling dept. \""}, {"ball": 0, "isHighlight": false, "text": "Aman Parikh: \"KK Nair over Unmukt Chand? I thought Unmukt was the next big thing for Indian Cricket after Kohli but he hasn't quite lived upto the potential he possesses.\""}, {"ball": 0, "isHighlight": false, "text": "Manish Khatri: \"The decision to drop Pathan down the order has always backfired for Kolkata. Rajasthan used him wisely by letting him play at the top of the order. Kolkata is missing a trick here\""}, {"ball": 0, "isHighlight": false, "text": "$$5.45pm$$  Final IPL game coming up for Abu Dhabi. Toss in fifteen minutes. KKR and RR next to each other on the points table with two wins and two losses for each. The burning question - can Gautam Gambhir leave the UAE with some runs? He has a grand total of one from four games"}, {"ball": 0, "isHighlight": false, "text": "------------ Drumroll! The winners list for Powerplay 1 of  $$CricIQ$$  is out! Ten of the biggest cricket buffs qualify for the first two video rounds that will be hosted by Joy Bhattacharjya over the weekend."}, {"ball": 0, "isHighlight": false, "text": "There are four more Powerplays to go. The next one could be your big shot at the big league. The challenge never ends on  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ . Pad up. Play!"}, {"ball": 0.1, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,short and wide to start with, Rahane does not go too hard at it, slaps it away square, where cover dives to prevent the boundary"}, {"ball": 0.2, "isHighlight": false, "text": "Vinay Kumar to Rahane, $$FOUR$$ ,overpitched around off, and Rahane uses the bit of inward angle to clip it through midwicket, excellent timing"}, {"ball": 0.3, "isHighlight": false, "text": "Vinay Kumar to Rahane,no run,back of a length, outside off, left alone"}, {"ball": 0.4, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,back of a length, angled in to the right hander, nudged square to leg"}, {"ball": 0.5, "isHighlight": false, "text": "Vinay Kumar to Nair,no run,Nair beaten by his Karnataka team-mate first ball, plays outside the line of this back of a length ball, which does not carry to the keeper"}, {"ball": 0.6, "isHighlight": false, "text": "Vinay Kumar to Nair,no run,pushed square on the off side"}, {"ball": 0.6, "isHighlight": false, "text": "Morkel, Morne"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Rahane,3 runs,starts full on the stumps, and is tucked in front of square, Shakib chases it and pulls it back near the rope"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Nair,1 wide,slants it in again, on a good length this time, and it carries down the leg side"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Nair,no run,this nipped in from outside off, there is an appeal for lbw, but there was an inside edge there"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Nair,1 run,another one coming in from a pitched up length outside off, a thick inside edge rolls to leg as he pushes carefully"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Rahane,no run,Morkel persists with the fuller length, Rahane comes forward and pushes it towards mid on"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Rahane,1 wide,tries his preferred back of a length now, and it climbs steeply, but well down leg"}, {"ball": 1.5, "isHighlight": false, "text": "Girish: \"@Aman Parikh: Karun Nair is one of highest run getters in domestic season and has been prominent player for Karnataka in winning both Ranji and Irani trophies. Remember how Unmukt Chand bowled off Brett Lee first ball last season.\""}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Rahane,no run,good length delivery slanted in a tad to off, Rahane comes across and nudges it square on the leg side"}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Rahane,no run,a fuller delivery pushed softly to extra cover"}, {"ball": 2.1, "isHighlight": false, "text": "Vinay Kumar to Nair, $$OUT$$ ,Nair charges out to a good length delivery, it comes in a bit after pitching and goes past his heave to hit the top of the stumps"}, {"ball": 2.1, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$b$$ $$Vinay$$ $$Kumar$$ $$1$$ $$(11m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$"}, {"ball": 2.1, "isHighlight": false, "text": "Dan: \"Of course Gambhir would have bowled. Who wants to start a match with a duck?\""}, {"ball": 2.2, "isHighlight": false, "text": "Vinay Kumar to Samson,no run,climbs high from short of a length and also moves away, left alone"}, {"ball": 2.3, "isHighlight": false, "text": "Vinay Kumar to Samson,no run,comes forward to defend a length ball to cover"}, {"ball": 2.4, "isHighlight": false, "text": "Vinay Kumar to Samson,no run,just back of a length, on the stumps, he plays it quietly down the track"}, {"ball": 2.4, "isHighlight": false, "text": "Aman Parikh: \"@Girish - Yes we did see that. But he has improved quite a lot from last season and don't forget he's only 21 yet. Unmukt should have been the 1st choice opener as he is a regular opener whereas Nair is more of a middle order batsman vulnerable to the new ball. \""}, {"ball": 2.5, "isHighlight": false, "text": "Vinay Kumar to Samson,1 run,a leading edge, but out of the reach of backward point and flies to third man, he was trying to turn this short of a length ball to leg"}, {"ball": 2.6, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,much fuller and angled in, Rahane works it along the ground to deep square"}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Rahane,no run,run out chance, but the throw misses at the non-striker's end even as Samson dives in, it would have been in vain had Pandey hit, Rahane had defended this short of a length ball close to the pitch on off and had sent Samson back after he rushed halfway up the track"}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Rahane, $$FOUR$$ ,between wide slip and the keeper, Rahane flashes at a rising short of a length ball, but Kallis is too wide to have much chance with this one"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Rahane,no run,length ball defended off the front foot to the off side"}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Rahane, $$FOUR$$ ,shot, he leans back as Morkel gives him width outside off and cracks the cut neatly behind backward point, third man has no chance"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Rahane,no run,nips in from short of a length, and hits him high on the pad"}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Rahane,no run,has a go at the cut again, but this back of a length ball does not get up as much as he anticipates and goes under his swish"}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Samson,no run,Narine produces a leading edge first ball as Samson comes forward to a pitched up ball, it rolls to extra cover"}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Samson,no run,straightish good length ball outside off, he carefully pushes it back"}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Samson,1 run,makes some room outside leg, Narine bowls a straighter one on off, Samson slaps it down to long on"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Rahane,no run,guides a fuller one outside off to point"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Rahane,1 run,tossed up offbreak turning into the pad, nudged behind square"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Samson,no run,good length offbreak at 95 kph comes in from outside off, pushed away"}, {"ball": 4.6, "isHighlight": false, "text": "Louis: \"Does the ball ever go to a wide slip?! Just have a normal slip, and at least cover the one area well.\""}, {"ball": 5.1, "isHighlight": false, "text": "Morkel to Rahane,1 run,stays in the crease to one rising from a length, and guides it to third man"}, {"ball": 5.2, "isHighlight": false, "text": "Morkel to Samson, $$FOUR$$ ,Morkel pitches it up, Samson takes it on and cracks it down the ground"}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Samson,3 wides,a full and wide outswinger at 146 kph, Samson reaches for it, misses"}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Samson, $$FOUR$$ ,this is good length pitching on middle, angling in to the pad, and Samson's reacted quickly to flick it fine"}, {"ball": 5.4, "isHighlight": false, "text": "Morkel to Samson,no run,Samson has another swing, but this darts in a long way from just outside off, and hits him on the thigh pad"}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Samson, $$FOUR$$ ,he's got away with this, drags this bouncer half-heartedly from outside off, and the top edge flies over short fine"}, {"ball": 5.6, "isHighlight": false, "text": "Morkel to Samson, $$FOUR$$ ,fourth boundary of the over, Samson is in control of this one, Morkel overpitches on the stumps, Samson clips it to the deep midwicket rope"}, {"ball": 6.1, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,no run,slides in with the angle first ball, Rahane escapes as he manages an inside edge onto pad"}, {"ball": 6.2, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run"}, {"ball": 6.3, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,tossed up high and full around off, pushed down to long on"}, {"ball": 6.4, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,no run,defended down the track off the front foot"}, {"ball": 6.5, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,no run,angled in from wide of the crease, straightens just outside off, cut straight to point"}, {"ball": 6.6, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,2 runs,a thick inside edge rolls to vacant mid on as Rahane looks to push on the off side, bowler is after it, but they do well to take the second"}, {"ball": 6.6, "isHighlight": false, "text": "Kallis comes on"}, {"ball": 7.1, "isHighlight": false, "text": "Kallis to Samson,no run,starts with a pitched up, widish delivery that is played out to point"}, {"ball": 7.2, "isHighlight": false, "text": "Kallis to Samson,1 run,there have been a few of these tonight, another one darts in from just back of a length and rolls square on the off side"}, {"ball": 7.3, "isHighlight": false, "text": "Kallis to Rahane,no run,leans forward and defends a slower delivery pitched up around off"}, {"ball": 7.3, "isHighlight": false, "text": "Satya Alapati: \"love it when local lads slam the overseas fast bowlers :)\""}, {"ball": 7.4, "isHighlight": false, "text": "Kallis to Rahane,2 runs,length ball swinging into the pad, Rahane tucks it through square leg and comes back easily for the second"}, {"ball": 7.5, "isHighlight": false, "text": "Kallis to Rahane,1 run,slower length ball at 110 kph outside off, guided to third man"}, {"ball": 7.6, "isHighlight": false, "text": "Kallis to Samson,no run,angles it away from the right-hander and wide outside off, he tries to reach it but misses"}, {"ball": 8.1, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,skips out but converts this tossed up ball into a yorker, digs it back, but Shakib cannot stop it"}, {"ball": 8.2, "isHighlight": false, "text": "Shakib Al Hasan to Samson,no run,driven to point"}, {"ball": 8.3, "isHighlight": false, "text": "Shakib Al Hasan to Samson, $$OUT$$ ,he goes back to a full delivery and pays for it, Samson tries to make room outside leg, but the ball does not turn, it carries onto hit him low on the pad and rolls onto the stumps"}, {"ball": 8.3, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$20$$ $$(29m$$ $$19b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$105.26$$"}, {"ball": 8.3, "isHighlight": false, "text": "Time out"}, {"ball": 8.3, "isHighlight": false, "text": "Jay: \"Rahane is playing this like an ODI, he has nearly 50% dot balls, this is where Kohli is so good\""}, {"ball": 8.4, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 run,full delivery pushed down to long off"}, {"ball": 8.5, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,angled in and tossed up full, worked to long on"}, {"ball": 8.6, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 run,length ball slanted in to the pad, turned square"}, {"ball": 8.6, "isHighlight": false, "text": "Afzal: \"Don't know why but everyone criticizes Pujara where as they appreciate Rahane and Kallis for holding on to the wicket at one end.\""}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to Watson,1 run,tossed up full outside off, he moves forward and pushes it square for a single"}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Rahane, $$FOUR$$ ,flighted full again, but pitches down the leg side, and Rahane sweeps it hard and fine"}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Rahane,no run,Chawla corrects the line, tosses it up, pitches it on a good length around off, Rahane defends"}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to Rahane,no run,googly spins in and hits Rahane on the pad, he is caught on the crease but that is headed down leg"}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to Rahane,no run,nudged off the front foot to the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Rahane,1 run,angled in quicker towards off, he turns it towards vacant mid on for a single, bowler fields"}, {"ball": 9.6, "isHighlight": false, "text": "Deepak: \"@Afzal: All is about relativity. Pujara is compared with Maxi and Miller. Kallis and Rahane have no such comparisons in their team :)\""}, {"ball": 10.1, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,angled in full on off, driven to long off"}, {"ball": 10.2, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,Watson is tentative initially but then he presses forward and defends this length ball to leg"}, {"ball": 10.3, "isHighlight": false, "text": "Shakib Al Hasan to Watson, $$FOUR$$ ,skips out, reaches the pitch of the ball and slams it straight over the bowler"}, {"ball": 10.4, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,defended to leg off the front foot"}, {"ball": 10.5, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 run,bowls it full and wide, Watson reaches it and slaps it to the sweeper"}, {"ball": 10.6, "isHighlight": false, "text": "Shakib Al Hasan to Rahane, $$FOUR$$ ,Rahane goes in his favoured zone, comes down the track and lofts cleanly over extra cover, safely out of the reach of the sweeper"}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to Watson,no run"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to Watson,no run,tossed up just outside off at 92 kph, defended"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Watson,no run,stretches forward and defends this length ball to cover"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Watson,1 run,fuller delivery, Watson uses the inward angle to nudge it square on the leg side"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to Rahane,1 run,tossed up and bowled slower at 79 kph, Rahane pushes it towards cover"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to Watson,2 runs,flatter on a length, Watson has time to cut it hard, but the sweeper gets to it with a slide"}, {"ball": 12.1, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,angled in to the pad, he leans forward and nudges it to short fine leg"}, {"ball": 12.2, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,hurls it very full and very wide, but just inside the marker, well bowled"}, {"ball": 12.3, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 run,darts it in quick and full, Watson cannot work it away"}, {"ball": 12.4, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,pushes off the front foot through extra cover, Rahane wants the second, but Pandey runs in and lets go of it quickly, and Rahane has to turn back"}, {"ball": 12.5, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 run,a full toss but he pushes it softly straight to sweeper cover"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run"}, {"ball": 13.1, "isHighlight": false, "text": "Chawla to Rahane,2 runs,jumps out to a 79 kph delivery, but manages only a thick inside edge, wasn't quite to the pitch"}, {"ball": 13.2, "isHighlight": false, "text": "Chawla to Rahane,1 run,driven off the front foot to the sweeper"}, {"ball": 13.3, "isHighlight": false, "text": "Chawla to Watson, $$FOUR$$ ,Watson picks this full delivery from outside off and slog-sweeps it over midwicket, beats long on easily"}, {"ball": 13.4, "isHighlight": false, "text": "Chawla to Watson,2 runs,this is flat-batted hard past the bowler, but long off will get to it"}, {"ball": 13.5, "isHighlight": false, "text": "Chawla to Watson, $$FOUR$$ ,overpitched at 88.7 kph outside off, Watson gets forward and drills it powerfully through extra cover"}, {"ball": 13.6, "isHighlight": false, "text": "Chawla to Watson, $$FOUR$$ ,almost got him there, this was shorter but hurried on towards the stumps, Watson had set himself up for the pull, and an inside edge saves him as it races past the keeper"}, {"ball": 13.6, "isHighlight": false, "text": "Jez: \"Rahane & Watson batting together is like a collaboration between Mozart and Motorhead.\""}, {"ball": 14.1, "isHighlight": false, "text": "Narine to Rahane,1 run,straighter one just outside off, Rahane guides it to point for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Narine to Watson,no run,punches a straightish length ball down the track"}, {"ball": 14.3, "isHighlight": false, "text": "Narine to Watson,1 run,offbreak comes in from a length, Watson cannot get hold of the pull, takes the single to deep square"}, {"ball": 14.4, "isHighlight": false, "text": "Narine to Rahane,1 run,skips out and tries to go over extra cover again, but ends up chipping it to the sweeper"}, {"ball": 14.5, "isHighlight": false, "text": "Narine to Watson,no run,rocks back but this is 101 kph on the stumps and he stabs it back"}, {"ball": 14.6, "isHighlight": false, "text": "Narine to Watson, $$FOUR$$ ,this one will go, Watson brings up 2000 runs for Royals by powering this flat delivery over extra cover, sat up that one"}, {"ball": 15.1, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,starts with a widish short of a length ball, and Rahane goes to fifty by punching it to the right of the sweeper"}, {"ball": 15.2, "isHighlight": false, "text": "Vinay Kumar to Rahane,no run,tries to hit this short of a length ball on the up, but is beaten by slight away movement and the carry"}, {"ball": 15.3, "isHighlight": false, "text": "Vinay Kumar to Rahane, $$SIX$$ ,tries to slam this over deep midwicket, but mishits it, Shakib comes in too much though, and by  the time he corrects himself, it has become too high for him although he gets an outstretched hand to it"}, {"ball": 15.4, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,low and wide full toss steered wide of the sweeper"}, {"ball": 15.5, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,pitched up outside off, pushed in the air down to long off"}, {"ball": 15.6, "isHighlight": false, "text": "Vinay Kumar to Watson,1 run,  $$OUT$$ ,what a gifted wicket, full toss outside off, Watson pummels it through the covers, throw comes in from the sweeper, two bounces to the keeper, Watson is not really charging back, he realises he needs to dive, but he's fallen short by inches, Pandey's been sharp in the field tonight"}, {"ball": 15.6, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$run$$ $$out$$ $$33$$ $$(34m$$ $$24b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$137.50$$"}, {"ball": 16.1, "isHighlight": false, "text": "Narine to Rahane, $$FOUR$$ ,well done, Rahane comes out, moves inside the line of this offbreak and drills it square on the off side"}, {"ball": 16.2, "isHighlight": false, "text": "Narine to Rahane,no run,leading edge to point this time as he tries to turn it to leg"}, {"ball": 16.3, "isHighlight": false, "text": "Narine to Rahane,2 runs,quick down the pads, swept to short fine leg, who cannot stop it cleanly"}, {"ball": 16.4, "isHighlight": false, "text": "Narine to Rahane,no run,tries the reverse sweep but is beaten by this offbreak"}, {"ball": 16.5, "isHighlight": false, "text": "Narine to Rahane,2 runs,driven off the front foot to the left of sweeper cover for two more"}, {"ball": 16.6, "isHighlight": false, "text": "Narine to Rahane,1 run,shorter one at 104 kph, comes too quickly onto him for any timing on the pull, it is dragged to deep midwicket"}, {"ball": 17.1, "isHighlight": false, "text": "Morkel to Rahane,1 run,a high full toss, Rahane was moving out and towards the leg side, slaps it to mid off"}, {"ball": 17.2, "isHighlight": false, "text": "Morkel to Binny, $$OUT$$ ,Binny goes first ball, backs away a bit, Morkel goes short of a length and widish outside off, Binny stretches to have a go at the cut, but nicks it behind"}, {"ball": 17.2, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$†Bisla$$ $$b$$ $$Morkel$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Morkel to Smith,2 runs,pitched up delivery whipped through midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "Morkel to Smith,1 run,in the blockhole wide outside off, Smith toe ends it through point"}, {"ball": 17.5, "isHighlight": false, "text": "Morkel to Rahane,1 run,drags this short one from wide outside off through midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Morkel to Smith,1 run,a low full toss, Smith cranks up and whips it in the air over midwicket but he has not timed it"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Smith,2 runs,walks out first ball to Narine and flicks it square off the pad"}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Smith, $$FOUR$$ ,moves to the leg side and swings at this full delivery, it takes the outside edge and races fine past the keeper on off"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Smith,2 runs,jumps out, Narine slows it down and shortens the length, Smith adjusts to work it in front of square and races back for two more"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Smith,no run,stays in the crease and slogs but cannot get hold of it"}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Smith,1 run,leaves the crease again, and drives to cover"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Rahane,1 run,straighter one forced down to long off"}, {"ball": 18.6, "isHighlight": false, "text": "Narine's most expensive spell this season"}, {"ball": 18.6, "isHighlight": false, "text": "Rod: \"Same story every night, why are Steve Smith & Faulkner in the side if they aren't going to bat? Sure Faulkner can bowl, but he can also belt 60 in 5 overs. Why waste time with inferior batsmen when Steve Smith is getting paid a million bucks to sit on the bench? \""}, {"ball": 19.1, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,wide one in the blockhole, Rahane reaches out and squeezes it in front of square"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to Smith,1 run,gets the yorker in outside off once more, Smith can only dig it out"}, {"ball": 19.3, "isHighlight": false, "text": "Vinay Kumar to Rahane, $$OUT$$ ,Rahane sensed this would be full and wide again, he moves outside off but Vinay goes wider and Rahane's only dragged it tamely to long on"}, {"ball": 19.3, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$Yadav$$ $$b$$ $$Vinay$$ $$Kumar$$ $$72$$ $$(94m$$ $$59b$$ $$6x4$$ $$1x6)$$ $$SR:$$ $$122.03$$"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay Kumar to Smith, $$FOUR$$ ,Smith does it, he walks outside off, this is a wide and low full toss, and Smith flicks it behind square leg"}, {"ball": 19.5, "isHighlight": false, "text": "Vinay Kumar to Smith,1 run,moves outside off once more, but Vinay goes short now, and Smith is hurried into his pull, the ball rolls away on off"}, {"ball": 19.6, "isHighlight": false, "text": "Vinay Kumar to Faulkner,2 runs,reaches for a full and wide one and it goes to third man, Faulkner pushes for the second and makes it"}, {"ball": 19.6, "isHighlight": false, "text": "Watson's dismissal in the 16th over potentially robbed RR of a bigger finish but this is a competitive total. This is not an easy pitch, but Gambhir was expecting dew during the chase"}, {"ball": 19.6, "isHighlight": false, "text": "Adib: \"Agree with Rod, which is why I believe Watson needs to open the batting with Rahane as they just haven't had that aggression up front which is pressuring the middle order. Samson can then play at 3, Smith will get more batting time he deserves at 4. Nair who bats in middle order in domestic can come in at 5 if they need consolidation, but if they need power hitting, Binny and Faulker at 5 and 6. \""}], "name": "Kolkata Knight Riders v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729315.html?innings=1;view=commentary", "match_num": 19}