{"commentary": [{"ball": 0, "isHighlight": false, "text": "Bangalore jog out into the field, their captain carrying the ball in his hands. Behind them come Delhi's openers M Vijay and Mayank Agarwal. Mitchell Starc is revving up, with the crowd chanting with the countdown clock"}, {"ball": 0, "isHighlight": false, "text": "$$6.20$$ $$pm$$  We're about 10 minutes away from the start of the match. Aside from the surprising exclusion, Bangalore have also gone for two promising Indian talents in Yuzvendra Chahal and Sachin Rana"}, {"ball": 0, "isHighlight": false, "text": "avi: \"I am sure R Sharma must be most relieved person after hearing that Gayle is not playing\""}, {"ball": 0, "isHighlight": false, "text": "Sumeet Vaidya: \"Elected to chase. Well, what do you expect if Kohli is captain :)\""}, {"ball": 0, "isHighlight": false, "text": "Venkat Sravanth: \"Is Bangalore trying to set an even playing field for Delhi by compensating KP's loss with the dropping of Gayle? Or do they seriously believe that Gayle's not good enough to be in the XI??\" It might be something relating to his fitness. Remember he has a pretty dodgy knee"}, {"ball": 0, "isHighlight": false, "text": "$$Bangalore$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bowl$$ . Nic Maddinson, Mitchell Starc, AB de Villiers and Albie Morkel are the overseas players.  $$No$$ $$Chris$$ $$Gayle$$ $$then$$ , at least from what Virat Kohli said at the toss. The pitch is good and hard, he adds and would be good for the batsmen and he preferred to restrict Delhi and then chase them down."}, {"ball": 0, "isHighlight": false, "text": "Dinesh Karthik who is leading Delhi says Ross Taylor, Jimmy Neesham, Wayne Parnell and JP Duminy are his overseas players and praised the balance of the side."}, {"ball": 0, "isHighlight": false, "text": "$$5.55$$ $$pm$$  Oh, just in case you've not got it down, Dan Vettori still a practicing cricketer in the international arena has swapped his playing jersy for the coach's hat this season. Parthiv Patel calls him \"chilled out\" which really isn't breaking news, is it?"}, {"ball": 0, "isHighlight": false, "text": "Madhushekar : \"I am a Bangalorean how can I support them when they dont have a single player from karnataka. The domestic irani and one day champs. So much for this tournament fostering franchise loyalty. Enjoyed domestic season more\""}, {"ball": 0, "isHighlight": false, "text": "James: \"Any side that can include Gayle, Kohli, AB and Yuvraj in its top and middle order must be in with a chance. The 2 best (on current form) limited overs batsmen in the world. Plus Chris Gayle.\""}, {"ball": 0, "isHighlight": false, "text": "Umm Abeeha: \"Delhi's best chance is to ask Bangalore to bat, try to restrict them to under 150 (hope Duminy bowls to Gayle opening over)and then look to chase it with Duminy, Taylor, De Kock and Indian support cast of Karthik, Tiwary and M Vijay..\""}, {"ball": 0, "isHighlight": false, "text": "$$5.30$$ $$pm$$  We're into the second day and this time the action shifts to Sharjah where Delhi and Bangalore begin to bury the disappointments of the previous season. In apology for such an unimaginative introduction let me plug in Abhishek Purohit's  $$preview$$ as quickly as possible"}, {"ball": 0, "isHighlight": false, "text": "Jose: \"Yesterday, three who are keen to get an entry/re-entry into the India team failed -- Gauti, Yusuf, & Uthappa. Today, another one has to try to prevent a possible exit -- Yuvi. Wish him all the success. For his sake, and for his good friend Kohli's sake. Between the two teams, Bangalore looks stronger in batting (especially with KP not playing for Delhi), and Delhi looks better in bowling. T-20, being a mirage, what looks right need not be, by the time you crawl up to the mirage!\""}, {"ball": 0, "isHighlight": false, "text": "$$CricIQ$$  got off to a blistering start yesterday with, with Philckt topping the daily leaderboard with 3317 points and taking home huge prizes. We are into Day 2 of the season now, and it's another chance to stake your claim at The Greatest Test Ever, and book a seat at Lord's for the India v England Test this summer.  $$Play$$ $$here.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Agarwal,no run,crisply punched into the covers as he leans forward to the fuller delivery angled across him"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Agarwal,1 wide,teases the batsman outside off again but he goes a bit too far there"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Agarwal,2 runs,slices it to deep third man who slaps the ball back into the field of play. Full and slated wide again. Had to reach for it"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Agarwal,no run,strides forward and drills another solid drive into the covers"}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Agarwal,1 run,walks at the bowler as Starc manages a bit of inward dip. Agarwal uses it and flicks through midwicket"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Vijay,no run,dug in short on middle, defended"}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Vijay,no run,some late inward movement again but Vijay negotiates it well with a front foot defensive"}, {"ball": 0.6, "isHighlight": false, "text": "Albie Morkel from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Agarwal,1 run,starts off short and it's pulled to deep midwicket. Seemed a little cramped there which limited his timing a bit"}, {"ball": 1.1, "isHighlight": false, "text": "Vishnu Mohan: \"Seriously, how come Mayank is preferred than Sourabh Tiwary or Kedhar Jadhav?? #stunned\" Cause the other two don't open"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Vijay,no run,fullish and outside off and Morkel even gets a bit of nibble away. Vijay leaves it watchfully"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Vijay,1 run,back of a length and angled in at him, clipped off his thighs to deep square leg"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Agarwal,no run,poor shot selection there. Keeps it back of a length and refuses him any room to free those arms. Agarwal is on the front foot and goes for a flat-batted pull. Hits high on the bat and drops just short of mid-on"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Agarwal,1 run,shortish and outside off, dabbed behind point for a quick single"}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Vijay,no run,fullish and just outside off, strides forward and defends to point. Yuvraj sends in a throw at the non-strikers'"}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Agarwal,1 run,145kph, that's his main threat and he almost had his man. Fullish and curling in rather late. Agarwal had to adjust his shot and block and gets more of an inside edge"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Vijay, $$SIX$$ ,picked away, that's a Vijay special! It was full and on the pads, a very strong area for the opener. Ensured his front foot was not in the way and an effortless whip of the wrists sends the ball beyond the square leg boundary"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Vijay,no run,pulls his length back a bit and directs the ball wider of off stump, Vijay prefers not to play"}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Vijay,1 run,nicely bowled, but Vijay negotiates the inswing well. Clips into the midwicker region for a single"}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Agarwal,no run,shortish and angled across him, Agarwal made room outside leg and looks to carve it over point. Beaten"}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Agarwal, $$OUT$$ ,he seemed a little too generous with that pull shot despite being late on it once before. Starc digs it in and it comes in at an awkward bounce, there is also a bit too much pace on the ball and he splices it to square leg"}, {"ball": 2.6, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Kohli$$ $$b$$ $$Starc$$ $$6$$ $$(14m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Vijay,no run,back of a length on off stump, Vijay covers the line and blocks it"}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Vijay,1 run,too straight and Vijay is comfortable clipping it away to deep square leg"}, {"ball": 3.2, "isHighlight": false, "text": "Dinesh Karthik, the captain, takes guard"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Karthik, $$OUT$$ ,golden duck for the captain! What a ripper from Albie! Gets one to straighten and extracts a bit more bounce as well. All that combine to claim a faint edge as Karthik prodded forward and the keeper did the rest"}, {"ball": 3.3, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$†Patel$$ $$b$$ $$Morkel$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 3.3, "isHighlight": false, "text": "Arjun: \"You know.. the crowd support in UAE got me thinking.. What if every Indian T20 started off with 1-2 weeks in a different off-beat location where cricket can be promoted? For locations that are further away from India, there could be a few days break in between. That way.. we can ensure franchises build teams for all conditions too.\""}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Tiwary,no run,back of a length and outside off, left alone"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Tiwary,1 run,skips down the track as Albie fires at his pads, Tiwary the new batsman, gets an inside edge that wanders into the leg side"}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Vijay,no run,more shape away and Vijay was left groping at it. No foot movement as he hung his bat and the good length ball darts across the outside edge"}, {"ball": 3.6, "isHighlight": false, "text": "Sam Richards: \"yesterday gambhir went for a duck and Kolkata won, so now will Delhi will win today\" Bowling change, Varun Aaron"}, {"ball": 4.1, "isHighlight": false, "text": "Aaron to Tiwary, $$OUT$$ ,what a soft dismissal, caught down the leg side! Kohli high-fives his bowler and Bangalore are jubilant. Tiwary shuffled across to try and glance it fine but the ball, just short of a good length, runs off the face and Parthiv collects another simple catch"}, {"ball": 4.1, "isHighlight": false, "text": "$$MK$$ $$Tiwary$$ $$c$$ $$†Patel$$ $$b$$ $$Aaron$$ $$1$$ $$(4m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 4.1, "isHighlight": false, "text": "JP Duminy has a slip, Aaron around the stumps"}, {"ball": 4.2, "isHighlight": false, "text": "Aaron to Duminy,no run,back of a length and outside off, JP shoulders arms"}, {"ball": 4.3, "isHighlight": false, "text": "Aaron to Duminy,no run,nice little stroke. Covered his stumps and angled the shortish ball outside off to point. Very compact"}, {"ball": 4.4, "isHighlight": false, "text": "Aaron to Duminy,no run,short of a length and outside off, Duminy looks to run it down the third man but doesn't get the requisite amount of bat on it"}, {"ball": 4.5, "isHighlight": false, "text": "Aaron to Duminy,no run,good length and angled in at middle. Turned away to square leg"}, {"ball": 4.5, "isHighlight": false, "text": "Tariq: \"So much for all the hype about reformed Delhi team……looks like same old team with no changes in performance.\""}, {"ball": 4.6, "isHighlight": false, "text": "Aaron to Duminy,no run,that's a  $$wicket-maiden$$ . Aaron digs this is short and gets it to rise around chest-high. Duminy dead bats it into the leg side."}, {"ball": 5.1, "isHighlight": false, "text": "Morkel to Vijay, $$FOUR$$ ,short fine leg makes a mess of it. He had to move to his left a bit but the ball sneaks under his dive. Albie is not pleased as Vijay's flick gets four more than it deserved"}, {"ball": 5.2, "isHighlight": false, "text": "Morkel to Vijay,2 runs,good length ball on off stump, Vijay comes forward and blocks to mid-on. A ricochet off the stumps at the bowler's end fetches an overthrow"}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Vijay,1 run,goes slower, think it was the offcutter. Vijay is wise to it and drops it into the off side for a quick single"}, {"ball": 5.3, "isHighlight": false, "text": "Viral Bhatt: \"Towards the start of this match, few would have expected this out of Bangalore's bowling attack and look what these 3 pacers have done. They've simply annihilated Delhi's back-bone. If they are able to keep the same momentum for rest of the season, Bangalore will be the team to beat, especially when they already have such a formidable batting order. Loads of work needs to be done by Duminy and Taylor in this match though.\""}, {"ball": 5.4, "isHighlight": false, "text": "Morkel to Duminy, $$FOUR$$ ,gorgeous shot! Didn't do much more than present a full face to the overpitched delivery but he had just timed it so well"}, {"ball": 5.4, "isHighlight": false, "text": "$$Allan$$ $$Donald$$ $$the$$ $$bowling$$ $$coach$$ $$for$$ $$Bangalore$$ $$says$$ $$Chris$$ $$Gayle$$ $$has$$ $$a$$ $$bit$$ $$of$$ $$a$$ $$back$$ $$issue$$"}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Duminy,1 run,corrects slides it off the open face to deep third man for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Morkel to Vijay,1 run,fullish and angling in at him, Vijay is forward and flicks away to deep midwikcet"}, {"ball": 5.6, "isHighlight": false, "text": "kailesh: \"@tariq .... its just the first match ... you got to have some patience .. its a new look team and hence it will gain momentum gradually as the tournament progresses .. \""}, {"ball": 6.1, "isHighlight": false, "text": "Aaron to Vijay,no run,shortish on middle and off, Vijay stands up tall and blocks"}, {"ball": 6.2, "isHighlight": false, "text": "Aaron to Vijay,no run,lazy waft outside off and he's beaten again. Aaron goes fishing outside off stump and gets a bit of away swing to bolster his case, but the edge is not forthcoming"}, {"ball": 6.3, "isHighlight": false, "text": "Aaron to Vijay,no run,145kph, that's some excellent aggression from the quick bowler. Saw the batsman backing away and followed him with a bouncer."}, {"ball": 6.4, "isHighlight": false, "text": "Aaron to Vijay,2 wides,back of a length and slanting down the leg side, the glance doesn't connect and the keeper makes a hash of it to allow an extra run in addition to the wide"}, {"ball": 6.4, "isHighlight": false, "text": "Aaron to Duminy,1 wide,short ball angled at leg stump, JP moves across to the off side to pull it down to fine leg but doesn't connect"}, {"ball": 6.4, "isHighlight": false, "text": "Aaron to Duminy,no run,slapped away to point and Yuvi tumbles to his right to halt it in its tracks"}, {"ball": 6.5, "isHighlight": false, "text": "Aaron to Duminy,1 run,this time he slaps it into the gap in the covers, but there is protection in the deep. Shouldn't offer width if he goes back of a length"}, {"ball": 6.6, "isHighlight": false, "text": "Aaron to Vijay,1 run,fires in a yorker just outside off and Vijay guides it to deep third man and we'll have the first strategic time out"}, {"ball": 6.6, "isHighlight": false, "text": "anurag: \"what happened to Aaron :)\" Ten dots in two overs"}, {"ball": 6.6, "isHighlight": false, "text": "Arsalan Ahmed: \"What are Delhi thinking, leaving Taylor to bat at 6? Whatever happened to giving your impact players more time in the middle to get you to a better score?\" Chahal into the attack"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Vijay, $$OUT$$ ,Vijay's beaten and the off stump is knocked back! What a way to debut for your new franchise! It was a rapid legspinner which drifted in on middle and straightens just enough after pitching. Vijay was looking to guide it down to third man again. A lot of bemused looks as they check if it was bowled or stumped or if the keeper disturbed the bails. The third ump is roped in and replays show he is bowled neck and crop"}, {"ball": 7.1, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$b$$ $$Chahal$$ $$18$$ $$(40m$$ $$20b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$90.00$$"}, {"ball": 7.1, "isHighlight": false, "text": "Ross Taylor is the new batsman"}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Taylor,no run,googly to the new batsman and Taylor had no clue. Gets an inside edge onto pad but there was no short leg"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Taylor,no run,more turn for his leggies. It's the kind that is just enough to trouble the batsman. Taylor looks to defend and is beaten"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Taylor,no run,flighted on middle, Taylor plants his bat in front of pad and defends"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Taylor,1 run,thick outside edge that evades the slips. Taylor was bringing a closed defensive face down on the ball and is deceived"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Duminy,no run,nice, tight line on off stump. Duminy is forward and blocks"}, {"ball": 8.1, "isHighlight": false, "text": "Aaron to Taylor,1 run,back of a length and outside off, steered to deep third man"}, {"ball": 8.2, "isHighlight": false, "text": "Aaron to Duminy,no run,presents an angled blade to the back of a length ball outside off. Can't beat point"}, {"ball": 8.2, "isHighlight": false, "text": "back over the wicket now"}, {"ball": 8.3, "isHighlight": false, "text": "Aaron to Duminy,no run,145kph, another terrific bouncer. Duminy is way too late on the hook shot and it was way too high to control it too. Rose to the crest on the helmet, but the top edge falls just short of the onrushing keeper"}, {"ball": 8.4, "isHighlight": false, "text": "Aaron to Duminy,1 run,full and slid across him, driven through to the sweeper"}, {"ball": 8.4, "isHighlight": false, "text": "Senthil Mohan: \"Delhi badly needs Pietersen here. Not just because of this collapse. They have good players. Just need to gain momentum which can be given only by Pietersen. \""}, {"ball": 8.5, "isHighlight": false, "text": "Aaron to Taylor,1 run,taps and runs to point as he rides the bounce on this shortish ball outside off"}, {"ball": 8.5, "isHighlight": false, "text": "Around the wicket again"}, {"ball": 8.6, "isHighlight": false, "text": "Aaron to Duminy,1 run,wide yorker, Duminy nudges into the covers and races off for the single"}, {"ball": 8.6, "isHighlight": false, "text": "Bangalore have taken 50 minutes to complete nine overs"}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Duminy,1 run,tossed up nicely on off stump, he hits it with the turn to deep midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Taylor,1 run,stays back to try and read the turn off the deck and dabs it in front of point for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Duminy,no run,Chahal throws himself to his left and stops the attempted single as Duminy nudged down the ground."}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Duminy,2 runs,comes down the track and looks to whip through the on side, but this is the wrong 'un and he gets a leading edge that just lobs over the bowler. Chahal leaped as high as he could, but he was just not tall enough"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Duminy,4 wides,that stayed so low! Gripped the pitch and turned down the leg side and deceived both the batsman and the keeper"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Taylor,1 run,stays deep in his crease and late cuts it down to deep third man"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Duminy,no run,he was backing away and ended up struggling to reach a googly that was pitched short and spinning wider of him. Can't beat point"}, {"ball": 9.6, "isHighlight": false, "text": "Ashok Dinda now"}, {"ball": 10.1, "isHighlight": false, "text": "Dinda to Taylor,1 run,back of a length and outside off, Taylor is back and punches into the covers to bring up the fifty"}, {"ball": 10.2, "isHighlight": false, "text": "Dinda to Duminy,1 run,pulls the pace off it this time as he attempts an offcutter which he angles across the left-hander. Duminy steers it down to third man"}, {"ball": 10.3, "isHighlight": false, "text": "Dinda to Taylor,1 run,low full toss shaping in at off stump, Taylor was forward and punches to long-off"}, {"ball": 10.4, "isHighlight": false, "text": "Dinda to Duminy,2 runs,digs it in short but it doesn't rise high enough. Duminy is in position for the pull and keeps it down nicely. Deep square leg runs around to his right to cut it off"}, {"ball": 10.5, "isHighlight": false, "text": "Dinda to Duminy,2 runs,full and outside off, Duminy pushes to mid-off who has a shy at the stumps and gives away an overthrow"}, {"ball": 10.6, "isHighlight": false, "text": "Dinda to Duminy,2 runs,picked away off his toes as Dinda search for the blockhole ends up a half-volley. Couple to the left of long-on"}, {"ball": 10.6, "isHighlight": false, "text": "Billybob: \"Delhi batting line up is all wrong. I mean why is Ross Talyor an quality international player coming in at 6 behind Tiwary and Karthik who are not.\""}, {"ball": 11.1, "isHighlight": false, "text": "Chahal to Taylor,1 run,drifts it in on off stump and then snares some lovely turn away from the bat. Taylor opens the face and plays it with soft hands into the covers"}, {"ball": 11.2, "isHighlight": false, "text": "Chahal to Duminy,no run,the wrong 'un dips on him and Duminy who was expecting the leg spinner was looking for a nudge to midwicket and misses"}, {"ball": 11.3, "isHighlight": false, "text": "Chahal to Duminy,1 run,strides down the track and succeeds in getting it to deep midwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Chahal to Taylor,1 run,shortish and outside off, Taylor goes back and cuts to point who misfields and the two batsman hesitate in the middle of the pitch wondering if they should go for the single. By the time the ball is taken control of though, they rush through for the single"}, {"ball": 11.5, "isHighlight": false, "text": "Chahal to Duminy,1 run"}, {"ball": 11.6, "isHighlight": false, "text": "Chahal to Taylor,1 run,flighted on off stump and it skids quite low onto the bat, Taylor pushes to long-off"}, {"ball": 11.6, "isHighlight": false, "text": "Sandeep raghuva: \"Dinda started again from where he left in the last time.. 9 overs in 1st over.. will expect some more expensive overs from him later on!!\""}, {"ball": 12.1, "isHighlight": false, "text": "Dinda to Taylor,1 run,drills the low full toss to the sweeper. He's starting to look comfortable out there"}, {"ball": 12.2, "isHighlight": false, "text": "Dinda to Duminy,1 run,opens the face to slice this full delivery outside off to deep cover"}, {"ball": 12.3, "isHighlight": false, "text": "Dinda to Taylor,1 wide,goes for the wide yorker but he toes outside the marker"}, {"ball": 12.3, "isHighlight": false, "text": "Dinda to Taylor,2 runs,keeps it right up there on off stump, Taylor's forward and drives it through the covers. Starc is very good in the deep as he slides down on it and and throws the ball in one motion"}, {"ball": 12.4, "isHighlight": false, "text": "Dinda to Taylor, $$FOUR$$ ,neatly picked away as Dinda goes off line. It was the slower ball off the back of the hand. Taylor knew fine leg was inside the circle and glances it away"}, {"ball": 12.5, "isHighlight": false, "text": "Dinda to Taylor,1 run,wide yorker draws him forward as he steers it off the open face to the sweeper"}, {"ball": 12.6, "isHighlight": false, "text": "Dinda to Duminy,1 run,full and outside off, Duminy pushes to long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Sagar: \"50% dot balls, not acceptable. Delhi should get back to basics and minimize dots and rotate strike... good bowling by B'lore\""}, {"ball": 12.6, "isHighlight": false, "text": "JP Duminy has become the 40th batsman to score 1000 runs in the tournament. Here's Yuvraj Singh with the ball"}, {"ball": 13.1, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,comes down the track to take advantage of the flight. Meets it on the full and whips it between long-on and deep midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Yuvraj Singh to Taylor,1 run,shortish and outside off, he rocks back and cuts to deep point"}, {"ball": 13.3, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,quicker and flatter on off stump, he goes back and punches to long-on"}, {"ball": 13.4, "isHighlight": false, "text": "Yuvraj Singh to Taylor,1 run,loads of flight on this as Taylor lashes to the sweeper"}, {"ball": 13.5, "isHighlight": false, "text": "Yuvraj Singh to Duminy,no run,stays a bit low as he tosses it up outside off. Goes on with the arm as JP bottom edges it"}, {"ball": 13.6, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,flighted on middle, Duminy pushes it down the ground to long-on. That's the second and final strategic time out of the innings"}, {"ball": 14.1, "isHighlight": false, "text": "Chahal to Duminy,1 run,googly to start and this time Duminy is aware of it, goes back and punches it down to long-off"}, {"ball": 14.2, "isHighlight": false, "text": "Chahal to Taylor,1 run,such lovely drift he's getting. Sneaks in towards leg stump but it gets some turn after pitching and takes the outside edge towards point"}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to Duminy,1 run,rocks back and cuts to deep point"}, {"ball": 14.4, "isHighlight": false, "text": "Chahal to Taylor,no run,this almost turned square! Loads of flight just outside off and lured the batsman into pushing at it. Gripped the deck and spun well past the outside edge"}, {"ball": 14.5, "isHighlight": false, "text": "Chahal to Taylor,no run,that could have been close! It was a shorter ball and he looked to dab it in front of point for a quick single. Kohli swoops on the ball and sends in the throw in one motion. Rosco has to pull out a full-length dive as well and it saves him, just about"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Taylor,no run,goes for the late cut, but still can't beat Kohli"}, {"ball": 15.1, "isHighlight": false, "text": "Yuvraj Singh to Duminy, $$SIX$$ ,peppers the sightscreen after skipping down the track. Yuvi fires in a flatter ball but he get under the ball and muscled it over the top"}, {"ball": 15.2, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,shortish and darted in on off stump, he shuffles across and works it wide of where mid-on would have been. Yuvi himself rushes after it"}, {"ball": 15.3, "isHighlight": false, "text": "Yuvraj Singh to Taylor,1 run,he's concentrating on a quicker pace now after that six. Taylor stays back and cuts behind point."}, {"ball": 15.4, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,punched down the ground to long-on where AB is lurking. No double there"}, {"ball": 15.5, "isHighlight": false, "text": "Yuvraj Singh to Taylor,1 run,this time there was flight available, but Taylor is not quite comfortable against the slower bowlers. Misses out as his swipe can only reach deep midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,shortish ball outside off, pulled to deep midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Mitchell Starc comes back"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to Duminy,1 no ball,pulls out the scoop, but it wasn't the right ball for it. Leg-stump yorker that wanders through to the keeper. Oh, but wait, he has overstepped!"}, {"ball": 16.1, "isHighlight": false, "text": "$$Free$$ $$hit$$ $$ball$$"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to Duminy,1 run,slower short ball and Duminy was just a little too exuberant. Mistimes the pull and finds deep square leg"}, {"ball": 16.1, "isHighlight": false, "text": "Around the wicket"}, {"ball": 16.2, "isHighlight": false, "text": "Starc to Taylor,2 runs,excellent work from Dinda at the third man boundary! Short and wide outside off as he threw his bat at it. Gets a thick outside edge that seemed set for four, but he hunted it down well"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to Taylor,1 run,sets himself up well outside off and Starc bowls it full and further wide, slices it away to deep point"}, {"ball": 16.3, "isHighlight": false, "text": "zaheer: \"Chahal record has been if not excellent then very good so far in T20s, 20 wkts in 28 odd matches and most imp. having an economy under 6 is brilliant.\""}, {"ball": 16.4, "isHighlight": false, "text": "Starc to Duminy,2 runs,fires it in full on middle stump as Duminy clears his front leg and squeezes it out to the right of deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to Duminy,1 run,low full toss on leg stump, swung away to deep square leg"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Taylor,no run,has a giant smile on his face after executing the perfect wide yorker to keep Taylor quiet"}, {"ball": 16.6, "isHighlight": false, "text": "NAUGHTY BLOOM: \"With Neesham and Parnel yet to come, Delhi can definitely look to put a fighting total on board.. I can smell 140-45 on the board!!\""}, {"ball": 17.1, "isHighlight": false, "text": "Dinda to Duminy,2 runs,full on off stump, drilled past Virat at mid-off but he hares after it and keeps it to a couple"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Duminy, $$SIX$$ ,misses the mark with his length and Duminy gets under it and smacks it beyond the long-off boundary. So clean"}, {"ball": 17.3, "isHighlight": false, "text": "Dinda to Duminy, $$FOUR$$ ,cleared his front leg away to whip the fuller delivery on leg stump away to the square leg boundary. Such quick hands and that's his fifty as well"}, {"ball": 17.4, "isHighlight": false, "text": "Dinda to Duminy,1 run,switches to a slower pace as he goes for the offcutter outside off, Duminy goes back and cuts to deep point"}, {"ball": 17.5, "isHighlight": false, "text": "Dinda to Taylor,no run,that's better. He gets his yorker right and it's quick enough to beat Taylor's lash outside off stump"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda to Taylor,1 run,goes for the slower ball and it ends up a low full toss, Taylor steers it to deep point"}, {"ball": 18.1, "isHighlight": false, "text": "Starc to Taylor,no run,heaves down the wrong line and misses out on a length delivery. Starc better be a lot fuller or a lot shorter than that"}, {"ball": 18.2, "isHighlight": false, "text": "Starc to Taylor, $$FOUR$$ ,blindly swings again and this time he gets the benefit of a thick outside edge that scurries away to the third man boundary. That was the offcutter and it did deceive the batsman"}, {"ball": 18.3, "isHighlight": false, "text": "Starc to Taylor,no run,knows Taylor was setting up for the fuller ball and gives him a short one. Isn't able to adjust and misses on the pull shot. Kicks the turf in disgust"}, {"ball": 18.4, "isHighlight": false, "text": "Starc to Taylor, $$FOUR$$ ,another slower ball as he rolls his fingers down the side of the ball. Taylor plants his front foot down the line and goes for that big golf swing again. Another outside edge, another third man boundary. Starc throws his head back"}, {"ball": 18.5, "isHighlight": false, "text": "Starc to Taylor,1 run,swiped away into the leg side as this is fullish on middle and leg"}, {"ball": 18.6, "isHighlight": false, "text": "Starc to Duminy, $$FOUR$$ ,there were two before it but this is the first one off the middle. Clears his front leg to lash a fullish delivery over the head of Kohli at mid-off"}, {"ball": 19.1, "isHighlight": false, "text": "Dinda to Taylor, $$FOUR$$ ,starts off with a full toss that is way too wide to become anything but a boundary through point. Taylor had to reach for it but he did manage to connect it well enough to beat the boundary rider"}, {"ball": 19.2, "isHighlight": false, "text": "Dinda to Taylor,2 runs,full and outside off again as Taylor lashes it right through Yuvi at backward point. But third man mops up"}, {"ball": 19.3, "isHighlight": false, "text": "Dinda to Taylor,no run,he's disgusted with himself after missing out on that. Smacks his pad with the bat as this full length ball that was asking to be smashed out of the ground ends up not even getting an edge"}, {"ball": 19.4, "isHighlight": false, "text": "Dinda to Taylor,1 run,wide yorker drilled down the ground to bring up the hundred partnership"}, {"ball": 19.5, "isHighlight": false, "text": "Dinda to Duminy, $$SIX$$ ,mauled into the crowd behind deep midwicket! It was the slower ball and he'd picked it early and though the bat turned in his hands, it sailed past the ropes"}, {"ball": 19.6, "isHighlight": false, "text": "Dinda to Duminy, $$FOUR$$ ,deep midwicket has a chance this time but Maddinson has rushed in too much and makes a mess of what should have been a simple catch. Low full toss on middle and Duminy hoicked it off the front foot and gets a boundary for his trouble"}, {"ball": 19.6, "isHighlight": false, "text": "$$8.15$$ $$pm$$  It was all Bangalore in the first six-seven overs but Delhi hung in there and exploded in the final overs. JP Duminy provided the momentum and his 67 off 48 has set up a \"competitive total\" according to him. There were a couple of gaffes in the field in the final two overs and Ashok Dinda leaked over 50 in his spell"}, {"ball": 19.6, "isHighlight": false, "text": "\"Unfortunate to lose as many wickets at the top,\" says Duminy, \"After 10 overs we knew we can get around to 140. Definitely competitive. It's a two-paced pitch, new ball had variable bounce. First six overs is key. Hopefully I can make a dent too\""}, {"ball": 19.6, "isHighlight": false, "text": "\"They got away from us a bit in the last four overs,\" Albie Morkel said. \"It's a bit slow and it's tough to play aggressive shots. [Strong top six but] We're gonna have to bat well. We still have to get those runs, swing with the new ball and if we can get through that and build a foundation.\""}, {"ball": 19.6, "isHighlight": false, "text": "greecedevil: \"and that's half centuries for Duminy and Dinda!!! Kohli will not be a good captain. Aaron and Albie did not finish their quotas even when they are much better than Dinda.\""}], "name": "Delhi Daredevils v Royal Challengers Bangalore", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729281.html?innings=1;view=commentary", "match_num": 2}