{"commentary": [{"ball": 0, "isHighlight": false, "text": "Here come Banglaore's openers. Parthiv Patel and Nic Maddinson, sporting a Draco Malfoy hairstyle."}, {"ball": 0, "isHighlight": false, "text": "JP Duminy to bowl, getting the ball to spin away to the left-handers"}, {"ball": 0.1, "isHighlight": false, "text": "Duminy to Patel,no run,length ball is pushed back towards the bowler"}, {"ball": 0.2, "isHighlight": false, "text": "Duminy to Patel,no run,looking to push this towards mid-on, misses and is hit on the pads, that was sliding down"}, {"ball": 0.3, "isHighlight": false, "text": "Duminy to Patel,no run,pushed towards cover this time"}, {"ball": 0.4, "isHighlight": false, "text": "Duminy to Patel,1 run,first run for Bangalore, steered towards cover"}, {"ball": 0.5, "isHighlight": false, "text": "Duminy to Maddinson, $$FOUR$$ ,Maddinson has a reputation for being a hitter, he starts off his innings by skipping down and launching the ball over the off side, in front of point  for four"}, {"ball": 0.6, "isHighlight": false, "text": "Duminy to Maddinson,no run,blocked off the back foot towards point"}, {"ball": 0.6, "isHighlight": false, "text": "Ashok Dinda not the most popular man among Cricinfo readers at the moment."}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Patel,1 run,short of length ball from Shami, nurdles the ball towards square leg for a single"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Maddinson,no run,cramps up Maddinson, back of length once more, Maddinson squirts that away to the leg side"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Maddinson,no run,beaten outside off, great line there, bounce as well as he drops it a touch shorter"}, {"ball": 1.3, "isHighlight": false, "text": "Idrees Kanchwal: \"Dinda clearly must be getting more tweets now than even kohli \""}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Maddinson,no run,again not given much room for Maddinson, following him on legstump, defended"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Maddinson, $$OUT$$ ,there's the first wicket for Delhi, a shortish ball down the leg side, wasn't the most threatening delivery, Maddinson wanted to pull that away, can only glove it away, easy catch for the keeper"}, {"ball": 1.5, "isHighlight": false, "text": "$$NJ$$ $$Maddinson$$ $$c$$ $$†Karthik$$ $$b$$ $$Mohammed$$ $$Shami$$ $$4$$ $$(6m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 1.5, "isHighlight": false, "text": "Here's Kohli"}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Kohli, $$FOUR$$ ,great effort from the keeper Karthik there, flinging himself to his left to nearly grab that one off Kohli, who just glanced that leg-side delivery"}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Patel,no run,short of length ball outside off, defended towards point"}, {"ball": 2.2, "isHighlight": false, "text": "Parnell to Patel,2 runs,drops it shorter, defended for a single, and there is amisfield as there's some awkward bounce for Mayank Agarwal"}, {"ball": 2.3, "isHighlight": false, "text": "Parnell to Patel, $$FOUR$$ ,this is a shot Parthiv plays well, the ball is dropped short by Parnell, Parthiv is quickly onto it, pulling it away in front of midwicket for four"}, {"ball": 2.4, "isHighlight": false, "text": "Parnell to Patel,no run,Parthiv defends this one"}, {"ball": 2.5, "isHighlight": false, "text": "Parnell to Patel,no run,a yorker from Parnell, 140.4kph, Parthiv gets his bat down in time to keep that one out"}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Patel,1 run,this time the pull doesn't quite work, a bottom edge onto the body as he throws his bat at that one"}, {"ball": 3.1, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,140kph, just too much pace. Angles a bouncer across him and Parthiv looks to drag it into the leg side with a pull. Comfortably beaten"}, {"ball": 3.2, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,his shot selection is better this time but Shami manages a bit of seam away from this back of a length delivery and beats him again"}, {"ball": 3.3, "isHighlight": false, "text": "Mohammed Shami to Patel,1 wide,I though that hit the thigh pad but the umpire reckons there was no contact. Back of a length down the leg side. He goes for the flick and has no success connecting"}, {"ball": 3.3, "isHighlight": false, "text": "Mohammed Shami to Patel,2 runs,this one doesn't rise and Parthiv latches onto a pull to deep midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Abhishek Jayswa: \"Not popular?? Dinda is favorite bowler of all Delhi supporters.\""}, {"ball": 3.4, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,139kph, another terrific bouncer! Parthiv continues taking it his hook shot had no chance of connecting. Little question asked but he hadn't touched that"}, {"ball": 3.5, "isHighlight": false, "text": "Mohammed Shami to Patel, $$FOUR$$ ,what a response! Charges him and pummels the fuller delivery to the long-on boundary."}, {"ball": 3.6, "isHighlight": false, "text": "Mohammed Shami to Patel, $$FOUR$$ ,goes down again and it made an awkward clink as it struck the bat on the splice. Just about clears a back-pedaling mid-off and scurries away"}, {"ball": 4.1, "isHighlight": false, "text": "Parnell to Kohli,no run,fullish and around the off stump, defended off the front foot"}, {"ball": 4.1, "isHighlight": false, "text": "slip in place for Kohli"}, {"ball": 4.2, "isHighlight": false, "text": "Parnell to Kohli,no run,gets back in line with the shortish ball and flicks to midwicket"}, {"ball": 4.3, "isHighlight": false, "text": "Parnell to Kohli,no run,hint of seam away and Kohli has to check his back-foot punch into the covers"}, {"ball": 4.4, "isHighlight": false, "text": "Parnell to Kohli, $$FOUR$$ ,full and angled across him, Kohli swings from the crease and gets a thick outside edge that flies away to the third man boundary, despite Rahul Sharma's tumbling effort"}, {"ball": 4.5, "isHighlight": false, "text": "Parnell to Kohli,1 run,143kph, shortish and angled across him, Kohli looks to steer it down to third man but bottom edges it. The non-striker sees the ball going into a gap behind the wickets and rushes up for a single"}, {"ball": 4.6, "isHighlight": false, "text": "Parnell to Patel, $$FOUR$$ ,spots the batsman charging and digs it in short, but makes the mistake of bowling wide. Parthiv slaps it over point. Thumping boundary"}, {"ball": 4.6, "isHighlight": false, "text": "Shahbaz Nadeem is into the attack, with the beginnings of a Hashim Amla beard"}, {"ball": 4.6, "isHighlight": false, "text": "anshu: \"Patel has habit of getting out on leg spinner often trying big shots, Rahul Sharma has good chance against him and Kohli too as pitch is double paced\""}, {"ball": 5.1, "isHighlight": false, "text": "Nadeem to Kohli,1 run,flat delivery to start off and Kohli stays on the back foot and pushes to long-off"}, {"ball": 5.2, "isHighlight": false, "text": "Nadeem to Patel, $$SIX$$ ,bowls a terrible long hop and Parthiv shuffles across and mauls it miles into the square leg boundary. Kohli enjoyed that. Smacked it out of the ground and we need a new ball"}, {"ball": 5.3, "isHighlight": false, "text": "Nadeem to Patel,no run,he was moving outside off again and Nadeem follows him with a fuller delivery. The slash doesn't beat point"}, {"ball": 5.4, "isHighlight": false, "text": "Nadeem to Patel, $$FOUR$$ ,pulls out the sweep and it's timed extremely well. He's not bothered with keeping the ball down and why should he when he hits it in the gap"}, {"ball": 5.5, "isHighlight": false, "text": "Nadeem to Patel,1 run,pushed through on off stump as Parthiv taps it into the covers and goes to the other end"}, {"ball": 5.6, "isHighlight": false, "text": "Nadeem to Kohli,1 run,flighted on off stump, Kohli calmly pushes it to long-on to raise his team's fifty. That's also the strategic time-out"}, {"ball": 5.6, "isHighlight": false, "text": "Inu Mhase: \"I wanted to see Gayle and Patel opening the batting today.. Interesting to see how the 2 guys with exactly opposite postures looks at the crease.. Would Patel be visible??\" Here's Duminy from around the stumps"}, {"ball": 6.1, "isHighlight": false, "text": "Duminy to Kohli,no run,goes on with the arm as Kohli taps it to backward point"}, {"ball": 6.2, "isHighlight": false, "text": "Duminy to Kohli,no run,shimmies down the pitch but he pulls the length back and Kohli can only nudge it to square leg"}, {"ball": 6.2, "isHighlight": false, "text": "Yuvi's waiting under the helmet"}, {"ball": 6.3, "isHighlight": false, "text": "Duminy to Kohli,2 runs,a little too straight with a good length ball and Kohli clips it away to long leg"}, {"ball": 6.4, "isHighlight": false, "text": "Duminy to Kohli,1 run,flatter delivery on middle and off, Kohli's wrists though work the ball to deep square leg"}, {"ball": 6.5, "isHighlight": false, "text": "Duminy to Patel,1 run,judges the ball to be short and he waits on the back foot before whipping it down to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Kohli,1 run,punched to the right of long-on as they milk the offspinner"}, {"ball": 7.1, "isHighlight": false, "text": "Nadeem to Kohli,no run,flights outside off and gets a bit of turn off this deck. Kohli is lured into poking at it and it goes down to point"}, {"ball": 7.2, "isHighlight": false, "text": "Nadeem to Kohli,no run,comes down the track and thumps it into the covers"}, {"ball": 7.3, "isHighlight": false, "text": "Nadeem to Kohli,2 runs,skids in with the arm, but it had started short and Kohli slaps it away to the sweeper"}, {"ball": 7.4, "isHighlight": false, "text": "Nadeem to Kohli,1 run,flighted on middle but he had come down the track and made room for himself to drive to long-off"}, {"ball": 7.4, "isHighlight": false, "text": "rahul: \"@Inu Mhase: Haven't you seen Patel and Hayden batted together when opening together for Chennai:)\""}, {"ball": 7.5, "isHighlight": false, "text": "Nadeem to Patel,no run,clears his front leg to chop this short ball on middle into the covers"}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem to Patel,1 wide,terrible delivery as he bowls it flat and well down the leg side. Parthiv looks to help it away, but doesn't succeed"}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem to Patel,1 run,he almost falls over in his attempt to make room. So much effort into his shots and it only ends up a single to long-off as he flat-bats the short ball"}, {"ball": 7.6, "isHighlight": false, "text": "Rahul Sharma's legspinners now"}, {"ball": 8.1, "isHighlight": false, "text": "Sharma to Patel,no run,goes for a big appeal as he sweeps across the line of a good length ball. But the impact was outside off"}, {"ball": 8.2, "isHighlight": false, "text": "Sharma to Patel,1 run"}, {"ball": 8.3, "isHighlight": false, "text": "Sharma to Kohli,no run,tossed up on off stump, Kohli lunges forward and blocks into the covers"}, {"ball": 8.4, "isHighlight": false, "text": "Sharma to Kohli,1 run,makes room outside leg as he advances and drills the shortish ball through the covers"}, {"ball": 8.5, "isHighlight": false, "text": "Sharma to Patel, $$OUT$$ ,races blindly down the track and goes for a hack across the line. The ball, a simple one on a good length, sneaks between bat and pad and rattles into off stump"}, {"ball": 8.5, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$b$$ $$Sharma$$ $$37$$ $$(39m$$ $$28b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$132.14$$"}, {"ball": 8.5, "isHighlight": false, "text": "It's Yuvi and Kohli at the crease again"}, {"ball": 8.6, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,gets a bit of turn as he pushes the batsman back in his crease. Flicked to long leg"}, {"ball": 8.6, "isHighlight": false, "text": "Harish: \"Patel has been doing the same thing ever since he played for India when he was 17 . Hit few great shots , get into the twenties or thirties , get out . That's why he has'nt lived that much in our hearts neither in the team . \""}, {"ball": 8.6, "isHighlight": false, "text": "Pace against Yuvi, Shami's back"}, {"ball": 9.1, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,no run,predictably its the short ball on middle and off stump. Yuvi has to jump off his feet and drop it at his feet with soft hands"}, {"ball": 9.2, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 wide,short delivery that is just a shade down the leg side. That's rather harsh as the ball sailed over his hips as he was a little cramped up while playing the pull"}, {"ball": 9.2, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh, $$FOUR$$ ,that was a snorter of a bouncer. The eyes came off the ball and he was mostly taking evasive action when the bat sort or jutted out and the top edge was taken to run away to the boundary at long leg"}, {"ball": 9.3, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,no run,goes fullish on leg stump and Yuvi is rooted to the crease as he blocks"}, {"ball": 9.4, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 run,stands and hoicks and the bat turns in his hands and he skies the ball over the slips. Taylor ran back but couldn't get under it"}, {"ball": 9.5, "isHighlight": false, "text": "Mohammed Shami to Kohli,no run,rock-solid forward defensive from Kohli at the other end"}, {"ball": 9.6, "isHighlight": false, "text": "Mohammed Shami to Kohli,no run,fullish on off stump, he goes forward and blocks into the covers. Searches for the single to keep strike but Yuvi says no"}, {"ball": 10.1, "isHighlight": false, "text": "Sharma to Yuvraj Singh, $$SIX$$ ,away she goes. Flat, hard and just over the ropes. Sharma flighted it on leg stump and he swung for the fences"}, {"ball": 10.2, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,blazed down the ground! Another one that's flighted on off stump and it was struck with considerable disdain. Vijay had to pull out a top effort to stop that. Kohli was in trouble of being beheaded there"}, {"ball": 10.3, "isHighlight": false, "text": "Sharma to Kohli,1 run,full toss on off stump, Kohli flicks to deep midwicket. Took the toe end there"}, {"ball": 10.4, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,strides down the wicket to block the flighted delivery that is pushed across him"}, {"ball": 10.5, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,charges him again and he yorks himself. Jams the bat down on the ball and collects a single to point"}, {"ball": 10.6, "isHighlight": false, "text": "Sharma to Kohli,1 run,tapped away through the covers. Sharma tries to toss this up outside Kohli's reach as he was advancing but it was easily controlled"}, {"ball": 10.6, "isHighlight": false, "text": "Jimmy Neesham takes over from Shami"}, {"ball": 11.1, "isHighlight": false, "text": "Neesham to Kohli,1 run,skips down the track and thumps it down to long-off. The bat turns in his hands, Kohli's timing hasn't been all that impressive in this innings"}, {"ball": 11.1, "isHighlight": false, "text": "Yuvraj is surveying the field. Deep backwards square leg and Long-off are back"}, {"ball": 11.2, "isHighlight": false, "text": "Neesham to Yuvraj Singh,no run,looks to ramp it to third man as he waits for the short ball, but does it a second longer. Not pleased with himself"}, {"ball": 11.3, "isHighlight": false, "text": "Neesham to Yuvraj Singh, $$FOUR$$ ,that sat up for Yuvi and he's walloped it to the square leg boundary. Neesh bowls waist-high short ball and it was the slower one as well. Comfortably dispatched. The ball seems to have caught the cables of the spider-cam and usually it provides grounds for a dead ball, but the umpires give a little leeway"}, {"ball": 11.4, "isHighlight": false, "text": "Neesham to Yuvraj Singh,no run,comes down the track and carves a full and wide delivery to point"}, {"ball": 11.5, "isHighlight": false, "text": "Neesham to Yuvraj Singh,1 run,another back of the hand slower ball which Yuvi steers behind point and Kohli scurries through for a quick single"}, {"ball": 11.6, "isHighlight": false, "text": "Neesham to Kohli,1 run,big ol full toss and Kohli has calmly slapped it away to the sweeper"}, {"ball": 11.6, "isHighlight": false, "text": "Rajat: \"Yuvi is best when he is trying to behead the partner at other end. Hopefully I don't jinx him :)\" He seems to be getting that swing back, yes. Except Shami's pace troubled him big time. Anyway, it's Wayne Parnell now"}, {"ball": 12.1, "isHighlight": false, "text": "Parnell to Kohli,1 run,that's a dolly and he's  $$dropped$$  it at short fine leg! Neesham, what have you done?! Clipped uppishly but straight to the man, at abound waist high and at a very comfortable pace coming at him. But it pops in and then pops out"}, {"ball": 12.2, "isHighlight": false, "text": "Parnell to Yuvraj Singh,no run,stays back to steer the good length ball behind point"}, {"ball": 12.3, "isHighlight": false, "text": "Parnell to Yuvraj Singh,no run"}, {"ball": 12.4, "isHighlight": false, "text": "Parnell to Yuvraj Singh,1 run,bit of room on offer and he essays a late cut to find deep third man"}, {"ball": 12.4, "isHighlight": false, "text": "Amit: \"Surely Shami had to stay on there and try to finish Yuvraj off. Karthik can't afford to take this down to the last over - not enough runs to play with.\""}, {"ball": 12.5, "isHighlight": false, "text": "Parnell to Kohli,no run,skips down the track but the ball seems to stop on the pitch before reaching him. Gets hit high on the bat as he pushes into the covers. Fell not too far away from the fielder either"}, {"ball": 12.6, "isHighlight": false, "text": "Parnell to Kohli,1 run,another  $$drop$$  and it's Agarwal in the square boundary on the off side. Raced down the track and slapped a short ball hard and flat. the fielder had to run in and come forward but he spills it"}, {"ball": 13.1, "isHighlight": false, "text": "Neesham to Kohli, $$SIX$$ ,do not drop me, says Kohli with a punishing six over extra cover. Overpitched outside off and he waded into the shot and timed it perfectly"}, {"ball": 13.2, "isHighlight": false, "text": "Neesham to Kohli,1 run,whipped away into the leg side as those strong wrists take over"}, {"ball": 13.3, "isHighlight": false, "text": "Neesham to Yuvraj Singh,1 run,waist-high full toss and Yuvi swipes it away to deep square leg"}, {"ball": 13.4, "isHighlight": false, "text": "Neesham to Kohli,no run,outside edge off the slower ball outside off. Tries to steer it down to third man but it bounces short of the keeper"}, {"ball": 13.4, "isHighlight": false, "text": "Salman1508: \"Is Kohli trying to be Yuvi here? \""}, {"ball": 13.5, "isHighlight": false, "text": "Neesham to Kohli,1 run,full on off stump, Kohli drills it down to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Neesham to Yuvraj Singh, $$SIX$$ ,fullish and outside leg stump and Yuvi's helped it on its way. Lands among the Bangalore players in the dug out and he has a big smile on his face while punching gloves with his captain"}, {"ball": 13.6, "isHighlight": false, "text": "Rahul Sharma's back"}, {"ball": 14.1, "isHighlight": false, "text": "Sharma to Kohli, $$SIX$$ ,and he's sent packing over long-on. Races down and gets to the pitch. Doesn't bother about how it's going to turn and just launches it into the night sky"}, {"ball": 14.2, "isHighlight": false, "text": "Sharma to Kohli, $$SIX$$ ,this one is hit with the turn and he's raises the fifty partnership with a glorious shot over extra cover. Didn't get to the pitch as much as the last ball and had to sort of reach for it, but his timing was still top-notch"}, {"ball": 14.3, "isHighlight": false, "text": "Sharma to Kohli,1 run,stays back as he knows this will be flatter and clips it to deep midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Sharma to Yuvraj Singh, $$SIX$$ ,drags it short as he fears Yuvi's trip down the track. But it was such a long hop that he has time to pull it to the long leg boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,backs away to the flatter ball outside off and chops it to cover"}, {"ball": 14.6, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,short again but this was just a touch quicker and Yuvi pulls to long-on. That is now the strategic time out"}, {"ball": 14.6, "isHighlight": false, "text": "Harshal: \"@Salman. Maybe, but even when Kohli's not in good nick, he's still going at better than a run a ball.\""}, {"ball": 14.6, "isHighlight": false, "text": "Jude: \"In the space of 2 overs RR came down from 8.1 to 4.4. Remarkable effort and game lost the balance well behind\" Prompts Shami to come back into the attack"}, {"ball": 15.1, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 run,slower ball outside off, Yuvi waits for it and thumps it to deep cover"}, {"ball": 15.2, "isHighlight": false, "text": "Mohammed Shami to Kohli,1 run,overpitched outside off, Kohli's flashing blade gives work for the sweeper"}, {"ball": 15.3, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,no run,slower short ball and he's deceived Yuvi. Set up for the pull shot and then realises it was not coming on and just lets it through to the keeper"}, {"ball": 15.4, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,no run,spears it in on middle and he was looking to clip to midwicket. Gets a leading edge to point. Squared Yuvi up there. Shami's been brilliant today"}, {"ball": 15.5, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,no run,another slower bouncer and though Yuvi goes through with the shot this time he has trouble connecting"}, {"ball": 15.6, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh, $$SIX$$ ,long-on watches it clear his head and thud into the advertising boards. Pitches it up in his arc and Yuvi's big back lift comes down in a thunderous swing"}, {"ball": 15.6, "isHighlight": false, "text": "sree: \"Karthik has a lot to learn as captain. When you have Kohli and Yuvi batting with 58 needed off 45 balls, you go for wickets, not for economy. economy doesn't work on these guys!\""}, {"ball": 16.1, "isHighlight": false, "text": "Nadeem to Kohli,1 run,low full toss to start his spell and Kohli drives to long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Nadeem to Yuvraj Singh, $$SIX$$ ,terrible line from Nadeem. On the pads and he's swept him miles into the boundary behind square leg. Yuvi against this kind of spin is no contest at all."}, {"ball": 16.3, "isHighlight": false, "text": "Nadeem to Yuvraj Singh,(no ball)  $$FOUR$$ ,that's a full toss over the waist and he has pulled it over short find leg to take him to his fifty on Bangalore debut"}, {"ball": 16.3, "isHighlight": false, "text": "Nadeem to Yuvraj Singh,1 run,flighted on off stump, he lunges forward to block and picks up a single square on the off side"}, {"ball": 16.4, "isHighlight": false, "text": "Nadeem to Kohli,1 run,races down the track and lofts it down towards long-on. Falls short of Vijay who was diving forward. They pick up the runs needed to pick up the victory and a very comprehensive one at that"}, {"ball": 16.4, "isHighlight": false, "text": "That's this game done and dusted. Tomorrow is a double header, so join us at 4 pm as the caravan continues gathering momentum. This is Alagappan Muthu, happy to type my last word tonight"}, {"ball": 16.4, "isHighlight": false, "text": "$$Yuzvendra$$ $$Chahal$$ $$is$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Its my second match in the IPL, I played one for Mumbai. I got confidence seeing the first ball turn. It is great to have the support of the captain Kohli, choosing me as the spinner over a player like Murali in the squad\""}, {"ball": 16.4, "isHighlight": false, "text": "\"That's what I was telling Yuvi in the middle, if those were mis-hits they wouldn't have gone to hand\" Virat Kohli says. \"It was a 170-plus track and to hold them down to 145 was big. Chahal did extremely well, Varun as well and Mitch too. [Yuvraj]He's won us two world cups, he's a proven match-winner and it's important to back a player like that.\""}, {"ball": 16.4, "isHighlight": false, "text": "\"Didn't bat well enough though Taylor and Duminy had a great partnership,\" says  $$Dinesh$$ $$Karthik$$ , the stand-in captain for Delhi. \"They batted well, kept playing their shots, came off, bad fielding. It looks like that when the opponent is hammering you. It's the first game of the season and we're getting used to who performs which role and it's important for us to learn and come back in the next game. Duminy absorbed the pressure brilliantly and hit some lusty blows at the end\""}, {"ball": 16.4, "isHighlight": false, "text": "\"About 90% runs of Yuvi came off bad deliveries today. I missed those sweet cover drives and classy late cuts off good deliveries that find the boundary more often than not.\" Those might not be too far off, Sahil"}, {"ball": 16.4, "isHighlight": false, "text": "$$9.45$$ $$pm$$  Kohli jumps on Yuvi as they walk back to the pavilion savouring a job well done. Their bowlers set things up by blasting out the Delhi top order. They stuck in there when Duminy and Taylor were building that partnership and in the chase Yuvraj Singh found form with 52 off 29. He was treated to some terrible bowling and he took complete advantage"}], "name": "Delhi Daredevils v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729281.html?innings=2;view=commentary", "match_num": 2}