{"commentary": [{"ball": 0, "isHighlight": false, "text": "Zaheer to Finch"}, {"ball": 0, "isHighlight": false, "text": "That was a good observation by Omprakash below."}, {"ball": 0, "isHighlight": false, "text": "OMPRAKASH KHOJA: \"Dunk,Rayudu,Gautam,Tare,Rahul & Ojha total six wicketkeepers in a match!! have you ever seen it before...???\""}, {"ball": 0, "isHighlight": false, "text": "Govin: \"Now Hussey is also added to the growing number of legend support staffs for mumbai indians.\""}, {"ball": 0, "isHighlight": false, "text": "Harish: \"All IPL teams have given chances to the players who have done well in domestic except MI and SRH. SRH have Juneja,Naman Ojha, Parvez Rasool and MI have Jalaj Saxena,Marathe all done well in domestic cricket. Give chances to them.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$ : Mumbai have won the toss and they are  $$bowling$$ $$first.$$  Only one change announced by Rohit - Ben Dunk comes in for Michael Hussey."}, {"ball": 0, "isHighlight": false, "text": "Two changes for Sunrisers. Irfan Pathan and Naman Ojha come in. We don't know yet who they have replaced. The two line-ups should be up shortly."}, {"ball": 0, "isHighlight": false, "text": "Prajyot: \"We just definitely need someone like Ben Dunk to open up with Tare as they can be the big hitter and Tare can also do well with some shift of gears then we need RO to get going along with Corey and Polly who both have found some kind of form...Hope ....I am not jinxing but today....I get a feel they are gonna make some big runs..:)\""}, {"ball": 0, "isHighlight": false, "text": "SV: \"The key for sunrisers is Darren Sammy. He had single handedly won games for windies in the world t20 .Sunrisers have a strong top order and if sammy plays the role of a good finisher sunrisers batting becomes formidable .Also his performance as the 5th bowler provides stability to their strong bowling lineup. \""}, {"ball": 0, "isHighlight": false, "text": "Good day everyone and welcome to match #20 of IPL 2014, and the final one in the UAE before the teams move to India. Can Mumbai Indians leave the UAE with a win? You sometimes wonder if the players swapped places with the coaching staff, they might win something."}, {"ball": 0, "isHighlight": false, "text": "Sunrisers Hyderabad haven't had the best of it either. Their middle order is the weaklink. Are they missing someone like S Badrinath?  $$Read$$ $$this$$ . Also read the  $$preview$$ ."}, {"ball": 0, "isHighlight": false, "text": "Suraj_Nepal: \"Mumbai Indians have not lost 5 successive matches in any editon of IPL. So, they are not gonna lose today.\""}, {"ball": 0, "isHighlight": false, "text": "Shivani: \"David Warner would be looking forward to do as good as his county opening partner Chris rogers. We want fireworks David!\""}, {"ball": 0, "isHighlight": false, "text": "Three to win of 1 ball. And Steve Smith pushes Sunil Narine into the covers to scamper two to tie the tie-breaker, and win the match. That finish meant Steve Smith moved to the top of the  $$Cricketers$$ $$trending$$ $$on$$ $$Twitter$$  page. Who will be trending at the end of #MIvSRH?"}, {"ball": 0, "isHighlight": false, "text": "The UAE leg of the IPL winds up, and it's time to chalk up new strategies on  $$Cricinfo$$ $$Fantasy$$  for the Indian leg of the tournament. Pick your XI wisely."}, {"ball": 0, "isHighlight": false, "text": "There are no Powerplays in Test cricket, but there are five of them in the  $$Greatest$$ $$Test$$ $$Ever$$ . Powerplay 2 at  $$CricIQ$$  is in full swing, so play your shots and clamber up the leaderboard before it is too late."}, {"ball": 0.1, "isHighlight": false, "text": "Khan to Finch,1 leg bye,Finch moves right across his stumps and the ball hits his thigh and rolls to the off side"}, {"ball": 0.1, "isHighlight": false, "text": "Arun: \"Can Ben dunk provide the much needed slam dunk for Mumbai indians.\""}, {"ball": 0.2, "isHighlight": false, "text": "Khan to Dhawan,1 leg bye,this was drifting on the pad and he tried to flick it away, struck the pad and it's another leg bye"}, {"ball": 0.3, "isHighlight": false, "text": "Khan to Finch, $$FOUR$$ ,that wasn't a bad ball at all actually, it was swinging in on a yorker length and Finch flicked that pretty well, placed it wide of square leg"}, {"ball": 0.3, "isHighlight": false, "text": "Fine leg up, square leg goes back"}, {"ball": 0.4, "isHighlight": false, "text": "Khan to Finch, $$FOUR$$ ,and just when fine leg comes up Zaheer makes the blunder by bowling on the pads, flicked away fine and the fielder dives in vain"}, {"ball": 0.5, "isHighlight": false, "text": "Khan to Finch,no run,that's the Zaheer we know  better, squared him up outside off by one that straightened, beaten all ends up"}, {"ball": 0.6, "isHighlight": false, "text": "Khan to Finch,no run,fires that full outside off and driven firmly but straight to cover"}, {"ball": 0.6, "isHighlight": false, "text": "Guru: \"Can we get our Shikar Dhawan back in form??? His form is crucial for Indian team for the coming World Cup!!"}, {"ball": 1.1, "isHighlight": false, "text": "Malinga to Dhawan,1 leg bye,swings it towards the pads, hurried him for pace, dribbles off his body"}, {"ball": 1.2, "isHighlight": false, "text": "Malinga to Finch,2 runs,this was on a good length outside off and he stays beside the line and punches it wide of point"}, {"ball": 1.2, "isHighlight": false, "text": "Krishna: \"@OMPRAKASH What's if we found so many keepers in same team... Kusal Perera, Thirimanne, Sangakkara, Chandimal, Dilshan\""}, {"ball": 1.3, "isHighlight": false, "text": "Malinga to Finch,no run,this was nice and straight, on the stumps and he defends on the back foot"}, {"ball": 1.4, "isHighlight": false, "text": "Malinga to Finch,1 run,good length outside off and moving away, opens the face and runs it down to third man"}, {"ball": 1.4, "isHighlight": false, "text": "sau: \"@guru..just give him a flat track and he's back in form..see past may 2nd ;)\""}, {"ball": 1.5, "isHighlight": false, "text": "Malinga to Dhawan,1 run,this was swinging in on a yorker length, mistimed the drive wide of mid-on"}, {"ball": 1.6, "isHighlight": false, "text": "Malinga to Finch,no run,slower ball this time, read it late and softly pushed it towards mid-on, Dhawan set off and had to scamper back"}, {"ball": 2.1, "isHighlight": false, "text": "Khan to Dhawan,1 run,good length on middle and leg, he stays back and knocks it to the on side"}, {"ball": 2.2, "isHighlight": false, "text": "Khan to Finch,1 leg bye,Zaheer gets away with it this time, short and on the body, he swivels to pull but mistimes it to short fine leg"}, {"ball": 2.3, "isHighlight": false, "text": "Khan to Dhawan, $$FOUR$$ ,hammered away, this was too wide outside off, Dhawan was anyway forward and he slapped that in the air wide of cover"}, {"ball": 2.4, "isHighlight": false, "text": "Khan to Dhawan, $$OUT$$ ,Zak's struck back after the boundary, this was on a good length outside off, Dhawan didn't have the width to drive unlike the previous ball, he went for the drive anyway, took the outside edge and comfortably taken by Harbhajan at first slip"}, {"ball": 2.4, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Harbhajan$$ $$Singh$$ $$b$$ $$Khan$$ $$6$$ $$(12m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 2.5, "isHighlight": false, "text": "Khan to Rahul,no run,nicely defended on the back foot by Rahul, Zaheer keeps it straight"}, {"ball": 2.6, "isHighlight": false, "text": "Khan to Rahul,no run,comes round the wicket and bowls it full, driven firmly down the track"}, {"ball": 2.6, "isHighlight": false, "text": "Rohan: \"Manish Pandey, Y Chahal, Suryakumar Yadav, Rahane, Binny, Akshar Patel and Takawale.. This isn't my IPL fan list.. It's the list of players who barely got chances at MI and have now become regulars for their current IPL sides..Shows how poorly MIs have utilised their domestic talent..\""}, {"ball": 3.1, "isHighlight": false, "text": "Ojha to Finch,no run,tossed up outside off and he makes room and cuts him to point"}, {"ball": 3.2, "isHighlight": false, "text": "Ojha to Finch, $$FOUR$$ ,take that! Premeditated by Finch as he made room very early, gave himself width to carve that over the covers"}, {"ball": 3.3, "isHighlight": false, "text": "Ojha to Finch,1 run,he shuffles and clips that to the on side"}, {"ball": 3.4, "isHighlight": false, "text": "Ojha to Rahul, $$FOUR$$ ,nicely driven, Rahul used his feet and danced down the track, met the ball on the half volley and drove it inside out wide of point"}, {"ball": 3.5, "isHighlight": false, "text": "Ojha to Rahul,no run"}, {"ball": 3.6, "isHighlight": false, "text": "Ojha to Rahul,1 run,tossed up and he drives him down to long-off"}, {"ball": 4.1, "isHighlight": false, "text": "Khan to Rahul,no run,Zaheer continues round the wicket, bangs it in short and he swivels to pull but misses"}, {"ball": 4.2, "isHighlight": false, "text": "Khan to Rahul,2 runs,fullish in length outside off and he gets forward and drives him wide of point"}, {"ball": 4.3, "isHighlight": false, "text": "Khan to Rahul, $$FOUR$$ ,okay that was risky! There was a slip and Rahul wasn;t afraid to glide that to third man, it was a slower ball he had to adjust quickly, kept it down and it bounced in front of Harbhajan, beat him and rolled away to third man"}, {"ball": 4.4, "isHighlight": false, "text": "Khan to Rahul,1 run,he gets forward and pushes it to the off side"}, {"ball": 4.5, "isHighlight": false, "text": "Khan to Finch,no run,keeps it straight and he knocks it to the off side"}, {"ball": 4.6, "isHighlight": false, "text": "Khan to Finch, $$OUT$$ ,spooned to cover! Zaheer fired that on a good length outside off, Finch was looking to punch it through the off side but failed to keep it down, Dunk jumps at cover and takes it easily"}, {"ball": 4.6, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$Dunk$$ $$b$$ $$Khan$$ $$16$$ $$(23m$$ $$15b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$106.66$$"}, {"ball": 5.1, "isHighlight": false, "text": "Malinga to Rahul,1 run,slower ball by Malinga, flicked with soft hands to the on side and he sets off"}, {"ball": 5.1, "isHighlight": false, "text": "Sugan: \"Good this Rahul move from SRH.. What do you do if u dont have quality middle order batsman .. Move one from top order to middle..Simple :)\""}, {"ball": 5.2, "isHighlight": false, "text": "Malinga to Warner,no run,this was a half volley outside off and Malinga was lucky Warner failed to get it past cover"}, {"ball": 5.3, "isHighlight": false, "text": "Malinga to Warner,1 run,packed off side field, Warner drove it just wide of point and Dunk did well to run to his left and cut it off, they pick up a run though"}, {"ball": 5.3, "isHighlight": false, "text": "Aditya Mandalem: \"Not since our star batsman Thirumalasetti Suman has any local player inspired fear among the opposition bowlers. Suman and his golf like swings... unforgettable images in 2009.\""}, {"ball": 5.4, "isHighlight": false, "text": "Malinga to Rahul,2 runs,that's a low full toss on the pads, he flicks it behind square on the on side"}, {"ball": 5.5, "isHighlight": false, "text": "Malinga to Rahul,no run,Malinga keeps it tight, on the stumps and he defends down the track"}, {"ball": 5.6, "isHighlight": false, "text": "Malinga to Rahul,2 runs,slower ball on the pads and he tucks it wide of midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Anil: \"the SRH batting order reminds me of Delhi's batting order last year. heavily depending on viru, warner, taylor and losing matches because of that\""}, {"ball": 6.1, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,tossed up and he comes down the track and gets an outside edge to the off side"}, {"ball": 6.2, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,gets forward and drives to the off side"}, {"ball": 6.3, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,tossed up and he gets forward and pushes it just wide of the bowler"}, {"ball": 6.4, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,tossed up and he stays back and clips it just wide of square leg"}, {"ball": 6.5, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,goes back at the crease and punches it down to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,this one skidded through as he looked to cut, beaten"}, {"ball": 7.1, "isHighlight": false, "text": "Ojha to Rahul,1 run,tossed up and he stabbed at it as he went forward, just wide of cover"}, {"ball": 7.2, "isHighlight": false, "text": "Ojha to Warner,no run,this was dragged a bit short, he went for the pull but couldn't beat short midwicket"}, {"ball": 7.3, "isHighlight": false, "text": "Ojha to Warner,5 wides,terrible ball, tossed up really wide down the leg side, the wicketkeeper couldn't do anything"}, {"ball": 7.3, "isHighlight": false, "text": "Ojha to Warner, $$SIX$$ ,tossed up on middle and leg, Warner was on his knee quickly and he slogged it flat over deep midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Ojha to Warner,1 run,he opens the face and runs it down to short third man"}, {"ball": 7.5, "isHighlight": false, "text": "Ojha to Rahul,1 run,tossed up and he gets forward and drives it down to long-off"}, {"ball": 7.6, "isHighlight": false, "text": "Ojha to Warner,1 run,stays back and whips it to square leg"}, {"ball": 7.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 7.6, "isHighlight": false, "text": "Harshal: \"A lot of talk about form during the IPL. I think its best to be out of form DURING the IPL, so that when you're back on the international (or domestic) circuit, you've allowed all your inner demons to be washed away. I feel like that's half the secret of Virat Kohli. He lets all his bad form happen during the various IPL seasons so that he's fresh and ready for international cricket.\""}, {"ball": 8.1, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,he stays back and punches it to the off side"}, {"ball": 8.2, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,quicker one, no room and he punches it to the off side"}, {"ball": 8.3, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,a little shorter and he pulls against the turn"}, {"ball": 8.4, "isHighlight": false, "text": "Harbhajan Singh to Rahul,no run,softly tucked to the on side and Zaheer picks up"}, {"ball": 8.5, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,quicker one and he turns it to square leg"}, {"ball": 8.6, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,full on the stumps and driven down to cover"}, {"ball": 8.6, "isHighlight": false, "text": "Naren: \"@Harshal: Great logic ! Even Kohli wouldn't have known that :P\""}, {"ball": 8.6, "isHighlight": false, "text": "rudhra: \"@Harshal: I am would be happy to see a out-of-form Kohli in IPL and full-form in international cricket vs Suresh Raina who is in-form in IPL and looses his form after IPL\""}, {"ball": 9.1, "isHighlight": false, "text": "Pollard to Rahul,1 run,the off cutter, he shuffles and tucks it to the leg side"}, {"ball": 9.2, "isHighlight": false, "text": "Pollard to Warner,1 run,Pollard delivers that from a few yards behind the crease, more than a few yards in fact, Warner drives to long-off"}, {"ball": 9.3, "isHighlight": false, "text": "Pollard to Rahul,1 run,slower ball and he opens the face and runs it down to short third man"}, {"ball": 9.4, "isHighlight": false, "text": "Pollard to Warner,no run,the keeper is up to the stumps, close call for Warner as he looked to run it down to third man and was beaten, the keeper fumbled"}, {"ball": 9.5, "isHighlight": false, "text": "Pollard to Warner,2 runs,a little shorter and he was on his toes as he guided that wide of backward point"}, {"ball": 9.6, "isHighlight": false, "text": "Pollard to Warner,1 run,angling across and he punches it wide of point to the sweeper"}, {"ball": 9.6, "isHighlight": false, "text": "Swaroop: \"Even Sangakkara applied the same logic. Last year his performances for SRH were below par where as he was tremendous at the international T20s\""}, {"ball": 10.1, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,went through with the arm and skidded, he just about chopped it away"}, {"ball": 10.2, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,stays back and punches it wide of cover"}, {"ball": 10.3, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,stays back and pushes it wide of point"}, {"ball": 10.4, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,looks to run it down to third man but can't beat short third man"}, {"ball": 10.5, "isHighlight": false, "text": "Harbhajan Singh to Warner,2 runs,he goes for the reverse sweep this time but it's in the air for a while but enough to clear short third man"}, {"ball": 10.6, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,fires it  on the stumps and he punches it wide of cover and sets off"}, {"ball": 10.6, "isHighlight": false, "text": "Asraar: \"Just could'nt understand the approach of Sunrisers here. If they score 15 runs in an over, instead of bulding up the momentum, they score only 2 singles in the next. Always leaving it too late to be aggressive.\""}, {"ball": 11.1, "isHighlight": false, "text": "Pollard to Warner,2 runs,this was too full and wide and he drives it down to long-off"}, {"ball": 11.2, "isHighlight": false, "text": "Pollard to Warner,1 run,stays beside the line and punches it wide of point"}, {"ball": 11.3, "isHighlight": false, "text": "Pollard to Rahul,1 run,this was outside off and he cuts it to deep point"}, {"ball": 11.4, "isHighlight": false, "text": "Pollard to Warner,1 run,Pollard taking the pace off the ball and making it tougher for Warner, he chops it hard to deep point"}, {"ball": 11.5, "isHighlight": false, "text": "Pollard to Rahul,1 run,slower ball and he shuffles and works it to fine leg"}, {"ball": 11.5, "isHighlight": false, "text": "Pollard pulls away before delivery"}, {"ball": 11.6, "isHighlight": false, "text": "Pollard to Warner,1 run,dabs it just wide of short third man and Ojha dives and cuts it off"}, {"ball": 12.1, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,pushes it down to sweeper cover"}, {"ball": 12.2, "isHighlight": false, "text": "Harbhajan Singh to Rahul,2 runs,Rahul plays the reverse sweep and plays it fine, short third man charges"}, {"ball": 12.3, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,full on the pads and he works him wide of midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,he fires that really quick and he dabs it down to short third man"}, {"ball": 12.5, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,stays back and works it against the turn to square leg"}, {"ball": 12.6, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 leg bye,down the leg side and flicked to short fine leg"}, {"ball": 12.6, "isHighlight": false, "text": "Kshitij: \"What's it with teams that they always ignore somebody like Parvez Rasool? When he went to Zimbabwe , India won 5-0, yet he didn't get a chance to play even in the dead rubbers. Pune were the worst team for the last 3 seasons...yet Rasool hardly got any matches to play...similarly here with Hyderabad..they have got such a talented offie like Rasool who can bat well too...but they continue to persist with 2 leg spinners who have not given any good performance...they continue swapping Irfan and Ishant who too are hardly promising...I mean I am just unable to understand the logic...\""}, {"ball": 13.1, "isHighlight": false, "text": "Pollard to Rahul,no run,full on the pads and he flicks it down to midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Pollard to Rahul, $$FOUR$$ ,that was good timing! Short of a length, Rahul made room early, looked to force it away but instead placed it well wide of point, middled that one"}, {"ball": 13.3, "isHighlight": false, "text": "Pollard to Rahul,1 run,full on the pads and he works it cover"}, {"ball": 13.4, "isHighlight": false, "text": "Pollard to Warner,no run,this was a yorker outside off and he drills it firmly back to the bowler who nearly flings it back"}, {"ball": 13.5, "isHighlight": false, "text": "Pollard to Warner, $$FOUR$$ ,take cover KL! This was a slower ball and shorter, Warner bashed it down the ground with brute force nearly taking the non-striker with him, that was one powerful backhand"}, {"ball": 13.6, "isHighlight": false, "text": "Pollard to Warner,1 run,punches it down to deep point"}, {"ball": 14.1, "isHighlight": false, "text": "Ojha to Warner,5 wides,for the second time today Ojha fires it down the leg side and beats everyone, the keeper couldn't do anything  and Warner didn't offer a shot"}, {"ball": 14.1, "isHighlight": false, "text": "Ojha to Warner,1 run,goes back and punches it to the off side"}, {"ball": 14.2, "isHighlight": false, "text": "Ojha to Rahul,1 run,gets forward and chips it down to long-off"}, {"ball": 14.3, "isHighlight": false, "text": "Ojha to Warner,2 runs,he stays back and punches it to point"}, {"ball": 14.4, "isHighlight": false, "text": "Ojha to Warner, $$SIX$$ ,into the stands over deep midwicket, tossed up and Warner was on his knee early and sent that a few rows over deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Ojha to Warner,1 run,he stays back and punches it to short third man"}, {"ball": 14.5, "isHighlight": false, "text": "Pravin: \"@Kshitij : Understand your frustration .. But SRH would not change the 2 Leg spinners formula so soon as it got them through to the play-offs last time .. Also i don see teams other than Punjab and Rajasthan banking on players without prior IPL experience..\""}, {"ball": 14.6, "isHighlight": false, "text": "Ojha to Rahul,2 runs,Rahul went down the track and chipped it down the ground, nearly reached the rope though, cut off by long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Snehil: \"Great work this from lokesh rahul...doing just the right thing by staying there and rotaing strike with the occasional boundary...this would set a perfect platform for hyderabad to attack in the last overs with Warner and Sammy.."}, {"ball": 15.1, "isHighlight": false, "text": "Pollard to Warner,1 no ball,and the umpire Dharmasena is down! For starters Pollard bowled a high full toss which he was penalised for, Warner wanted to bash this down the ground but Pollard's hand came in the way and he deflected it to Dharmasena who was struck on the shoulder, Dharmasena went down and immediately penalised Pollard who was very apologetic"}, {"ball": 15.1, "isHighlight": false, "text": "Pollard to Warner,1 run,pushes this one past cover"}, {"ball": 15.2, "isHighlight": false, "text": "Pollard to Rahul,1 run,gets forward and drives to long-off"}, {"ball": 15.3, "isHighlight": false, "text": "Pollard to Warner, $$SIX$$ ,miles over long-on! That was one mighty slog by Warner, length ball, on his knee and that went several rows back"}, {"ball": 15.4, "isHighlight": false, "text": "Pollard to Warner,1 run,and he punches this one down to long-off and gets his fifty! Warner looking dangerous now"}, {"ball": 15.5, "isHighlight": false, "text": "Pollard to Rahul,2 runs"}, {"ball": 15.6, "isHighlight": false, "text": "Pollard to Rahul,1 run,he moves across the stumps and sweeps him behind square"}, {"ball": 15.6, "isHighlight": false, "text": "malinga to bowl"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Rahul,1 run,fires that full on the off stump and he drills it down the track wide of the bowler"}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to Warner,2 runs,that was the switch hit off Malinga! Warner had the audacity to try that against him, he turned quickly and changed the grip and dabbed it wide of Ojha at short fine leg who leaps to his right, gets a hand to it but can't hang on, so that would be a  $$drop$$"}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Warner,2 runs,drives that firmly to Harbhajan at extra cover and hurries the single, there's an overthrow"}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to Warner,2 runs,fuller one on the pads and worked down to long-on"}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Warner,no run,fires that full outside off and he drives to cover"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Warner,no run,good comeback by Malinga as he bowls the slower yorker and Warner can only drill it down the track"}, {"ball": 17.1, "isHighlight": false, "text": "Khan to Rahul,1 run,comes round the wicket, on the stumps and he flicks it to midwicket"}, {"ball": 17.1, "isHighlight": false, "text": "Kapil: \"Rahul should simply go for ther leather here. 8 wickets in hand and SRH should target that 175 mark\""}, {"ball": 17.1, "isHighlight": false, "text": "Kiran Gummalla: \"Did Mumbai forget Anderson. They tried pollard. Why not Anderson ??\""}, {"ball": 17.2, "isHighlight": false, "text": "Khan to Warner,1 run,full on the stumps and Warner could only drill it just wide of the bowler"}, {"ball": 17.3, "isHighlight": false, "text": "Khan to Rahul,1 run,good length outside off and he makes room and forces it to long-off"}, {"ball": 17.4, "isHighlight": false, "text": "Khan to Warner,1 run,Warner made room early looking to slog and he ended up getting an inside edge to the pads, and things getting spicy between Warner and Zaheer as they exchange words and glares! Warner puts his index finger on his helmet grill suggesting to Zaheer to keep quiet"}, {"ball": 17.5, "isHighlight": false, "text": "Khan to Rahul,1 run"}, {"ball": 17.6, "isHighlight": false, "text": "Khan to Warner,1 run,Warner makes room and looks to slog and again he mistimes it, gets an inside edge to the leg side and Zaheer smiles this time, I suppose all's well now! It is, as Warner smiles back too"}, {"ball": 18.1, "isHighlight": false, "text": "Anderson to Warner, $$SIX$$ ,And Anderson is welcomed to the crease with a slog, length ball, Warner made room and it just cleared deep midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "Anderson to Warner, $$OUT$$ ,Warner tries one switch hit too many! Anderson was round the wicket, it was full and Warner was looking to send that over deep midwicket (to the right-hander), thick edge to the keeper"}, {"ball": 18.2, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$c$$ $$†Gautam$$ $$b$$ $$Anderson$$ $$65$$ $$(66m$$ $$51b$$ $$1x4$$ $$4x6)$$ $$SR:$$ $$127.45$$"}, {"ball": 18.2, "isHighlight": false, "text": "Any big hits from Sammy?"}, {"ball": 18.3, "isHighlight": false, "text": "Anderson to Sammy, $$SIX$$ ,that answers the question as he tees off from ball one! Pitched up and Sammy dragged his left leg well forward and sent that several miles in the air and big over long-on"}, {"ball": 18.4, "isHighlight": false, "text": "Anderson to Sammy,1 wide,Anderson slides this down the leg side"}, {"ball": 18.4, "isHighlight": false, "text": "Anderson to Sammy,no run,that's the better length, fires that full and quick outside off and Sammy couldn't dig it out"}, {"ball": 18.5, "isHighlight": false, "text": "Anderson to Sammy,1 wide,that was far too wide outside off and sammy was down on the ground attempting to reach out"}, {"ball": 18.5, "isHighlight": false, "text": "Anderson to Sammy, $$FOUR$$ ,Sammy was looking to slog that but got an outside edge that cleared short third man"}, {"ball": 18.6, "isHighlight": false, "text": "Anderson to Sammy, $$OUT$$ ,brilliantly done by Pollard! Slower ball from Anderson and Sammy fetched that from outside off and looked to clear long-on, didn't get the distance and Pollard ran forward, kept his eyes on it and took it inches off the turf on the dive"}, {"ball": 18.6, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$Pollard$$ $$b$$ $$Anderson$$ $$10$$ $$(4m$$ $$4b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$250.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "18 off the over and two wickets!"}, {"ball": 19.1, "isHighlight": false, "text": "Malinga to Ojha,1 run,good yorker to begin with, hits the pads and the ball rolls away"}, {"ball": 19.2, "isHighlight": false, "text": "Malinga to Rahul, $$OUT$$ ,soft dismissal for Rahul, he moved across his stumps looking to scoop it to fine leg, it was the off cutter, top edged it and an easy one for Gautam"}, {"ball": 19.2, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$c$$ $$†Gautam$$ $$b$$ $$Malinga$$ $$46$$ $$(85m$$ $$40b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$115.00$$"}, {"ball": 19.3, "isHighlight": false, "text": "Malinga to Ojha,1 run,full on the pads and he works it down to long-on"}, {"ball": 19.4, "isHighlight": false, "text": "Malinga to Pathan,1 run,that's a direct hit and Irfan is in trouble! Drills it down to cover and he sets off and doesn't run straight, there's a direct hit at the bowler's end and Irfan has just about got his bat in"}, {"ball": 19.5, "isHighlight": false, "text": "Malinga to Ojha, $$FOUR$$ ,bashed a full delivery wide of cover, this was a touch wide, cover and mid-off in place and he bisects the gap"}, {"ball": 19.6, "isHighlight": false, "text": "Malinga to Ojha, $$FOUR$$ ,and again! Same area, this was full on the middle stump and Ojha made just a hint of room and smacked that along the ground and beat a diving Pollard at mid-off"}, {"ball": 19.6, "isHighlight": false, "text": "83 off the last seven overs and Mumbai will have to bat like a transformed side to leave UAE with a win. Sunrisers really picked up thanks to Warner and the support he got from Rahul was invaluable. The penultimate over went for 18 and Malinga's last over didn't quite go to plan. Warner, speaking on TV, said that the stump-to-stump balls are hard to hit. That's the way to bowl here. Join us shortly for the chase."}], "name": "Mumbai Indians v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729317.html?innings=1;view=commentary", "match_num": 20}