{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.30$$ $$pm$$  Ben Dunk v Dale Steyn. What an initiation into the IPL"}, {"ball": 0.1, "isHighlight": false, "text": "Steyn to Dunk,no run,fullish on off stump, he defends to mid-off"}, {"ball": 0.2, "isHighlight": false, "text": "Steyn to Dunk,1 run,shapes in off a fuller length, Dunk pushes away from his body a little and gets a thick inside edge down to fine leg"}, {"ball": 0.2, "isHighlight": false, "text": "Slip and found men in the ring on the off side"}, {"ball": 0.3, "isHighlight": false, "text": "Steyn to Sharma,no run,just short of a good length and the ball curls away after pitching, Rohit won't be enticed by it"}, {"ball": 0.4, "isHighlight": false, "text": "Steyn to Sharma,no run,fullish on middle, Rohit nudges it from the crease to midwicket"}, {"ball": 0.5, "isHighlight": false, "text": "Steyn to Sharma,1 run,back of a length and outside off, Rohit dabs into the off side and hesitates. Dunk is haring across so he has to run. Cover races in and sends an underarm thrown on the dive and had that hit, it would have been curtains for Dunk. Hits the marker behind the stumps and deflects away"}, {"ball": 0.6, "isHighlight": false, "text": "Steyn to Dunk, $$FOUR$$ ,short and wide, Dunk gets up on his toes and slaps it over the head of point. Crisp, but a little dangerous"}, {"ball": 1.1, "isHighlight": false, "text": "Kumar to Sharma,no run,full and a little swing outside off, he goes forward and blocks with a bit of an open face"}, {"ball": 1.2, "isHighlight": false, "text": "Kumar to Sharma, $$OUT$$ ,big gap between bat and pad as he exhibits a lazy drive down the ground. Bhuvi gets this to dart back in quite late  and off stump takes a clattering. Mumbai's batting is treading familiar territory once again"}, {"ball": 1.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$b$$ $$Kumar$$ $$1$$ $$(6m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$"}, {"ball": 1.2, "isHighlight": false, "text": "Jigs View: \"Falls of early wicket trend will continue for MI in UAE... MI will start counting winning points with huge MI crowd fan at wankhediam only..\""}, {"ball": 1.2, "isHighlight": false, "text": "Corey Anderson walks out at No.3. Slip in place"}, {"ball": 1.3, "isHighlight": false, "text": "Kumar to Anderson,1 wide,fuller ball, but a directed a little too far outside off"}, {"ball": 1.3, "isHighlight": false, "text": "Kumar to Anderson,no run,just short of a good length as he goes back and blocks with a straight face"}, {"ball": 1.3, "isHighlight": false, "text": "Bhuvi goes around the wicket. Sachin has the mic in hand and says \"it's a little difficult staying away from the game\""}, {"ball": 1.4, "isHighlight": false, "text": "Kumar to Anderson,no run,back of a length and just outside off, defended"}, {"ball": 1.5, "isHighlight": false, "text": "Kumar to Anderson,no run,good length ball pushing in at his pads, Anderson nudges towards the leg side and the bowler takes care of it"}, {"ball": 1.6, "isHighlight": false, "text": "Kumar to Anderson,1 run,on the hips and he clips, towards midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Sachin says he's been taking up golf during his stay at the UAE. \"If I can keep my temper in check on the cricket field, gold isn't a problem\". Spoke about catching up with family and how good it felt t obe back in a dug out"}, {"ball": 2.1, "isHighlight": false, "text": "Steyn to Anderson,no run,147 kph, Anderson is rooted to the crease as he wafts at a good length ball that is angled across him. Steyn goes up in a big appeal, but the keeper is late to follow and the umpire says no."}, {"ball": 2.2, "isHighlight": false, "text": "Steyn to Anderson,no run,shortish on middle, Anderson drops it towards midwicket but the fielders swoop down on it quickly"}, {"ball": 2.3, "isHighlight": false, "text": "Steyn to Anderson,no run,full and pushed wide to entice him, Anderson looks to lace it over the covers and misses. Again no feet"}, {"ball": 2.3, "isHighlight": false, "text": "Saching says the ball is coming onto the bat here and that it has a strong message to convey to you and as a batsman, you should hear it. Hasn't felt like padding up so far, but he says he has to start practicing for the game at Lords."}, {"ball": 2.4, "isHighlight": false, "text": "Steyn to Anderson, $$OUT$$ ,what a ball! Anderson has had a torrid time against the pace Steyn is generating. So he goes for the innovation. Gets on one-knee and looks to scoop a short of a good length delivery over the keeper. Unwise shot against someone of this pace. Only gloves it and the keeper pouches an easy take"}, {"ball": 2.4, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$†Ojha$$ $$b$$ $$Steyn$$ $$1$$ $$(7m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$12.50$$"}, {"ball": 2.4, "isHighlight": false, "text": "Ambati Rayudu has two sips and a short leg. Sachin says the target is difficult but not impossible. These are the challenging moments and if you do something special it is satsifying. Adds MI have to bat better"}, {"ball": 2.5, "isHighlight": false, "text": "Steyn to Rayudu,no run,steams in and sends a 141 k thunderbolt that is allowed to thud into the keeper's gloves. Shortish and in that off stump corridor"}, {"ball": 2.5, "isHighlight": false, "text": "sree: \"what's with golf and retired cricket greats? Kapil Dev, Ponting, now sachin...\""}, {"ball": 2.6, "isHighlight": false, "text": "Steyn to Rayudu, $$FOUR$$ ,148kph, short and pushed a little too far down the leg side. He goes for a pull and the ump says he's got wood on it"}, {"ball": 3.1, "isHighlight": false, "text": "Kumar to Dunk,1 wide,he strays down the leg side"}, {"ball": 3.1, "isHighlight": false, "text": "Kumar to Dunk,no run,he stays beside the line and punches it to point"}, {"ball": 3.2, "isHighlight": false, "text": "Kumar to Dunk,no run,swings away and he stays beside the line and works it to point"}, {"ball": 3.3, "isHighlight": false, "text": "Kumar to Dunk,no run,moves away from him and he is sliced in half, beaten for movement"}, {"ball": 3.4, "isHighlight": false, "text": "Kumar to Dunk,no run,punches it off the bottom half of the bat to cover"}, {"ball": 3.5, "isHighlight": false, "text": "Kumar to Dunk,no run,good length on the stumps and he punches it firmly down to mid-on"}, {"ball": 3.5, "isHighlight": false, "text": "Hemanth: \"Never seen so many mentors for a single team. Maybe they should be renamed as Mumbai Mentors. sigh.\""}, {"ball": 3.6, "isHighlight": false, "text": "Kumar to Dunk,no run,good length outside the off stump and he punches it to cover, very over from Bhuvi here"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Rayudu,1 run,Sharma bowls it flat and quick, worked to the on side"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Dunk, $$FOUR$$ ,in the slot for Dunk to scoop this comfortably over mid-off, no turn for Karn"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Dunk,2 runs,works it behind square on the on side and Warner's throw isn't quick enough to prevent the second run"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Dunk,no run"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Dunk, $$FOUR$$ ,goes for the drive but gets a thick outside edge, beats Bhuvi at short third man who doesn't time his dive right, gets up and chases but in vain"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Dunk,no run,he stays back and knocks it down the track"}, {"ball": 5.1, "isHighlight": false, "text": "Sammy to Rayudu,1 run,Dhawan dives full length to his left to stop that, well done"}, {"ball": 5.2, "isHighlight": false, "text": "Sammy to Dunk, $$FOUR$$ ,that was raw power, it was a slower one and too short, Dunk slammed that off the back foot, too quick for cover"}, {"ball": 5.3, "isHighlight": false, "text": "Sammy to Dunk,1 run,he stays on the back foot and punches it towards cover"}, {"ball": 5.4, "isHighlight": false, "text": "Sammy to Rayudu,1 run,stays beside the line and angles it down to third man"}, {"ball": 5.5, "isHighlight": false, "text": "Sammy to Dunk, $$OUT$$ ,the keeper is up to the stumps, Dunk was at the crease looking to pull, Sammy bowled the off cutter and it skidded through, deflected off the pads and onto the stumps"}, {"ball": 5.5, "isHighlight": false, "text": "$$BR$$ $$Dunk$$ $$b$$ $$Sammy$$ $$20$$ $$(28m$$ $$17b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$117.64$$"}, {"ball": 5.5, "isHighlight": false, "text": "31 for 3 chasing 173. Mumbai need someone to play a dream knock. Will it be Pollard?"}, {"ball": 5.5, "isHighlight": false, "text": "Andrew: \"If nothing else, the inability of Anderson and Neesham to make an impression shows that success in a few T20s does not guarantee success in all forms of cricket. There is no substitute for a good first-class and ODI upbringing.\""}, {"ball": 5.6, "isHighlight": false, "text": "Sammy to Pollard,1 run,a bit too straight and he shuffles and tucks it to square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Steyn's back, to have a crack at Pollard"}, {"ball": 6.1, "isHighlight": false, "text": "Steyn to Pollard,1 wide,he strays far too wide down the leg side"}, {"ball": 6.1, "isHighlight": false, "text": "Steyn to Pollard,no run,solid in defence, this was pacy and on the stumps and Pollard was happy to get forward and defend"}, {"ball": 6.2, "isHighlight": false, "text": "Steyn to Pollard,no run,Steyn's not giving much room yet, this was on the off stump and Pollards defended it again"}, {"ball": 6.2, "isHighlight": false, "text": "Arun: \"@Andrews, absolutely true. There was a lesson to be learnt from Richard Levi. And guess who had bought Levi..:P\""}, {"ball": 6.3, "isHighlight": false, "text": "Steyn to Pollard,1 run,the short one finally! Forced Pollard to go right back and take that on the knuckles, did well to keep it down"}, {"ball": 6.4, "isHighlight": false, "text": "Steyn to Rayudu, $$FOUR$$ ,chance at slip and  $$dropped$$ ! Strange old shot by Rayudu, he backed away and meekly poked his bat out, went between keeper and slip and Sammy could have hung on had he moved a bit quicker to his left, all happened in a flash"}, {"ball": 6.5, "isHighlight": false, "text": "Steyn to Rayudu,no run,Rayudu risks the same shot again, this was pitched up and moving away, beaten"}, {"ball": 6.6, "isHighlight": false, "text": "Steyn to Rayudu,no run,beaten yet again! Rayudu looks to pull and he swishes at thin air, something's got to give here"}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Pollard,no run"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Pollard,3 runs,this was fired full and flicked to the leg side, Aaron Finch threw to the bowler's end but he was way off the mark! Must have slipped out, the throw went towards mid-off"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Rayudu,1 run"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Pollard,no run,tossed up and he gets forward and defends"}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Pollard,1 run,tossed up and he works it to the leg side"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Rayudu,no run,flatter one and he can only defend it back to the bowler"}, {"ball": 7.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 7.6, "isHighlight": false, "text": "Vikram: \"@Andrew: It's not that Corey hasn't performed well in ODI's. He is very much talented than you are thinking and you'll know if you remember ODI series with India. It's just that he is in the early days of his career and hasn't traveled much so that he could play in any place. And not many New Zealanders feel comfortable in Sub-Continent even after a well established career. Give him some time \""}, {"ball": 7.6, "isHighlight": false, "text": "VJain: \"@Andrew, @Arun, easy to say that - but Pollard is a perfect counter example. and guess who bought him.... :) I think all bets that MI placed this season have gone against them. I am sure they will come back stronger. This is the same team management that gave us amazing last two-three seasons.\""}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to Pollard,no run"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to Pollard,1 run,fires that on the pads and he works it behind square on the leg side"}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to Rayudu,1 run,he drops this one short and he stays back and pulls down to long-on"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to Pollard,1 run,that was the googly and he stays back and punches it to midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Rayudu,1 run,spins away and he punches it down to long-on"}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to Pollard,1 run,slower and shorter and he works it against the turn to midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "vijay chak: \"Guys - Please hold your judgement on Andersona and Neesham. Wait until the next world cup in Aus/NZ and guys like them will end up being match winners for their country. They are better batsmen on their own turf like most of the good batsmen these days. So failure in IPL should not count against their talent. \""}, {"ball": 9.1, "isHighlight": false, "text": "Sammy to Pollard,2 runs,this was short of a length and he stays back and clips it to square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Sammy to Pollard,1 run,good length outside the off stump and he angles it down to third man"}, {"ball": 9.3, "isHighlight": false, "text": "Sammy to Rayudu, $$FOUR$$ ,the opening Rayudu needed, the loopy slower ball, he gets on his knee and exploits the gap at midwicket, no chance of stopping that"}, {"ball": 9.4, "isHighlight": false, "text": "Sammy to Rayudu,1 run,that was a lot full toss which he fails to put away, mistimes it to midwicket"}, {"ball": 9.5, "isHighlight": false, "text": "Sammy to Pollard,no run,drops it towards point and Rayudu sets off first and so does Pollard, Pollard scampers back"}, {"ball": 9.6, "isHighlight": false, "text": "Sammy to Pollard, $$FOUR$$ ,this was short on middle and leg, the right length for Pollard to pull in front of square, better over for Mumbai"}, {"ball": 10.1, "isHighlight": false, "text": "Mishra to Rayudu,1 run,he stays back and punches this down the ground to long-on"}, {"ball": 10.2, "isHighlight": false, "text": "Mishra to Pollard,no run,flatter delivery and Pollard is happy to defend, another dot ball though"}, {"ball": 10.3, "isHighlight": false, "text": "Mishra to Pollard,no run,turn, turn turn! Squared up Pollard, he was forward to defend and that really turned square"}, {"ball": 10.4, "isHighlight": false, "text": "Mishra to Pollard,1 run,comes forward and pushes it to point and Rayudu sets off, the fielder does well to dive and throw it to the keeper in one motion, appeal for a run out but Rayudu was safe"}, {"ball": 10.5, "isHighlight": false, "text": "Mishra to Rayudu,no run,stays back and punches it back to the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "Mishra to Rayudu,1 run,drops this one short and he rocks back and punches it to point"}, {"ball": 10.6, "isHighlight": false, "text": "Sunjay: \"Every time a team has a batting collapse, the only thing i want to say to them is \"Badri\". The man had a fc batting average of 60+ just was born in the wrong generation. He is a better strokemaker than many other fellow conventional batsman, and one of the best fielders in the country.\""}, {"ball": 11.1, "isHighlight": false, "text": "Sharma to Rayudu,1 run,tossed up and he fetches that from outside off and sweeps"}, {"ball": 11.2, "isHighlight": false, "text": "Sharma to Pollard,no run,Pollard skips down the track and has to check his shot on seeing the turn, good bowling"}, {"ball": 11.3, "isHighlight": false, "text": "Sharma to Pollard,no run,frustration getting to him! He was forward looking to force it away but was cramped for room and had to defend it, Pollard nearly kicked the ball away in frustration"}, {"ball": 11.4, "isHighlight": false, "text": "Sharma to Pollard,1 run"}, {"ball": 11.5, "isHighlight": false, "text": "Sharma to Rayudu,1 run,he comes down and lofts it inside out to wide long-off"}, {"ball": 11.6, "isHighlight": false, "text": "Sharma to Pollard,1 run,flatter delivery and he punches it down the pitch just wide of the bowler, good over by Karn keeping Pollard quiet"}, {"ball": 12.1, "isHighlight": false, "text": "Mishra to Pollard, $$FOUR$$ ,that was a very friendly length, this was dragged too short, Pollard was waiting for that to release the pressure, pounded to deep midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Mishra to Pollard, $$SIX$$ ,he is opening up! Mishra tosses it up and Pollard was down the track and lofted it over long-off, and it wasn't timed that well too, raw power"}, {"ball": 12.3, "isHighlight": false, "text": "Mishra to Pollard,no run,and Pollard is beaten for turn as he looks to force it down the ground and the bat flies off his hand and lands behind the keeper"}, {"ball": 12.4, "isHighlight": false, "text": "Mishra to Pollard, $$SIX$$ ,turning out to be a big over! Tossed up and Pollard was down the track and lofted it over long-on"}, {"ball": 12.5, "isHighlight": false, "text": "Mishra to Pollard,1 run,good comeback by Mishra as he bowls the big googly, forces Pollard to check his shot to the off side"}, {"ball": 12.6, "isHighlight": false, "text": "Mishra to Rayudu,2 runs,Rayudu decides to open up as well and sweeps in front of square to deep midwicket"}, {"ball": 13.1, "isHighlight": false, "text": "Sharma to Pollard,1 run,he stays back and punches it to long-on"}, {"ball": 13.2, "isHighlight": false, "text": "Sharma to Rayudu,1 run,he comes down the track and lofts a full toss inside out to wide long-off"}, {"ball": 13.3, "isHighlight": false, "text": "Sharma to Pollard, $$SIX$$ ,heads up! Pollard dishes out the treatment to Sharma now, down the track and sends it over wide long-on"}, {"ball": 13.4, "isHighlight": false, "text": "Sharma to Pollard,1 run,bowls that quicker and he works it wide of square leg"}, {"ball": 13.5, "isHighlight": false, "text": "Sharma to Rayudu, $$FOUR$$ ,Rayudu doesn't want to be left behind! He too skips down the track and lofts down the ground but it's flatter, beats long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Sharma to Rayudu,no run,comes forward and gets an inside edge to the pad as he looks to force it away"}, {"ball": 13.6, "isHighlight": false, "text": "Bhuvneshwar now for damage control"}, {"ball": 14.1, "isHighlight": false, "text": "Kumar to Pollard,1 run,awkward shot by Pollard, this was rising up on him and he stabbed it down to long-off"}, {"ball": 14.2, "isHighlight": false, "text": "Kumar to Rayudu, $$FOUR$$ ,he finds the gap now! This was a short of a length ball and Rayudu was down the track and he smacked it over cover who leapt"}, {"ball": 14.3, "isHighlight": false, "text": "Kumar to Rayudu,1 run,fullish in length outside off and he slogs it to long-on"}, {"ball": 14.4, "isHighlight": false, "text": "Kumar to Pollard,no run,good comeback by the bowler as he fires a yorker outside off and he cannot dig it out"}, {"ball": 14.5, "isHighlight": false, "text": "Kumar to Pollard,1 run,fires that full and he can only drill it down to long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Kumar to Rayudu,no run,good slower ball to end the over, the legcutter and he was squared up"}, {"ball": 14.6, "isHighlight": false, "text": "Irfan brought on to bowl now. Can he keep these two quiet?"}, {"ball": 15.1, "isHighlight": false, "text": "Pathan to Pollard,1 run,comes round the wicket, fires that full and wide outside off and he can only drive it to long-off"}, {"ball": 15.1, "isHighlight": false, "text": "Vijay: \"Dhawan for sure has a lot to learn. Cannot have 2 leg spinners bowling in tandem to batsmen like Rayudu who is an excellent against spin and pollard can use the long handle and more they get used to the pace of the pitch.\""}, {"ball": 15.2, "isHighlight": false, "text": "Pathan to Rayudu,1 wide,over the wicket, this time he strays wide down the leg side, he tries to sweep but gets no bat on it"}, {"ball": 15.2, "isHighlight": false, "text": "Pathan to Rayudu, $$OUT$$ ,the bowling change has worked! Irfan bowls this quite wide outside off and Rayudu has to really fetch that, playing against the line of the ball, he slogs but finds Warner at deep midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Warner$$ $$b$$ $$Pathan$$ $$35$$ $$(57m$$ $$27b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$129.62$$"}, {"ball": 15.2, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 15.2, "isHighlight": false, "text": "Aditya: \"Irfan Pathan pumped up as if he bowled a toe crushing yorker at 155 kmph to get Rayudu.\""}, {"ball": 15.3, "isHighlight": false, "text": "Pathan to Pollard,2 runs,that's a sharp inswinging yorker by Irfan, and Pollard does well to flick it away"}, {"ball": 15.4, "isHighlight": false, "text": "Pathan to Pollard,1 run,full on middle and leg and drilled down to long-on to bring up his fifty"}, {"ball": 15.4, "isHighlight": false, "text": "Prashant: \"Keep a striaghtish mid-off and bowl full and straight to Pollard. Reminded of Pollard c Hayden b Morkel from IPL3 final :)\""}, {"ball": 15.5, "isHighlight": false, "text": "Pathan to Tare,no run,cramped him for room as he chopped it towards the keeper"}, {"ball": 15.6, "isHighlight": false, "text": "Pathan to Tare, $$FOUR$$ ,this was dragged a bit too short and Tare strikes it well, bounces wide of square leg and races away"}, {"ball": 16.1, "isHighlight": false, "text": "Mishra to Pollard, $$SIX$$ ,bowl full tosses to Pollard at your own peril, Pollard just stays there and biffs it over long-off, went a few rows back"}, {"ball": 16.2, "isHighlight": false, "text": "Mishra to Pollard, $$SIX$$ ,is this the over? Tossed up outside off and Pollard stays at the crease, bends and lofts a few rows more over long-off"}, {"ball": 16.3, "isHighlight": false, "text": "Mishra to Pollard, $$SIX$$ ,Three out of three and all in the same place! Tossed up on the off stump and this was lofted flatter and over Sammy's head at long-off"}, {"ball": 16.4, "isHighlight": false, "text": "Mishra to Pollard, $$FOUR$$ ,Mishra comes round the wicket and it doesn't help! Pollard stays forward and biffs it in the air and flat and down the ground, no hope for long-off"}, {"ball": 16.5, "isHighlight": false, "text": "Mishra to Pollard,2 runs,flatter and on the pads and flicked away firmly towards Warner at deep midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Mishra to Pollard,1 wide,Mishra dishes this too wide down the leg side and it's too wide for him to attempt a shot"}, {"ball": 16.6, "isHighlight": false, "text": "Mishra to Pollard,2 runs,Pollard gets down for a premeditated paddle and he places it fine, 27 off the over!"}, {"ball": 16.6, "isHighlight": false, "text": "Mahesh: \"This is going pretty much similar to the match happened between these two teams in the last IPL. Pollard taking Mishra to the cleaners..... \""}, {"ball": 16.6, "isHighlight": false, "text": "Reddy: \"Worst captaincy. Bowlout Steyn and Bhuvi along with Pathan. There is no sense to go with Mishra when Pollard is on top of him.\""}, {"ball": 17.1, "isHighlight": false, "text": "Steyn to Tare,1 run,Steyn comes on and Tare makes room and chops it just wide of cover where Dhawan chases"}, {"ball": 17.1, "isHighlight": false, "text": "Troy: \"What's happened to the new adage: bowl your best bowler to the opposition's best batsman? Why holding back Steyn and Bhuvi?\""}, {"ball": 17.2, "isHighlight": false, "text": "Steyn to Pollard,1 run,that's a top notch delivery, swinging away and quick, yorker length and dug out to the off side"}, {"ball": 17.3, "isHighlight": false, "text": "Steyn to Tare,2 runs,good length outside off and timed the punch well to sweeper cover, the throw is flat to the keeper and Tare is home"}, {"ball": 17.4, "isHighlight": false, "text": "Steyn to Tare, $$OUT$$ ,Tare backs away to give himself room for the big hit, he fetches it high on the body and gets a top edge that goes miles up in the air, the keeper Ojha does the honours"}, {"ball": 17.4, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$†Ojha$$ $$b$$ $$Steyn$$ $$7$$ $$(12m$$ $$5b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 17.5, "isHighlight": false, "text": "Steyn to Pollard,no run,another top notch ball to Pollard, it was too quick and on a yorker length outside off, he can't dig it out"}, {"ball": 17.6, "isHighlight": false, "text": "Steyn to Pollard,no run,and now Steyn bowls it shorter and has the big man weaving backwards, Pollard didn't have room, top over"}, {"ball": 17.6, "isHighlight": false, "text": "Steyn has finished. Here's Bhuvi. That could mean Sammy or Irfan for the final over"}, {"ball": 18.1, "isHighlight": false, "text": "Kumar to Harbhajan Singh,1 run,good yorker on the stumps and he drills it down to long-off to get Pollard on strike"}, {"ball": 18.2, "isHighlight": false, "text": "Kumar to Pollard,1 run,he comes round the wicket and risks bowling a full toss, this was hammered and the umpire Dharmasena did well to duck, long-on was quite straight"}, {"ball": 18.3, "isHighlight": false, "text": "Kumar to Harbhajan Singh,1 wide,returns over the wicket, he bowls the slower ball and it's wide outside off and Harbhajan swings and misses, after a lot of thought Dharmasena gives it a wide"}, {"ball": 18.3, "isHighlight": false, "text": "Kumar to Harbhajan Singh,no run,another swing and a miss, although off a straighter ball"}, {"ball": 18.4, "isHighlight": false, "text": "Kumar to Harbhajan Singh, $$OUT$$ ,the captain's done the honors, this was fired in full on the stumps, he made room to slam that wide of cover but ended up smacking it to Dhawan at cover"}, {"ball": 18.4, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$c$$ $$Dhawan$$ $$b$$ $$Kumar$$ $$1$$ $$(5m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 18.4, "isHighlight": false, "text": "Mumbai need Pollard on strike as much as possible. Bhuvi backs away before delivery, Gautam was looking to paddle it"}, {"ball": 18.5, "isHighlight": false, "text": "Kumar to Gautam, $$FOUR$$ ,not a bad start at all! This was swinging in wide outside the leg stump and Gautam had made a lot of room and yet managed to drive that inside out wide of cover, take that for placement"}, {"ball": 18.6, "isHighlight": false, "text": "Kumar to Gautam,no run,Gautam shuffles across his stumps and looks to play the ramp shot and ends up placing it to Mishra at short fine leg and they don't take the single"}, {"ball": 18.6, "isHighlight": false, "text": "20 needed and it's Pathan"}, {"ball": 19.1, "isHighlight": false, "text": "Pathan to Pollard, $$OUT$$ ,inside edge! Irfan bowls round the wicket and swings it towards the stumps, Pollard looks to swipe it across the line but gets an inside edge onto the stumps, Pathan's animated and Mumbai have lost their best hope"}, {"ball": 19.1, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$b$$ $$Pathan$$ $$78$$ $$(69m$$ $$48b$$ $$3x4$$ $$6x6)$$ $$SR:$$ $$162.50$$"}, {"ball": 19.1, "isHighlight": false, "text": "Uzair : \"Look at Pathan there, trying to imitate the Cristiano Ronaldo celebration after knocking off Pollard, was he watching the champions league semi-finals last night, a great inspiration\""}, {"ball": 19.2, "isHighlight": false, "text": "Pathan to Khan,1 run,low full toss swinging in on the leg stump and he swings it to deep midwicket"}, {"ball": 19.2, "isHighlight": false, "text": "Irfan backs away before delivery"}, {"ball": 19.3, "isHighlight": false, "text": "Pathan to Gautam,no run,good bowling again, this was full and wide outside off and Gautam can't dig it out"}, {"ball": 19.3, "isHighlight": false, "text": "3 big hits needed"}, {"ball": 19.4, "isHighlight": false, "text": "Pathan to Gautam,1 leg bye,just a leg bye, not enough, full and the ball rolls to the off side"}, {"ball": 19.5, "isHighlight": false, "text": "Pathan to Khan,1 bye,another good inswinging yorker which just missed the leg stump, good take there by Ojha"}, {"ball": 19.6, "isHighlight": false, "text": "Pathan to Gautam,1 bye,and Irfan bowls a super last over! This was a loopy full toss and he swings and misses., Irfan leaps and celebrates with his captain Dhawan"}, {"ball": 19.6, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.6, "isHighlight": false, "text": "$$Dhawan$$ : \"Really tight. Bowlers bowled really well under pressure, especially Irfan and Bhuvi. I thought of Irfan bowling the last over and getting the main bowlers to pick up the wickets. Finding the groove now. The pitches here in the UAE have been very nice.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Bhuvneshwar$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ : \"I was looking to bowl well with the new ball. Steyn is mentoring us very well. Against Pollard my plan was to bowl him the yorker. Swing is my strength and that was how I got Rohit.\""}, {"ball": 19.6, "isHighlight": false, "text": "That's it from us here. Thankfully it didn't stretch like yesterday. Thanks for your company. Most of you guys can look forward to seeing your teams in the flesh for the next month with the IPL returning to India. Have fun and keep partying. Good night!"}, {"ball": 19.6, "isHighlight": false, "text": "$$End$$ $$of$$ $$match$$ : That's 5 defeats in a row for the defending champions, the opposite of what Kings XI achieved. It was down to Pollard but there was only so much he could do on his own. Sachin Tendulkar smiles as the players shake hands but he must be hurting on the inside."}, {"ball": 19.6, "isHighlight": false, "text": "$$Rohit$$ $$Sharma$$ : \"We spoke about trying to get wickets and in the last five overs a big score was on the cards. We fielded first because we wanted to see what we needed to chase. We've got to win all the games from here on. Let's see what we can do in home conditions. We just have to stay positive, that's all I can say. Not a great birthday for me (smiles).\""}], "name": "Mumbai Indians v Sunrisers Hyderabad", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729317.html?innings=2;view=commentary", "match_num": 20}