{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$9.40pm$$  Enough of the waiting, it's time to play. The umpires walk in, as do Dwayne Smith and Brendon McCullum. It's Smith on strike, and Shakib Al Hasan has the new ball."}, {"ball": 0, "isHighlight": false, "text": "And yes, there's a correction. It's two bowlers allowed four overs each."}, {"ball": 0, "isHighlight": false, "text": "Priyatham: \"In a 17 over match, I dont understand how 3 bowlers can bowl a max of 4 overs each....Shudn't that be 2 bowlers max of 4 overs?\" Lots of commenters asking the same question, and there's been a bit of debate about that here in office as well, but the news we've got is that three bowlers will be allowed to bowl four overs."}, {"ball": 0, "isHighlight": false, "text": "$$9.30pm$$  We will have a game. It will be 17 overs a side, and it will start at 9.40pm. The powerplay will last five overs, and three bowlers can bowl a maximum of four overs each."}, {"ball": 0, "isHighlight": false, "text": "$$9.20pm$$  Players, we are informed, are warming up. Unconfirmed reports say it will be a Seventeen17 game."}, {"ball": 0, "isHighlight": false, "text": "$$9.10pm$$  Word is in that covers are off and there will be another inspection at 9.15pm."}, {"ball": 0, "isHighlight": false, "text": "Waseem isn't too optimistic: \"I am from Ranchi; and its still drizzling... once it starts here in evening time it keeps on pouring for whole night.... forget about a game today....\""}, {"ball": 0, "isHighlight": false, "text": "$$9.05pm$$  News from the middle, according to the presenters at the studio, is \"slightly unclear\"."}, {"ball": 0, "isHighlight": false, "text": "baggu: \"I m a localite at ranchi , jus to update u all dat it's still drizzling :((\""}, {"ball": 0, "isHighlight": false, "text": "$$9.00pm$$  Since there's little else to do at this point, why not delve into Cricinfo's archives, and ponder this question: Should Twenty20 have a  $$specialised$$ $$rain$$ $$rule$$ ?"}, {"ball": 0, "isHighlight": false, "text": "Snehil: \"Well,some of the indian quickies that performed well in UAE may go back to being mediocre...cant say the same about Bhuvi...he is very effective in these indian conditions..seeing he is already in the top 5 leading wicket takers,he is a serious contender for the purple cap this season.\""}, {"ball": 0, "isHighlight": false, "text": "$$8.40pm$$  The rain seems to have stopped, and the umpires have come out for an inspection. No other updates just yet."}, {"ball": 0, "isHighlight": false, "text": "Zak Bagans: \"@Hitesh: Not unfair at all!! We just have to think that he lost the toss and the other team got the advantage. If we start focusing on these petty issues, we might lose the spirit of winning and losing!\""}, {"ball": 0, "isHighlight": false, "text": "Ahaan: \"Then, why don't you ask Sidharth Monga about the weather?\" I have done that, and he has replied: \"very thin drizzle\"."}, {"ball": 0, "isHighlight": false, "text": "Hitesh: \"Considering it was drizzling at the time, shouldn't the toss have been pushed back too? Seems unfair to make the winning captain bat based on what he thought would be a 20 over game. Not the same as having an interruption midway through the game.\""}, {"ball": 0, "isHighlight": false, "text": "$$8.30pm$$  While you wait for the game to start, why not give  $$CricIQ$$  a go? You could end up flying to Lord's to watch India play England."}, {"ball": 0, "isHighlight": false, "text": "manu: \"Any word on when is the match starting???is it still raining\" For now, all we are getting from the broadcasters is a scrolling update saying the match is delayed, and advising viewers to stay tuned for updates. We advise you to do the same."}, {"ball": 0, "isHighlight": false, "text": "paramasivan nav: \"what all the possible over cut for the match if it begins from now\" If it begins right now, it will remain a full Twenty20 game. Overs generally start getting chopped when the start is delayed by an hour or more."}, {"ball": 0, "isHighlight": false, "text": "Sree has what seems a logical answer for anyone wondering about Kolkata's changes: \"Ranchi is a small ground and a flat track, so KKR has gone in with Russel and Yusuf who are power hitters. At the same time, they have cut down on genuine pace so that it is tougher to hit sixes, and will instead rely on slower bowling.\""}, {"ball": 0, "isHighlight": false, "text": "\"Rain Rain Go Away, Come again Mumbai day, this will change their fate,first points they will get.\" Dhawal Atrey has clearly had better days with his sense of rhyme and meter."}, {"ball": 0, "isHighlight": false, "text": "Umesh K: \"MAC Stadium, Chepauk, Chennai would have given perfect start to the Indian leg of IPL7... No rain for Months here. Not sure why they preferred Ranchi to start? Elections over at Chennai too. \""}, {"ball": 0, "isHighlight": false, "text": "\"So if I change my fantasy team now, will it be valid for this game?\" Sorry, Aalok. You can only do that before the scheduled start of play. And no, Vishal Janani. Your transfers won't be reversed if the match is washed out."}, {"ball": 0, "isHighlight": false, "text": "$$8.15pm$$  For anyone who has just tuned in, and is wondering about the lack of activity around these parts, the start of the match has been  $$delayed$$ $$by$$ $$rain$$ ."}, {"ball": 0, "isHighlight": false, "text": "Varun: \"Can we go back to the UAE?\""}, {"ball": 0, "isHighlight": false, "text": "Idrees Kanchwal: \"Dont understand KKR's tactics here. No genuine pace bowler in the XI. Bisla dropped after one game. Dont think Uthapa and Yusuf have that game in them which they had before. I'd rather make Yadav bat higher and play Lynn in place of Russell and get in Yadav instead. \""}, {"ball": 0, "isHighlight": false, "text": "Kris aims a cheeky shot at Tamil Nadu fans. \"Manhas is the Badrinath of Delhi, except he has won the Ranji Trophy.\""}, {"ball": 0, "isHighlight": false, "text": "$$8.05pm$$  We'll bring you updates as they keep coming in, but first up, the worst-case scenario. The latest the match can begin is 11.10pm, in which case it will be shortened to five overs a side."}, {"ball": 0, "isHighlight": false, "text": "$$8.00pm$$  We should have had the players walking in now. What we've got instead is super slo-mo shots from the stadium, of groundstaff bringing covers into the field."}, {"ball": 0, "isHighlight": false, "text": "venki: \"Come on Dhoni - what is Mahnas doing in the squad. Just a filler in that position. Atleast you can give chance to youngster like Aparajit or Vijay Shankar. \""}, {"ball": 0, "isHighlight": false, "text": "Ahaan: \"@Jason: I don't know about playing less than 4, but, MI were allowed to play 5 in the CLT20 2012, probably as many of their players were injured.\""}, {"ball": 0, "isHighlight": false, "text": "Another scorecard for you, Jason, dug up by the people at the office. Mumbai playing with  $$only$$ $$three$$ $$overseas$$ $$players$$  in the 2012 season."}, {"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  There's lightning and what appears to be heavy rain, but the presenter in the studio says those are pictures from earlier. The curator at the stadium says the rain won't persist for too long, and that the start should only be delayed by around 15 minutes."}, {"ball": 0, "isHighlight": false, "text": "\"Has any team played with less than the 4 overseas player in all these years of IPL history?....\" It's happened, Jason. Can't say how many times, but I can tell you  $$Kolkata$$ $$did$$ $$it$$  in the opening game of the 2011 season, when they only had Eoin Morgan and Jacques Kallis."}, {"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  Kolkata have Morne Morkel, Umesh Yadav and Pat Cummins in their squad. All three can bowl upwards of 90mph. All three are on the bench today."}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm$$  Sidharth Monga, our man at the JSCA Stadium, has this update: \"The rain has eased but a drizzle is still on. Only the square is covered. Thunder heard and lightning seen. This is at 7.46pm.\""}, {"ball": 0, "isHighlight": false, "text": "\"The top 10 run getters list for this season has only 2 Indian Batsman. But the top 10 wicket takers list has 7 Indian Bowlers. Has the UAE leg gotten the best out of Indian bowlers and the worst out of the Indian Batsmen?\" Certainly looks like it, Karthik. Will the India leg see a reversal?"}, {"ball": 0, "isHighlight": false, "text": "\"Why replace Bravo? What happened to him? What did I miss?\" He injured himself while fielding against Punjab, Nishanth."}, {"ball": 0, "isHighlight": false, "text": "Vishnu Valsalan: \"Still cant understand why kuldeep yadav is not getting an oppertunity.... i think kkr dont want that mystery in their bowling as they are getting mystery with yusuf in their selection\""}, {"ball": 0, "isHighlight": false, "text": "More on the Bravo query, from Soham Samaddar: \"MI signed Dwayne Smith in 2012 as a replacement for an injured Mitchell Johnson but he played for them for 2 seasons.\" Don't see how that's an issue as long as the team didn't go over their spending limit or their limit on overseas signings."}, {"ball": 0, "isHighlight": false, "text": "Barath: \"IPL moves from UAE to India. That means: Noisier crowds,Pitches similar to Danny Morrison's head (no offence), The likes of Raina,Rohit,Shikar and GG finding form and cracking into the list of contenders for orange cap and spinners dominating the purple cap contenders list. Varun Aaaron,Ishwar Pandey and Mohit will probably go back to being \"not so effective\" fast bowlers.\""}, {"ball": 0, "isHighlight": false, "text": "Vijay Anna Fan : \"Surprised seeing Bisla not in team . The only team against whom he plays too good is against CSK . Cannot forget the final still , posting 190 in a final and getting thrashed by a local guy .\""}, {"ball": 0, "isHighlight": false, "text": "chibi: \"KKR made a big mistake by dropping Morkel.. He's the only one who would have taken on smith and McCullum during the powerplay overs. \""}, {"ball": 0, "isHighlight": false, "text": "\"The Ipl Technical Committee has approved that csk can replace bravo. If they replace they cant sign him for next season?\" Bravo is contracted for two seasons, Kaushik. His replacement, I guess, will get a contract for this season alone."}, {"ball": 0, "isHighlight": false, "text": "$$7.35pm$$  Interesting decision, that, to leave out Morne Morkel. He went for 40 in his four overs against Rajasthan, but bowled pretty well in all their other games. Russell, meanwhile, will make his first appearance this season."}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  Toss time! MS Dhoni calls the UAE leg 'fantastic' but says nothing beats the feeling of being back home. Gautam Gambhir, says, nothing can compare to the feeling of becoming a parent."}, {"ball": 0, "isHighlight": false, "text": "Uh, oh. There seem to be a few spots of rain in the air, during the captains' interviews."}, {"ball": 0, "isHighlight": false, "text": "It's tails, and Chennai have won the toss. Dhoni will bat, on a 'good-looking wicket', but says the team are a bit confused by the rain, and hope it stays away. Chennai are unchanged."}, {"ball": 0, "isHighlight": false, "text": "Kolkata have made two changes, bringing in Andre Russell for Morne Morkel, and Yusuf Pathan for Manvinder Bisla, which probably means Robin Uthappa will wear the big gloves again."}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$  Hello and welcome to the first match of the IPL's India leg, between Chennai Super Kings and Kolkata Knight Riders in Ranchi. I'm your commentator for the game, Karthik Krishnaswamy."}, {"ball": 0, "isHighlight": false, "text": "It's a home game for Chennai, in the hometown of their captain MS Dhoni, against a team that played two home games at the same venue last season. Try and work your head around that. Last year, Kolkata  $$beat$$ $$Bangalore$$  in a low-scoring game here, and then, three days later,  $$lost$$ $$a$$ $$high-scoring$$ $$game$$  to Pune Warriors. Not much, therefore, can be read into those two games, in terms of pattern."}, {"ball": 0, "isHighlight": false, "text": "This season, Chennai have been unstoppable, except for one occasion when they ran into Glenn Maxwell, while Kolkata are one of four teams with two wins in five games. Only net run rate separates Kolkata in fourth from second-from-bottom Delhi Daredevils. The result of this match, therefore, could swing their season dramatically, one way or the other."}, {"ball": 0, "isHighlight": false, "text": "Kolkata's captain Gautam Gambhir hasn't had a good season by any stretch of the imagination, but he won't be too worried about that right now. He became the father of a baby girl yesterday. News is that he will play today's match."}, {"ball": 0, "isHighlight": false, "text": "For more thoughts on today's game, read this  $$preview$$  by Abhishek Purohit."}, {"ball": 0, "isHighlight": false, "text": "The IPL is back home after a memorable ride through the UAE, which you can relive by reading  $$this$$ $$review$$ ."}, {"ball": 0, "isHighlight": false, "text": "Will the change in venue bring more cheer to the tournament's  $$struggling$$ $$opening$$ $$batsmen$$ , and will these  $$big-name$$ $$bench-warmers$$  finally get a game?"}, {"ball": 0, "isHighlight": false, "text": "Who are the only players to make 50s in IPL games at Ranchi?  $$Head$$ $$here$$  if you know the answer (and even if you don't)."}, {"ball": 0, "isHighlight": false, "text": "The IPL moves to India - smaller grounds, a little more turn, a few more boundaries, and perhaps a new set of stars. Have you revamped your  $$Cricinfo$$ $$Fantasy$$ $$XI$$  yet. There are robots to be won..."}, {"ball": 0.1, "isHighlight": false, "text": "Shakib Al Hasan to Smith,no run,Leg and middle, on a good length. Smith plays it cautiously back to the bowler."}, {"ball": 0.2, "isHighlight": false, "text": "Shakib Al Hasan to Smith,no run,Tries to sweep, misses, muted appeal for lbw, would have slid down leg."}, {"ball": 0.3, "isHighlight": false, "text": "Shakib Al Hasan to Smith, $$FOUR$$ ,Drifts down the leg side, swept away powerfully behind square."}, {"ball": 0.4, "isHighlight": false, "text": "Shakib Al Hasan to Smith,1 run,angling in towards the pads, worked away down to long-on."}, {"ball": 0.4, "isHighlight": false, "text": "Gokul: \"Should n't we not have the Strategic Time Out and make it a say 18 over game . Thats what atleaset most fans would want.\""}, {"ball": 0.5, "isHighlight": false, "text": "Shakib Al Hasan to McCullum, $$FOUR$$ ,drifting onto the pads once again, and McCullum is on his way with a fine glance. Not good bowling when you have fine leg in the circle."}, {"ball": 0.6, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,better line, on middle, defended down to the bowler."}, {"ball": 0.6, "isHighlight": false, "text": "Ooh. It's Narine."}, {"ball": 1.1, "isHighlight": false, "text": "Narine to Smith, $$FOUR$$ ,shot! It's on leg stump, and continues further down that angle, but Smith pulls out the reverse-sweep nonetheless."}, {"ball": 1.2, "isHighlight": false, "text": "Narine to Smith,no run,back of a length, straightens, defended off the back foot."}, {"ball": 1.3, "isHighlight": false, "text": "Narine to Smith,no run,same line, fuller, defended off the front foot."}, {"ball": 1.4, "isHighlight": false, "text": "Narine to Smith,1 run,batsman waits on it this time, allows it to turn in, plays it down to long on."}, {"ball": 1.5, "isHighlight": false, "text": "Narine to McCullum,no run,Straightens from off stump. McCullum plays it watchfully off the back foot towards the covers."}, {"ball": 1.6, "isHighlight": false, "text": "Narine to McCullum,no run,Turns in this time, McCullum tries to force it behind square, hits it straight to point."}, {"ball": 1.6, "isHighlight": false, "text": "lovely ball, flighted, spins away, Smith tries to go after it and misses, and overbalances as well. Keeper has the bails off, but the umpire signals dead ball! Shakib's towel had fallen out of his waistband during his run-up! No replays from a side-on angle, but I suspect Smith's foot was out of his crease."}, {"ball": 2.1, "isHighlight": false, "text": "Shakib Al Hasan to Smith,no run,nudged to square leg"}, {"ball": 2.2, "isHighlight": false, "text": "Shakib Al Hasan to Smith, $$SIX$$ ,similar ball to that dead ball, but Smith stays balanced and hits it cleanly over the long off boundary."}, {"ball": 2.3, "isHighlight": false, "text": "Shakib Al Hasan to Smith, $$OUT$$ ,he's got him, after all! tries to sweep, misses. Ball straightens and hits his back pad, in front of the stumps. That looked plumb."}, {"ball": 2.3, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$lbw$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$16$$ $$(8m$$ $$11b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$145.45$$"}, {"ball": 2.3, "isHighlight": false, "text": "In comes Raina now."}, {"ball": 2.4, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,Length ball, kept a bit low. Raina jams his bat down to hit it towards square leg."}, {"ball": 2.5, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,defended watchfully into the off side."}, {"ball": 2.6, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,pushed down the ground to mid-off."}, {"ball": 2.6, "isHighlight": false, "text": "What an eventful over that was! Here's Narine, once again."}, {"ball": 3.1, "isHighlight": false, "text": "Narine to McCullum,2 runs,turns away from McCullum, finds his outside edge as he plays it off the back foot. Ball squirts away between point and short third man."}, {"ball": 3.2, "isHighlight": false, "text": "Narine to McCullum, $$FOUR$$ ,turn for Narine, but McCullum is in position really early to pull it away powerfully over midwicket."}, {"ball": 3.3, "isHighlight": false, "text": "Narine to McCullum,2 runs,big, sharp turn, and the ball jams off the inside edge behind square on the leg side. Fielder hits the stumps direct at the bowler's end, but Raina is well in."}, {"ball": 3.4, "isHighlight": false, "text": "Narine to McCullum,1 run,Turned away into the midwicket region, off the back foot."}, {"ball": 3.4, "isHighlight": false, "text": "Slip comes in for the left-hander."}, {"ball": 3.5, "isHighlight": false, "text": "Narine to Raina,no run,huge turn, there. Raina thinks about playing it, but pulls his bat out of the way as it screams past his edge."}, {"ball": 3.6, "isHighlight": false, "text": "Narine to Raina,no run,swept straight to square leg."}, {"ball": 3.6, "isHighlight": false, "text": "this looks like a raging turner. We didn't have any of those in the UAE!"}, {"ball": 4.1, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,Full, on leg stump. McCullum defends inside-out."}, {"ball": 4.2, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,goes with the arm this time, played away uncertainly towards square leg, off the inside half of the bat."}, {"ball": 4.3, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,comes down the track, taken on the full, flicked straight to deep midwicket."}, {"ball": 4.4, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,down the track, not anywhere near the pitch, jams down on the ball straight to the bowler."}, {"ball": 4.5, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,back and across, tennis-style swat down to long off."}, {"ball": 4.6, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,down the pitch once more, driven hard but straight to long-on."}, {"ball": 4.6, "isHighlight": false, "text": "Vikram: \"Doesn't Nigel Llong look a lot like the nerdy brother from two and a half men?\"Piyush Chawla is on for Narine. Can the legspinner get as much from this wicket as the fingerspinners have done?"}, {"ball": 5.1, "isHighlight": false, "text": "Chawla to Raina, $$FOUR$$ ,Skids through with the arm, not that short, but Raina goes deep in his crease and guides it  nicely behind point."}, {"ball": 5.2, "isHighlight": false, "text": "Chawla to Raina,no run,similar length, straighter, defended off the back foot."}, {"ball": 5.3, "isHighlight": false, "text": "Chawla to Raina, $$FOUR$$ ,Short ball, similar shot from Raina to the first ball, fielded on the slide by Yusuf Pathan at deep point. Oh, hang on. He's touched the rope with his foot as he did so."}, {"ball": 5.4, "isHighlight": false, "text": "Chawla to Raina,2 runs,Another shortish ball, another ball chopped down to the off-side sweeper."}, {"ball": 5.4, "isHighlight": false, "text": "rpolimetla: \"GG's captaincy is just awesome...good thinking to attack on Smith with spin right from first over\""}, {"ball": 5.5, "isHighlight": false, "text": "Chawla to Raina,no run,Bit of turn here, legbreak, Raina gives himself room but has to adjust quickly to pat it to safety."}, {"ball": 5.6, "isHighlight": false, "text": "Chawla to Raina,no run,width, Raina is on the back foot once more, hits it with a straight bat to cover."}, {"ball": 5.6, "isHighlight": false, "text": "First sign of pace. Vinay Kumar is into the attack."}, {"ball": 6.1, "isHighlight": false, "text": "Vinay Kumar to McCullum,no run,Bit of shape away. McCullum goes back, cuts to point."}, {"ball": 6.2, "isHighlight": false, "text": "Vinay Kumar to McCullum,no run,Short ball, good carry, keeps rising as it passes McCullum's head. Tries to pull, but misses."}, {"ball": 6.3, "isHighlight": false, "text": "Vinay Kumar to McCullum,1 leg bye,Angled towards leg, McCullum is hit on the pad as he misses the flick."}, {"ball": 6.4, "isHighlight": false, "text": "Vinay Kumar to Raina,no run,Angled across Raina, who opens his bat face and tries to steer it behind point. Hits it to the fielder."}, {"ball": 6.5, "isHighlight": false, "text": "Vinay Kumar to Raina,1 run,Bit of shape towards Raina's pads, worked to deep midwicket."}, {"ball": 6.6, "isHighlight": false, "text": "Vinay Kumar to McCullum, $$SIX$$ ,short ball on off stump, McCullum is waiting for precisely that. Pulls it remorselessly over the deep midwicket boundary."}, {"ball": 7.1, "isHighlight": false, "text": "Chawla to Raina,2 runs,Turn for Chawla, but his length is still too short. Raina gets it down to long off, plays with a straight bat."}, {"ball": 7.2, "isHighlight": false, "text": "Chawla to Raina,1 run,Full, on leg stump, may have been a googly, but Raina is untroubled as he pushes down to long on."}, {"ball": 7.3, "isHighlight": false, "text": "Chawla to McCullum, $$FOUR$$ ,Short again, and McCullum never misses out on those. In position early to pull well wide of deep midwicket."}, {"ball": 7.4, "isHighlight": false, "text": "Chawla to McCullum,no run,Slower, fuller, legbreak. McCullum is drawn forward and beaten by the turn."}, {"ball": 7.4, "isHighlight": false, "text": "There's turn, and the odd ball is keeping low as well."}, {"ball": 7.5, "isHighlight": false, "text": "Chawla to McCullum,1 run,Skids on from outside off. McCullum cuts it to deep point."}, {"ball": 7.6, "isHighlight": false, "text": "Chawla to Raina,no run,defended solidly off the front foot."}, {"ball": 7.6, "isHighlight": false, "text": "Who do we have now? It's still Vinay Kumar."}, {"ball": 7.6, "isHighlight": false, "text": "Strategic timeout now. Lots of commenters have wondered if that could have been done away with, and another over made up that way."}, {"ball": 7.6, "isHighlight": false, "text": "bks: \"Hoped to see Narine vs Badree today.. When are CSK gonna use him??\" Badree would have enjoyed bowling on this pitch, you imagine."}, {"ball": 7.6, "isHighlight": false, "text": "Sam: \"KKR have an advantage in chasing here. CSK have only two established spinners. GG and Kallis will have to prove their responsibility though.\""}, {"ball": 8.1, "isHighlight": false, "text": "Vinay Kumar to McCullum,2 runs,short again, pulled again, but he hasn't hit it too well. Deep square leg runs around to his left to cut it off at the rope."}, {"ball": 8.2, "isHighlight": false, "text": "Vinay Kumar to McCullum,2 runs,not that short this time, but McCullum pulls again, and pulls well, square. Deep square leg doesn't have as much running to do this time."}, {"ball": 8.3, "isHighlight": false, "text": "Vinay Kumar to McCullum, $$FOUR$$ ,Vinay keeps bowling short, McCullum keeps pulling. He finds the gap this time, as anyone will given so many opportunities to play the same shot. Ball bounces just short of the rope."}, {"ball": 8.4, "isHighlight": false, "text": "Vinay Kumar to McCullum, $$FOUR$$ ,Vinay is bowling like a bowling machine set to 'short'. McCullum pulls a little later, and it goes fine for another boundary."}, {"ball": 8.5, "isHighlight": false, "text": "Vinay Kumar to McCullum,no run,fuller, McCullum makes room to push it into the covers."}, {"ball": 8.6, "isHighlight": false, "text": "Vinay Kumar to McCullum,1 run,shortish, on off stump this time. Played down to deep point with an open bat-face."}, {"ball": 8.6, "isHighlight": false, "text": "Chawla again. Can he hit a better length now?"}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to McCullum,1 run,Short, bit of turn, McCullum hits it airily, on the bounce, to deep point."}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Raina, $$SIX$$ ,down the pitch, it's just a chip with a straight bat but it flies way over the straight boundary."}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Raina,1 run,worked away down to long on."}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to McCullum,1 run,full, wide, lovely drive, cut off by long-off."}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to Raina, $$FOUR$$ ,short ball, Raina goes back in his crease, flips his wrists over, and the ball splits deep midwicket and long on."}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Raina,no run,jumps down the track, tries to defend but misses, ball goes off Raina's front pad into the off side."}, {"ball": 9.6, "isHighlight": false, "text": "This is a helpful pitch, with sharp turn and indifferent bounce. Kolkata haven't bowled well so far. Here's Shakib."}, {"ball": 10.1, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,Full, on leg stump. Driven down to long on."}, {"ball": 10.2, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,Quick, flat, fired across the left-hander, who tries to heave and misses."}, {"ball": 10.3, "isHighlight": false, "text": "Shakib Al Hasan to Raina, $$FOUR$$ ,Full again, Raina makes room and places it perfectly with a full face to cover's left, screams to the ropes."}, {"ball": 10.4, "isHighlight": false, "text": "Shakib Al Hasan to Raina, $$OUT$$ ,he's gone! comes down the track and hits a full-toss straight down the throat of long-on. He seemed to cramp himself for room, and didn't get a free swing of his arms."}, {"ball": 10.4, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Yadav$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$31$$ $$(36m$$ $$25b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$124.00$$"}, {"ball": 10.4, "isHighlight": false, "text": "Massive cheer as MS Dhoni walks out for his first IPL game on his home ground."}, {"ball": 10.5, "isHighlight": false, "text": "Shakib Al Hasan to Dhoni,1 leg bye,plonks his front foot down, but waits on the ball before nurdling it square on the leg side."}, {"ball": 10.6, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,full, wide, driven to the left of long-off."}, {"ball": 10.6, "isHighlight": false, "text": "Jacques Kallis into the attack now."}, {"ball": 10.6, "isHighlight": false, "text": "Jay: \"The amount of support and noise for Dhoni today.. from Ranchi... it feels more like Ranchi Super Kings playing today!! :) :) \""}, {"ball": 10.6, "isHighlight": false, "text": "madhu: \"Can we give yellow jersey to Raina while playing for India?\""}, {"ball": 11.1, "isHighlight": false, "text": "Kallis to McCullum,1 run,slower ball, off-cutter, McCullum waits on it and opens his bat-face to dink it into the off side."}, {"ball": 11.2, "isHighlight": false, "text": "Kallis to Dhoni,1 run,Another off-cutter, back of a length, cut away down to deep point."}, {"ball": 11.3, "isHighlight": false, "text": "Kallis to McCullum,no run,driven firmly to mid-off."}, {"ball": 11.4, "isHighlight": false, "text": "Kallis to McCullum, $$SIX$$ ,short, pulled, six. Have we seen this somewhere? That shot brings up fifty for McCullum."}, {"ball": 11.5, "isHighlight": false, "text": "Kallis to McCullum,1 run,full, outside off, pushed towards cover point."}, {"ball": 11.6, "isHighlight": false, "text": "Kallis to Dhoni,1 run,off-cutter again. Dhoni walks across his stumps and helps it to short fine leg."}, {"ball": 11.6, "isHighlight": false, "text": "It's time for another time-out. Thirty of McCullum's 51 runs, incidentally, have come in the midwicket region. Tells you all you need to know."}, {"ball": 11.6, "isHighlight": false, "text": "rssampat: \"Bowl short on a helpful pitch and give away riskfree easy bounaries and Sixer's seems to the strategy for the KKR today. \""}, {"ball": 11.6, "isHighlight": false, "text": "Aayush: \"Those pull shots from McCullum remind me of his iconic 158 in the First ever IPL match. What a day it was!\""}, {"ball": 12.1, "isHighlight": false, "text": "Vinay Kumar to Dhoni,1 run,Length ball outside off. Dhoni stays back, tries to heave across the line, gets an inside edge into the leg side."}, {"ball": 12.2, "isHighlight": false, "text": "Vinay Kumar to McCullum,1 run,comes forward, pokes it into the off side with an open face."}, {"ball": 12.2, "isHighlight": false, "text": "Maximus: \"Chennai openers now have scored 500 runs this season and this is just the 6th game! Pretty phenomenal!\""}, {"ball": 12.3, "isHighlight": false, "text": "Vinay Kumar to Dhoni,2 runs,short, wide, Dhoni hits it on the jump wide of long-off, in typical Dhoni fashion."}, {"ball": 12.4, "isHighlight": false, "text": "Vinay Kumar to Dhoni,1 run,full toss outside off stump. Dhoni goes back and across, punches it down to long-off."}, {"ball": 12.5, "isHighlight": false, "text": "Vinay Kumar to McCullum,no run,Short, and McCullum's eyes light up, but it's a slower ball. Much slower than he expected, and he's through the pull shot before the ball even reaches him. Ball rolls down to the keeper."}, {"ball": 12.6, "isHighlight": false, "text": "Vinay Kumar to McCullum,1 run,Short again, but no room for those arms to swing, hit weakly to long-on."}, {"ball": 12.6, "isHighlight": false, "text": "Here's Narine, for his third."}, {"ball": 13.1, "isHighlight": false, "text": "Narine to McCullum,1 run,Not that short, offbreak, McCullum pulls anyway down to deep midwicket."}, {"ball": 13.2, "isHighlight": false, "text": "Narine to Dhoni,1 run,shortish, wide outside off, straightens a touch. Chopped to deep point."}, {"ball": 13.3, "isHighlight": false, "text": "Narine to McCullum,1 run,stays back, opens the face, steers it to short third man."}, {"ball": 13.4, "isHighlight": false, "text": "Narine to Dhoni,1 run,Dhoni comes forward, gets a thickish leading edge to cover as the ball straightens off the pitch."}, {"ball": 13.5, "isHighlight": false, "text": "Narine to McCullum,1 run,slower, tossed up a touch, swept to deep square leg."}, {"ball": 13.6, "isHighlight": false, "text": "Narine to Dhoni,1 run,sharp turn, but Dhoni is back to push it gently into the covers."}, {"ball": 13.6, "isHighlight": false, "text": "In comes Russell, for his first over of the tournament."}, {"ball": 14.1, "isHighlight": false, "text": "Russell to Dhoni, $$FOUR$$ ,Full, on off stump, Dhoni opens his front foot a touch and swivels powerfully through the shot to send it skimming straight back past the bowler. Lots of bottom-hand there."}, {"ball": 14.2, "isHighlight": false, "text": "Russell to Dhoni,1 leg bye,slower ball, struck on the pads as he tried to pull. No one appealed"}, {"ball": 14.3, "isHighlight": false, "text": "Russell to McCullum, $$OUT$$ ,Russell strikes! full ball, wide of off stump, McCullum goes low and slashes, but it slices off his bat and straight into the hands of deep point."}, {"ball": 14.3, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Pathan$$ $$b$$ $$Russell$$ $$56$$ $$(66m$$ $$40b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja is in, but the batsmen crossed over. Dhoni on strike."}, {"ball": 14.4, "isHighlight": false, "text": "Russell to Dhoni,no run,short, wide of off stump, rising. Dhoni slashes and misses."}, {"ball": 14.5, "isHighlight": false, "text": "Russell to Dhoni,1 run,slower ball, pulled to deep midwicket."}, {"ball": 14.6, "isHighlight": false, "text": "Russell to Jadeja, $$SIX$$ ,Full, straight, Jadeja leans back to make himself space to shovel the ball way over deep midwicket. Shot!"}, {"ball": 14.6, "isHighlight": false, "text": "Surendranadh V: \"Are you kidding me? Jadeja is a better striker of the ball than du Plesis?\" That wasn't too bad a shot first up, was it?"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Dhoni,1 run,Nurdled square on the leg side off the back foot."}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Jadeja,no run,straight, skids on, beats Jadeja for pace as he tries to flick and hits his front pad. Inside-edge, possibly, and no one appeals."}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Jadeja,2 runs,Comes a couple of steps down the pitch, chips it over cover."}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Jadeja,1 run,driven straight to cover and runs, Suryakumar Yadav throws to the bowler, who fumbles. Direct hit would have had Jadeja struggling."}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Dhoni,1 run,Goes back, pushes it carefully to midwicket."}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Jadeja,1 no ball,he's gone! middle and leg, straightens, Jadeja thrusts his front foot across, and has to play around his front pad. Struck plumb in front. But wait! They check for the no ball, and his front foot is well in front of the crease."}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Jadeja,1 leg bye,Free hit. Jadeja swings at a leg-stump ball and misses, ball goes off his pad behind square leg."}, {"ball": 15.6, "isHighlight": false, "text": "Russell to bowl the last over."}, {"ball": 16.1, "isHighlight": false, "text": "Russell to Jadeja,1 run,Shortish ball on off stump, Jadeja swats it down to long off."}, {"ball": 16.2, "isHighlight": false, "text": "Russell to Dhoni, $$SIX$$ ,Full, wide, and Dhoni swings viciously through the line, bringing his bottom hand into play to send the ball soaring over long off."}, {"ball": 16.3, "isHighlight": false, "text": "Russell to Dhoni,1 leg bye,walks across to a back of a length ball outside off, tries to swat it into the leg side, misses. Ball squirts into the off side off his pads."}, {"ball": 16.4, "isHighlight": false, "text": "Russell to Jadeja,2 runs,short ball, Jadeja opens his body to make some room but can't swing freely enough through the pull. Rolls down to deep midwicket."}, {"ball": 16.5, "isHighlight": false, "text": "Russell to Jadeja, $$FOUR$$ ,Moves his front foot out of the line, carves through the line and hits it straight and flat over the bowler's head."}, {"ball": 16.6, "isHighlight": false, "text": "Russell to Jadeja,1 run,full ball on leg-stump, and Jadeja flicks it straight to square leg."}, {"ball": 16.6, "isHighlight": false, "text": "Aayush: \"Find it amusing that the only no ball bowled in this innings got a wicket on it. \""}, {"ball": 16.6, "isHighlight": false, "text": "kushb: \"Sunil Narine has gone wicketless in past 2 matches. 0/28 against RR in last match and 0/26 against CSK today. Has batsmen found a way to play him and not giving him any wickets ?\""}, {"ball": 16.6, "isHighlight": false, "text": "Kolkata have to chase 149 in 17 overs. It's a difficult ask, but it isn't out of the question. They still have to go at under 9 an over, in a shortened game. The pitch, though, isn't the best for batting, especially against spin, and some of Kolkata's bowlers, particularly Piyush Chawla, could have bowled a whole lot  better on it."}, {"ball": 16.6, "isHighlight": false, "text": "McCullum calls the pitch \"a bit tacky\", and says the ball was turning quite a bit. It was tough to hit down the ground, he adds, and he was sitting back and waiting for balls to pull."}], "name": "Chennai Super Kings v Kolkata Knight Riders", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733971.html?innings=1;view=commentary", "match_num": 21}