{"commentary": [{"ball": 0, "isHighlight": false, "text": "Zaheer Khan marks out his run-up to open the attack for Mumbai. Sehwag and Pujara walk out to the middle of the Wankhede, rather sedately. again, it's a scorcher in Mumbai. Humid too."}, {"ball": 0, "isHighlight": false, "text": "Pujara to face, two slips in place."}, {"ball": 0, "isHighlight": false, "text": "$$3.50$$ $$pm$$  Here's a left-field suggestion. Aayush: \"I think Kings XI still haven't found their ideal number 3, they've shuffled around Maxwell, Saha and Patel. Would love to see Rishi Dhawan play in that spot, he's looked good with the bat.\""}, {"ball": 0, "isHighlight": false, "text": "Idrees Kanchwal: \"Apurwa has hit the point perfectly. IPL is a long tournament and the retained players will get a game for sure but for the moment KingsXI dont want to mess much with the winning Combo\""}, {"ball": 0, "isHighlight": false, "text": "Aayush: \"Maxwell hasn't been on song for the last couple games, hope we see a Maxie special against his former team today!\""}, {"ball": 0, "isHighlight": false, "text": "Daud: \"I still feel that Mumbai should give more opportunities to Hussey. He performs well in India, it's it's understandable that he just needed some time to adjust back into cricket. They don't call him Mr.Cricket for nothing, he was one of the main reasons for Chennai's success over the past few years.\""}, {"ball": 0, "isHighlight": false, "text": "Zak Bagans: \"I do not think it's the back room staff. I think it's the case of all big players getting out of form at the same time. They basically have the same backroom staff last year!! Ponting was not playing so he was doing the job of a backroom staff -making strategies. So, the best MI can hope for is that being in India and at home, their players can get back to form.\""}, {"ball": 0, "isHighlight": false, "text": "Vikram: \"Aayush: Saha is good there dude. They sent Maxwell only in match vs SRH where the run rate was good and they want to post a big total. Dhawan is good with bat but lets not make him Irfan Pathan.\""}, {"ball": 0, "isHighlight": false, "text": "Utkarsh Bhatla: \"The big question is will Rohit open today? Though he opens for India, I don't think he is very comfortable facing the new ball. Johnson could bowl him over. Should save himself for the middle overs when the ball has lost its shine and the spinners are in operation.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$3.35$$ $$pm$$  Rohit Sharma tosses, George Bailey calls heads, and he's called correctly.  $$Kings$$ $$XI$$ $$Punjab$$ $$will$$ $$bat$$ $$first$$ . It's a hot and humid afternoon. Hotter than the UAE was, according to Bailey."}, {"ball": 0, "isHighlight": false, "text": "Kings XI are unchanged. Mumbai have made one change, left-arm spinner Pragyan Ojha has been left out and seamer Jasprit Bumrah is playing his second game of the season."}, {"ball": 0, "isHighlight": false, "text": "Rohit said Mumbai wanted to bat as well on a dry pitch. They were unbeaten at the Wankhede last season. Will a maiden victory this season keep that form going?"}, {"ball": 0, "isHighlight": false, "text": "Utkarsh : \"What did KXIP retain Manan Vohra for? I think they could go in for him or Mandeep in place of Pujara just to get that extra spark at the top\""}, {"ball": 0, "isHighlight": false, "text": "Siva: \"Hussey and Simmons in place of Dunk and Anderson would have been much better- safer option.\""}, {"ball": 0, "isHighlight": false, "text": "Kishore: \"Mumbai should shuffle their batting order. Pollard should bat in the top-order. This move will put Punjab under pressure. \""}, {"ball": 0, "isHighlight": false, "text": "Abishek: \"I think that KXIP should have Manan Vohra in place of Pujara. MI should send Adithya Tare out and sent Lendl Simmonds in.\""}, {"ball": 0, "isHighlight": false, "text": "Apurwa: \"So many comments on not playing retained players by KIngs XI, but my guess is that they dont want to change the 'winning combination'....\""}, {"ball": 0, "isHighlight": false, "text": "Who was the first player to hit a 50 and take 3 wickets in an IPL game? The answer will come up on The Huddle soon after this game, so watch this space. There are 1000s of questions waiting for you at  $$CricIQ$$  - are you ready for The Greatest Test Ever?"}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  Good afternoon, and welcome to another double-header day in the IPL, with Mumbai Indians hosting Kings XI Punjab in the first game at the Wankhede Stadium this season. I'm George Binoy, your commentator for the match."}, {"ball": 0, "isHighlight": false, "text": "These teams are at extremes in the  $$points$$ $$table$$ . Kings XI are on top, with five wins in five matches, and Mumbai are bottom, with five defeats in five games.  Did you know that Kings XI's five successive wins this season have contributed to  $$a$$ $$record-breaking$$ $$streak$$  in the IPL?"}, {"ball": 0, "isHighlight": false, "text": "Nagraj Gollapudi had an  $$interesting$$ $$take$$ $$on$$ $$Mumbai's$$ $$issues$$ . He felt that the multitude of high-profile names in Mumbai's backroom staff - Tendulkar, Wright, Ponting, Kumble, Rhodes and Robin Singh - might be hindering the progress of the team. Do you agree?"}, {"ball": 0, "isHighlight": false, "text": "Idrees Kanchwal: \"Mumbai issues with back room staff can be put in the good old phrase \"too many cooks spoil the broth\"."}, {"ball": 0, "isHighlight": false, "text": "The atmosphere at the Wankhede is going to be quite something today. It's a hot afternoon but that won't deter the 18,000 children - all in Mumbai Indians blue -  in attendance from raising the roof."}, {"ball": 0, "isHighlight": false, "text": "**"}, {"ball": 0, "isHighlight": false, "text": "The contest continues on  $$CricIQ$$  - two more days, six more attempts to find a spot in the Powerplay leaderboard, and join Joy Bhattacharjya on the video rounds. Are you fan enough?"}, {"ball": 0.1, "isHighlight": false, "text": "Khan to Pujara,no run,good length with some width outside off as the ball angles across the right-hander from over the wicket, Pujara strides forward and lets it pass"}, {"ball": 0.2, "isHighlight": false, "text": "Khan to Pujara, $$FOUR$$ ,too full and on the pads, Pujara immediately gets forward and across to flick the ball crisply, hitting it in the air and to the square leg boundary"}, {"ball": 0.3, "isHighlight": false, "text": "Khan to Pujara,no run,moves forward and defends a good length ball on the off side"}, {"ball": 0.3, "isHighlight": false, "text": "Farhan: \"@daud I agree completely with you .. now IPL in India and Hussey was the back bone of CSK, taking this inconsideration he should get some games... hopefully the mentors / coach's reading this ... \""}, {"ball": 0.4, "isHighlight": false, "text": "Khan to Pujara,no run,a fuller ball around off stump, Pujara leans forward and punches to cover"}, {"ball": 0.4, "isHighlight": false, "text": "It's a stunning atmosphere at the Wankhede. 18,000 kids in blue. Cheering."}, {"ball": 0.5, "isHighlight": false, "text": "Khan to Pujara,no run,short of a length outside off, Pujara stays back and cuts but does not beat the man at point"}, {"ball": 0.6, "isHighlight": false, "text": "Khan to Pujara,1 run,opens the face a bit later this time to guide the ball behind point towards third man"}, {"ball": 0.6, "isHighlight": false, "text": "Jasprit Bumrah from over the wicket ..."}, {"ball": 1.1, "isHighlight": false, "text": "Bumrah to Pujara,no run,the first ball is full and fast, speared into Pujara's pads, he misses the ball and is hit on the pad but that was missing leg"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to Pujara,2 wides,Bumrah goes wide of the crease and sprays the ball down leg, the keeper dives well to collect but can't prevent a bye"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to Sehwag,1 run,good length and the ball skids on to Sehwag, cramping him for room and time, Sehwag fends at it and gets an inside edge on to his body, they run a single after the ball goes close on the off side"}, {"ball": 1.3, "isHighlight": false, "text": "Bumrah to Pujara,no run,Pujara gets beaten by a full and wide ball outside off"}, {"ball": 1.4, "isHighlight": false, "text": "Bumrah to Pujara, $$FOUR$$ ,that's a graceful shot from Pujara and well timed, he got on to the front foot and drove a wide ball on the up through cover"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to Pujara,1 wide,that's a wide outside off stump this time"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to Pujara,no run,that ball has bounced sharply from short of a length and jagged back in at Pujara, cutting him in half between bat and body, the keeper thought there was an inside edge but there wasn't"}, {"ball": 1.6, "isHighlight": false, "text": "Bumrah to Pujara,no run,left alone outside off stump"}, {"ball": 1.6, "isHighlight": false, "text": "Ayon: \"I think Manan Vohra and Mandeep Singh should play in the places of Wriddhiman Saha & Cheteshwar Pujara as the duo were quite amazing on the previous IPL and they will bring more solidity and power along with enthusiasm in the playing XI\""}, {"ball": 2.1, "isHighlight": false, "text": "Khan to Sehwag, $$OUT$$ ,Sehwag's been run out! He cut the ball firmly to point where the fielder dived to his right and half-stopped the ball. Rohit moved to his left from cover, picked up the ball with his left hand, transferred it to his right as he turned around and threw down the stumps at the bowler's end. Sehwag was well short. He had hesitated to run until the first fielder made his stop so that delay cost him"}, {"ball": 2.1, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$run$$ $$out$$ $$1$$ $$(11m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 2.2, "isHighlight": false, "text": "Khan to Pujara,1 run,nudged off the pads on the leg side for a single"}, {"ball": 2.2, "isHighlight": false, "text": "Saha is the No. 3 batsman for Kings XI."}, {"ball": 2.3, "isHighlight": false, "text": "Khan to Saha,1 run,good length outside off, Saha pushes with soft hands on the off side and runs, there's a throw at the bowler's end but it misses, Rohit was moving in to collect the throw and he collided with the umpire, he seems to be winded a bit"}, {"ball": 2.4, "isHighlight": false, "text": "Khan to Pujara, $$FOUR$$ ,a length ball outside off stump and Pujara sends it racing to the cover boundary with a flowing drive on the front foot, split the gap between two fielders in the circle"}, {"ball": 2.5, "isHighlight": false, "text": "Khan to Pujara,no run,Zaheer goes round the wicket and bowls on the pads, Pujara glances but can't beat the man at short fine leg"}, {"ball": 2.6, "isHighlight": false, "text": "Khan to Pujara,1 run,steered to third man for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Ravi: \"Mumbai should keep Malinga for Maxwell and Miller. That would be a treat to watch. I still remember Malinga getting better of Miller in World T20.\""}, {"ball": 2.6, "isHighlight": false, "text": "Sunil Sharma: \"What was Sehwag doing? He was on his daily evening walk that cost him his wicket. Poor body language by him. No attempt to dive.\""}, {"ball": 2.6, "isHighlight": false, "text": "The left-armer Anderson from over the wicket ..."}, {"ball": 3.1, "isHighlight": false, "text": "Anderson to Pujara, $$FOUR$$ ,that's so gorgeous, not the half-volley Anderson bowled outside off but the drive through extra cover from Pujara"}, {"ball": 3.2, "isHighlight": false, "text": "Anderson to Pujara,no run,lots of width outside off stump but Pujara's square drive does not beat point"}, {"ball": 3.3, "isHighlight": false, "text": "Anderson to Pujara, $$OUT$$ ,Pujara's cameo is over! Anderson gave him lots of width again and the ball seamed across him from over the wicket, Pujara chased after it and tried to drive through cover but got an edge through to the keeper"}, {"ball": 3.3, "isHighlight": false, "text": "$$CA$$ $$Pujara$$ $$c$$ $$†Gautam$$ $$b$$ $$Anderson$$ $$19$$ $$(17m$$ $$18b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$105.55$$"}, {"ball": 3.3, "isHighlight": false, "text": "NitishM: \"This Pujara bashing is getting out of hand. He is a solid player, taking on the responsibility of anchoring the innings a la Rahul Dravid. Sometimes he'll play a silly shot and get out, other times he'll play jammy strokes with run rate in mind; but his natural instincts tell him to save his wicket and that (much like a holding midfielder in the sport of football) allows the batsmen around him to kick on and play aggressively. He's the new Mr Dependable, and there's certainly value in that, regardless of the format of cricket being played.\""}, {"ball": 3.3, "isHighlight": false, "text": "Maxwell is in at No. 4."}, {"ball": 3.4, "isHighlight": false, "text": "Anderson to Maxwell,no run,good length around off stump, Maxwell stays in his crease and plays the ball towards point"}, {"ball": 3.5, "isHighlight": false, "text": "Anderson to Maxwell, $$FOUR$$ ,Maxwell sees the full ball wide outside off stump, he moves forward and flays at it, carving the ball over cover point to get going with a boundary"}, {"ball": 3.6, "isHighlight": false, "text": "Anderson to Maxwell,1 wide,that's much too wide outside off stump"}, {"ball": 3.6, "isHighlight": false, "text": "There's a slip in place."}, {"ball": 3.6, "isHighlight": false, "text": "Anderson to Maxwell,no run,a length ball on leg and middle, Maxwell moves forward and across and plays a checked on-drive of sorts, the ball travelled flat through the air and fell a few metres short of the man on the edge of the circle"}, {"ball": 4.1, "isHighlight": false, "text": "Bumrah to Saha,no run,played off the back foot towards point"}, {"ball": 4.2, "isHighlight": false, "text": "Bumrah to Saha,no run,Saha drops the ball close on the on side, Maxwell wants one, Saha says no"}, {"ball": 4.3, "isHighlight": false, "text": "Bumrah to Saha,no run,goes wide of the crease and fires the ball in at middle stump, Saha stays in his crease and defends on the leg side"}, {"ball": 4.4, "isHighlight": false, "text": "Bumrah to Saha,1 run,defended on the off side"}, {"ball": 4.5, "isHighlight": false, "text": "Bumrah to Maxwell,1 run,a full toss on the pads flicked to deep square leg for a single"}, {"ball": 4.6, "isHighlight": false, "text": "Bumrah to Saha,no run,played back to the bowler on the back foot"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga to bowl his first over ..."}, {"ball": 5.1, "isHighlight": false, "text": "Malinga to Maxwell,1 run,good length and straight, played off the pads through square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Malinga to Saha,no run,a slower ball around off stump, played with an open face towards backward point"}, {"ball": 5.3, "isHighlight": false, "text": "Malinga to Saha, $$FOUR$$ ,a poor line with fine leg in the circle, full and on the pads, Saha glances it to the boundary"}, {"ball": 5.4, "isHighlight": false, "text": "Malinga to Saha,no run,short of a length outside off stump, Saha swishes and misses"}, {"ball": 5.4, "isHighlight": false, "text": "MeenaSathya: \"Good start to the Indian leg of IPL for Mumbai. Bumrah seems to be better selection ahead of Ojha. \""}, {"ball": 5.5, "isHighlight": false, "text": "Malinga to Saha,no run,good length on middle and off, Saha gets on the front foot and plays on the leg side"}, {"ball": 5.6, "isHighlight": false, "text": "Malinga to Saha,no run,good length on off, Saha gets behind the line and defends on the off side"}, {"ball": 5.6, "isHighlight": false, "text": "The players seem to be taking a break for drinks so the umpire waits and then signals a time-out."}, {"ball": 5.6, "isHighlight": false, "text": "Aayush: \"Saha is 6 runs off 11 balls and is looking all over the place. He is simply building up pressure for other batsmen by eating up balls and not taking singles. Just doesn't look the part of a number 3 batsman.\""}, {"ball": 5.6, "isHighlight": false, "text": "samarth: \"What is Saha doing?? Maxwell has faced 2 deliveries in the last 2 overs!! With Pujara opening the innings don't understand the strategy of sending Saha at no 3 either. He is too slow and is a poor rotator of the strike. Bailey should come at no 3. No 5 is too low for him anyways. \""}, {"ball": 6.1, "isHighlight": false, "text": "Bumrah to Maxwell,1 no ball,short and wide outside off, Maxwell hits it hard into the ground and the fielder at point has to leap to field it, Bumrah had overstepped so a free hit is coming up"}, {"ball": 6.1, "isHighlight": false, "text": "Bumrah to Maxwell, $$FOUR$$ ,a full toss outside off stump, Maxwell slipped to one knee as he hit it but managed to place the ball wide of the man at mid-off"}, {"ball": 6.2, "isHighlight": false, "text": "Bumrah to Maxwell,no run,Maxwell aims to cart the ball for six over midwicket but missed, the ball was on a good length outside off stump"}, {"ball": 6.3, "isHighlight": false, "text": "Bumrah to Maxwell,no run,Maxwell gets beaten on the pull, the ball was too full and it lobbed over the stumps off the body"}, {"ball": 6.4, "isHighlight": false, "text": "Bumrah to Maxwell,1 run,Maxwell moves across his stumps and flicks extravagantly to deep square leg"}, {"ball": 6.5, "isHighlight": false, "text": "Bumrah to Saha,no run,Saha is beaten on the cut as the ball darts into him from outside off stump"}, {"ball": 6.6, "isHighlight": false, "text": "Bumrah to Saha,no run,defended on the off side, Bumrah ends the over well after beginning with a no-ball and a boundary"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to bowl for the first time today, from over the wicket."}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Maxwell,1 run,tight length on middle stump, Maxwell pushes towards long on and runs"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,tossed up outside off stump, Saha dabs the ball towards Zaheer at short third man, Maxwell sprints the single"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Maxwell, $$FOUR$$ ,what's happened there? Maxwell was beaten in the flight but he went through with the lofted slice and took one hand off the bat after he made contact, the ball beat the fielder on the cover boundary"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Maxwell,1 run,chipped over the fielder at cover for a single"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,driven on the front foot to long on for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Maxwell,1 run,Maxwell strides forward and punches the ball firmly towards long off"}, {"ball": 8.1, "isHighlight": false, "text": "Malinga to Maxwell, $$SIX$$ ,Malinga drops short and Maxwell carts him, swivelling and pulling off the front foot far over the deep midwicket boundary"}, {"ball": 8.2, "isHighlight": false, "text": "Malinga to Maxwell, $$FOUR$$ ,that's a yorker but Maxwell jumps outside leg stump to hit down the ground and gets an inside edge on it that beats the keeper, boundary to long stop"}, {"ball": 8.3, "isHighlight": false, "text": "Malinga to Maxwell,no run,the slower short ball and Maxwell pulls furiously, almost finished the shot before the ball got to him"}, {"ball": 8.4, "isHighlight": false, "text": "Malinga to Maxwell,1 run,Malinga thinks the ball has hit the boot before the bat, the umpire does not. Malinga bowled a perfect yorker but Maxwell was good enough to keep it out and get a single towards point"}, {"ball": 8.5, "isHighlight": false, "text": "Malinga to Saha,no run,Saha keeps out another yorker, Malinga seems to have found his groove"}, {"ball": 8.6, "isHighlight": false, "text": "Malinga to Saha,1 run,just when you think the yorker is going to creep below the bat, Saha manages to play it out towards square leg and keep strike"}, {"ball": 8.6, "isHighlight": false, "text": "gary: \"Rohit isnt rotating his bowlers well. He shoudl preseve malinga if the others are doing a good job. Malinga is being wasted in tehse middle overs and he is not sure what lenght he has to bowl. He would have been better off having corey pollard and bumraih bowling their overs and getting done with the 4th and 5th bowler overs.\""}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to Saha,no run,nicely flighted on middle stump, nudged off the front foot on the leg side"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,glanced off the pads through square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to Maxwell,1 leg bye,Maxwell slogs across the line but is beaten by the flight, the ball goes close on the leg side"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to Saha,no run,Saha slogs wildly but the ball goes off the toe end of the bat towards the bowler"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,Saha's attempt at paddle sweeping ends up at square leg, he needs to find a way to get to a run a ball ..."}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to Maxwell, $$FOUR$$ ,a friendly full toss outside off stump, easy pickings for Maxwell, who drives the ball to the extra cover boundary"}, {"ball": 9.6, "isHighlight": false, "text": "Sushil: \"Saha is doing the perfect job for MI. They should not try to take his wicket. Block singles and put pressure on other batsmen.\""}, {"ball": 9.6, "isHighlight": false, "text": "Pollard from over the wicket ..."}, {"ball": 10.1, "isHighlight": false, "text": "Pollard to Saha,1 run,a slower ball, Saha moves across and dabs the ball towards midwicket for a single"}, {"ball": 10.1, "isHighlight": false, "text": "Sarim: \"Don't seem to understand the role Saha is playing here. He is not rotating the strike, he is not hitting them big either. He is anchoring himself possibly thinking this outing might earn him a call up for the Test Side. After all, it takes guts and skills to maintain a strike rate of under 55 in a T20 game. :/\""}, {"ball": 10.2, "isHighlight": false, "text": "Pollard to Maxwell,1 wide,that's wide outside off stump, and the umpire calls it ... Mawell played no shot"}, {"ball": 10.2, "isHighlight": false, "text": "Pollard to Maxwell,2 runs,Maxwell doesn't have much pace on the ball to work with - slower one from Pollard - but he manages to slap it towards wide long off and they take two to Malinga"}, {"ball": 10.3, "isHighlight": false, "text": "Pollard to Maxwell,1 leg bye,Maxwell misses the reverse swat and gets hit on the leg, Pollard roars an appeal but the impact was outside off stump"}, {"ball": 10.4, "isHighlight": false, "text": "Pollard to Saha,1 bye,a very slow ball from Pollard and Saha was hopelessly beaten, his struggle is damaging for Kings XI"}, {"ball": 10.5, "isHighlight": false, "text": "Pollard to Maxwell,2 runs,Maxwell heaves at the ball but mis-times it through midwicket, Maxwell races back for the second to keep strike"}, {"ball": 10.6, "isHighlight": false, "text": "Pollard to Maxwell,1 run,a length ball, slow outside off stump, Maxwell pulls to deep midwicket"}, {"ball": 11.1, "isHighlight": false, "text": "Harbhajan Singh to Maxwell, $$SIX$$ ,Mazwell charges the offspinner and slams the ball over long off, he's got it all to do for Kings XI, getting no support from Saha"}, {"ball": 11.2, "isHighlight": false, "text": "Harbhajan Singh to Maxwell,1 run,driven to long on for a single"}, {"ball": 11.3, "isHighlight": false, "text": "Harbhajan Singh to Saha, $$SIX$$ ,Saha has hit a six! Got down on one knee and slog swept the ball flat over deep square leg. That came out of nowhere."}, {"ball": 11.4, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,Saha steps out and flicks the ball to deep square leg"}, {"ball": 11.5, "isHighlight": false, "text": "Harbhajan Singh to Maxwell, $$OUT$$ ,caught at long on! Maxwell's gone and Mumbai are ecstatic. Maxwell came down the track but didn't get to the pitch of the ball, he went through with the shot and mis-hit it straight to Ben Dunk on the boundary. Perhaps the pressure of no runs from Saha got to him in the end ..."}, {"ball": 11.5, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Dunk$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$45$$ $$(38m$$ $$27b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$166.66$$"}, {"ball": 11.5, "isHighlight": false, "text": "George Bailey has come in ahead of Miller ..."}, {"ball": 11.6, "isHighlight": false, "text": "Harbhajan Singh to Saha,no run,Saha tries a cute little reverse dab, it does not come off"}, {"ball": 11.6, "isHighlight": false, "text": "Anderson's back ... bowling round the wicket."}, {"ball": 12.1, "isHighlight": false, "text": "Anderson to Bailey, $$FOUR$$ ,a first-ball four for Bailey, Anderson offered him so much width outside off, Bailey reached for it and opened the face to let the ball run off the face to the backward point boundary"}, {"ball": 12.2, "isHighlight": false, "text": "Anderson to Bailey,1 run,Bailey cuts off the back foot in front of point this time"}, {"ball": 12.2, "isHighlight": false, "text": "Arich: \"I don't understand why slamming Wriddhi(Saha) when the team is scoring around 9 rpo in the last 5 overs. I agree his current strike rate is little low, but its not wise to have all the batsmen go boom boom from the word go..spare the poor chap! He's got it in him to success at the highest level.\""}, {"ball": 12.3, "isHighlight": false, "text": "Anderson to Saha,no run,Saha gets beaten by one that seams across him close to off stump, he was trying to run the ball to third man"}, {"ball": 12.4, "isHighlight": false, "text": "Anderson to Saha,1 run,Saha waits for the slower ball and dabs it towards third man"}, {"ball": 12.5, "isHighlight": false, "text": "Anderson to Bailey,1 run,dabbed off the back foot towards third"}, {"ball": 12.6, "isHighlight": false, "text": "Anderson to Saha,1 run,Saha reaches for a length ball outside off and cuts towards third man"}, {"ball": 12.6, "isHighlight": false, "text": "satty: \"That's really harsh on Saha, he has nothing to do with maxwell wicket, look at KXI run rate it's about 7.5, so there was no need to rush until 15 overs, few good innings from maxwell and people are like he does nothing wrong, that's rubbish\""}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin: \"@Arich : I don't think you understand what we mean! No one is expecting Saha to go Boom Boom! But when Maxwell is in a good form,the least Saha could do is simply keep rotating the strike,Maxwell was kept off the strike too long! I think the criticism against him is totally justified,at least in this match till now.\""}, {"ball": 13.1, "isHighlight": false, "text": "Pollard to Saha, $$FOUR$$ ,that's a poor ball, outside leg stump with fine leg in the circle, Saha swings across the line and helps it along to the fine leg boundary"}, {"ball": 13.2, "isHighlight": false, "text": "Pollard to Saha,1 run,Saha swats the ball through square leg for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Pollard to Bailey,no run,a slower ball on off stump, Bailey defends towards the bowler"}, {"ball": 13.4, "isHighlight": false, "text": "Pollard to Bailey,1 run,good length angling into off stump, Bailey waits in his crease and dabs towards third man"}, {"ball": 13.5, "isHighlight": false, "text": "Pollard to Saha, $$FOUR$$ ,mid-off is in the circle so Saha steps out and lofts a short of a length ball over the in field, sharp awareness of where the field is"}, {"ball": 13.6, "isHighlight": false, "text": "Pollard to Saha, $$SIX$$ ,this time he gets down low and pulls the ball flat and hard, Anderson is on the deep backward square leg boundary but the ball beats his jump ... Saha making up ..."}, {"ball": 13.6, "isHighlight": false, "text": "Zaheer from over the wicket ..."}, {"ball": 14.1, "isHighlight": false, "text": "Khan to Bailey,no run,good length just outside off stump, Bailey tries to steer the ball to third man but misses"}, {"ball": 14.2, "isHighlight": false, "text": "Khan to Bailey,no run,Bailey makes room to hit on the off side but mistimes it towards midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Keerat: \"SR now over 100 and people will now say what a good innings by Saha. Oh T20, how quickly things can go from good to bad or vice versa.\""}, {"ball": 14.3, "isHighlight": false, "text": "Khan to Bailey,no run,good length angling into the right hander from round the wicket, Bailey stays in his crease and plays to cover"}, {"ball": 14.4, "isHighlight": false, "text": "Khan to Bailey, $$FOUR$$ ,cut hard off the back foot, the fielder at point dives to his left but can't stop it, that will be a boundary, Bailey makes up for three dot balls"}, {"ball": 14.5, "isHighlight": false, "text": "Khan to Bailey,1 run,a full ball outside off stump, driven through cover point for a single"}, {"ball": 14.6, "isHighlight": false, "text": "Khan to Saha, $$FOUR$$ ,superb placement from Saha, dragging the ball from outside off, pulling it over the infield and into the gap on the deep midwicket boundary"}, {"ball": 15.1, "isHighlight": false, "text": "Harbhajan Singh to Bailey,1 run,Bailey dabs the ball close on the off side and responds to Saha's call ... the keeper does the fielding"}, {"ball": 15.2, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,Saha steps out but is beaten in the flight, he dabs towards point and runs"}, {"ball": 15.3, "isHighlight": false, "text": "Harbhajan Singh to Bailey,no run,Bailey goes back and pulls the ball straight to midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Harbhajan Singh to Bailey,2 runs,short ball and Bailey pulls to deep square leg, Pollard runs to his right on the boundary, picks up with one hand and fires the throw in"}, {"ball": 15.5, "isHighlight": false, "text": "Harbhajan Singh to Bailey, $$OUT$$ ,caught at deep square leg! Bailey slog sweeps but mis-times it woefully, Anderson comes running in and then stoops to catch the ball with fingers pointing up even though it was a low take"}, {"ball": 15.5, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$c$$ $$Anderson$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$15$$ $$(19m$$ $$14b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$107.14$$"}, {"ball": 15.5, "isHighlight": false, "text": "David Miller is at the non-striker's end because the batsmen crossed before the catch was taken."}, {"ball": 15.6, "isHighlight": false, "text": "Harbhajan Singh to Saha,1 run,Saha moves outside leg to make room and cuts to Zaheer at short third man"}, {"ball": 16.1, "isHighlight": false, "text": "Bumrah to Saha,1 run,Saha moves forward and dabs the ball through point for a single"}, {"ball": 16.2, "isHighlight": false, "text": "Bumrah to Miller,1 run,Miller gets on to the front foot and punches the ball through cover for a single"}, {"ball": 16.3, "isHighlight": false, "text": "Bumrah to Saha,1 run,short of a length and Saha pulls to deep square leg"}, {"ball": 16.4, "isHighlight": false, "text": "Bumrah to Miller,2 runs,short of a length on the hips, Miller nudges the ball and once it passes the fielder in the circle at midwicket there's enough time to return for the second"}, {"ball": 16.5, "isHighlight": false, "text": "Bumrah to Miller,no run,a slower ball and Miller defends with a straight bat"}, {"ball": 16.6, "isHighlight": false, "text": "Bumrah to Miller, $$FOUR$$ ,that's a horrible ball, and more so when your fine leg is in the circle, Miller swivelled and paddled a length ball from outside leg stump past the fielder and to the fine leg boundary, piece of cake"}, {"ball": 17.1, "isHighlight": false, "text": "Malinga to Saha,1 run,a length ball on middle and leg, slightly slower, Saha pulls to deep square leg, just the single though"}, {"ball": 17.2, "isHighlight": false, "text": "Malinga to Miller,1 run,a low full toss outside off, Miller drives on the front foot to long off, Pollard is the fielder so no more than one"}, {"ball": 17.3, "isHighlight": false, "text": "Malinga to Saha,1 run,Saha makes room by moving outside leg and slogs across the line, mis-timing it towards deep square leg"}, {"ball": 17.3, "isHighlight": false, "text": "Swapnil: \"I think Mumbai will be the favorites despite KXIP scoring 175-180 odd today. Wankhede has been the fortress for MI and it will be difficult for Mitch and Co. to contain them. Expecting Ben Dunk to fire today. Sadly but MI has only 4 matches at the Wankhede.\""}, {"ball": 17.4, "isHighlight": false, "text": "Malinga to Miller,1 run,a full ball on middle and leg, Miller chips it towards long on for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Malinga to Saha,no run,Saha swings across the line at a low full toss and was beaten, that just missed leg stump"}, {"ball": 17.6, "isHighlight": false, "text": "Malinga to Saha,1 run,full and straight, Malinga's bowled a terrific over, Saha can only drive the ball along the ground to the fielder on the edge of the circle at cover"}, {"ball": 18.1, "isHighlight": false, "text": "Khan to Saha, $$SIX$$ ,short ball and Saha gets to fifty by swivelling and pulling into the stands at deep square leg, he may have started slow but he's made that start count"}, {"ball": 18.2, "isHighlight": false, "text": "Khan to Saha,1 run,short of a length outside off, Saha stays back and drives the ball over cover"}, {"ball": 18.3, "isHighlight": false, "text": "Khan to Miller,4 leg byes,Zaheer attempts a yorker but gets his line wrong just a little - outside leg stump - Miller opens up his stance and swings across the line, the ball brushes the back leg and goes between the legs to the fine leg boundary. Zaheer seems to have injured his shoulder while bowling that delivery"}, {"ball": 18.3, "isHighlight": false, "text": "Zaheer's shoulder is not good enough for him to continue bowling, Pollard will finish the 19th over."}, {"ball": 18.4, "isHighlight": false, "text": "Pollard to Miller, $$SIX$$ ,a full toss outside off stump, that's in Miller's arc and he slams it far over the long-off boundary"}, {"ball": 18.5, "isHighlight": false, "text": "Pollard to Miller,1 run,a slower ball outside off, Miller reaches for it far outside off and drives it to deep cover"}, {"ball": 18.6, "isHighlight": false, "text": "Pollard to Saha,2 runs,a full ball, nearly in the blockhole but not quite, Saha brings his bat down hard and hits it towards cow corner, Ben Dunk sprints to his left from long-on and dives to save the boundary"}, {"ball": 19.1, "isHighlight": false, "text": "Malinga to Miller,no run,a low full toss outside off, nearly a yorker, Miller swings across the line and swings on top of the ball, he misses it"}, {"ball": 19.2, "isHighlight": false, "text": "Malinga to Miller,no run,Miller's missed out on this one, it was a higher full toss but he once again swung and was beaten, a costly miss, two dots to start the final over"}, {"ball": 19.3, "isHighlight": false, "text": "Malinga to Miller, $$OUT$$ ,two dots and now a wicket, this is an exceptional final over from Malinga, Miller has struggled against Malinga and this time he ended up hitting a low full toss with the bottom of the bat, mis-timing it towards long on. Ben dunk ran in quickly and dived forward to catch the ball. Terrific take"}, {"ball": 19.3, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$c$$ $$Dunk$$ $$b$$ $$Malinga$$ $$16$$ $$(19m$$ $$12b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 19.4, "isHighlight": false, "text": "Malinga to Saha,2 runs,Saha hits the ball towards long on and Johnson comes sprinting back for the second, superb running"}, {"ball": 19.5, "isHighlight": false, "text": "Malinga to Saha,1 run,Saha swings across the line and gets an inside edge towards deep backward square leg"}, {"ball": 19.6, "isHighlight": false, "text": "Malinga to Johnson,no run,a strong finish from Malinga, only three runs off the final over, Johnson tried to paddle a full and straight ball and ended up making no proper contact, the ball dropped on the pitch in front of him. Saha wanted to run but Johnson did not know where it was and stayed rooted to his spot"}, {"ball": 19.6, "isHighlight": false, "text": "$$5.40$$ $$pm$$  KXIP finish with 168. It's not as much as they would have wanted, but despite never hitting full steam, they have reached a competitive score. Mumbai Indians did not lose at home last season. They haven't won a match this season. I'll be back in ten minutes for the chase."}, {"ball": 19.6, "isHighlight": false, "text": "Sharma: \"Saha showing the importance of batting through the innings...where are all the Saha bashers now? Even in T20 you can afford to get your eyes in..\""}, {"ball": 19.6, "isHighlight": false, "text": "Ashwin: \"@Sharma: Wow,you really don't get the point,do you? Saha's knock is undoubtedly a good one.But do you not understand that him not rotating the strike in the middle overs was a mistake? Just because he has a 50 now doesn't change that fact! And I still feel that KXIP have fallen 10-15 short of what they could have achieved.\""}], "name": "Mumbai Indians v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733973.html?innings=1;view=commentary", "match_num": 22}