{"commentary": [{"ball": 0, "isHighlight": false, "text": "The chase is about to begin. Ben Dunk and CM Gautam are opening for Mumbai. Sandeep Sharma, who's had a terrific last couple of games, will open the bowling for KXIP."}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Dunk, $$FOUR$$ ,a full ball outside off stump, Ben Dunk gets on to the front foot and drives through extra cover to get this chase going. A loose ball and it was put away"}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Dunk,no run,better length outside off stump, movement away from the left-hander, Dunk moves forward and lets it go"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Dunk,1 run,pushed off the front foot to wide mid-off for a single, there's a direct hit at the bowler's end but the batsman is safe and they don't run off the ricochet"}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Gautam,1 leg bye,a full ball on the pads, slanting down leg, Sharma appeal for what I have no idea, Gautam did not make proper contact with the flick"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to Dunk, $$OUT$$ ,that's an outstanding catch from Saha! He's having a good game! Dunk drove away from his body at one that swung away from him on a good length outside off stump, the edge flew quickly but Saha dived to his left to take it smoothly"}, {"ball": 0.5, "isHighlight": false, "text": "$$BR$$ $$Dunk$$ $$c$$ $$†Saha$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$5$$ $$(3m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "menon: \"MI have is habit of leaving too much for final overs. Considering their current form, hope they dont leave too much. For a change, they should have a good start to win.\""}, {"ball": 0.5, "isHighlight": false, "text": "Rayudu in at No.3."}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to Rayudu,no run,fullish delivery outside off, Rayudu plays the ball to mid off"}, {"ball": 0.6, "isHighlight": false, "text": "L Balaji from over the wicket .."}, {"ball": 1.1, "isHighlight": false, "text": "Balaji to Gautam,no run,angles into the right-hander, pitches on a good length outside off, and then nips away from Gautam, who lets it go"}, {"ball": 1.2, "isHighlight": false, "text": "Balaji to Gautam,2 runs,that's a terrific effort from Akshar Patel but it will have to go down as a  $$drop$$ . Gautam moved across his stumps and flicked, the ball seamed away from him and went off the leading edge high over extra cover. Patel sprinted after it from mid-off, covering lots of ground, doing superbly to get to the ball as it dropped over his head. he seemed to catch it too, but the ball fell out of his hands after he hit the ground"}, {"ball": 1.3, "isHighlight": false, "text": "Balaji to Gautam,1 run,mis-timed on the leg side for a single"}, {"ball": 1.4, "isHighlight": false, "text": "Balaji to Rayudu, $$FOUR$$ ,a full and straight delivery, Rayudu moves forward and across and drills it past mid-on for four"}, {"ball": 1.5, "isHighlight": false, "text": "Balaji to Rayudu,no run,Rayudu moves forward to try and attack the ball but lets it go after it pitches on a good length and seams away from him"}, {"ball": 1.6, "isHighlight": false, "text": "Balaji to Rayudu, $$FOUR$$ ,edged between between first and second slip for four! Rayudu drove in hope at that ball, the length was not right for the drive and it seamed away from him, taking the outside edge and beating the fielder at first slip - Sehwag - on his right hand"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Gautam,1 wide,that's wide down leg side"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Gautam, $$FOUR$$ ,look at that! Gautham moves so late across his stumps and the scoops the ball over the head of the man at short fine leg, the bowler did not have time to adjust his length"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,replies with the bouncer, Gautham tries to ramp it over the keeper but misses"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,this time he steps out to pull but misses and is hit on the body"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Gautam,1 run,a full ball swings into the right-hander and goes off the inside edge through square leg"}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Rayudu, $$OUT$$ ,lbw! That ball snaked late into the right-hander, bending sharply from far outside off stump, Rayudu had moved across his crease and was right in front of the stumps when the ball crashed into his front pad below the knee roll. Plumb."}, {"ball": 2.5, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$lbw$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$8$$ $$(9m$$ $$5b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$160.00$$"}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to Sharma,no run,Rohit stays in his crease and clips the ball to cover"}, {"ball": 2.6, "isHighlight": false, "text": "Johnson to bowl, from over the wicket ..."}, {"ball": 3.1, "isHighlight": false, "text": "Johnson to Gautam,1 run,Gautham moves back and across to steer a length delivery slanting across him towards third man"}, {"ball": 3.2, "isHighlight": false, "text": "Johnson to Sharma,no run,good length on middle and off, Rohit gets behind the line and defends"}, {"ball": 3.2, "isHighlight": false, "text": "Ravinder: \"Although the Rayudu dismissal delivery swung very late it was not a good to see an experienced Indian domestic batsman to get out like this. That was like Yusuf Pathan like dismissal.\""}, {"ball": 3.3, "isHighlight": false, "text": "Johnson to Sharma,no run,Rohit has quick hands and he uses them to cut hard into the ground and towards point"}, {"ball": 3.4, "isHighlight": false, "text": "Johnson to Sharma,no run,short of a length and at the body, Rohit stays back and plays the ball off his toes towards square leg, that hit high on the bat"}, {"ball": 3.4, "isHighlight": false, "text": "Rohit pulls put of the ball because there was something on the sightscreen ..."}, {"ball": 3.5, "isHighlight": false, "text": "Johnson to Sharma,no run,good length on middle and off, Rohit leans forward and plays the ball back to the bowler"}, {"ball": 3.6, "isHighlight": false, "text": "Johnson to Sharma, $$SIX$$ ,that's a short ball and Rohit pulls, he might have got more of a top edge on the ball than the middle off the bat but it was good enough to send the ball into the stands at backward square leg"}, {"ball": 3.6, "isHighlight": false, "text": "This time Gautham pulls out of the delivery because someone ran across the sightscreen. Small hold-up in play."}, {"ball": 4.1, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,Sandeep hits the front pad again with the ball that swings into the right-hander, that was a bit high though"}, {"ball": 4.2, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,what on earth was that? Sandeep dug it in short, Gautham moved across his stumps and tried to scoop it over the man at short fine leg, he ended up playing it into the ground and towards slip. Ugly."}, {"ball": 4.3, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,a late inswinger hits the front pad again, seemed like a decent shout for lbw but the umpire was not interested"}, {"ball": 4.4, "isHighlight": false, "text": "Sandeep Sharma to Gautam, $$SIX$$ ,why does he play shots like 4.2 when he can play like this? He spotted the slower ball, came forward and drove gracefully over the extra cover boundary, timing it superbly"}, {"ball": 4.5, "isHighlight": false, "text": "Sandeep Sharma to Gautam,no run,when Sandeep gets his length right his late swing has troubled the batsman. Another one hits the pad"}, {"ball": 4.6, "isHighlight": false, "text": "Sandeep Sharma to Gautam, $$SIX$$ ,he's carted this over deep midwicket! Moving across his stumps to get inside the line of the length ball and hoisting it into the stands. Mumbai on their way now."}, {"ball": 4.6, "isHighlight": false, "text": "A comedy of errors playing out behind the bowler's arm near the sight-screen."}, {"ball": 5.1, "isHighlight": false, "text": "Johnson to Sharma,no run,Rohit tries to drive on the off side but gets an inside edge towards midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Johnson to Sharma,1 run,short and wide outside off, Rohit cuts and the ball gets to the fielder at third man on the first bounce"}, {"ball": 5.3, "isHighlight": false, "text": "Johnson to Gautam,1 run,Gautham moves back and across and dabs the ball as it slants across him towards third man"}, {"ball": 5.3, "isHighlight": false, "text": "Ojas: \"Who would've thought Johnson would be second fiddle to Sandeep Sharma and Steyn to Bhuvi? Amazing performances from a few Indian bowlers this IPL.\""}, {"ball": 5.4, "isHighlight": false, "text": "Johnson to Sharma,1 wide,Johnson goes round the wicket to angle the ball into the right-hander and then strays down leg side. Saha thinks the ball brushed something. Johnson does too."}, {"ball": 5.4, "isHighlight": false, "text": "Johnson to Sharma,no run,there's a huge mix-up but Kings XI make a big mess of it! Rohit drops the ball close on the off side and Gautham sets off, Rohit sends him back very late. Miller fields near point and throws the ball back to Johnson who is in front of the stumps. Johnson makes an utter mess of it and misses the stumps"}, {"ball": 5.5, "isHighlight": false, "text": "Johnson to Sharma, $$FOUR$$ ,a length ball and Rohit plays a graceful lofted drive over extra cover for a one-bounce four"}, {"ball": 5.6, "isHighlight": false, "text": "Johnson to Sharma,no run,driven back to the bowler, Johnson picks up and hurls the ball at the striker's end, hitting the stumps"}, {"ball": 5.6, "isHighlight": false, "text": "Himanshu Jansar: \"These were 2nd and 3rd sixes of C Gautam's T20 career!\""}, {"ball": 5.6, "isHighlight": false, "text": "Akshar Patel to bowl left-arm spin from round the wicket."}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Gautam, $$FOUR$$ ,Gautham brings up the fifty by playing a reverse dab fine to the third man boundary, that went off the glove and arm but beat the keeper and short third man"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to Gautam,1 run,pushed into the off side for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to Sharma, $$FOUR$$ ,flat and short, Rohit knows where the field is so he moves towards the off side and paddles the ball into the huge vacant space at fine leg"}, {"ball": 6.4, "isHighlight": false, "text": "Patel to Sharma,1 run,nudged between point and cover for a single"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to Gautam,1 run,another reverse paddle, shouts of catch but it falls well short of short third man"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to Sharma,1 run,goes back and works the ball off the pads through midwicket ..."}, {"ball": 6.6, "isHighlight": false, "text": "This is what Anderson and Pollard have needed this season - a solid start from the top order. They are cruising at present."}, {"ball": 6.6, "isHighlight": false, "text": "Rishi Dhawan to bowl, from over the wicket."}, {"ball": 7.1, "isHighlight": false, "text": "Dhawan to Sharma,1 run,a length ball outside off stump, Rohit opens the face and steers to third man, strolls the single"}, {"ball": 7.2, "isHighlight": false, "text": "Dhawan to Gautam,no run,pitches on a length and nips into Gautham, who is caught on the crease and hit on the thigh"}, {"ball": 7.3, "isHighlight": false, "text": "Dhawan to Gautam,no run,tried to bash the ball through the off side but mis-timed it to cover, nearly carried to the fielder"}, {"ball": 7.4, "isHighlight": false, "text": "Dhawan to Gautam,2 runs,a length ball and Gautham lifts it off his pads towards cow corner, Miller runs to his left from long-on to field"}, {"ball": 7.5, "isHighlight": false, "text": "Dhawan to Gautam,no run,nudged towards midwicket, they begin to run and then stop, Maxwell picks up and throws at the striker's end, he misses, the batsmen decide against the overthrow"}, {"ball": 7.6, "isHighlight": false, "text": "Dhawan to Gautam,1 run,good length on the pads, Gautham nudges towards square leg and runs, Johnson has to come in from the deep to field but he is quick enough to prevent the second"}, {"ball": 8.1, "isHighlight": false, "text": "Patel to Gautam,no run,defended on the front foot towards the bowler"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to Gautam,no run,steps out but is beaten in the flight, played back to the bowler"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to Gautam,1 leg bye,tries to play the reverse pull but misses and is hit on the pad"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to Sharma,no run,nudged on the leg side, Patel moves to his right to field"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to Sharma,1 run,worked off the back foot through midwicket for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to Gautam,2 runs,there's a direct hit at the non-striker's end from deep midwicket but Rohit has run hard and is safe. Maxwell was the fielder"}, {"ball": 9.1, "isHighlight": false, "text": "Dhawan to Sharma,no run,good length and the ball seems to straighten after pitching on middle, Rohit defends"}, {"ball": 9.2, "isHighlight": false, "text": "Dhawan to Sharma,no run,played off the back foot towards the bowler"}, {"ball": 9.3, "isHighlight": false, "text": "Dhawan to Sharma,1 run,makes room and dabs the ball straight to short third man, Balaji is unable to save the single"}, {"ball": 9.4, "isHighlight": false, "text": "Dhawan to Gautam, $$OUT$$ ,lbw! One cute reverse shot too many from Gautham. Dhawan kept it simple, wicket to wicket and on a good length. Gautham tried to reverse swat off the back foot and he missed. The ball hit him plumb in front"}, {"ball": 9.4, "isHighlight": false, "text": "$$CM$$ $$Gautam$$ $$lbw$$ $$b$$ $$Dhawan$$ $$33$$ $$(49m$$ $$29b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$113.79$$"}, {"ball": 9.4, "isHighlight": false, "text": "Corey Anderson is the new batsman."}, {"ball": 9.5, "isHighlight": false, "text": "Dhawan to Anderson,no run,good length around off stump, Anderson plays the ball to point where the fielder fumbles but doesn't concede a run"}, {"ball": 9.6, "isHighlight": false, "text": "Dhawan to Anderson,no run,Anderson drives hard at a good length ball that pitches around off and angles away from him, he is beaten. Poor footwork"}, {"ball": 10.1, "isHighlight": false, "text": "Patel to Sharma,no run,Rohit tries to turn the ball on the leg side but is hit on the pad, that was sliding past leg"}, {"ball": 10.2, "isHighlight": false, "text": "Patel to Sharma,no run,flatter, shorter and quicker, Rohit goes back and plays the ball to the bowler"}, {"ball": 10.3, "isHighlight": false, "text": "Patel to Sharma,1 run,that was slower and outside off, driven through point for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Milind: \"With Tare, Pollard, Rohit and Anderson still batting, Mumbai suddenly seem like a much stronger batting lineup. Such is the power of a good start.\""}, {"ball": 10.4, "isHighlight": false, "text": "Patel to Anderson,2 runs,over the wicket, length ball outside off, Anderson waits on the back foot and cuts firmly to deep point"}, {"ball": 10.5, "isHighlight": false, "text": "Patel to Anderson,1 run,that's a short ball, Anderson misses out, he mistimed the pull to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Patel to Sharma,1 run,Rohit makes room by moving outside leg and drives the wicket-to-wicket ball through extra cover"}, {"ball": 11.1, "isHighlight": false, "text": "Dhawan to Sharma, $$SIX$$ ,short and wide, a rare lose ball from Dhawan, third man is in the circle too, Rohit slashes hard, carving the ball over the third-man boundary"}, {"ball": 11.2, "isHighlight": false, "text": "Dhawan to Sharma,1 run,good length on off and middle, Rohit dabs it through square leg and they run a single"}, {"ball": 11.2, "isHighlight": false, "text": "EPM: \"This is exactly why Mumbai hasn't won a match yet, they depend on the last few overs to make an impact and horribly fail.\""}, {"ball": 11.3, "isHighlight": false, "text": "Dhawan to Anderson,no run,Anderson jumps outside leg to hit through the off but can't beat mid-off"}, {"ball": 11.4, "isHighlight": false, "text": "Dhawan to Anderson,no run,that was so close to off stump! Slightly slower from Dhawan, Anderson backed away towards leg to cut and was beaten"}, {"ball": 11.5, "isHighlight": false, "text": "Dhawan to Anderson, $$SIX$$ ,a length ball and that's disappeared over long on! Anderson just lined it up and freed his arms, Pujara's on the boundary but the ball sails over him ..."}, {"ball": 11.6, "isHighlight": false, "text": "Dhawan to Anderson,1 run,a slower ball outside off, hit to long off for a single"}, {"ball": 12.1, "isHighlight": false, "text": "Patel to Anderson,1 run,a full toss on the pads, driven to wide long on for a single"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to Sharma,1 run,Rohit stays in his crease and plays a tight delivery towards cover for a single, that was on a good length on middle"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to Anderson, $$FOUR$$ ,Anderson sees the width on offer outside off, the trajectory is flat as well, he biffs it flat over the bowler's head for a one-bounce four"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to Anderson, $$SIX$$ ,that's gone as well! Mumbai gaining ground this over. Anderson opens up his stance and slogs the ball into the stands beyond cow corner"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to Anderson, $$FOUR$$ ,awful bowling this, flat with width outside off, Anderson smashes it flat over the bowler's head for four more"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Anderson, $$FOUR$$ ,that's 20 off the over! Anderson slog sweeps and hits it past the fielder in the circle at square leg, Patel ends his spell with a shocker. Didn't seem to vary his deliveries at all"}, {"ball": 13.1, "isHighlight": false, "text": "Balaji to Sharma,no run,good length angling into Anderson, Rohit nudges towards the leg side, he's going to play the anchor"}, {"ball": 13.2, "isHighlight": false, "text": "Balaji to Sharma,no run,Rohit stays in his crease and mis-hits a good length ball towards the bowler"}, {"ball": 13.3, "isHighlight": false, "text": "Balaji to Sharma,1 run,angles into the pads, Rohit nudges the ball towards backward square leg and hurries through for a single"}, {"ball": 13.4, "isHighlight": false, "text": "Balaji to Anderson,1 run,in the blockhole outside off stump, Anderson reaches for it and ends up bottom edging it into the pitch, Rohit knows he can beat Balaji on the sprint to the other end and he does so"}, {"ball": 13.5, "isHighlight": false, "text": "Balaji to Sharma, $$FOUR$$ ,shot! Rohit moves across, gets down on one knee and scoops the ball over short fine leg, superb planning and execution"}, {"ball": 13.6, "isHighlight": false, "text": "Balaji to Sharma,no run,Bailey dives to his left at backward point to cut off a Rohit steer and save the single"}, {"ball": 13.6, "isHighlight": false, "text": "Johnson has two overs left. He will bowl one of them now."}, {"ball": 14.1, "isHighlight": false, "text": "Johnson to Anderson,no run,a full toss on the pads outside leg, Anderson swung across the line and missed, Johnson makes an absurd half appeal"}, {"ball": 14.2, "isHighlight": false, "text": "Johnson to Anderson,no run,a full ball outside off, Anderson opens up his stance and swings hard, mis-times the ball towards mid off"}, {"ball": 14.3, "isHighlight": false, "text": "Johnson to Anderson,no run,banged in short, Anderson backs away and hooks, Johnson follows him and beats him"}, {"ball": 14.4, "isHighlight": false, "text": "Johnson to Anderson,2 runs,a low full toss, Anderson swings and hits the ball behind square leg, Pujara runs to his right from fine leg and dives to save the four"}, {"ball": 14.5, "isHighlight": false, "text": "Johnson to Anderson,no run,Johnson goes very wide of the crease from round the wicket and bowls a slower ball that goes between Anderson's legs as he tries to hit on the leg side, Anderson then went out of his crease and didn't seem to know where the ball was. The keeper's throw missed the stumps by a long way"}, {"ball": 14.6, "isHighlight": false, "text": "Johnson to Anderson,1 run,played to deep midwicket for a single, Johnson has completed an exceptional over"}, {"ball": 15.1, "isHighlight": false, "text": "Balaji to Anderson,1 leg bye,too slow for Anderson, who had swung at the length ball before it reached him, the ball hit his stomach and dropped on the pitch, Rohit rushed through to get on strike. There's a hold up in play after that delivery, I think they were checking if the batsmen had obstructed Balaji as he tried to get to the ball. It looks okay."}, {"ball": 15.1, "isHighlight": false, "text": "John: \"I think Corey's got a problem with genuinely quick bowlers he struggled in the previous game against Steyn n he's struggling against Mitch in his one.\" Most batsmen do, John."}, {"ball": 15.2, "isHighlight": false, "text": "Balaji to Sharma, $$FOUR$$ ,a length ball and Rohit heaves across the line, the ball goes quickly to the deep square leg boundary of the thick inside edge"}, {"ball": 15.3, "isHighlight": false, "text": "Balaji to Sharma, $$OUT$$ ,Saha takes an easy catch! Rohit backed away to leg and closed the face to play the ball through square leg. He played too early and the ball lobbed tamely off the leading edge behind the wicket to Saha"}, {"ball": 15.3, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$†Saha$$ $$b$$ $$Balaji$$ $$39$$ $$(64m$$ $$34b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$114.70$$"}, {"ball": 15.3, "isHighlight": false, "text": "That brings Kieron Pollard to the crease, to join Corey Anderson. The end game has begun."}, {"ball": 15.4, "isHighlight": false, "text": "Balaji to Anderson,1 run,a low full toss outside off, Anderson drives through point for a single"}, {"ball": 15.5, "isHighlight": false, "text": "Balaji to Pollard,no run,Pollard lets his first ball go! Good length outside off and Pollard plays  a Test-match leave"}, {"ball": 15.6, "isHighlight": false, "text": "Balaji to Pollard,no run,this time he's beaten! Pollard pushes forward at a good length ball outside off and is beaten by the seam movement"}, {"ball": 15.6, "isHighlight": false, "text": "Mumbai need 11 an over, it's hotting up. Dhawan, Balaji, Johnson and Sharma will bowl the last four overs. Not necessarily in that order."}, {"ball": 16.1, "isHighlight": false, "text": "Dhawan to Anderson,1 run,full and wide outside off, Anderson reaches for it and hits the ball to long off"}, {"ball": 16.2, "isHighlight": false, "text": "Dhawan to Pollard,1 run,a full ball on middle stump, Pollard chips it over midwicket, falls well short of the man in the deep"}, {"ball": 16.3, "isHighlight": false, "text": "Dhawan to Anderson,no run,very full and rather wide outside off stump, Anderson is too far away from the ball to reach it, I think the bowler is lucky to get away with that"}, {"ball": 16.4, "isHighlight": false, "text": "Dhawan to Anderson, $$OUT$$ ,Anderson fails to see it through! He tries to hit a good length ball over the long-off boundary and doesn't connect properly. Miller is ready and waiting for the catch"}, {"ball": 16.4, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$Miller$$ $$b$$ $$Dhawan$$ $$35$$ $$(38m$$ $$25b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Tare is at the non-striker's end."}, {"ball": 16.5, "isHighlight": false, "text": "Dhawan to Pollard,1 run,a low full toss on off stump, Pollard can't get under it and ends up hitting it through square leg"}, {"ball": 16.6, "isHighlight": false, "text": "Dhawan to Tare,1 run,a full ball on middle and leg, Tare stays back and dabs to midwicket to take the strike net over. Kings XI will not mind that"}, {"ball": 16.6, "isHighlight": false, "text": "Dhawan bowled an outstanding over for KXIP, Mumbai need 13.5 off the last three overs. Balaji to bowl ..."}, {"ball": 17.1, "isHighlight": false, "text": "Balaji to Tare,2 runs,Tare makes room and chips the ball to wide long on, Pollard strides back for the second"}, {"ball": 17.1, "isHighlight": false, "text": "Senthil: \"Classic Mumbai, leaving it too late and even late for Pollard. What Pollard will do this time?\""}, {"ball": 17.2, "isHighlight": false, "text": "Balaji to Tare, $$FOUR$$ ,that's outstanding placement! Tare latches on to a full ball outside off and lofts inside out to the extra cover boundary, almost went all the way for six"}, {"ball": 17.3, "isHighlight": false, "text": "Balaji to Tare,1 run,short of a length, cramping the batsman for room, Tare mis-times the pull down the ground"}, {"ball": 17.4, "isHighlight": false, "text": "Balaji to Pollard,1 run,full ball outside off stump, driven to long off, Pollard hasn't attempted a big shot yet"}, {"ball": 17.5, "isHighlight": false, "text": "Balaji to Tare,2 runs,Tare uses the width outside off stump to cut the ball towards the point boundary, where Akshar Patel fields"}, {"ball": 17.6, "isHighlight": false, "text": "Balaji to Tare, $$SIX$$ ,that's a stunning finish to the over from Tare, he's dragged Mumbai back into this! He charges the final ball, which is a harmless length delivery, and pulls it over the deep midwicket boundary"}, {"ball": 17.6, "isHighlight": false, "text": "Bailey goes to Johnson to defend 25 off 12 balls, and try and take out Pollard."}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to Pollard, $$SIX$$ ,Pollard's clobbered this! You cannot bowl full to him. Pollard makes room by moving outside leg and launches the ball powerfully over the long-on boundary"}, {"ball": 18.1, "isHighlight": false, "text": "Surely Johnson needs to bowl short at Pollard? Johnson goes round the wicket and aborts his delivery as he nears his jump."}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to Pollard,1 wide,short ball but it's mis-directed down leg side, that's a wide. Will Johnson be able to keep it together? Mumbai seem to be favourites now ..."}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to Pollard,2 runs,he goes full, not short, misses the yorker by a little, Pollard hits the low full toss to deep midwicket and comes back for the second ..."}, {"ball": 18.3, "isHighlight": false, "text": "Johnson to Pollard,2 runs,a slower ball, but Pollard checks his shot and manages to dab it towards square leg, Pollard comes back for the second before the fielder in the deep can rush in to field the ball"}, {"ball": 18.4, "isHighlight": false, "text": "Johnson to Pollard, $$FOUR$$ ,the yorker, but it's gone for four! Johnson fired in the yorker from round the wicket, Pollard jammed his bat down on it and the ball goes off the inside edge to the fine leg boundary"}, {"ball": 18.5, "isHighlight": false, "text": "Johnson to Pollard, $$FOUR$$ ,Pollard you beauty! Johnson has been torn apart. Pollard pulled at a slower ball, and made good enough contact to beat the fielder on the square leg boundary."}, {"ball": 18.6, "isHighlight": false, "text": "Johnson to Pollard,1 run,a full toss to complete a shocker from Johnson, Pollard drives it to long on and settles for the single to keep strike"}, {"ball": 18.6, "isHighlight": false, "text": "Sandeep Sharma has just five to defend off the final over. Faiz: \"How crucial was that last over from Malinga which went for 3 runs , during KXIP innings ?????\""}, {"ball": 19.1, "isHighlight": false, "text": "Sandeep Sharma to Pollard, $$SIX$$ ,he's done it! Pollard has ended Mumbai's run of defeats. He's done it by lofting a length ball lean over the long off boundary. The Wankhede erupts, Mumbai did not lose here last season, they have kept that streak going"}, {"ball": 19.1, "isHighlight": false, "text": "$$7.40$$ $$pm$$  Kings XI Punjab's campaign has touched earth, their first defeat after five wins. Mumbai have a first victory after five defeats. The upshot from this result is that we have  $$a$$ $$new$$ $$table$$ $$leader$$ , Chennai Super Kings are head of Kings XI on net run rate."}, {"ball": 19.1, "isHighlight": false, "text": "Daniel Alexande: \"Lasith Malinga's brilliant death bowling was the difference today \""}, {"ball": 19.1, "isHighlight": false, "text": "Nandakiran N: \"Pollard is looking as good as he looked in edition 3 of IPL. So Monstrous! Good Games consecutively!\""}, {"ball": 19.1, "isHighlight": false, "text": "shantanu: \"malinga was not the difference. everybody knows its hard to hit malinga at death so you need to target other bowlers. difference was all the runs lost out due to slow scoring by saha at the start of his innings.maxwell did not get enough strike.\""}, {"ball": 19.1, "isHighlight": false, "text": "Deepak: \"Everybody is talking about pollard and malinga but what about Tare..he was true remarkable his 16 runs just came in 6 balls. unsung Hero \""}, {"ball": 19.1, "isHighlight": false, "text": "Kuldeep: \"@shantanu: Absolutely. People tend to wrongly associate T20 with just boundaries and big hits. It is the constant rotation of strike in between that actually matters. Both teams will hit boundaries anyway. It is the team takes many 1s and 2s in between and doesn't let panic set in due to many dot balls that wins in the end. Batsmen should learn from Virat Kohli.\""}, {"ball": 19.1, "isHighlight": false, "text": "I'm sorry but we haven't been shown the presentation today, because of the spill over into the next game. Thank you for all your emails. Stick around for Delhi Daredevils v Rajasthan Royals! Cheers."}], "name": "Mumbai Indians v Kings XI Punjab", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733973.html?innings=2;view=commentary", "match_num": 22}