{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00$$ $$pm$$  Strangely enough, we didn't get telecast of the previous match's presentation ceremony. But who cares (actually for those who do, Corey Anderson was declared the Man of the Match), Rajasthan Royals and striding out into the field. M Vijay and Quinton de Kock bound out as well.  $$Halla$$ $$Bol$$  blares out as we get ready for the first ball. How bout that for hospitality? Hallo, Stuart Binny has the ball in hand. Slip in place"}, {"ball": 0, "isHighlight": false, "text": "$$7.50$$ $$pm$$  \"Practically this is not the home game for dd as pitch is new and changed..\" Satyam, we aren't completely sure if it's a new deck, but apparently it was changed a couple of days ago."}, {"ball": 0, "isHighlight": false, "text": "Sam: \"Are you the Alagappan Muthu of basketball statistics fame?\" You mean there's an Alagappan Muthu more popular than me?!"}, {"ball": 0, "isHighlight": false, "text": "\"It was not a yorker. It was a slightly full delivery which came in with the angle and then pitched and seamed away. Totally unplayable.\"  $$See$$ $$why$$ $$I$$ $$hid$$ $$my$$ $$name?$$  We'll agree to disagree, Aniket"}, {"ball": 0, "isHighlight": false, "text": "Kevin Pietersen, with a load less bandage on his finger, calls Feroz Shah Kotla a fortress at the toss but follows it up saying he was unsure about the pitch. Talk about opposite ends of a spectrum. Though he did have company in the opposition camp as well. Shane Watson said the pitch was changed two or so days ago so they preferred to bowl and see how it behaved. The home captain said it was a high-scoring ground and that defending is difficult, but he was confident with his batsmen and was hoping his bowlers orchestrate a middle-overs strangle"}, {"ball": 0, "isHighlight": false, "text": "Rahul: \"I just happened to notice this, but why doesn't cricinfo show the name of the commentator and the scorer in the summary page anymore? Is there a problem revealing the names of the guys who are doing their job so nicely? I'd really like to know the names :)\" Well, I was taught to be a modest lad but hey, if it pleases the masses, this is Alagappan Muthu. Don't wear it out"}, {"ball": 0, "isHighlight": false, "text": "$$7.35$$ $$pm$$  So while a thriller is still under way at the Wankhede, the more important news, at least as far as this corner of the internet is concerned,  $$Rajasthan$$ $$Royals$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elected$$ $$to$$ $$field$$ . Iqbal Abdulla sits out for  $$Dhawal$$ $$Kulkarni$$ . The home camp though has gone the over way, switching a seamer in Laxmi Shukla for legspinner  $$Rahul$$ $$Sharma$$ . If there was any mind to analysing XIs and pitches and the conditions, this is not the game for it."}, {"ball": 0, "isHighlight": false, "text": "\"RR still in search of rahane's opening partner; unmukt should get a chance today specially in Delhi,\" Raja adds another reason in favour of India's Under-19 World Cup winning captain. Hopefully he's recovered from that scorching yorker Brett Lee bowled to him last season. First ball of the IPL and stumps were shattered"}, {"ball": 0, "isHighlight": false, "text": "--------------"}, {"ball": 0, "isHighlight": false, "text": "The contest continues on  $$CricIQ$$  - two more days, six more attempts to find a spot in the Powerplay leaderboard, and join Joy Bhattacharjya on the video rounds. Are you fan enough?"}, {"ball": 0.1, "isHighlight": false, "text": "Binny to de Kock,no run,invites him forward with a fuller delivery outside off and de Kock times it nicely to mid-off"}, {"ball": 0.2, "isHighlight": false, "text": "Binny to de Kock, $$FOUR$$ ,drilled through point! Sought the blockhole, but de Kock came forward with an open face and the square drive was even better struck"}, {"ball": 0.3, "isHighlight": false, "text": "Binny to de Kock,1 run,little inward drift and de Kock clips the good length ball towards midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Binny to Vijay,2 runs,far more tentative is Vijay as a back of a length delivery shapes away. Gets a thick outside edge down to third man. I get the feeling Binny likes a right-hander better"}, {"ball": 0.4, "isHighlight": false, "text": "Archit: \"Was that a MIB reference?\" I'll nod my head, like that"}, {"ball": 0.5, "isHighlight": false, "text": "Binny to Vijay,1 run,and even as I say that he bowls a full toss on leg stump and Vijay tucks it behind square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Binny to de Kock,1 run,whipped through to deep midwicket. This was fuller but the line was on the pads, easy put away for de Kock"}, {"ball": 0.6, "isHighlight": false, "text": "Kane Richardson still posing considerable challenge to Hashim Amla's beard comes on"}, {"ball": 1.1, "isHighlight": false, "text": "Richardson to de Kock,1 run,just back of a length on middle and leg, tucked away in front of square leg"}, {"ball": 1.2, "isHighlight": false, "text": "Richardson to Vijay, $$FOUR$$ ,offers room and it was a half volley as well, Vijay leans into a gorgeous cover drive. Had no troubles at all"}, {"ball": 1.3, "isHighlight": false, "text": "Richardson to Vijay,1 run,opens the face that time as he preempts the bowler would go shorter. Stays back in his crease and finds third man"}, {"ball": 1.4, "isHighlight": false, "text": "Richardson to de Kock,no run,back of a length on and around off stump, de Kock looks to close his bat a little too early and gets an outside edge towards cover"}, {"ball": 1.5, "isHighlight": false, "text": "Richardson to de Kock,1 run,this time the length is a little fuller and de Kock nudges it through midwicket off the back foot"}, {"ball": 1.6, "isHighlight": false, "text": "Richardson to Vijay,no run,sends in a short one just outside off, soars past a swaying Vijay and the keeper has to leap as high as he could go to pull that in"}, {"ball": 1.6, "isHighlight": false, "text": "\"Has someone deceived Vijay by saying that these are knock out matches? 40 in the previous game and now,a cracking cover drive to start off. \" Nandakiran N wonders. Any bets on hypnosis?"}, {"ball": 2.1, "isHighlight": false, "text": "Kulkarni to de Kock,1 run,full and tailing in on leg stump, clips through square leg"}, {"ball": 2.2, "isHighlight": false, "text": "Kulkarni to Vijay,no run,back of a length on off stump, Vijay tries a shuffle but then taps to mid-on"}, {"ball": 2.3, "isHighlight": false, "text": "Kulkarni to Vijay,no run,goes fuller and the shape away gains a little more potency. Vijay is forward and gets it off the outside half of the bat towards cover"}, {"ball": 2.4, "isHighlight": false, "text": "Kulkarni to Vijay,1 run,picks this off off stump and flicks it to deep square leg. Why bother with the covers when you have wrists like that"}, {"ball": 2.4, "isHighlight": false, "text": "Murali: \"4 South Africans vs 4 Australians, wonder which will prevail.\""}, {"ball": 2.5, "isHighlight": false, "text": "Kulkarni to de Kock,no run,this was the slower delivery pushed wide outside off. De Kock slashes and misses"}, {"ball": 2.6, "isHighlight": false, "text": "Kulkarni to de Kock, $$FOUR$$ ,plants his front leg across on off stump and swiped it to the long leg boundary. That's 2000 runs in T20 cricket for QDK. Well done to him, especially in spotting that slower ball"}, {"ball": 2.6, "isHighlight": false, "text": "Amit: \"Can @EspnCricinfo confirm that Tahir is in DD squad? If yes then I think he should ply DD struggles with Spin Dept\" We heard it where you heard it as well, on the telecast"}, {"ball": 2.6, "isHighlight": false, "text": "Watto into the attack"}, {"ball": 3.1, "isHighlight": false, "text": "Watson to Vijay,3 runs,floats a fuller ball, Vijay takes it from outside off and those wrists come into picture again. Lovely timing meant the fielder at deep midwicket had a lot of ground to cover and needed a full-length dive as well"}, {"ball": 3.2, "isHighlight": false, "text": "Watson to de Kock,no run,full and wide outside off, De Kock drives into the covers but hasnt timed it"}, {"ball": 3.3, "isHighlight": false, "text": "Watson to de Kock,1 run,they're not bothering with the off side much. This was full and angling across the batsman, but De Kock pushed forward and his fast hands pull off a whip to deep midwicket"}, {"ball": 3.4, "isHighlight": false, "text": "Watson to Vijay,1 run,slightly slower this time so Vijay has to wait on it but still flicks it handsomely to deep midwicket"}, {"ball": 3.4, "isHighlight": false, "text": "Mudhabir: \"Have you forget about the 14 indians. Its Indian Premier league\""}, {"ball": 3.5, "isHighlight": false, "text": "Watson to de Kock, $$SIX$$ ,this has gone all the way! QDK on fire. Full and outside off but he skips across outside off and flicks it away. All the way."}, {"ball": 3.6, "isHighlight": false, "text": "Watson to de Kock,no run,that must have geed Watson up. Fires in a 136k fuller ball outside off. De Kock allows it through to the keeper. Was a little too outside leg to reach"}, {"ball": 3.6, "isHighlight": false, "text": "Sam: \"Looking at QdK, it seems he has reached 2000 runs before reaching puberty. :)\""}, {"ball": 3.6, "isHighlight": false, "text": "Faulkner is in"}, {"ball": 4.1, "isHighlight": false, "text": "Faulkner to Vijay, $$OUT$$ ,and produces magic straight away. Vijay looks to force the pace off a back of a good length delivery and has spooned a catch to mid-off. Would have done better to punch off the back foot, but Vijay is most comfortable pressing forward. Went through with the shot and the bat face turned on impact. Ends up a simple catch after Watson called mine"}, {"ball": 4.1, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$Watson$$ $$b$$ $$Faulkner$$ $$13$$ $$(20m$$ $$11b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$118.18$$"}, {"ball": 4.1, "isHighlight": false, "text": "KP is in at No.3. He averages 83 and strikes 152 at Kotla"}, {"ball": 4.2, "isHighlight": false, "text": "Faulkner to de Kock,no run,back of a length on middle, De Kock presents a dead bat"}, {"ball": 4.3, "isHighlight": false, "text": "Faulkner to de Kock,no run,fuller delivery on off stump, De Kock closes the face to mid-on"}, {"ball": 4.4, "isHighlight": false, "text": "Faulkner to de Kock,1 run,shortish and angled in at him, De Kock picks a single to deep square leg"}, {"ball": 4.5, "isHighlight": false, "text": "Faulkner to Pietersen,no run,fullish and just outside off, KP is punches to mid-off after a big move forward. That's usually a sign that he's feeling good"}, {"ball": 4.6, "isHighlight": false, "text": "Faulkner to Pietersen,1 run,more evidence for KP's form: the push down the ground and a hare across to the non-strikers'"}, {"ball": 4.6, "isHighlight": false, "text": "Pravin Tambe to bowl the final over of Powerplay."}, {"ball": 5.1, "isHighlight": false, "text": "Tambe to Pietersen,1 run,skids on with the arm and KP has to hurry into a flick towards midwicket"}, {"ball": 5.1, "isHighlight": false, "text": "KellyM: \"KP has only played 17 more T20 matches than QdK, despite the 12 year age gap!\""}, {"ball": 5.2, "isHighlight": false, "text": "Tambe to de Kock,no run,flighted on off stump, De Kock pushes to the left of the bowler"}, {"ball": 5.3, "isHighlight": false, "text": "Tambe to de Kock, $$FOUR$$ ,loops it up but errs by giving a little room. De Kock lashes it through the covers. He seems pretty adept at getting those fuller balls away through the off side"}, {"ball": 5.4, "isHighlight": false, "text": "Tambe to de Kock, $$FOUR$$ ,this time off the back foot. He knew Tambe would pull his length back and he jumped back, made a little room outside leg and cuts past a diving point"}, {"ball": 5.5, "isHighlight": false, "text": "Tambe to de Kock,no run,think this was the wrong 'un. Tossed up on leg stump and QDK watchfully defends. Don't think he read it"}, {"ball": 5.6, "isHighlight": false, "text": "Tambe to de Kock,2 runs,flighted on middle, De Kock drills it places it nicely between deep midwicket and long-on"}, {"ball": 5.6, "isHighlight": false, "text": "\"KP might fail today but i still think this is a really good decision to play at No.3. Karthick should come at 4 and Duminy to provide the last blast at 5. \" Is that the anti-jinx, shantanu? Well, it's Rajat Bhatia now. How slow can he go?"}, {"ball": 6.1, "isHighlight": false, "text": "Bhatia to Pietersen,no run,good length ball outside off, KP wades into a punch to cover"}, {"ball": 6.2, "isHighlight": false, "text": "Bhatia to Pietersen,no run,legcutter and KP looks for a whip off the legs. Doesn't succeed in getting bat to it and then he looks for a cheeky single as the ball dribbles behind him. Samson rushed after it and hurled the throw and finds the target.  $$The$$ $$umps$$ $$haven't$$ $$referred$$ $$it,$$ $$but$$ $$the$$ $$replays$$ $$show$$ $$KP$$ $$was$$ $$way$$ $$out$$ . The Rajasthan dug out have sent the info out and Watson is having a heated conversation with the umps."}, {"ball": 6.2, "isHighlight": false, "text": "Sanjay Hazare was the square leg umpire"}, {"ball": 6.3, "isHighlight": false, "text": "Bhatia to Pietersen,1 run,another legcutter and this time KP trusts his straight bat and drives to long-on"}, {"ball": 6.4, "isHighlight": false, "text": "Bhatia to de Kock,1 run,fullish on the pads, De Kock nudges towards midwicket and the bowler himself has to race after it"}, {"ball": 6.5, "isHighlight": false, "text": "Bhatia to Pietersen,1 run,long-off is back as KP leans forward to yet another legcutter and hits uppishly down the ground"}, {"ball": 6.6, "isHighlight": false, "text": "Bhatia to de Kock,1 run,took it from the stumps and cuts the slower ball straight to point. And he goes for the run! Desparing dive from De Kock (Yes, I liked saying that) but the throw doesn't find it's mark"}, {"ball": 6.6, "isHighlight": false, "text": "Raghu: \"Never seen an anti- jinx work so well !!\" Me neither"}, {"ball": 6.6, "isHighlight": false, "text": "Seems to be the time out"}, {"ball": 6.6, "isHighlight": false, "text": "Mohan: \"we know its out. but this aint different from not giving a plumb LBW out.. its a easy game when we see in big screen isnt it?\" That's fair enough, but when you keep checking the no-ball after every wicket, why can't you go up for a contentious run-out?"}, {"ball": 7.1, "isHighlight": false, "text": "Tambe to de Kock,1 run,tossed up on the pads, QDK nudges through to deep midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Tambe to Pietersen,1 run,skips down the track and slices this through to the sweeper. Almost had to dig that out of the blockhole"}, {"ball": 7.3, "isHighlight": false, "text": "Tambe to de Kock,1 run,googly and this time he camps on his back foot having picked it and taps it through to deep cover"}, {"ball": 7.4, "isHighlight": false, "text": "Tambe to Pietersen,no run,he's gotten away with that. It's a short ball spinning away too, KP rocks back to cut and gets a thick outside edge that almost reaches short third man"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to Pietersen, $$FOUR$$ ,take that. Comes forward and opens the face of the bat to smash this flighted ball through the covers. Magnificent footwork there as he stayed leg side to hit inside out"}, {"ball": 7.6, "isHighlight": false, "text": "Tambe to Pietersen,no run,swift turn for Tambe and KP was almost deceived. Looks ungainly as he cuts off the back foot. Almost lost his balance"}, {"ball": 7.6, "isHighlight": false, "text": "Inzamam ul Haq: \"Are you kidding me. Umpires, why didn't you do this for any of my 125 run outs\""}, {"ball": 8.1, "isHighlight": false, "text": "Bhatia to de Kock,1 run,offcutter now, but its on the pads and De Kock tucks it away to square leg"}, {"ball": 8.1, "isHighlight": false, "text": "JK: \"I wont be surprised if Steve Smith and A Rahane bowls the ninth and tenth over :P\" Watson has been busy with his changes, hasn;t he?"}, {"ball": 8.2, "isHighlight": false, "text": "Bhatia to Pietersen,1 run,do I even need to bother typing slower ball for this guy? Foils KP's timing thoroughly as the length ball is bunted to long-off"}, {"ball": 8.3, "isHighlight": false, "text": "Bhatia to de Kock, $$FOUR$$ ,you beauty! Walks across and swipes this low full toss over the head of a diving short fine leg fielder. This was the seam-up delivery and whatever extra pace it had was utilised magnificently"}, {"ball": 8.4, "isHighlight": false, "text": "Bhatia to de Kock,no run,goes back to his variations as the offcutter is chopped to point"}, {"ball": 8.5, "isHighlight": false, "text": "Bhatia to de Kock,1 run,legcutter with ample width, De Kock comes forward and slaps it to the sweeper"}, {"ball": 8.6, "isHighlight": false, "text": "Bhatia to Pietersen, $$FOUR$$ ,short and wide and KP has muscled it to the right of the sweeper. He knew exactly where that man was as he sat and waited and then square drove it with a whip of his wrists. Daredevils have set up an excellent foundation here"}, {"ball": 8.6, "isHighlight": false, "text": "\"Good for us that Danny isn't there today in the Comm box. DD, RR, QDK, KP, KDK, JP.. Uffff..\" Spoke too soon, Swami"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe continues unchanged for his third over"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to de Kock,1 run,flighted on middle, nudged through the vacant midwicket region"}, {"ball": 9.2, "isHighlight": false, "text": "Tambe to Pietersen,no run,this is shortish and he cuts into the off side. Looked to hit it too hard"}, {"ball": 9.3, "isHighlight": false, "text": "Tambe to Pietersen, $$OUT$$ ,picks out long-on! This skewed off the inside half of the bat and it's Steven Smith down there. You know the rest of it. Tossed up and he looked to take it on. His timing fails him and this time the umps don't bother about the front-foot no-ball check"}, {"ball": 9.3, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$c$$ $$Smith$$ $$b$$ $$Tambe$$ $$14$$ $$(23m$$ $$15b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$93.33$$"}, {"ball": 9.3, "isHighlight": false, "text": "Niyas: \"watson is getting the feel of gully cricket where he has to give bowl to everyone\""}, {"ball": 9.4, "isHighlight": false, "text": "Tambe to de Kock,1 leg bye,flighted on leg, goes for the sweep but he can't hit it well enough. Single towards square leg"}, {"ball": 9.4, "isHighlight": false, "text": "Dinesh Karthik is at No.4. Good move considering the battery of slow bowlers Royals have"}, {"ball": 9.5, "isHighlight": false, "text": "Tambe to Karthik,1 run,flatter delivery on off stump, pushed down to long-on"}, {"ball": 9.6, "isHighlight": false, "text": "Tambe to de Kock, $$OUT$$ ,another one, Tambe, you legend! Looped it on off stump and De Kock could not resist. Went for a drive against the turn and the ball pitched just before his flaying blade, took the inside half of it and sat safely in the hands of the bowler himself. Tambe was pushed to the floor while taking the catch, but he had it under control"}, {"ball": 9.6, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$c$$ $$&$$ $$b$$ $$Tambe$$ $$42$$ $$(48m$$ $$33b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$127.27$$"}, {"ball": 9.6, "isHighlight": false, "text": "Adam Alves: \"Just when I thought DD figured out their batting lineup they go back to their same old habits with JP. (Let you best batsmen face the most balls)\" Not how they intended it, but Duminy is out there now. James Faulkner is the new bowler, by the way"}, {"ball": 10.1, "isHighlight": false, "text": "Faulkner to Karthik,1 run,back of a length and outside off, Karthik opens the face to sneak a single through point"}, {"ball": 10.2, "isHighlight": false, "text": "Faulkner to Duminy,1 run,shortish and JP rises with it and dabs it with short hands behind point"}, {"ball": 10.3, "isHighlight": false, "text": "Faulkner to Karthik,no run,fullish on off stump, he comes forward and blocks"}, {"ball": 10.4, "isHighlight": false, "text": "Faulkner to Karthik,2 leg byes,fullish and DK races down the track to whip through midwicket. But the ball skews off the pads towards midwicket. Appeal from the bowler, but I think that pitched outside leg"}, {"ball": 10.5, "isHighlight": false, "text": "Faulkner to Karthik,1 run,walks at him and blocks the short of a good length delivery towards mid-on. Direct hit at the bowlers' tempts DK towards a second, but he is sent back"}, {"ball": 10.6, "isHighlight": false, "text": "Faulkner to Duminy,1 run,shortish and JP works it off his hips towards midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Kane  $$Richardson$$ , as many of you have pointed out, is into the attack"}, {"ball": 11.1, "isHighlight": false, "text": "Richardson to Duminy,1 run,just back of a good length as he tucks Duminy up. Manages a little dab towards midwicket"}, {"ball": 11.2, "isHighlight": false, "text": "Richardson to Karthik,1 run,wears it on the glove and scampers across for a single. It was a well directed short ball that seemed to climb on him. DK handled it well and the midwicket fielder just missed the bowler while hitting the stumps at the nonstrikers'"}, {"ball": 11.2, "isHighlight": false, "text": "Slip in place. Royals seem to have control of this now"}, {"ball": 11.3, "isHighlight": false, "text": "Richardson to Duminy,no run,shortish on and around the stumps, blocked"}, {"ball": 11.4, "isHighlight": false, "text": "Richardson to Duminy,no run,on the pads, but JP can't pick it away off his hips"}, {"ball": 11.5, "isHighlight": false, "text": "Richardson to Duminy,1 run,shortish and this time just outside off, JP is comfortable letting it run down his open face towards third man"}, {"ball": 11.6, "isHighlight": false, "text": "Richardson to Karthik,no run,fullish on off stump, DK pushes back to the bowler. Lovely straight bat"}, {"ball": 11.6, "isHighlight": false, "text": "Last five overs 31 runs and 2 wickets. Can the JP charm work again for Delhi? He has the challenge of Bhatia now"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Duminy,1 run,offcutter, driven down to long-off"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Karthik,1 run,legcutter on the pads, DK eases it behind square leg"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Duminy,1 run,clipped towards the midwicket region as this slower ball was a little shortish in length"}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Karthik,2 runs,seam up and DK has smashed it through the legs of the bowler. The virtue of a straight bat but it's Smith down there, races across from long-off and pulls it in"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Karthik,no run,sought to ride the slower ball and dab it to third man for a single, but the legcutter bounces more and beats him. Well kept by Samson"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Karthik,1 run,fullish on off stump, defended into the covers for a single"}, {"ball": 12.6, "isHighlight": false, "text": "kk: \"delhi is totally depended on overseas whereas only those tem progress well where indian locals perform..for example chennai\" Age old mantra in IPL, isn't it?"}, {"ball": 13.1, "isHighlight": false, "text": "Kulkarni to Karthik,1 run,flicked off his toes as this was full and sliding down leg. Neatly done, bit finds the man in the deep"}, {"ball": 13.2, "isHighlight": false, "text": "Kulkarni to Duminy,no run,back of a length on off stump, JP goes back and blocks towards midwicket"}, {"ball": 13.3, "isHighlight": false, "text": "Kulkarni to Duminy,1 run,terrific stroke. Granted it was asking for it but JP had a long way to reach as he rocked back and cut through a diving backward point"}, {"ball": 13.4, "isHighlight": false, "text": "Kulkarni to Karthik,1 run,shortish on middle, DK works it down to long leg"}, {"ball": 13.5, "isHighlight": false, "text": "Kulkarni to Duminy,no run,walks across to pull it down to fine leg, but this one is a little quicker from Kulkarni. Decent height too, around the shoulders as he misses"}, {"ball": 13.6, "isHighlight": false, "text": "Kulkarni to Duminy,no run,this is the slower ball with a bit of width, JP spotted it but cuts straight to point."}, {"ball": 13.6, "isHighlight": false, "text": "Sam: \"@kk - Well, seeing that 7 out of 11 players ina team are Indians, that should be a no-brainer statistics.\""}, {"ball": 13.6, "isHighlight": false, "text": "Harshad: \"@kk What about KXIP in this season?\" Balaji and Sandeep Sharma have been brilliant. Oho, forgot about informing you guys of the time out. And Royals go one better in the last five overs: 21 for 2. Here's one of the men responsible, Pravin Tambe"}, {"ball": 14.1, "isHighlight": false, "text": "Tambe to Karthik,1 run,flighted on the stumps, driven nicely to long-on"}, {"ball": 14.2, "isHighlight": false, "text": "Tambe to Duminy,1 run,a little more flight on this and JP dances down the track and works it towards deep midwicket."}, {"ball": 14.3, "isHighlight": false, "text": "Tambe to Karthik,1 run,goes deep in his crease as Tambe bowls this well behind the bowling crease. Ends up a little shortish and DK cuts to short third man"}, {"ball": 14.4, "isHighlight": false, "text": "Tambe to Duminy,no run,flights it on off stump, JP goes for the sweep but it turns and sneaks through. Deflects off his thigh and the keeper can't collect"}, {"ball": 14.5, "isHighlight": false, "text": "Tambe to Duminy,1 run,nudged straight of midwicket to pick up a couple. Good use of the feet again. Oh, but look DK has not put his bat in while he was turning for the second"}, {"ball": 14.6, "isHighlight": false, "text": "Tambe to Duminy,1 run,flicked off a good length to deep midwicket and they walk the single"}, {"ball": 14.6, "isHighlight": false, "text": "It's death overs time and on comes Faulkner again"}, {"ball": 15.1, "isHighlight": false, "text": "Faulkner to Duminy,1 run,back of a length and outside off, tapped behind towards third man"}, {"ball": 15.2, "isHighlight": false, "text": "Faulkner to Karthik, $$OUT$$ ,holes out at deep square leg! Another crucial wicket at a crucial time for Royals. Dug in short and he chose to take it on. Hit high on the bat as he looked to pull. The man in the deep hardly had to move"}, {"ball": 15.2, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Binny$$ $$b$$ $$Faulkner$$ $$12$$ $$(28m$$ $$16b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$75.00$$"}, {"ball": 15.2, "isHighlight": false, "text": "Don: \"@Sam - It should be, but team still focus and spend most of their money on big name overseas players. Teams like Chennai, RR and even KXIP to an extent who realized this and have balanced sides with quality domestic players to back up their big international names are the ones that succeed. Although IPL seems to be moving in that direction focusing more and more towards the locals talents, unlike the first couple of seasons when it was all about the big international players. \""}, {"ball": 15.2, "isHighlight": false, "text": "Kedar Jadhav, the top-scorer of the Ranji Trophy, is out there"}, {"ball": 15.3, "isHighlight": false, "text": "Faulkner to Jadhav,no run,greeted by a short ball and he ducks under it"}, {"ball": 15.4, "isHighlight": false, "text": "Faulkner to Jadhav,1 run,slower ball off the back of the hand, he chops it to the right of the keeper for a single"}, {"ball": 15.4, "isHighlight": false, "text": "sanjay: \"Come on Delhi wake up early, it's a limited over match \""}, {"ball": 15.5, "isHighlight": false, "text": "Faulkner to Duminy,1 run,shortish and outside off, steered to deep third man again. JP is playing the waiting game, but is he waiting a little too long?"}, {"ball": 15.6, "isHighlight": false, "text": "Faulkner to Jadhav, $$SIX$$ ,top-edged six! This looked even worse than DK's dismissal, but it went to a more fortunately-sized part of the ground. Lovely short ball from Faulkner again and Jadhav was quite late on his hook"}, {"ball": 15.6, "isHighlight": false, "text": "Dhawal Kulkarni from the other end"}, {"ball": 16.1, "isHighlight": false, "text": "Kulkarni to Duminy, $$FOUR$$ ,pushes it wide and JP reaches out and times this brilliantly! But the clinching factor was a little clumsiness from Richardson in the deep. Overruns the ball and lets it through his legs at deep cover"}, {"ball": 16.2, "isHighlight": false, "text": "Kulkarni to Duminy,1 run,another one with all the pace off it, shortish delivery chopped towards point"}, {"ball": 16.2, "isHighlight": false, "text": "Tushar: \"A few bowlers are in the running for the purple cap, but Faulkner is skating towards it... If he keeps going like this, he might add it to his wardrobe in a couple of games\" And he picks them around the death"}, {"ball": 16.3, "isHighlight": false, "text": "Kulkarni to Jadhav,1 run,full and angled into the pads, Jadhav glances it to long leg"}, {"ball": 16.4, "isHighlight": false, "text": "Kulkarni to Duminy,1 run,full and wide again, JP has a long way to reach and steers it to deep point"}, {"ball": 16.4, "isHighlight": false, "text": "anil: \"delhi is not overly dependent on overseas players its just that domestic players havent been performing good enough murali vijay,karthik,kedar jadav,shami,nadeem are proven performers be it ipl or ranji trophy\""}, {"ball": 16.5, "isHighlight": false, "text": "Kulkarni to Jadhav,1 run,shortish and outside off, Jadhav finds deep third man with a dab. Out in the dugout, Gary Kirsten is shuffling in his seat"}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Duminy,1 run,that's a lovely delivery. Slower bouncer. Shades of Shaun Pollock there. JP adjusts well enough but still he can only pull it for a single through midwicket"}, {"ball": 17.1, "isHighlight": false, "text": "Richardson to Duminy, $$FOUR$$ ,that's what he can do. He is such a clever striker at this time of the innings. It was short and angled across him. There was no slip (obviously) and JP opens the blade and uses the extra pace of the new bowler Richardson to tuck into an easy boundary to deep third man"}, {"ball": 17.2, "isHighlight": false, "text": "Richardson to Duminy,no run,looks for it again, but this time the cheekiness doesn't come off. It was shortish and on middle which probably hurt the execution"}, {"ball": 17.3, "isHighlight": false, "text": "Richardson to Duminy,no run,skips down the track while making room for himself, but his slice finds cover"}, {"ball": 17.4, "isHighlight": false, "text": "Richardson to Duminy,1 run,slower ball on the pads, clips to midwicket. JP had opened his stance that time"}, {"ball": 17.4, "isHighlight": false, "text": "Marius: \"well done, JP Duminy reaching 4,000 runs\" QDK got to 2000 too. How many more landmarks will this game fetch?"}, {"ball": 17.5, "isHighlight": false, "text": "Richardson to Jadhav,1 wide,that's an easy one for the umpire. Slower ball slides down leg. Jadhav was walking across to pull over fine leg but can't reach"}, {"ball": 17.5, "isHighlight": false, "text": "Richardson to Jadhav,1 run,staying deep in the crease helps him punch an almost-yorker down to long-on. Gee, that was struck hard."}, {"ball": 17.6, "isHighlight": false, "text": "Richardson to Duminy, $$FOUR$$ ,length on the stumps and JP shuffles off side to cart it away to the square leg boundary. Extra ball bites"}, {"ball": 17.6, "isHighlight": false, "text": "Biplab: \"Murli Vijay is not performing..DK should open with Quinton..and Jadhav should be promoted to 3, with KP and Manoj Tiwary and JP to follow..that should be the right batting order for DD..\""}, {"ball": 18.1, "isHighlight": false, "text": "Faulkner to Jadhav,no run,dot ball straight up. It's the slower one off the back of the hand, Jadhav was set up for the heave over cow corner, but he misses completely"}, {"ball": 18.2, "isHighlight": false, "text": "Faulkner to Jadhav, $$FOUR$$ ,skips down the track, turns the full delivery into a full toss and his timing is sit-up-on-your-chair-and-rub-your-eyes good! What a flick, deep midwicket had no chance"}, {"ball": 18.2, "isHighlight": false, "text": "Now that man goes out. Cover comes in"}, {"ball": 18.3, "isHighlight": false, "text": "Faulkner to Jadhav,1 run,this was a good length, slower ball following him as he moved outside leg. The ball gets a kick off the turf after it hit the seam and it is chopped towards third man"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to Duminy,1 run,ends up low full toss just outside off as JP comes at him. Eased through to the sweeper"}, {"ball": 18.5, "isHighlight": false, "text": "Faulkner to Jadhav,1 run,down the track again and he flicks it off middle to deep midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to Duminy, $$FOUR$$ ,got under it and that helps him smash it down the ground. Long-on can only jog across and return the cherry back. Faulkner misses his length and JP was ready and waiting deep in his crease"}, {"ball": 18.6, "isHighlight": false, "text": "Kane Richardson to finish things off, starts around the wicket"}, {"ball": 19.1, "isHighlight": false, "text": "Richardson to Jadhav,1 run,fires it seeking the block hole on middle, Doens't find it and Jadhav has punched it down to long-on"}, {"ball": 19.2, "isHighlight": false, "text": "Richardson to Duminy, $$SIX$$ ,length again and Duminy has mauled it over square leg. This is what he was looking for, one to swing that backlift clean through the line of the ball. This little partnership has reached 46 off 25"}, {"ball": 19.3, "isHighlight": false, "text": "Richardson to Duminy, $$OUT$$ ,what a catch! Bhatia has picked up a sensational catch while skirting the long leg boundary! This was full and on leg stump and again sat up for Duminy to swing away. The fielder had to run to his right, had his eyes on it all the way and pouched it. But then he made sure he kept his balance. Faulkner was right beside him just in case he couldn't and needed assistance"}, {"ball": 19.3, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$c$$ $$Bhatia$$ $$b$$ $$Richardson$$ $$39$$ $$(45m$$ $$31b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$125.80$$"}, {"ball": 19.4, "isHighlight": false, "text": "Richardson to Jadhav, $$FOUR$$ ,mighty strike through the covers! Jadhav is making a big case here for Delhi. This was almost a yorker and he had absolutely no room for the shot. Yet he opened the face and laced it through."}, {"ball": 19.4, "isHighlight": false, "text": "still around to right hander"}, {"ball": 19.5, "isHighlight": false, "text": "Richardson to Jadhav, $$SIX$$ ,Richardson, what are you doing?! Serving up length in the final over against a batsman who is timing it like a dream. Came forward and launched it straight over the bowler's head."}, {"ball": 19.6, "isHighlight": false, "text": "Richardson to Jadhav,1 run,full toss outside off as he switches over the wicket. Goes for another swing but it came at him a little too quickly and he can only bunt it to long-off"}, {"ball": 19.6, "isHighlight": false, "text": "$$9.40$$ $$pm$$  Delhi Daredevils have smashed 40 off the last three overs. Kedar Jadhav has been brilliant and JP Duminy had a little hand in it as well. But Rajasthan Royals wouldn't be too trifled by this target. They pulled things back in the middle overs after Quinton de Kock made a bright start, but would have preferred a much better final over"}, {"ball": 19.6, "isHighlight": false, "text": "Shakib: \"Jadhav is such an underrated player. Hope he gets more chances after this. He's not in bad form either, he made  $$1227$$  1223 runs in Ranji season at a SR Of 80\" Like I said, he was the top-scorer in Ranji"}, {"ball": 19.6, "isHighlight": false, "text": "Nithin: \"19.5 Richardson to Jadhav, SIX, Richardson, what are you doing?! Alagappan are you a supporter of RR?\" Not quite, just surprised that he would bowl something like that in the final over"}, {"ball": 19.6, "isHighlight": false, "text": "\"Not too sure, it's not a bad score,\" says QDK, the top-scorer. \"Not quite what we wanted. [His form] Doing okay, two 40s, just need to kick on. It's nice with the new ball then it gets slower\""}], "name": "Delhi Daredevils v Rajasthan Royals", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733975.html?innings=1;view=commentary", "match_num": 23}