{"commentary": [{"ball": 0, "isHighlight": false, "text": "Delhi Daredevils are done with their huddle and out they charge. Ajinkya Rahane and Karun Nair touch gloves and take to the field. I see the keeper up at the stumps, is it going to be Shahbaz Nadeem? Yep. Slip comes in"}, {"ball": 0, "isHighlight": false, "text": "Hari Karthi: \"Back to back 152 games for RR.....\""}, {"ball": 0.1, "isHighlight": false, "text": "Nadeem to Rahane,1 run,flighted but drifting down, Rahane lunges forward and sweeps to the right of short fine leg"}, {"ball": 0.2, "isHighlight": false, "text": "Nadeem to Nair,1 run,tossed up on middle and Karun displays an awkward sweep to deep square leg"}, {"ball": 0.3, "isHighlight": false, "text": "Nadeem to Rahane,1 run,goes on with the arm with a fuller delivery, Rahane calmly tucks it into midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Nadeem to Nair,1 run,holds into the pitch a little and Karun benefits by presenting a straight bat. Single to long-on"}, {"ball": 0.5, "isHighlight": false, "text": "Nadeem to Rahane,no run,flighted on off stump, comes forward and blocks"}, {"ball": 0.6, "isHighlight": false, "text": "Nadeem to Rahane,1 run,pushed through on the pads and Rahane picks it through to deep square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami revs up. Slip in"}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Rahane, $$FOUR$$ ,little bit of shape but it only helps Rahane as he caresses the good length delivery through the covers. Just enough room to free the arms but it wasn't hit at all hard"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Rahane,no run,tightens up on the corridor as Rahane blocks the back of a length delivery down the pitch"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Rahane,1 run,fullish and shaping away, Rahane was a little early into his drive through the covers and settles for a single off an inside edge straight of midwicket"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Nair, $$FOUR$$ ,angles it into the other opener and Karun has clipped it smartly to the midwicket boundary. Nicely controlled"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,digs it into the middle of the pitch at 142kph, it was outside off so the batsman sways inside the line"}, {"ball": 1.5, "isHighlight": false, "text": "satyen: \"@ alagappan, I am surprised too that u r overrating richardson who hasnt yet proved at international level at tbe same time underrating k.jadhav who has played that shot brilliantly...\" It was length, he threw everything he had into the shot. It wasn't really a contest."}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,back of a length and just outside off, defended"}, {"ball": 1.6, "isHighlight": false, "text": "ganeshbabu: \"Rahane is the only indian batsmen in top 6 leading run scores so far.\""}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Rahane,1 leg bye,144kph, shortish and on the hips, Rahane nudges it to short fine leg"}, {"ball": 2.2, "isHighlight": false, "text": "Parnell to Nair,no run,144kph, good length ball just outside off, Nair leans into a push through the covers. Rahane was looking for a single but had to be sent back."}, {"ball": 2.3, "isHighlight": false, "text": "Parnell to Nair,1 run,guided to deep third man as Parnell goes fishing outside off stump. That was at 146kph!"}, {"ball": 2.4, "isHighlight": false, "text": "Parnell to Rahane, $$FOUR$$ ,short ball, sat up for him and Rahane put it away with the minimum of fuss. Didn't bother keeping it down because he knew fine leg was up in the circle"}, {"ball": 2.5, "isHighlight": false, "text": "Parnell to Rahane, $$OUT$$ ,how bout that! M Vijay has pulled off a screamer and took a leaf out of Dwayne Bravo's book and did a little jig. This was fuller and teasing him outside off, Rahane got forward and timed his cover drive quite well. Only he didn't keep it down. Vijay dives to his left and plucks out a low one"}, {"ball": 2.5, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$Vijay$$ $$b$$ $$Parnell$$ $$12$$ $$(12m$$ $$10b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$120.00$$"}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Samson,1 wide,146kph, shortish, but his search for pace is luring his lines to go wrong."}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Samson,no run,just short of a good length on middle, Samson the new batsman, is right behind it"}, {"ball": 2.6, "isHighlight": false, "text": "Mohanachandar: \"@ganeshbabu Malinga and Narine are the only two overseas bowlers in the top 10\""}, {"ball": 2.6, "isHighlight": false, "text": "Jaydev Unadkat takes over from Shami"}, {"ball": 3.1, "isHighlight": false, "text": "Unadkat to Nair,no run,they're struggling with their line here. This was back of a length and goes down leg. Karun looks to glance it and misses. But the bowler and the fielders are quite interested in this. Keeper wasn't though"}, {"ball": 3.2, "isHighlight": false, "text": "Unadkat to Nair,no run,beauty! Drew him into chasing at a back of a length delivery that darted away after pitching. Karun was beaten all ends up there"}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Nair,1 wide,he's getting the ball to zip nicely, but his line is on the pads. Karun goes for another nurdle to try and beat short fine leg but can't connect."}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Nair,no run,gorgeous! This was fuller as he slanted it across the right hander, who pushes forward with an open face and is beaten by the away seam"}, {"ball": 3.4, "isHighlight": false, "text": "Unadkat to Nair,1 run,shortish and on the pads again, tucked away through square leg"}, {"ball": 3.5, "isHighlight": false, "text": "Unadkat to Samson,no run,this good length ball seems to have held in the pitch judging by Samson having to pull his top hand off the bat while pushing into the off side."}, {"ball": 3.6, "isHighlight": false, "text": "Unadkat to Samson, $$FOUR$$ ,picked off his legs, that should keep Unadkat to a better line. Especially when he's beating the batsmen outside off. Fast hands and brilliant timing from Samson"}, {"ball": 3.6, "isHighlight": false, "text": "zafarjaveds: \"Did anyone else notice that there is only ONE player playing in this IPL from the world t20 champions team Sri Lanka and that's Malinga. And moreover I can hardly see players from England, new zealand, Bangladesh. Only Australia and South Africa and a couple from west indies Dominating.\""}, {"ball": 3.6, "isHighlight": false, "text": "Shami still has slip"}, {"ball": 3.6, "isHighlight": false, "text": "rajasahadevan: \"@Mohanachandar Its good to see Indian bowlers among the wickets with the likes of Malinga, Narine, Johnson, Steyn in the tournament. What more pleasing is the number of Indian seamers in it!!\""}, {"ball": 4.1, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,back of a length and just outside off, defended down the pitch. That was pacy"}, {"ball": 4.2, "isHighlight": false, "text": "Mohammed Shami to Nair,1 run,a little close for the cut but he goes for it still. It was just short of a length and in the corridor, a wristy flick gets it down to third man"}, {"ball": 4.3, "isHighlight": false, "text": "Mohammed Shami to Samson,1 run,goes for a front foot pull and it lobs up in the air. Manages to get enough bat on it to land safely in the midwicket region. Good short ball from Shami as he made sure the batsman had to fetch it from off stump"}, {"ball": 4.4, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,144kph, dug in, just outside off. He's rooted to the crease and pushes at it with his hands. Somehow manages to keep it down"}, {"ball": 4.5, "isHighlight": false, "text": "Mohammed Shami to Nair,1 run,slower ball outside off, chopped behind point for a quick single"}, {"ball": 4.6, "isHighlight": false, "text": "Mohammed Shami to Samson,1 run,a little slower again around the off stump, dabbed into the third man region"}, {"ball": 5.1, "isHighlight": false, "text": "Parnell to Samson,no run,shortish and on the stumps, makes Samson rise up on his toes to block down the pitch"}, {"ball": 5.2, "isHighlight": false, "text": "Parnell to Samson,no run,140kph,  $$falls$$ $$short$$ $$of$$ $$mid-off$$ . Samson was looking for a flick through midwicket and it was off the front foot again. Ends up with a leading edge because this ball was too short for the shot. And there was a run-out chance as well at the non-strikers'"}, {"ball": 5.3, "isHighlight": false, "text": "Parnell to Samson, $$SIX$$ ,fullish on middle and off, this time Samson was right in getting forward and a clean swing of the arms down the line sends the ball clattering into the crowd straight down the ground"}, {"ball": 5.4, "isHighlight": false, "text": "Parnell to Samson,no run,back of a length on leg stump as he hopes to cramp him up, succeeds as Samson blocks down the pitch"}, {"ball": 5.5, "isHighlight": false, "text": "Parnell to Samson,no run,opens the face and runs the short of a good length ball to point"}, {"ball": 5.6, "isHighlight": false, "text": "Parnell to Samson,1 run,back of a length and angled across him, Samson runs it down to third man on the boundary"}, {"ball": 5.6, "isHighlight": false, "text": "Don: \"@zafarjaveds - I think the reason for the lack of Sri Lankan and English players is that they won't be available for the whole of the IPL, and no team would want to spent millions on a player who won't be there for the whole season, especially this year at the start of a new cycle. Also there are plenty of New Zealanders in this ipl, McCullum, Anderson, Neesham, Southee and Ross Taylor has played a couple of matches as well, but only McCullum has really performed. \""}, {"ball": 5.6, "isHighlight": false, "text": "Sandeep Raghuva: \"Where is Brad Hodge these days?\" Camped out on the bench because of a certain Steve Smith. Bet he feels like it's old times again. Anyway, it's Rahul Sharma now"}, {"ball": 6.1, "isHighlight": false, "text": "Sharma to Samson,2 runs,starts off with a short one outside off, Samson slaps it through to the keeper for a couple. The throw comes in and a dive seems to have saved Samson by miles but the umps will go up for the replay. Better safe than sorry"}, {"ball": 6.2, "isHighlight": false, "text": "Sharma to Samson,1 run,walks across to off stump as the bowler is in his delivery stride, Samson steers it towards short third man"}, {"ball": 6.3, "isHighlight": false, "text": "Sharma to Nair, $$FOUR$$ ,that's a terrific stroke. Went deep in his crease and used the pace of the flatter ball and late cuts it past the short third man"}, {"ball": 6.4, "isHighlight": false, "text": "Sharma to Nair,1 run,much better. Bit of flight and drift on off stump as the batsman strides forward and pushes to long-off"}, {"ball": 6.5, "isHighlight": false, "text": "Sharma to Samson,no run,on a good length on off stump, he stands up tall and punches it back at the bowler"}, {"ball": 6.6, "isHighlight": false, "text": "Sharma to Samson,1 run,walks forward and nudges the flighted delivery from off stump down to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "kritesh: \"Karun Nair has totally failed to give good starts to RR. How long will they keep playing him and keep Unmukht on bench? I just dont see any logic here...\" To be honest, he's holding steady out there. With Watson and Smith in the hut, things look okay for now. Nadeem is back"}, {"ball": 7.1, "isHighlight": false, "text": "Nadeem to Samson,no run,goes back and dabs the good length ball into the covers"}, {"ball": 7.2, "isHighlight": false, "text": "Nadeem to Samson,2 runs,tosses the arm ball up outside off, Samson leans into a square drive and Parnell had to pull out a slide on the boundary to keep it in the field of play"}, {"ball": 7.3, "isHighlight": false, "text": "Nadeem to Samson,no run,beauty! This one grips and turns and beats Samson's front foot push. The perfect length to lure the batsman forward but he still had his back leg in his crease"}, {"ball": 7.4, "isHighlight": false, "text": "Nadeem to Samson,1 run,driven down the ground calmly for a single"}, {"ball": 7.5, "isHighlight": false, "text": "Nadeem to Nair,1 run,goes back as this is on a good length and taps it down to long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem to Samson,1 run,comes forward and pushes the length ball through to the sweeper"}, {"ball": 7.6, "isHighlight": false, "text": "Nabeeg Akram: \"Holding steady doesnt give you license to play at a strike rate less than 100\""}, {"ball": 8.1, "isHighlight": false, "text": "Sharma to Samson,no run,good length ball just outside off, he taps it down the ground with a straight bat"}, {"ball": 8.2, "isHighlight": false, "text": "Sharma to Samson,2 runs,shortish and just a shade outside off, Samson stays leg side of it and slaps it through to the sweeper"}, {"ball": 8.3, "isHighlight": false, "text": "Sharma to Samson,1 run,walks across to off stump and defends into the covers. Nadeem is the man there and in his haste to throw ball, he hits it into the turf right by his feet"}, {"ball": 8.4, "isHighlight": false, "text": "Sharma to Nair, $$FOUR$$ ,magnificent! Saw it tossed up and leaned forward and stayed beside the ball and launched it over extra cover"}, {"ball": 8.5, "isHighlight": false, "text": "Sharma to Nair,1 run,flighted on middle, nudged down to long-on"}, {"ball": 8.6, "isHighlight": false, "text": "Sharma to Samson,no run,moves to off stump and blocks this flighted ball down the pitch. It's the time out now"}, {"ball": 8.6, "isHighlight": false, "text": "Vipul: \"@Nabeeg Karun Does'nt need to play above 100 , because Samson and Watson along with co can up the rate anytime they want without playing themselves into trouble\" He seems to be picking things up now. Watson, Dravid and Upton are out there discussing strategy with the two batsmen. Kirsten is with Delhi as KP leads the team talk"}, {"ball": 8.6, "isHighlight": false, "text": "Apologies for the delay in comms, there seems to be a technical failure in the feed we are receiving."}, {"ball": 9.1, "isHighlight": false, "text": "Nadeem to Nair,no run,teases him on middle and he lets it go"}, {"ball": 9.2, "isHighlight": false, "text": "Nadeem to Nair,1 run"}, {"ball": 9.3, "isHighlight": false, "text": "Nadeem to Samson, $$FOUR$$"}, {"ball": 9.4, "isHighlight": false, "text": "Nadeem to Samson, $$SIX$$ ,flighted on the stumps and he has slapped it straight over the bowler's head. Good shot"}, {"ball": 9.5, "isHighlight": false, "text": "Nadeem to Samson,no run"}, {"ball": 9.6, "isHighlight": false, "text": "Nadeem to Samson, $$OUT$$ ,tossed up and outside off, Samson reaches out to lash it through the covers. Misses and his momentum ruins his balance. The keeper waits on the back foot to lift and then whips off the bails. Promising innings cut short"}, {"ball": 9.6, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$st$$ $$†Karthik$$ $$b$$ $$Nadeem$$ $$34$$ $$(33m$$ $$28b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$121.42$$"}, {"ball": 9.6, "isHighlight": false, "text": "Rajat Bhatia is the new man in. What's RR thinking?"}, {"ball": 10.1, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,good length ball just outside off, he stays back and blocks"}, {"ball": 10.2, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,141kph, short of a length and whizzing through to the keeper as the batsman lets it go"}, {"ball": 10.2, "isHighlight": false, "text": "\"Dont appologies, but meanwhile you can publish our commentaries\" I see your priorities, Nabeeg Akram"}, {"ball": 10.3, "isHighlight": false, "text": "Mohammed Shami to Nair,2 runs,on a length and he backs away and slaps it down the ground. Comes off the bottom of the bat though"}, {"ball": 10.4, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,goes wide of the crease and Karun swings wildly. Goes for a pull and gets an inside edge that bounces on its way to the keeper"}, {"ball": 10.5, "isHighlight": false, "text": "Mohammed Shami to Nair,2 runs,full on middle, Karun has timed it nicely through midwicket. Long-on gets a work out"}, {"ball": 10.5, "isHighlight": false, "text": "phani: \"\"bhatia in place of watson...RR expecting close encounter\"\""}, {"ball": 10.5, "isHighlight": false, "text": "Aditya: \"Rajat knows these ground really well + he has T20 100 on these ground in syed ali T20 cup.\""}, {"ball": 10.6, "isHighlight": false, "text": "Mohammed Shami to Nair,1 run,good length ball outside off, comes forward and looks to smash it over the off side. Gets a thick inside edge that wanders away to deep square leg"}, {"ball": 10.6, "isHighlight": false, "text": "Jaydev Unadkat has been recalled"}, {"ball": 11.1, "isHighlight": false, "text": "Unadkat to Nair,1 run,starts off with a change of pace, which is no surprise to the batsman who waits on it and cuts it late down to third man"}, {"ball": 11.2, "isHighlight": false, "text": "Unadkat to Bhatia,1 run,another guide down to third man off a slower ball"}, {"ball": 11.3, "isHighlight": false, "text": "Unadkat to Nair,1 run,back of a good length and he's taken the pace off again, blocked with an open face behind point"}, {"ball": 11.4, "isHighlight": false, "text": "Unadkat to Bhatia,no run,goes for another late cut but this slower ball is a little too close. Beaten"}, {"ball": 11.5, "isHighlight": false, "text": "Unadkat to Bhatia,1 run,steps down the track and swipes at the slower bouncer with the top hand off the bat. Single to deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Unadkat to Nair, $$SIX$$ ,this is back of a length and he backs away and heaves it over the top. Gets a lot of height and I was expecting someone to be under it, but it's got enough on it to reach the extra cover boundary. Just checking if it is a six or a four now. It's terribly tight. Judgement call this and it's a six"}, {"ball": 12.1, "isHighlight": false, "text": "Sharma to Bhatia,no run,that's a shocking ball and Bhatia has produced an even worse shot. banged into the middle of the pitch and it was meant to go sailing out of the ground. Instead Bhatia has tried to slog it too hard and bunts it back to the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Sharma to Bhatia,2 runs,Duminy was backtracking at long-on and he reaches one hand out ahead of him to try and grab it. The swirler though evades him. Excellent effort from him. Tossed up and Bhatia ran down the track and swung with all his might. Got more height than distance there though"}, {"ball": 12.3, "isHighlight": false, "text": "Sharma to Bhatia, $$SIX$$ ,but this has been struck cleanly! Raced down the track again and gets under this flighted ball to send it soaring over long-on"}, {"ball": 12.4, "isHighlight": false, "text": "Sharma to Bhatia,2 runs,quicker, shorter and flatter. Bhatia camped on his back foot and pulls wide of long-on. It was well struck and Duminy had to get the skates on"}, {"ball": 12.5, "isHighlight": false, "text": "Sharma to Bhatia,1 run,flighted on off stump, Bhatia drills it to long-on"}, {"ball": 12.5, "isHighlight": false, "text": "Suren: \"Why isnt Duminy rolling his golden arm today ?\""}, {"ball": 12.6, "isHighlight": false, "text": "Sharma to Nair, $$FOUR$$ ,walks across and cuts it to the boundary behind point. Rahul Sharma's inclusion is backfiring on all cylinders. This was short and handed the batsman width. Karun accepted with glee"}, {"ball": 12.6, "isHighlight": false, "text": "rajasahadevan: \"Man, I love cricinfo viewers comments!! Debates, Stats, Funny-ones, Fights, Discussion, Depth-analysis, some stupid ones. What more you want? Frankly, Even If i watch it in TV, I come here to read the viewer comments!!(No offense, Alagappan)\" None taken"}, {"ball": 13.1, "isHighlight": false, "text": "Parnell to Bhatia,1 wide,goes short but this has a little too much steam on it. Sails over the batsman's head while he was almost upright as he let it go"}, {"ball": 13.1, "isHighlight": false, "text": "Parnell to Bhatia,1 run,shortish on middle, Bhatia pulls to deep square leg"}, {"ball": 13.1, "isHighlight": false, "text": "Aditya: \"Sorry, Rajat 107 in T20 was in Mumbai.\""}, {"ball": 13.2, "isHighlight": false, "text": "Parnell to Nair,no run,a little too full for the cut and Karun walks over towards square leg to admonish himself. Another dot ball for him"}, {"ball": 13.3, "isHighlight": false, "text": "Parnell to Nair,1 run,shortish and he's lofted it into the midwicket region"}, {"ball": 13.4, "isHighlight": false, "text": "Parnell to Bhatia,1 run,short-armed pull towards deep midwicket as Parnell pushes the batsman back again"}, {"ball": 13.5, "isHighlight": false, "text": "Parnell to Nair, $$FOUR$$ ,that was what he practiced the last time he played and missed and it pays off. Lovely hands from Karun as he picks a good length ball from off stump and late cut it to the third man boundary"}, {"ball": 13.6, "isHighlight": false, "text": "Parnell to Nair,2 runs,and on the other end of the other V. Parnell strays on the pads with a short length ball which is calmly glanced away. That will be the time out"}, {"ball": 13.6, "isHighlight": false, "text": "Chethan: \"It is actually logical to have K Nair in place of Unmukt Chand. Nair has a fantastic first class average of 65 and has been consistent throughout the domestic season. Unmukt on the other hand had a trouble in domestic circuit in the recent past \""}, {"ball": 13.6, "isHighlight": false, "text": "Nagesh Nayak: \"Any comments on unimaginative captaincy by KP?\" 42 off 36 with eight wickets in hand. Would take something of a miracle from Delhi to win this. Does Shami have it up his sleeve?"}, {"ball": 14.1, "isHighlight": false, "text": "Mohammed Shami to Bhatia,1 run,142kph, just short of a good length and Bhatia seems hurried as he pulls and has to fling the top hand off his bat. Single to deep square leg"}, {"ball": 14.2, "isHighlight": false, "text": "Mohammed Shami to Nair,1 run,this is the slower bouncer and Karun has spotted it and dabs it to deep third man"}, {"ball": 14.3, "isHighlight": false, "text": "Mohammed Shami to Bhatia,1 run,on a length and Bhatia swings it away to deep square leg"}, {"ball": 14.4, "isHighlight": false, "text": "Mohammed Shami to Nair,no run,shortish and outside off, Karun taps it to point"}, {"ball": 14.4, "isHighlight": false, "text": "mysterious vive: \"KP should himself bowl. either the batsmen will hit it out or get out\""}, {"ball": 14.5, "isHighlight": false, "text": "Mohammed Shami to Nair,1 run,cramps him up with a short of a good length delivery on off stump, he pulls through midwicket awkwardly"}, {"ball": 14.6, "isHighlight": false, "text": "Mohammed Shami to Bhatia, $$OUT$$ ,there we go, the offcutter has flattened off stump! Bhatia saw length and went for a slog, But he hasn't spotted the variation, which grips the pitch and darts back in to hit timber. Is this the start of something?"}, {"ball": 14.6, "isHighlight": false, "text": "$$R$$ $$Bhatia$$ $$b$$ $$Mohammed$$ $$Shami$$ $$17$$ $$(24m$$ $$13b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$130.76$$"}, {"ball": 14.6, "isHighlight": false, "text": "Shane Watson walks out to the middle. Nadeem is back"}, {"ball": 15.1, "isHighlight": false, "text": "Nadeem to Nair,1 run,flighted outside off, Karun leans forward and drives to long-off"}, {"ball": 15.1, "isHighlight": false, "text": "Rishi: \"I don't think it's the fault with KP's captaincy, but more with Delhi bowlers. Shami & Rahul have been a great disappointment.\" Rahul yes, Shami not as much"}, {"ball": 15.2, "isHighlight": false, "text": "Nadeem to Watson,2 runs,presses forward but once he sees it isn't in his half, he is quick to rock back and cuts behind point. Lovely shot"}, {"ball": 15.3, "isHighlight": false, "text": "Nadeem to Watson, $$SIX$$ ,skips down the track and Watson has picked this up and dropped it over long-on. Nadeem's flight backfires on him that time"}, {"ball": 15.3, "isHighlight": false, "text": "two short cover in"}, {"ball": 15.4, "isHighlight": false, "text": "Nadeem to Watson,no run,doesn't bother him as he keeps tossing the ball up. Lures him forward and gets a bit of an outside edge"}, {"ball": 15.5, "isHighlight": false, "text": "Nadeem to Watson,no run,on a good length on off stump, defended off the back foot"}, {"ball": 15.6, "isHighlight": false, "text": "Nadeem to Watson,no run,down the pitch again, but the bowler drags his length ball and pushes the ball a little outside off as well. Watson was looking long-on again and adjusts a flick of the wrists"}, {"ball": 15.6, "isHighlight": false, "text": "kannan: \"Nice to see Rajasthan Royals Trend of giving chances to Indian players ahead of their overseas players , after all it is Indian Primer League\""}, {"ball": 15.6, "isHighlight": false, "text": "Unadkat from around the wicket"}, {"ball": 16.1, "isHighlight": false, "text": "Unadkat to Nair,2 runs,back of a length and outside off, Karun clipes it through midwicket and picks up a couple that gets him past a half-century. Pace off the ball doesn't bother him"}, {"ball": 16.2, "isHighlight": false, "text": "Unadkat to Nair,no run,good length ball on middle and off, he steps forward and blocks. Again, slower ball"}, {"ball": 16.3, "isHighlight": false, "text": "Unadkat to Nair,1 run,seam-up this time and Nair moves outside leg to drill the full delivery to long-off"}, {"ball": 16.4, "isHighlight": false, "text": "Unadkat to Watson,1 run,back of a length, punched to short cover. Daredevils are scrapping the bottom of their plans bucket"}, {"ball": 16.5, "isHighlight": false, "text": "Unadkat to Nair, $$SIX$$ ,length and Karun has slapped it over long-on. Came forward out of his crease and belted it over the top"}, {"ball": 16.6, "isHighlight": false, "text": "Unadkat to Nair,2 runs,these slower balls are sitting up for him. It's no longer a surprise when you bowl it through the over and Karun set himself up to hit over the top through the off side. Mid-off runs back and pulls it in"}, {"ball": 16.6, "isHighlight": false, "text": "17 off 18 needed now. Seems straightforward. Lets see how Parnell's extra pace does to the equation, around the wicket. There's some smoke roaming across the ground which seems to be holding up play. And now it's the sightscreen that's causing problems"}, {"ball": 16.6, "isHighlight": false, "text": "Nitin Kumbhar: \"jugaad fan: I somehow observed an immense similarity between the way Watson and Pietersen launches that straight shot! Both looks so graceful when times it perfectly and at the same time they are vulnerable to that catch at longon/off in every third inning they play!!\""}, {"ball": 17.1, "isHighlight": false, "text": "Parnell to Watson,1 run,thick outside edge flies to deep third man as Parnell goes full and outside off"}, {"ball": 17.2, "isHighlight": false, "text": "Parnell to Nair, $$FOUR$$ ,shortish and just enough outside off for Karun to flick those wrists and cut it past the keeper. Third man was too square to stop that and Karun placed it brillliantly. One point his strike rate was well below 100 and it's 140 almost"}, {"ball": 17.3, "isHighlight": false, "text": "Parnell to Nair,1 run,back of a length and outside off, defended into the off side for a quick single"}, {"ball": 17.4, "isHighlight": false, "text": "Parnell to Watson,no run,fullish on middle, Watson punches it back at the bowler who hurls it at the stumps. Watson was taking evasive action and finds himself on the floor. Parnell apologises, but Watson doesn't seem like he takes too kindly to unnecessary projectiles hurled at him"}, {"ball": 17.5, "isHighlight": false, "text": "Parnell to Watson,no run,came on the front foot and slaps it towards point. Though there was a run in it but he is sent back by the non-striker. Rightly too and a desperate dive seems to have saved him. Kedar Jadhav had a stump or so to aim at and he nailed it. Excellent work"}, {"ball": 17.6, "isHighlight": false, "text": "Parnell to Watson, $$SIX$$ ,length and it sat up for Watson to maul over midwicket. If he was looking for revenge, that was it"}, {"ball": 17.6, "isHighlight": false, "text": "srinivas: \"Feeling very good for all karnataka players who performed well in domestic cricket and getting a good chance to play in ipl k.nair, k.l.rahul, manish, robin, vinay, c.m.gowtham well deserved players :) !\""}, {"ball": 17.6, "isHighlight": false, "text": "Ridwan M.: \"No one talks about Karthik, the second expensive buy. Its high time he let his bat do the talking.\""}, {"ball": 18.1, "isHighlight": false, "text": "Unadkat to Nair, $$FOUR$$ ,slower ball in the slot and Karun has launched it over cover. One-bounce four brings the scores level"}, {"ball": 18.2, "isHighlight": false, "text": "Unadkat to Nair,no run,seeks the yorker on middle, Karun nudged towards midwicket and the captain at the other end just set off. The fielder takes aim and sends in the throw, but it misses. Watson was miles out"}, {"ball": 18.3, "isHighlight": false, "text": "Unadkat to Nair, $$FOUR$$ ,slower ball ends up a full toss which Karun smashes over point and that seals the game"}, {"ball": 18.3, "isHighlight": false, "text": "So that's a simple chase done and dusted and Rajasthan Royals have moved up to third in the points table. Joins us at 8 pm tomorrow as the IPL caravan moves on. This is Alagappan Muthu, signing off midway through a yawn"}, {"ball": 18.3, "isHighlight": false, "text": "$$Karun$$ $$Nair$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"In the UAE, I wasn't giving myself enough time. There are quite big legends in the dressing room and I would like to thank Watto and the support staff for their confidence in me\""}, {"ball": 18.3, "isHighlight": false, "text": "\"Nice win to be able to restrict such a high quality batting order to around 150. We controlled it well in the middle with Pravin Tambe and Rajat. We've got quite a lot of bowlers to mix and match and the way Karun steered the ship home, it's quite exciting,\"  $$Shane$$ $$Watson$$  says, \"Management does a brilliant job spotting the talent and we like to encourage these guys to play with freedom. Very disappointing not to play in Jaipur, I love it there and we;ve had a lot of success there. Feels like a second home for me but I'm sure Ahmedabad will be good for us and hopefully we can make that into a fortress as well\""}, {"ball": 18.3, "isHighlight": false, "text": "\"Feeling good about contributing for the team,\" says Sanju Samson. \"They [management] want me to play according to the situation. It is one of the main roles in the team and they don't want me to lose my wicket early. So I hang on a little and then I play my shots. [Sixes flying off his bat] It just goes away. Any cricketer of my age, like Karun Nair and myself, it is a great support to have Rahul sir in the team. The atmosphere is very awesome, we never get to see the king in any other team. We enjoy it and when it is time to perform, we step up\""}, {"ball": 18.3, "isHighlight": false, "text": "kartik: \"All this talk about Sanju Samson is justified.. he is a terrific player.. but now its time for him to show maturity and get past that 20s and 30s score..He just seems to give it away when he is looking good\""}, {"ball": 18.3, "isHighlight": false, "text": "\"I thought in the 10th over when myself and Quinny got out, that undid us,\" says  $$KP$$ , \"It was poor for both of us to get out and we didn't have enough runs on the board. I want the boys to keep their heads up, they've done all they can and that's all one can ask for. The pitch got slower, but we just didn't have a score on. [Satisfied with his bowling attack] We're talking the right language and the boys are training hard and that's all anyone can ask for\""}, {"ball": 18.3, "isHighlight": false, "text": "$$11.30$$ $$pm$$  Daredevils just did not have enough on the board and with an opener lasting the entire chase, Rajasthan Royals have cantered home with seven wickets and nine balls to spare. Karun Nair played within himself early on and as he grew in confidence he started playing more shots and has finished on a decent 73 off 50 balls. None of the bowlers really looked threatening and the Daredevils' drawing board must be in disarray again"}], "name": "Delhi Daredevils v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733975.html?innings=2;view=commentary", "match_num": 23}