{"commentary": [{"ball": 0, "isHighlight": false, "text": "Finch will take strike for Sunrisers. Dhawan at the other end. Starc with the new ball"}, {"ball": 0, "isHighlight": false, "text": "$$Kohli$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$RCB$$ $$will$$ $$bowl$$"}, {"ball": 0, "isHighlight": false, "text": "Two changes for RCB.  $$Rilee$$ $$Rossouw$$ , the South African batsman, will make his IPL debut in place of Albie Morkel and Harshal Patel is in for Yogesh Takawale"}, {"ball": 0, "isHighlight": false, "text": "Kohli: \"We love to chase on the this ground. Small field, we know what to do here, we have played here before.\""}, {"ball": 0, "isHighlight": false, "text": "Dhawan would have fielded first as well because of the small outfield. He is expecting some swing and bounce for the fast bowlers. Ishant Sharma comes in for Amit Mishra. The legspinner has had a nightmarish IPL this time with an economy-rate of 10.30. S Rajesh has  $$all$$ $$the$$ $$numbers$$ ."}, {"ball": 0, "isHighlight": false, "text": "Venkat Sravanth: \"@Madhu.. But do you seriously reckon picking Ishant is an assurance on a small ground?? I would rather go with Prashanth's point.\""}, {"ball": 0, "isHighlight": false, "text": "Rana Waleed: \"Virat Kohli wins the toss and decided to chase. Very obvious. It is as obvious as telling that we are humans.\""}, {"ball": 0, "isHighlight": false, "text": "Aman Parikh: \"RCB going with 5 genuine bowlers. That's what i'm talking about This is gonna be the way forward for RCB :)\""}, {"ball": 0, "isHighlight": false, "text": "Prashanth: \"I am surprised to see SRH not opting for Parvez Rasool inspite of RCB playing four left-hand batsmen in their top six. Gayle and Yuvraj are well known for their struggles against offspin bowling.\""}, {"ball": 0, "isHighlight": false, "text": "madhu: \"It's very good decision to bring Ishant in place of Mishra considering small ground and power-hitters of spin in RCB (Gayle and Yuvraj )\""}, {"ball": 0, "isHighlight": false, "text": "$$7.10pm$$  First match of the IPL season coming up in Bangalore, with the hosts taking on Sunrisers. With scores of 70 and 124 in their last two games in the UAE, Royal Challengers will be looking to the Chinnaswamy to produce plenty more runs"}, {"ball": 0, "isHighlight": false, "text": "-------------------- Complete the sequence: Garry Sobers, Ravi Shastri, Herschelle Gibbs and _________. Think you have all the answers?  $$We$$ $$have$$ $$the$$ $$questions.$$ $$Play$$ $$CricIQ$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Finch,no run,very low full toss to start off, swings in a tad just outside off, Finch cannot connect as he pushes at it"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Finch,1 run,swinging in right on off stump this time, full length, Finch pushes and gets a thick inside edge square to the leg side"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Dhawan,1 run,pitched up to the left-hander as well, who adjusts for the movement and pushes it past the bowler for one, mid on fields"}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Finch,1 run,straightening on middle on a full length, nudged square on the leg side"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Dhawan,no run,just back of a length, 143 kph, and it does not carry to the keeper even as Dhawan lets it go outside off"}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Dhawan,no run,pitches it up to end the over, bang on off stump, Dhawan stays in the crease and guides it to point"}, {"ball": 0.6, "isHighlight": false, "text": "Dhawal Atrey: \"Has chasing become default mentality of Indian players???..both wanted to field first...\""}, {"ball": 1.1, "isHighlight": false, "text": "Dinda to Finch,1 run,Dinda starts right on target too, with a pitched up ball holding its line on off stump, is pushed to the off side, AB runs across from extra cover and dives forward to try and lob the ball at the non-striker's end, but only succeeds in parrying it to mid off, Kohli runs after it to cut off the chance of another run"}, {"ball": 1.2, "isHighlight": false, "text": "Dinda to Dhawan,no run,Dinda gets away, a length delivery is smashed straight to cover"}, {"ball": 1.3, "isHighlight": false, "text": "Dinda to Dhawan,1 run,pushes this full one to wide mid off for an easy single"}, {"ball": 1.4, "isHighlight": false, "text": "Dinda to Finch,no run,137.4 kph back of a length, coming into the batsman, who fails to tuck it to leg, Dinda rushes forward to prevent the single"}, {"ball": 1.5, "isHighlight": false, "text": "Dinda to Finch, $$FOUR$$ ,that is right through Yuvraj at square leg, that should have been stopped easily, Finch toe-ended a pull from outside off, it was close to Yuvraj's right, he slid across too, but it raced past"}, {"ball": 1.6, "isHighlight": false, "text": "Dinda to Finch, $$SIX$$ ,Finch goes over the off side now, a pitched up ball allowing him enough width to have a go, and he lofts it cleanly just over the deep cover rope"}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Dhawan,no run,beats him with a good length outswinger outside off as Dhawan goes following it"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Dhawan,no run"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Dhawan, $$FOUR$$ ,back of a length, but on the pads, and Dhawan helps it past short fine"}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Dhawan,1 run,another one on the pad, very full though, Dhawan flicks hard, but straight to fine leg"}, {"ball": 2.4, "isHighlight": false, "text": "oshua: \"When Kohli is in the game every side will want to chase.\""}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Finch, $$OUT$$ ,Starc bounces out Finch, a 140 kph lifter into the body, Finch tries to gather himself into playing a hook, but it rises up too fast, and he's in no position to play the shot, he is hopping in the air, trying to half-fend, half-hook, and only ends up looping it to the keeper"}, {"ball": 2.5, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$†PA$$ $$Patel$$ $$b$$ $$Starc$$ $$13$$ $$(13m$$ $$8b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$162.50$$"}, {"ball": 2.5, "isHighlight": false, "text": "Rahul at No 3"}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Rahul,no run,short of a length, 139.3 kph, Rahul plays it down square on the leg side"}, {"ball": 2.6, "isHighlight": false, "text": "Arsalan: \"Agree with Prashant. Playing Ishant on a small ground against such high quality stroke makers as those of RCB is probably even worse than playing an out of form Mishra. Parvez Rasool would have given the team a bit of variety at the same time adding some depth to their misfiring middle-order!\""}, {"ball": 2.6, "isHighlight": false, "text": "Rahul is having a change of bats"}, {"ball": 3.1, "isHighlight": false, "text": "Dinda to Dhawan,3 runs,a length ball, into the pad, Dhawan tucks it past square leg, who chases and slides to pull it back in near the rope"}, {"ball": 3.2, "isHighlight": false, "text": "Dinda to Rahul,no run,back of a length ball punched to mid off"}, {"ball": 3.3, "isHighlight": false, "text": "Dinda to Rahul, $$FOUR$$ ,Dinda drops it short, and Rahul hooks it over square leg, bounces inches before the boundary"}, {"ball": 3.4, "isHighlight": false, "text": "Dinda to Rahul,no run,just short of a length, widish outside off, played out to backward point"}, {"ball": 3.5, "isHighlight": false, "text": "Dinda to Rahul,2 runs,pitched up, and moving in a bit towards off, it is turned to mid on, Harshal charges in, but he fails to pick the ball up, and a second run is taken"}, {"ball": 3.6, "isHighlight": false, "text": "Dinda to Rahul, $$OUT$$ ,this was short and wide, but Rahul has edged the cut, and Gayle has moved to his left at slip to take a head-high catch"}, {"ball": 3.6, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$c$$ $$Gayle$$ $$b$$ $$Dinda$$ $$6$$ $$(5m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 3.6, "isHighlight": false, "text": "Warner is in"}, {"ball": 3.6, "isHighlight": false, "text": "samarth : \"Bizzare tactics by SRH. Warner is at his best while opening the innings. Not only he doesn't open but KL Rahul is out at 3! Selfish by Dhawan really. Given his ordinary form he should move down at 3 and allow Warner and Finch to open. \""}, {"ball": 4.1, "isHighlight": false, "text": "Aaron to Dhawan,1 run,Dhawan under-edges an attempted cut square on the off side for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Aaron to Warner, $$FOUR$$ ,shot! Warner starts with an exquisite boundary, he stands half forward and punches this length ball sweetly through the covers"}, {"ball": 4.3, "isHighlight": false, "text": "Aaron to Warner,1 no ball,Aaron over-steps as he bowls it back of a length outside off"}, {"ball": 4.3, "isHighlight": false, "text": "Aaron to Warner,no run,nothing out of the free hit, it is in the blockhole widish outside off, Warner tries a big drive but misses"}, {"ball": 4.4, "isHighlight": false, "text": "Aaron to Warner,1 wide,short at 143 kph but it pitches outside leg and bounces just past Warner"}, {"ball": 4.4, "isHighlight": false, "text": "Aaron to Warner,no run,pushes a back of a length ball to the bowler, who cannot field, mid on tidies up"}, {"ball": 4.5, "isHighlight": false, "text": "Aaron to Warner,2 runs,Warner reaches out to a length ball and thick-edges the drive just out of the reach of a flying backward point, AB rushes after it from cover"}, {"ball": 4.6, "isHighlight": false, "text": "Aaron to Warner,no run,he's pummeled this short of a length ball off the back foot but found cover"}, {"ball": 5.1, "isHighlight": false, "text": "HV Patel to Dhawan,1 run,it is down the leg side but Dhawan does not get enough bat on it and cannot tuck wide enough of fine leg"}, {"ball": 5.2, "isHighlight": false, "text": "HV Patel to Warner,1 run,turned past Gayle at midwicket and wide of mid on for a single"}, {"ball": 5.2, "isHighlight": false, "text": "Kuldeep: \"@samarth: Actually it is the right tactic by Dhawan since he is not in form, not a case of him being selfish. The idea of having Warner at 4 is to strengthen the middle order. An out-of-form Dhawan would only weaken it. Just imagine if your best two batsman are the openers, once they get out, your middle order would look as thin as an aluminium foil!!!\""}, {"ball": 5.3, "isHighlight": false, "text": "HV Patel to Dhawan,1 wide,this should have gone too, back of a length and well down the leg side,  but Dhawan cannot connect"}, {"ball": 5.3, "isHighlight": false, "text": "HV Patel to Dhawan,1 run,short of a length and bouncing on the left-hander, dropped softly and square on off for one"}, {"ball": 5.4, "isHighlight": false, "text": "HV Patel to Warner,no run,a slower one going across the left-hander, Warner has a go at it, but only thin-edges it into the ground and to the keeper"}, {"ball": 5.5, "isHighlight": false, "text": "HV Patel to Warner,1 run,good length into the pad, worked square for a single"}, {"ball": 5.6, "isHighlight": false, "text": "HV Patel to Dhawan, $$FOUR$$ ,he's kept bowling on the legs, and this time he pays for it, a short of a length ball rises without much bite and is pulled hard, in front of square, no chance for deep square leg"}, {"ball": 6.1, "isHighlight": false, "text": "Chahal to Warner,1 run,cut to the sweeper for a single"}, {"ball": 6.2, "isHighlight": false, "text": "Chahal to Dhawan,1 run,shortish ball pulled to deep midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Chahal to Warner,1 run,full delivery slogged down to wide long on from outside off"}, {"ball": 6.4, "isHighlight": false, "text": "Chahal to Dhawan,1 run"}, {"ball": 6.5, "isHighlight": false, "text": "Chahal to Warner,1 run,sliding across the left-hander from a length, slapped down to long on"}, {"ball": 6.6, "isHighlight": false, "text": "Chahal to Dhawan,1 run,punched off the back foot to wide long off"}, {"ball": 6.6, "isHighlight": false, "text": "Abhi: \"Agree with Kuldeep. If Openers had a good stand, Warner would probably have come in at 3 instead of Rahul.\""}, {"ball": 7.1, "isHighlight": false, "text": "HV Patel to Dhawan,no run,short of a length, into the body, punched straight back to the bowler"}, {"ball": 7.2, "isHighlight": false, "text": "HV Patel to Dhawan,1 run,pitching outside leg and angling across towards middle, he pushes it towards cover for one"}, {"ball": 7.3, "isHighlight": false, "text": "HV Patel to Warner, $$FOUR$$ ,one more around the thigh pad, and Warner works it to the deep backward square leg boundary"}, {"ball": 7.4, "isHighlight": false, "text": "HV Patel to Warner,1 run,struck well but backward point dives to get a hand to it, and it rolls towards deep point"}, {"ball": 7.5, "isHighlight": false, "text": "HV Patel to Dhawan,no run,stands in the crease and lets this climbing back of a length ball angle across him outside off"}, {"ball": 7.6, "isHighlight": false, "text": "HV Patel to Dhawan,no run,angled across again and ending around off, Dhawan is cramped for room and runs it to backward point"}, {"ball": 7.6, "isHighlight": false, "text": "Time out"}, {"ball": 7.6, "isHighlight": false, "text": "Ram: \"Guys, we cannot really criticize every decision of a captain just because it is not working out but somehow I cannot imagine Dhawan as a captain :P\""}, {"ball": 7.6, "isHighlight": false, "text": "Abhishek: \"The whole team looks unsettled. Instead of having both Finch and Warner, they should drop one of them and give a chance to Moises Henriques. He's a very good player. That would give them more stability to the middle order. They are relying too much on the openers. Playing Warner at 4 is bad. He does not suit that position. Henriques will\""}, {"ball": 8.1, "isHighlight": false, "text": "Chahal to Warner,no run,stays back to the googly and ends up sending the leading edge to cover.. Just drops short"}, {"ball": 8.2, "isHighlight": false, "text": "Chahal to Warner,no run,now he uses his feet to get to the pitch of the ball and drives it firmly to off, but that's straight to the fielder at cover"}, {"ball": 8.3, "isHighlight": false, "text": "Chahal to Warner,no run,another googly, Warner chooses to stay in the crease and gets beaten"}, {"ball": 8.4, "isHighlight": false, "text": "Chahal to Warner,1 run,there is some room this time and Warner chops it to deep cover for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Chahal to Dhawan,no run,oh, Warner charges down the pitch after Dhawan dabs this floater to point.. He is almost halfway down the pitch, but makes it back in time"}, {"ball": 8.6, "isHighlight": false, "text": "Chahal to Dhawan,1 run,shorter this time, allows Dhawan the space to rock back and pull it to deep midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Aaron comes round the wicket"}, {"ball": 8.6, "isHighlight": false, "text": "Don: \"@Ram - Agree with you there Ram, why make Dhawan the captain when there's a world cup winning captain in you playing XI. Maybe it would be worth a try having Sammy captain the side and see how it goes, this would allow Dhawan to focus on his batting instead of worrying about captaining the side. \""}, {"ball": 9.1, "isHighlight": false, "text": "Aaron to Dhawan,no run,sharp length delivery outside off, doesn't bounce much this time. Dhawan throws his bat at that and misses"}, {"ball": 9.2, "isHighlight": false, "text": "Aaron to Dhawan, $$FOUR$$ ,that's typical Dhawan this time! There is hardly any room in that one as it comes in with the angle, but he somehow creates room and cracks it past backward point.. That raced to the boundary"}, {"ball": 9.2, "isHighlight": false, "text": "Goes over the wicket"}, {"ball": 9.3, "isHighlight": false, "text": "Aaron to Dhawan,1 wide,digs this one short and this one flies over the batsman's head, it's called a wide"}, {"ball": 9.3, "isHighlight": false, "text": "Kuldeep: \"@Abhishek: Agreed that Henriques is a good all-rounder who can smash it around with the bad and bowl decently. However, SRH are not in need of an extra bowler and Henriques is certainly no Warner or Finch. His inclusion instead of either of these would only weaken the batting further and in terms of bowling, well - Too many cooks spoil the broth!!\""}, {"ball": 9.3, "isHighlight": false, "text": "Aaron to Dhawan,1 run,shortish again and Dhawan tries to pull this behind square, but gets an underedge on to his body. They pick up a single but Dhawan is in some pain after taking that blow to his thigh"}, {"ball": 9.4, "isHighlight": false, "text": "Aaron to Warner,no run,fuller length delivery outside off but Warner misses out, punching this straight back at the bowler"}, {"ball": 9.5, "isHighlight": false, "text": "Aaron to Warner, $$FOUR$$ ,length delivery with loads of width this time! He missed out in the last delivery but not this time, Warner plants his front foot out and crashes this through extra cover"}, {"ball": 9.6, "isHighlight": false, "text": "Aaron to Warner,1 run,gets a short of length delivery and whacks it along the ground to deep midwicket, AB is manning the boundary there.. so just a single"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal continues"}, {"ball": 10.1, "isHighlight": false, "text": "Chahal to Warner,1 run,this was much slower from Chahal, allowed Warner all the time in the world to go back and punch it to deep midwicket"}, {"ball": 10.2, "isHighlight": false, "text": "Chahal to Dhawan, $$FOUR$$ ,he uses his feet and slaps the low full toss calmly over the umpire's head.."}, {"ball": 10.3, "isHighlight": false, "text": "Chahal to Dhawan,2 runs,waits on the back foot and cracks it to deep backward point for a couple"}, {"ball": 10.4, "isHighlight": false, "text": "Chahal to Dhawan,1 run,tossed up and it turns a touch away, was the googly. Dhawan calmly presses forward and dabs it to point for a single"}, {"ball": 10.5, "isHighlight": false, "text": "Chahal to Warner,1 run,that stayed a touch low! Warner was shaping to pull as this was short, but toe-ends it to long off"}, {"ball": 10.6, "isHighlight": false, "text": "Chahal to Dhawan,no run,another backfoot punch from Dhawan  as he spots the shortness in the length early, but he is not able to beat Gayle at backward point"}, {"ball": 10.6, "isHighlight": false, "text": "Raghu B: \"Really impressed with the temperament of Warner, the way he is trying to build the innings with odd boundary and have a go in the final overs. Unlike Warner role! Sign of a good team man!\""}, {"ball": 10.6, "isHighlight": false, "text": "Patel comes back into the attack"}, {"ball": 11.1, "isHighlight": false, "text": "HV Patel to Warner,1 run,that is brilliantly cut off by the point fielder! He dives to his left and saves extra runs from a cracking cut shot"}, {"ball": 11.1, "isHighlight": false, "text": "Patel switches to round the wicket line"}, {"ball": 11.2, "isHighlight": false, "text": "HV Patel to Dhawan,no run,looks to cut a length delivery, but this was not short enough. He is beaten"}, {"ball": 11.3, "isHighlight": false, "text": "HV Patel to Dhawan,1 run,this time he decides to wait for the ball rather than throw bat on it, he opens the face of the bat late and runs it down to third man"}, {"ball": 11.4, "isHighlight": false, "text": "HV Patel to Warner, $$FOUR$$ ,slower ball, Warner spots it early and plays a double-handed forehand winner down the line! No chance for anyone there"}, {"ball": 11.5, "isHighlight": false, "text": "HV Patel to Warner,no run,looks to cut the short of length delivery, but misses it completely"}, {"ball": 11.6, "isHighlight": false, "text": "HV Patel to Warner,no run,is that an edge! Parthiv was interested, and I heard something as the ball passed the bat.. But Harshal turns around and takes his hat. Strange"}, {"ball": 12.1, "isHighlight": false, "text": "Aaron to Dhawan,1 run,full and very wide, Dhawan reaches for it and slaps it to the sweeper, they think about the overthrow, but Dhawan is ultimately sent back"}, {"ball": 12.2, "isHighlight": false, "text": "Aaron to Warner,1 run,Warner has blasted this length delivery but there is long off, a few bounces and down to him"}, {"ball": 12.3, "isHighlight": false, "text": "Aaron to Dhawan,1 run,chops this short of a length ball on the stumps square on the off side"}, {"ball": 12.3, "isHighlight": false, "text": "Sawdust being poured on the bowler's landing area"}, {"ball": 12.4, "isHighlight": false, "text": "Aaron to Warner,1 run,in the blockhole outside off, Warner squeezes it to Starc at backward point, who misfields"}, {"ball": 12.5, "isHighlight": false, "text": "Aaron to Dhawan,no run,walks way outside off trying to scoop this to fine leg, but the ball is not pitched up, and bounces past Dhawan's bat-swing"}, {"ball": 12.6, "isHighlight": false, "text": "Aaron to Dhawan, $$OUT$$ ,not the first time Dhawan's fallen to the pull, he's mishit it to AB at deep midwicket, it was a short ball around chest height"}, {"ball": 12.6, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Aaron$$ $$37$$ $$(66m$$ $$36b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$102.77$$"}, {"ball": 13.1, "isHighlight": false, "text": "Dinda to Sammy,no run,good length, close to off stump, defended to the bowler"}, {"ball": 13.2, "isHighlight": false, "text": "Dinda to Sammy,1 run,turns this length ball to wide long on for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Dinda to Warner,no run,yorker angled across the left-hander, just outside off, Warner gets low and tries to squeeze it away but misses"}, {"ball": 13.4, "isHighlight": false, "text": "Dinda to Warner,no run,and again, a shade wider but in the blockhole again, Warner cannot connect this time too"}, {"ball": 13.5, "isHighlight": false, "text": "Dinda to Warner,1 run,a full toss now, but Warner cannot hit it hard enough to beat long on who reaches it to his right"}, {"ball": 13.6, "isHighlight": false, "text": "Dinda to Sammy,no run,pitched up around off stump, Sammy drills it back, Dinda gets down and prevents it from going down the ground"}, {"ball": 14.1, "isHighlight": false, "text": "Chahal to Warner, $$SIX$$ ,Chahal begins his last over and is taken for maximum down the ground first ball, as Warner skips out, reaches the pitch and powers it high and into the sightscreen"}, {"ball": 14.2, "isHighlight": false, "text": "Chahal to Warner,1 run,goes flat and sits up outside off for the cut, but Warner's stroke finds point"}, {"ball": 14.2, "isHighlight": false, "text": "Uzair Rizvi: \"Sammy too early, this is where Sunrisers miss a middle order batsman, either they have openers or they have lower order and tail-enders, but no middle order batsman\""}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to Sammy,1 wide,slips it flat down the leg side even as Sammy fails to connect"}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to Sammy,1 run,wrong 'un, Sammy is going back to make room but it spins in and is inside-edged to short fine leg"}, {"ball": 14.4, "isHighlight": false, "text": "Chahal to Warner,no run,another wrong 'un pitching outside off and spinning further away, Warner stretches for a cut, cannot beat point"}, {"ball": 14.5, "isHighlight": false, "text": "Chahal to Warner,2 runs,leans forward to a pitched up ball and drives past cover to the sweeper"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Warner,1 wide,floats it up way outside the off stump now"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Warner,1 run,length ball on middle and leg, he moves across to work it in front of square"}, {"ball": 14.6, "isHighlight": false, "text": "Time out"}, {"ball": 14.6, "isHighlight": false, "text": "suhas: \"I think it's the perfect time for sammy to come to get the momentum going with warner.\""}, {"ball": 14.6, "isHighlight": false, "text": "perplexed: \"Sammy in too early? you think he is not capable of being in a partnership that lasts 5 overs and provides him with about 15 balls to face? that seems a little strange . .\""}, {"ball": 15.1, "isHighlight": false, "text": "HV Patel to Warner,1 run,run out chance, needed a direct hit, Warner skipped out and slammed this full toss to Kohli at extra cover, the captain fired it in flat and quick, Warner was not even in the frame, but Kohli missed"}, {"ball": 15.2, "isHighlight": false, "text": "HV Patel to Sammy,no run,Sammy cranks up for the big one, but this is not full enough to get under, and he plays it out to point instead"}, {"ball": 15.3, "isHighlight": false, "text": "HV Patel to Sammy, $$SIX$$ ,he's flat-batted this wide length ball 80 metres over long off, set himself up, pushed front foot out and clobbered it"}, {"ball": 15.4, "isHighlight": false, "text": "HV Patel to Sammy,1 leg bye,tries to go leg side but this is a slower one and rolls towards the keeper off the thigh pad"}, {"ball": 15.5, "isHighlight": false, "text": "HV Patel to Warner,1 run,very wide full toss, Warner reaches out and drills it through point"}, {"ball": 15.6, "isHighlight": false, "text": "HV Patel to Sammy, $$OUT$$ ,the slower one at 118 kph works for Harshal, a length ball cutting in from outside off, Sammy wants to deposit it over deep midwicket but it comes off slowly and bounces, he mishits it to straight the fielder"}, {"ball": 15.6, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$Starc$$ $$b$$ $$HV$$ $$Patel$$ $$8$$ $$(17m$$ $$8b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to Warner,1 leg bye,Starc goes full on leg stump even as Warner tries to make some room, Warner swings hard but cannot connect"}, {"ball": 16.2, "isHighlight": false, "text": "Starc to Ojha,no run,another escape for Warner, and it is Kohli again, he misses from midwicket this time, Ojha had turned a short of a length ball there, and Warner had backed up too far"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to Ojha,2 runs,guided  wide of third man, where Aaron dives to his right to stop the ball"}, {"ball": 16.4, "isHighlight": false, "text": "Starc to Ojha,1 run,rises high on him as it is angled in from round the stumps, Ojha gets on his toes and drops it in front of midwicket, it is Kohli v Warner again, and Kohli misses with the lob too now"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to Warner,1 run,has a crack at this full delivery angled in from over the wicket, but will only get an inside edge to midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Ojha, $$FOUR$$ ,makes Ojha hop with another lifter from round the stumps, but the batsman does well to guide it calmly past the keeper and fine to the third man boundary"}, {"ball": 17.1, "isHighlight": false, "text": "Dinda to Warner,1 run,a wide and low full toss, Warner reaches for it and drags it to long on"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Ojha,no run,bowled full around off, is driven back, Dinda gets down to stop it"}, {"ball": 17.2, "isHighlight": false, "text": "Alex: \"Theres the answer for you perplexed. \""}, {"ball": 17.3, "isHighlight": false, "text": "Dinda to Ojha,1 run,high full toss guided through point to the sweeper"}, {"ball": 17.4, "isHighlight": false, "text": "Dinda to Warner, $$SIX$$ ,just over long off's jump, Warner walks down the track and hammers this full toss, AB runs to his left and leaps but in vain"}, {"ball": 17.5, "isHighlight": false, "text": "Dinda to Warner,2 runs,another full toss, lower this time, Warner drills it past the non-striker, there is no denying AB this time, he zooms across and slides in front of the sightscreen to prevent the boundary"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda to Warner, $$SIX$$ ,now Warner hammers one out of the reach of long on, Dinda gives him another full toss, Warner sends it flat and powerful, long on jumps too, like AB had, and is as successful"}, {"ball": 18.1, "isHighlight": false, "text": "Aaron to Ojha,no run,mid off is up, this is pitched up, but Ojha's driven this straight to him,"}, {"ball": 18.2, "isHighlight": false, "text": "Aaron to Ojha,1 run,makes some room and guides this bouncing delivery to third man"}, {"ball": 18.2, "isHighlight": false, "text": "round the stumps"}, {"ball": 18.3, "isHighlight": false, "text": "Aaron to Warner,1 run,full delivery, Warner cracks it along the ground to long on"}, {"ball": 18.4, "isHighlight": false, "text": "Aaron to Ojha,no run,short ball flies past the batsman outside off, Ojha hops and tries to steer it fine, can't reach it"}, {"ball": 18.5, "isHighlight": false, "text": "Aaron to Ojha, $$SIX$$ ,this time he connects, and sends a length ball high, straight and 89 metres"}, {"ball": 18.6, "isHighlight": false, "text": "Aaron to Ojha,1 wide,goes way outside off stump now"}, {"ball": 18.6, "isHighlight": false, "text": "Aaron to Ojha, $$OUT$$ ,full and wide, Ojha reaches for it, but he hasn't gone too hard at it, and ends up slicing it to Starc, who runs to his left from sweeper cover to take it"}, {"ball": 18.6, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$c$$ $$Starc$$ $$b$$ $$Aaron$$ $$15$$ $$(14m$$ $$11b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$136.36$$"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Pathan,1 leg bye,full and low into the pad, Irfan cannot connect, the ball pops up on the leg side, Irfan is standing and watching before he is forced into action as Warner charges up"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Warner,no run,yorker outside leg stump as Warner moves out and tries to make room, he misses, Irfan wants the bye now, but is sent back"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to Warner,no run,now he gives him the bouncer, even as Warner comes across and tries to get down on a knee, the ball rears up at him, Warner misses again"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Warner, $$OUT$$ ,he's missed a final time this innings, walked across outside off stump, Starc went full on middle, and hit it"}, {"ball": 19.4, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$b$$ $$Starc$$ $$61$$ $$(82m$$ $$49b$$ $$4x4$$ $$3x6)$$ $$SR:$$ $$124.48$$"}, {"ball": 19.5, "isHighlight": false, "text": "Starc to KV Sharma,1 run,backs away and slogs, mishits through midwicket"}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Pathan, $$FOUR$$ ,Irfan gets the final delivery away for four over extra cover, Starc pitches it up, offers slight width, Irfan clears front leg, bends the back leg and lofts it cleanly"}, {"ball": 19.6, "isHighlight": false, "text": "Superb last over from Starc. Sunrisers manage 49 off the last five. RCB won't mind having to chase 155 but their recent batting form hasn't been great"}], "name": "Royal Challengers Bangalore v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733977.html?innings=1;view=commentary", "match_num": 24}