{"commentary": [{"ball": 0, "isHighlight": false, "text": "All set to go. Rahane walks in, Nair is here. Yusuf at first slip. Vinay Kumar to start"}, {"ball": 0, "isHighlight": false, "text": "$$3.45$$ $$pm$$  Clearly Gambhir's decision had nothing to do with the history of T20s on this ground. Teams batting first have won 17 out of 22 games played here. But this doesn't look like a typical Motera track."}, {"ball": 0, "isHighlight": false, "text": "\"When will RR will give chance to Unmukt Chand,he is better than karun nair,of course he played last match very well but Unmukt Chand is better option for RR rather than karun nair\" ---- Bilal, Unmukt has not a single T20 half-century in 17 IPL outings. Nair scored a 50 two days back. Who do you choose?"}, {"ball": 0, "isHighlight": false, "text": "Ashwin: \"I choose .... Pikachu!\""}, {"ball": 0, "isHighlight": false, "text": "$$3.30$$ $$pm$$   $$KKR$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$are$$ $$going$$ $$to$$ $$bowl$$ . \"I have never seen so much grass in Ahmedabad,\" says Gambhir. Watson would have batted first anyway. Two changes for RR - Southee in for Richardson and Tewatia (who is playing his first game) comes in for Kulkarni.  $$KKR$$ $$have$$ $$made$$ $$two$$ $$big$$ $$changes$$ $$-$$ $$Kallis$$ $$is$$ $$out.$$ $$RTD$$ $$comes$$ $$in.$$  Umesh replaces Chawla."}, {"ball": 0, "isHighlight": false, "text": "Aayush: \"Finally ten Doeschate! Can't wait to see him in action today. I think KKR have wasted his abilities so far in consecutive seasons. Hope he does well!\""}, {"ball": 0, "isHighlight": false, "text": "watfor: \"RR again springing a surprise. Tewatia has barely played a couple of first-class games.\""}, {"ball": 0, "isHighlight": false, "text": "Ram: \"I think as a young Indian player, RR is the best team to be part of. You will get a chance unlike the big teams like MI, CSK, RCB etc... (Aparajit, Yuzvendra, etc...) - Tewatia profile shows he has played just 1 match in his career and now he is in the team at expense of Dhawal. Looks promising. Same for the almost unknowns who are ruling the roost after being in RR - Rahane, Binny, Sanju, Tambe et al\""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  Royals are not in Rajasthan today, they are in Gujarat, their new home. How would that affect their chances here? Mind you, KKR are not the strongest of sides on current form. While we wait for the toss, here's the  $$match$$ $$preview$$ ."}, {"ball": 0, "isHighlight": false, "text": "\"I am in Ahmedabad. I can see clear blue skies. Weather is clean. But believe me its really Hot out there. Even if you are going out to just see the sky, you will get burned. In fact it has cool down a little since last 2-3 days but still far hotter than any other venue right now.\" -- I trust you Ankit. But believe me, Mumbai is no fun either. I bet Chennaiwallahs will laugh at both of us."}, {"ball": 0, "isHighlight": false, "text": "\"hahahah, (laughing from chennai), its raining from last night here and the weather is awesome for a beautiful bike ride...\" --- Laugh while you can Jai.. Chennai will strike back."}, {"ball": 0, "isHighlight": false, "text": "Lots of questions facing KKR as the aim to reignite their IPL campaign. Answering them could give them victory today. There are lots of questions for the cricket fan in  $$CricIQ$$  - answering them could get you on an all-expenses paid trip to Lord's to watch India play England.  $$Play$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Vinay Kumar to Rahane, $$FOUR$$ ,bowls full on the pads and Rahane will flick them all day, he does it neatly past the square leg umpire"}, {"ball": 0.2, "isHighlight": false, "text": "Vinay Kumar to Rahane,no run,corrects the line, gets this one to shape away a touch outside off, the batsman defends it to off"}, {"ball": 0.3, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,this one is too straight again, there is some shape on it but Rahane dabs it to midwicket for a single"}, {"ball": 0.4, "isHighlight": false, "text": "Vinay Kumar to Nair,no run,length delivery on off stump, Karun stays in the crease and defends this solidly to mid-on"}, {"ball": 0.4, "isHighlight": false, "text": "Soumyadut: \"With s much grass on the pitch, I would have picked Morkel over Shakib/ Russell any day. And where is Pat Cummins? He was fantastic when he played for Australia the last time\" --- Warming the bench I think"}, {"ball": 0.5, "isHighlight": false, "text": "Vinay Kumar to Nair,no run,gets this to shape away from short of length, Karun has a poke at it and misses"}, {"ball": 0.6, "isHighlight": false, "text": "Vinay Kumar to Nair,no run,appeals for an lbw but this is an ambitious shout as the ball pitched on leg stump and didn't straighten enough"}, {"ball": 0.6, "isHighlight": false, "text": "Umesh Yadav to start from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "UT Yadav to Rahane,no run,length delivery on off stump, easily defended to square leg"}, {"ball": 1.2, "isHighlight": false, "text": "UT Yadav to Rahane,1 leg bye,strays on to the pads and easily tickled to fine leg, that was off the thigh pad actually"}, {"ball": 1.3, "isHighlight": false, "text": "UT Yadav to Nair, $$FOUR$$ ,short and wide, Karun is the man with the confidence of a fifty behind him, he waits an extra second and cracks it through backward point"}, {"ball": 1.3, "isHighlight": false, "text": "Chandan: \"Wonder how quickly the approach of a captain also changes in T20s. Gambhir in first few matches was heard saying \"if we put runs on the board, we are more likely to win with the kind of bowling attack we have\". After few matches chawla, Morkel and Kallis are out of that bowling attack and he prefers to chase including Russell at 8. Difficult strategies.\""}, {"ball": 1.4, "isHighlight": false, "text": "UT Yadav to Nair,3 runs,now he bowls it full on the pads, Karun doesn't have to do much, he just wrists it behind square leg and it looks set for the boundary, but RTD saves a single with a dive"}, {"ball": 1.5, "isHighlight": false, "text": "UT Yadav to Rahane,no run,looks for the outswinger, but ends up bowling a low full toss, punched to mid-off"}, {"ball": 1.6, "isHighlight": false, "text": "UT Yadav to Rahane,1 run,on the pads again, easily nudged to fine leg for a single"}, {"ball": 1.6, "isHighlight": false, "text": "Rahul: \"Russell's talented but he tried to overdo it. When he swings his bat it's like he's trying to go for a 12. T20 aggression has gone to his head imo lol. Its bonkers to have Cummins on the bench and play AR when his batting really is more like slogging and his bowling isn't impressive either. Morkel's been in patchy form so I understand benching him.\""}, {"ball": 1.6, "isHighlight": false, "text": "Siddartha Khand: \"If the thinking behind choosing Russell is to bolster the batting, he's batting at 8 mind you, it shows you have zero confidence in your batting. Rcb for instance, play with only 6. Morkel on a green pitch is my pick anyday.\""}, {"ball": 2.1, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,bowls it slow and bowls it full, Rahane flicks it to deep backward square leg as the line is too straight"}, {"ball": 2.2, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,they are bowling on the pads - maybe that's the plan - Rahane flicks this one fine and picks up a couple as the fine leg was squarer"}, {"ball": 2.3, "isHighlight": false, "text": "Vinay Kumar to Rahane,2 runs,more runs at fine leg! This is on the middle stump line, Rahane just has to close the face and bang.. couple of easy runs"}, {"ball": 2.4, "isHighlight": false, "text": "Vinay Kumar to Rahane,no run,finally outside off, but this one was asking to be hit. It was short and wide, the batsman punches it straight to cover point"}, {"ball": 2.5, "isHighlight": false, "text": "Vinay Kumar to Rahane,no run,this one is crisply timed off the back foot! It was short enough for that kind of shot, but Surya at cover dives to his left to cut it off"}, {"ball": 2.6, "isHighlight": false, "text": "Vinay Kumar to Rahane,1 run,short of length and on the body, easily clipped to backward square leg for another single"}, {"ball": 3.1, "isHighlight": false, "text": "UT Yadav to Rahane,no run,this one is quick! it skids off the surface and beats the outside edge as Rahane looks to punch it off the back foot"}, {"ball": 3.2, "isHighlight": false, "text": "UT Yadav to Rahane,no run,looks to flick it to the on side, but this was just outside off. The batsman gets a leading edge towards mid-off, but it drops well short"}, {"ball": 3.3, "isHighlight": false, "text": "UT Yadav to Rahane, $$FOUR$$ ,easily done! He was trying to play the same shot off the last ball.. this time he does it well. Full on the middle, Rahane just chips it over midwicket for a boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Arindam: \"As a hardcore KKR supporter, I have to say that I'm baffled with how the team management takes decisions for changes in team.. If they commit 1 great n bold move by dropping Kallis, they commit a bigger blunder by not playing Morkel/Cummins in a grassy pitch, leaving the fast bowling dept in the hands of the unimpressive duo of Umesh-Vinay..\""}, {"ball": 3.4, "isHighlight": false, "text": "UT Yadav to Rahane, $$SIX$$ ,this one has sailed all the way! More runs at fine-leg! He charges down the pitch, got a good slower delivery, but the batsman just carries on with his flick shot"}, {"ball": 3.5, "isHighlight": false, "text": "UT Yadav to Rahane,1 run,comes forward and nudges the length delivery to deep square leg for a single"}, {"ball": 3.5, "isHighlight": false, "text": "khan: \"When I watch Rahane bat its as if I see Dravid's ghost. Another example of class batting benefits.\""}, {"ball": 3.6, "isHighlight": false, "text": "UT Yadav to Nair,1 run,short and wide, it's steered down to third man for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Spin already.. Shakib  is here.."}, {"ball": 4.1, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 wide,fires it down the leg side.."}, {"ball": 4.1, "isHighlight": false, "text": "Shakib Al Hasan to Nair,no run,floated up on off stump, Karun pushes it to cover"}, {"ball": 4.2, "isHighlight": false, "text": "Shakib Al Hasan to Nair, $$FOUR$$ ,that's a neat sweep shot! It was always coming in from the angle Shakib bowls with and Karun just helps it along its way, bisecting the gap between short fine leg and backward square leg"}, {"ball": 4.3, "isHighlight": false, "text": "Shakib Al Hasan to Nair, $$FOUR$$ ,another sweep, another boundary at the same area.. This one was more of a top-edge as he was looking to hit this hard"}, {"ball": 4.4, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 run,uses his feet and drives the fuller delivery down to long off for a single"}, {"ball": 4.5, "isHighlight": false, "text": "Shakib Al Hasan to Rahane,1 run,tossed up, but this is on the pads, Rahane dabs it to midwicket for a single"}, {"ball": 4.5, "isHighlight": false, "text": "Faisal Habib: \"@Khan: Dravid was strictly against getting into double figures before number of balls \""}, {"ball": 4.6, "isHighlight": false, "text": "Shakib Al Hasan to Nair,no run,comes down the pitch, but has to defend as he is not to the pitch of the delivery"}, {"ball": 4.6, "isHighlight": false, "text": "Now Narine"}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Rahane,1 run,bowls an offspinner, easily worked away to deep square leg for a single"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Nair,no run,that's the straighter one! Karun had no idea. He was playing for the turn and gets beaten"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Nair,no run,woo! that's a big doosra! Squares up Karun completely. He gets an outside edge, but that falls short of slip"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Nair,1 run,cross-batted shot comes out since he has no clue where this is spinning, picks up a single to deep square leg"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Rahane,no run,he comes forward and defends this one solidly down the pitch"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Rahane, $$FOUR$$ ,shorter from Narine and Rahane stands up tall to punch this through cover! Lovely timing there, although not a great effort by the cover fielder who allowed it to go through.. Quick 50 for RR already"}, {"ball": 5.6, "isHighlight": false, "text": "Another change.. Russell now"}, {"ball": 6.1, "isHighlight": false, "text": "Russell to Nair,2 runs,on the  pads! How many times have we seen this today, Karun flicks it to deep backward square leg"}, {"ball": 6.2, "isHighlight": false, "text": "Russell to Nair,no run,back of length delivery outside off, the batsman defends it to point"}, {"ball": 6.3, "isHighlight": false, "text": "Russell to Nair, $$OUT$$ ,direct hit has cut short Rahane's innings! or has it? It always looked like a risky single. Karun flicked the short of length delivery straight to short fine leg... It just went too quickly to the fielder.. Narine does well and throws down the stumps at the striker's end. Rahane dived.. but was always going to be short"}, {"ball": 6.3, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$run$$ $$out$$ $$30$$ $$(28m$$ $$22b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$136.36$$"}, {"ball": 6.3, "isHighlight": false, "text": "Sanju Samson is the next man"}, {"ball": 6.4, "isHighlight": false, "text": "Russell to Samson,1 run,looks for the yorker, but bowls a low full toss outside off, easy delivery for Sanju who drives it to deep cover"}, {"ball": 6.5, "isHighlight": false, "text": "Russell to Nair,1 run,back of length delivery on the body, Karun clips it off his hips to fine leg"}, {"ball": 6.6, "isHighlight": false, "text": "Russell to Samson, $$FOUR$$ ,this is beautifully played! It was a good short of length delivery outside off, Samson just opens the bat face very late to run it down fine on the off side.. third man had no chance"}, {"ball": 6.6, "isHighlight": false, "text": "Shakib comes back.. no slip for him now"}, {"ball": 7.1, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 leg bye,full and flighted, on the pads, the batsman dabs it towards square leg for a quick single"}, {"ball": 7.2, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,goes on the back foot and pushes the fuller delivery to the right of midwicket softly"}, {"ball": 7.3, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 run,goes deep in the crease and punches the flatter delivery to deep midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,comes down the pitch but Shakib bowls this wide outside off, he has to adjust and he does that well, stretching forward to drive it to deep cover"}, {"ball": 7.5, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 run,comes forward and dabs this softly to the vacant midwicket region"}, {"ball": 7.6, "isHighlight": false, "text": "Shakib Al Hasan to Samson,no run,he comes forward and defends the floated delivery to cover"}, {"ball": 7.6, "isHighlight": false, "text": "Indranil: \"This is the third run out for nair-rahane pair...management needs to look this out a little i guess...hate to see rahane get out atleast in this fashion! \""}, {"ball": 7.6, "isHighlight": false, "text": "Anand: \"@Indranil: You had Rahane on your Fantasy 11, didn't you? :)\""}, {"ball": 8.1, "isHighlight": false, "text": "Russell to Nair,1 run,bowls a fuller delivery on off, easily punched to long on for a single"}, {"ball": 8.1, "isHighlight": false, "text": "Khan: \"Mario Bolatelli has had enough of soccer and so he is playing for KKR as Andre Russell. No wonder he is not the bowler we expect him to be.\""}, {"ball": 8.2, "isHighlight": false, "text": "Russell to Samson, $$FOUR$$ ,that's neatly done too! This is a length delivery wide outside off, Sanju makes no effort to keep it down, slicing it over point"}, {"ball": 8.3, "isHighlight": false, "text": "Russell to Samson,no run,that's a good response from Russell.. A slower delivery just outside off, it bounces a touch extra too and beats the outside edge"}, {"ball": 8.4, "isHighlight": false, "text": "Russell to Samson,1 run,another slower delivery, this was full and it's driven to deep cover for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Russell to Nair,1 run,fires this one on the pads, the batsman misses his flick but picks up a leg bye towards the off side"}, {"ball": 8.6, "isHighlight": false, "text": "Russell to Samson,1 run,he comes forward and drives this on the up to wide long on for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Shakib continues"}, {"ball": 9.1, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,floated up outside off, the batsman pushes it to cover for a single"}, {"ball": 9.2, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 run,looks to push this to the off side, but gets an inside edge to midwicket to pick up a single"}, {"ball": 9.3, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,comes down the pitch and almost yorks himself, still manages to push it to long off for a single"}, {"ball": 9.4, "isHighlight": false, "text": "Shakib Al Hasan to Nair,1 run,flatter delivery but Nair was down on his knee early for a sweep shot, he gets a big top edge but that lands safely at deep backward square leg"}, {"ball": 9.5, "isHighlight": false, "text": "Shakib Al Hasan to Samson,no run,he has won that call! That was by the wide marker outside off.. No signal from the umpire"}, {"ball": 9.6, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,uses his feet and gets a high full toss that he punches to deep cover"}, {"ball": 9.6, "isHighlight": false, "text": "Change in bowling.. Ten Doeschate comes in for the first time this season"}, {"ball": 10.1, "isHighlight": false, "text": "ten Doeschate to Samson,1 run,slower delivery outside off, the batsman slices it to short third man for a single"}, {"ball": 10.1, "isHighlight": false, "text": "Ashwin: \"I do understand the thinking process behind putting Watto at no.4 to stabilise the middle order! But how I wish he opened or atleast came in at no.3....would have been perfect for this situation to take RR to over 200!\""}, {"ball": 10.2, "isHighlight": false, "text": "ten Doeschate to Nair,no run,looks to reverse paddle this length delivery, but is a touch late and is beaten.. Uthappa is standing up to the stumps"}, {"ball": 10.3, "isHighlight": false, "text": "ten Doeschate to Nair,1 run,smart bowling.. This is slower outside off, the batsman works it away to deep midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "ten Doeschate to Samson,1 run,moves a touch to the leg side and gets a short of length delivery on the body, he chops it to short third man for a single"}, {"ball": 10.5, "isHighlight": false, "text": "ten Doeschate to Nair,2 runs,another slower ball, but this is too full and on the pads too, easily flicked over square leg for a couple to the deep"}, {"ball": 10.6, "isHighlight": false, "text": "ten Doeschate to Nair,no run,fires a good yorker outside off, the batsman digs it out back to the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "sathya: \"What these two are waiting for? They have watto, smith, why can't they throw the bat atleast every third ball? Royals are wasting the talents of watto and smith\""}, {"ball": 10.6, "isHighlight": false, "text": "Umesh comes back"}, {"ball": 11.1, "isHighlight": false, "text": "UT Yadav to Samson,no run,and bowls a slower delivery to start with, Sanju plays his attempted guide to third man a touch too early to be beaten"}, {"ball": 11.2, "isHighlight": false, "text": "UT Yadav to Samson,1 run,he is lucky as this edge lands just behind the bowler! That was going nowhere as he tries to flat-bat this short of length delivery down the ground only to get a thick top edge"}, {"ball": 11.3, "isHighlight": false, "text": "UT Yadav to Nair,1 run,moves to the leg side and gets a slower ball, he punches it to deep midwicket for a single"}, {"ball": 11.4, "isHighlight": false, "text": "UT Yadav to Samson,1 run,there is some force in this back foot punch, but Sanju hits it straight to deep cover"}, {"ball": 11.4, "isHighlight": false, "text": "Daison: \"The wagon wheels for each batter tells a story about individuals getting planned by teams. Rahane had to score almost all his runs around square leg region, Karun got to score most his run in leg side. Just when you think the bowlers are going leg side too much, Sanju's wagon wheel shows most his runs in cover region. There is a lot going within the game eh?\""}, {"ball": 11.5, "isHighlight": false, "text": "UT Yadav to Nair, $$SIX$$ ,he has cleared the man at deep square leg! That looked like a leading edge to me.. it was a low full toss on the pads and the batsman was aiming to play it fine, but closes the face too early.. The edge has enough to send it all the way though"}, {"ball": 11.6, "isHighlight": false, "text": "UT Yadav to Nair,2 runs,another full delivery, this time outside off, he slices it to deep backward point for a couple"}, {"ball": 11.6, "isHighlight": false, "text": "Kshitiz: \"They are waiting for Winter to arrive. :P #GameOfThrones \""}, {"ball": 12.1, "isHighlight": false, "text": "ten Doeschate to Samson,no run,looks to punch this offcutter through off, but gets a thick outside edge to short third man"}, {"ball": 12.2, "isHighlight": false, "text": "ten Doeschate to Samson,1 run,full and flighted on the middle, the batsman squeezes it out to cover point for a single"}, {"ball": 12.3, "isHighlight": false, "text": "ten Doeschate to Nair,1 run,good work by Gambhir at backward point! He dives to his left and saves a certain boundary as the batsman had got enough bat on that"}, {"ball": 12.4, "isHighlight": false, "text": "ten Doeschate to Samson,2 runs,fuller, quicker and on the pads, it's flicked to deep backward square leg"}, {"ball": 12.5, "isHighlight": false, "text": "ten Doeschate to Samson,1 run,swings his bat across the line to the length delivery, but can only find the man at deep midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "ten Doeschate to Nair, $$FOUR$$ ,this is a poor delivery! It was one of those offcutters, but RTD bowls this one down the leg side.. Karun just helps it on its way, flicking it over short fine leg for a boundary"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib comes back for his last over, over the wicket now"}, {"ball": 13.1, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 wide,floats this one very wide .. outside off."}, {"ball": 13.1, "isHighlight": false, "text": "Shakib Al Hasan to Samson,2 runs,bowls a low full toss outside off and it's driven to wide long off.. where Manish Pandey and Surya almost make a hash of it.. But they end up giving away only one extra run"}, {"ball": 13.1, "isHighlight": false, "text": "Back round the wicket"}, {"ball": 13.1, "isHighlight": false, "text": "Anil Raj: \"Both Nair and Samson should know Narine has got 3 more overs to bowl and they won't be able to get much out of him. So they should have attacked others when they have Watto and Smith to follow. This is why Watson should have come at 3 today\""}, {"ball": 13.2, "isHighlight": false, "text": "Shakib Al Hasan to Samson,1 run,moves the leg side and drives the fuller delivery to deep cover"}, {"ball": 13.3, "isHighlight": false, "text": "Shakib Al Hasan to Nair, $$OUT$$ ,he misses out on his half-century! That was smartly bowled by Shakib. He saw the batsman making a move down the pitch and fired it full outside off.. Nair was stranded down the pitch.. no chance for him"}, {"ball": 13.3, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$st$$ $$†Uthappa$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$44$$ $$(59m$$ $$35b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$125.71$$"}, {"ball": 13.3, "isHighlight": false, "text": "Riyaz Tak: \"blessing in disguise.here comes watson :)\"... Six and a half overs for him.."}, {"ball": 13.4, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,bowls a flatter delivery on the pads, the batsman punches it straight to midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Shakib Al Hasan to Watson,1 wide,another one fired flat.. but this way down the leg side"}, {"ball": 13.5, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,quicker on on the middle and leg line, again, Watson finds the man at midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Shakib Al Hasan to Watson,no run,goes back to punch this, but it keeps coming in with the angle, the batsman pushes it to cover"}, {"ball": 13.6, "isHighlight": false, "text": "Narine is back"}, {"ball": 14.1, "isHighlight": false, "text": "Narine to Samson,1 run,looks to flick it towards midwicket, but ends up chipping it past the non-striker for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Narine to Watson,1 run,bowls it too short, Watson pulls it hard along the ground, but there is protection at deep midwicket"}, {"ball": 14.3, "isHighlight": false, "text": "Narine to Samson, $$FOUR$$ ,comes down the pitch, is beaten by the doosra, fortunately for him, he gets a thick outside edge that runs fine through off side"}, {"ball": 14.4, "isHighlight": false, "text": "Narine to Samson,2 runs,this one is off the middle! He moves to leg side and punches this flatter delivery over point for a good couple of runs"}, {"ball": 14.5, "isHighlight": false, "text": "Narine to Samson,no run,pushes the offspinner down the ground, Narine does the fielding"}, {"ball": 14.5, "isHighlight": false, "text": "mehdizaman: \"I don't understand all this fuss; had they gotten out trying to retain the run rate everybody would have been lashing out for not taking their time. 104 with 6 overs to go gives allot of time and freedom for watto to flex his muscles \""}, {"ball": 14.6, "isHighlight": false, "text": "Narine to Samson,2 runs,shuffles across to the off side this time before charging down the pitch, gets a toe end to deep square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Joshua: \"I get that Watson is trying to emulate what Warne did so well with RR in the first edition of the IPL by empowering the lesser known players... But Warnie still bowled himself in tough situations and led from the front. There's a time when sticking with a strategy that could be improved just becomes stubbornness...\""}, {"ball": 14.6, "isHighlight": false, "text": "Vinay comes back into the attack"}, {"ball": 15.1, "isHighlight": false, "text": "Vinay Kumar to Watson, $$SIX$$ ,that's a gift to Watson.. a half-volley outside off, Watson clubs it over long-on with ease.. thank you very much"}, {"ball": 15.2, "isHighlight": false, "text": "Vinay Kumar to Watson, $$FOUR$$ ,now a low full toss wide outside off, that has been hammered through extra cover"}, {"ball": 15.3, "isHighlight": false, "text": "Vinay Kumar to Watson,1 run,fires that wide yorker.. this would have been a wide has Watson not stuck his bat out.. They pick up a single to cover"}, {"ball": 15.4, "isHighlight": false, "text": "Vinay Kumar to Samson,1 run,gets a slower delivery and he throws his bat at that, but finds the man at deep midwicket"}, {"ball": 15.5, "isHighlight": false, "text": "Vinay Kumar to Watson, $$SIX$$ ,another gift .. this is a full delivery outside off, Watson won't mind these at all.. He clubs this down the ground, over the bowler's head"}, {"ball": 15.6, "isHighlight": false, "text": "Vinay Kumar to Watson,1 run,pushes this to long off for a single"}, {"ball": 16.1, "isHighlight": false, "text": "Narine to Watson,1 run,plants his front foot out and punches this to long on"}, {"ball": 16.2, "isHighlight": false, "text": "Narine to Samson, $$OUT$$ ,marginally short and Sanju makes a good connection with his pull shot, but that has gone higher than longer and is comfortably taken by Pandey at deep midwicket"}, {"ball": 16.2, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$Pandey$$ $$b$$ $$Narine$$ $$37$$ $$(46m$$ $$31b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$119.35$$"}, {"ball": 16.2, "isHighlight": false, "text": "Stuart Binny is the new man"}, {"ball": 16.3, "isHighlight": false, "text": "Narine to Watson,no run,flatter and quicker on the stumps, the batsman punches it back to the bowler"}, {"ball": 16.4, "isHighlight": false, "text": "Narine to Watson,1 run,slower this time, the batsman presses forward and pushes it softly to midwicket.. Binny wanted two, but is sent back"}, {"ball": 16.5, "isHighlight": false, "text": "Narine to Binny,1 run,watches the away-going delivery carefully, dabs it to cover for a single"}, {"ball": 16.6, "isHighlight": false, "text": "Narine to Watson,1 leg bye,this is down the leg side, it flicks the pads to roll to fine leg"}, {"ball": 16.6, "isHighlight": false, "text": "Now Russell..third man and fine leg are in.."}, {"ball": 17.1, "isHighlight": false, "text": "Russell to Watson, $$FOUR$$ ,wow!! Binny gets away from it just in the nick of time.. That low full toss was murdered back down the pitch"}, {"ball": 17.2, "isHighlight": false, "text": "Russell to Watson,(no ball) 1 run,a high full toss this time! the batsman throws his bat at that and gets a top edge back down the ground.. Too high .. it's called a no-ball"}, {"ball": 17.2, "isHighlight": false, "text": "Russell to Binny,1 run,bowls a half-volley outside off, that is crashed through extra cover, but straight to the man in the deep"}, {"ball": 17.3, "isHighlight": false, "text": "Russell to Watson,no run,what was that! Russell looked like he was pulling out of the run up.. but he continues.. and bowls it outside off.. what was that! Nigel Llong didn't see that because the bowler was behind him.. Watson is confused and he is protesting with the umpire.. Llong - the other day he reprieved Dwayne Smith because the towel fell off Shakib's trousers.."}, {"ball": 17.3, "isHighlight": false, "text": "That's no innovation.. that should be called a dead ball"}, {"ball": 17.4, "isHighlight": false, "text": "Russell to Watson,2 runs,Watson was clearly irked by the previous ball as he throws his bat at this fuller delivery .. he gets a thick outside edge, but it lands safely beyond the reach of short third man running backwards"}, {"ball": 17.5, "isHighlight": false, "text": "Russell to Watson,1 run,gets the yorker on the target, the batsman punches it down to long on"}, {"ball": 17.6, "isHighlight": false, "text": "Russell to Binny,1 run,length delivery outside off, this is clubbed to wide long off..but just a single"}, {"ball": 17.6, "isHighlight": false, "text": "Shagun: \"Just when you thought that only batsmen could innovate, Russel comes along!! Never seen this before for sure. But is that legal?\" ---- He completed it, so yes legal.. But this was not right for me.. Watson was almost taking his eyes off that one"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Binny,1 run,swings his bat across the line to pick up a single to wide long on"}, {"ball": 18.1, "isHighlight": false, "text": "Sarma: \"why no innovation? Batsmen can do many things to disturb bowlers concentration, but if same is trying from bowler's end, its a crime. Com'n, when cricket became an exclusive batsmen game!!!\" ---- just because Russell's smartness could have caused serious injury.."}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Watson,2 runs,fires it on the pads, Watson works it away behind square on the leg side for a quick couple"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Watson, $$OUT$$ ,tossed up!! And what about that catch! KKR are pulling these blinders in this IPL.. Watson had reached the pitch of the delivery and it was well on his way over the long-on boundary.. But Surya waits at the edge of the boundary, and stretches outward to take that brilliantly.. He manages to keep his balance too.. Wonderful effort"}, {"ball": 18.3, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$SA$$ $$Yadav$$ $$b$$ $$Narine$$ $$31$$ $$(26m$$ $$20b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$155.00$$"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Binny,no run,now Binny tries to go inside out over extra cover, but misses and could be stumped here..He has just managed to keep his back foot inside the line"}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Binny, $$SIX$$ ,he come down the pitch and swings across the line.. gets it on the middle.. it wouldn't have mattered which way it was spinning.. that sails over deep midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Binny,no run,makes room and tries to hoist it over extra cover, but misses as this turns away .."}, {"ball": 18.6, "isHighlight": false, "text": "Vinay Kumar comes in"}, {"ball": 19.1, "isHighlight": false, "text": "Vinay Kumar to Smith,3 runs,he prepares for the switch hit early, gets a slower ball and whacks it over point.. but doesn't get much behind it.. the ball is pulled in by Gambhir"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to Binny,1 run,fires a good yorker on off, the batsman digs it out to deep midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Vinay Kumar to Smith, $$OUT$$ ,slower delivery, he looks for the big hit, but his timing is awry and that lobs up gently for the long on fielder"}, {"ball": 19.3, "isHighlight": false, "text": "$$SPD$$ $$Smith$$ $$c$$ $$SA$$ $$Yadav$$ $$b$$ $$Vinay$$ $$Kumar$$ $$3$$ $$(5m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay Kumar to Binny, $$OUT$$ ,another good catch in the deep! this time it's Tendo.. Binny whacked the low full toss straight towards deep midwicket.. Tendo was slightly inside the boundary and was expecting it to drop down towards him.. but that was hit hard and didn't look like coming down.. in the end he had to time his leap to get to that.."}, {"ball": 19.4, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$ten$$ $$Doeschate$$ $$b$$ $$Vinay$$ $$Kumar$$ $$11$$ $$(18m$$ $$9b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$122.22$$"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay on a hat-trick"}, {"ball": 19.5, "isHighlight": false, "text": "Vinay Kumar to Faulkner,1 run,no hat-trick for the bowler as Faulkner pushes this to deep midwicket for a single"}, {"ball": 19.6, "isHighlight": false, "text": "Vinay Kumar to Bhatia, $$SIX$$ ,slower ball, Bhatia gets under it and launches it over deep midwicket boundary"}, {"ball": 19.6, "isHighlight": false, "text": "An excellent last over from Vinay barring that last ball. KKR might be slightly pleased that they have managed to keep Royals down to 170 as they looked good for more at one stage. We will be back for the chase in 10 mins. the debate over Russell's actions rages on.."}, {"ball": 19.6, "isHighlight": false, "text": "Ranjith P: \"This is no innovation because Russell was not trying to distract Watson's concentration. He was trying to make him think that was a failed run up and give up on the ball. This is completely different from a batsman moving in his crease to create innovative shots. I will never support Russell's action. \""}, {"ball": 19.6, "isHighlight": false, "text": "Sriram: \"Cricket cannot be 50% batsman and 50% bowler's game simply because it will just take 10 balls to get 10 wickets. When batsman thinks bowler is not going to bowl and if bowler bowls it is unfair. On the contrary, when batsman changes stance, there is all indication that batsman is still trying to hit the ball and keep the ball in play.\""}, {"ball": 19.6, "isHighlight": false, "text": ""}, {"ball": 19.6, "isHighlight": false, "text": "Russell: \"Russell used to do that early in his career . Didn't like it then either. Someday someone's going to be out to that ball and it will be a controversy...\""}, {"ball": 19.6, "isHighlight": false, "text": "Khan: \"That takes some talent to do it and it was pretty cheeky. In all fairness though it was the leg umpire who could and should have signalled a dead ball.\""}, {"ball": 19.6, "isHighlight": false, "text": "Anyway, here's a constructive way to spend the innings break.  $$Answer$$ $$15$$ $$questions$$ $$in$$ $$quick$$ $$time$$ , and you could be on a flight to London to watch India play England at Lord's. Go."}], "name": "Rajasthan Royals v Kolkata Knight Riders", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733979.html?innings=1;view=commentary", "match_num": 25}