{"commentary": [{"ball": 0, "isHighlight": false, "text": "Watson is here to bowl..Uthappa to start"}, {"ball": 0.1, "isHighlight": false, "text": "Watson to Uthappa,no run,bowls a gentle outswinger, the batsman lets it go through"}, {"ball": 0.1, "isHighlight": false, "text": "Scott: \"In regards to the Russel delivery, he clearly slowed down, looked away. That is a dead ball, and shocking umpiring to simply say he didn't see it. Secondly, I guess Russel needs to reduce his career average of 9 an over somehow! \""}, {"ball": 0.2, "isHighlight": false, "text": "Watson to Uthappa,no run,another one shaping away from the batsman, Uthappa stretches forward and pushes it back to the bowler"}, {"ball": 0.3, "isHighlight": false, "text": "Watson to Uthappa, $$FOUR$$ ,slightly short in length and Uthappa is quick to swivel on his toes and whip it over midwicket for the first boundary"}, {"ball": 0.4, "isHighlight": false, "text": "Watson to Uthappa,no run,another outswinger.. This is wide outside off and keeps going away to beat the outside edge"}, {"ball": 0.5, "isHighlight": false, "text": "Watson to Uthappa,1 run,oh what timing! Uthappa meets this outswinger under his eye and times it beautifully, but straight to the man at cover, who has a shy at the striker's end and gives away an extra run"}, {"ball": 0.6, "isHighlight": false, "text": "Watson to Gambhir,no run,short delivery first up to Gambhir, the batsman goes for the pull but makes no connection"}, {"ball": 0.6, "isHighlight": false, "text": "Tim Southee comes in"}, {"ball": 1.1, "isHighlight": false, "text": "Southee to Uthappa,no run,bowls it full in the channel outside off, Uthappa comes forward and punches it back to the bowler"}, {"ball": 1.2, "isHighlight": false, "text": "Southee to Uthappa,no run,a brute of an outswinger! It's pitched on length and slightly shapes away to beat the outside edge.. Uthappa was looking for the on-the-up drive"}, {"ball": 1.3, "isHighlight": false, "text": "Southee to Uthappa,no run,he slaps this length delivery firmly, but hits it straight to mid-off"}, {"ball": 1.4, "isHighlight": false, "text": "Southee to Uthappa,1 run,goes wide of the crease and hits the pads as Uthappa misses his flick, but that was heading down the leg side"}, {"ball": 1.5, "isHighlight": false, "text": "Southee to Gambhir,3 runs,comes forward and drives the full and wide delivery through extra cover, not much timing behind that one, but it gives him three"}, {"ball": 1.6, "isHighlight": false, "text": "Southee to Uthappa, $$FOUR$$ ,superbly hit through wide mid-on! It was angled in on to the stumps and Uthappa went on with his drive, threading the gap between midwicket and mid-on"}, {"ball": 2.1, "isHighlight": false, "text": "Watson to Gambhir,no run,length delivery outside off, the batsman looks to punch this through off but gets an inside edge back to the bowler"}, {"ball": 2.2, "isHighlight": false, "text": "Watson to Gambhir,1 run,length delivery on the stumps, Gambhir dabs it close to the stumps and calls for a quick single"}, {"ball": 2.3, "isHighlight": false, "text": "Watson to Uthappa, $$FOUR$$ ,length delivery on the pads, Uthappa easily tickles it past the short fine leg .. Tambe gives it a chase, but cannot keep it in"}, {"ball": 2.4, "isHighlight": false, "text": "Watson to Uthappa, $$FOUR$$ ,thick outside edge, but there is only one slip in place and this flew through second slip.. It was another outswinger and he drew the batsman into it"}, {"ball": 2.5, "isHighlight": false, "text": "Watson to Uthappa,no run,he almost times it into the hands of the cover fielder! It was full and wide, the batsman comes forward and drives it to cover, but lands just short"}, {"ball": 2.6, "isHighlight": false, "text": "Watson to Uthappa,1 run,short of length delivery on off, Uthappa takes a smart single by dropping this one to the off side"}, {"ball": 2.6, "isHighlight": false, "text": "Some spin now.. Pravin Tambe is in"}, {"ball": 3.1, "isHighlight": false, "text": "Tambe to Uthappa,1 run,tossed up delivery on off, Uthappa comes forward and drives it down to long off for a single"}, {"ball": 3.2, "isHighlight": false, "text": "Tambe to Gambhir,1 run,tossed up and full on the pads, Gambhir is down on his knees early and sweeps it to deep midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Tambe to Uthappa,no run,lots of air on this one, Uthappa takes it on the full and drives it straight to cover"}, {"ball": 3.4, "isHighlight": false, "text": "Tambe to Uthappa, $$FOUR$$ ,comes down the pitch and just chips it over mid-on for another boundary! That was smart as he didn't try to hit it out of the ground, just a neat punch"}, {"ball": 3.5, "isHighlight": false, "text": "Tambe to Uthappa,2 runs,on the pads, Robin stays on the back foot and punches it to deep midwicket for a couple"}, {"ball": 3.6, "isHighlight": false, "text": "Tambe to Uthappa,no run,he stretches forward and pushes this to wide mid-on, but Faulkner dives across from midwicket, gets a hand to the ball and fuels hesitation.. Uthappa turns down the single"}, {"ball": 3.6, "isHighlight": false, "text": "James Faulkner is the new man.."}, {"ball": 4.1, "isHighlight": false, "text": "Faulkner to Gambhir,2 runs,very lucky for Gambhir this one! He was looking to punch this full delivery through midwicket, but gets a thick leading edge that flies in the gap at extra cover"}, {"ball": 4.2, "isHighlight": false, "text": "Faulkner to Gambhir,1 run,looks to pull the short of length delivery, but doesn't get hold of it.. It lands safely, way short of deep midwicket"}, {"ball": 4.2, "isHighlight": false, "text": "Faulkner runs in but Uthappa is not ready.. He moves away"}, {"ball": 4.3, "isHighlight": false, "text": "Faulkner to Uthappa,no run,length delivery outside off, Uthappa comes forward and punches this on the up straight to mid-off"}, {"ball": 4.4, "isHighlight": false, "text": "Faulkner to Uthappa,1 run,heaves this length delivery across the line and manages a single to deep square leg as it comes off the inside half of the bat"}, {"ball": 4.4, "isHighlight": false, "text": "Some words being exchanged between Faulkner and Uthappa"}, {"ball": 4.5, "isHighlight": false, "text": "Faulkner to Gambhir, $$FOUR$$ ,now Gambhir gets the bat behind it! It's full and on the stumps, Gambhir just presses forward and whacks it over midwicket for a boundary"}, {"ball": 4.6, "isHighlight": false, "text": "Faulkner to Gambhir,no run,slower delivery, it bounces a touch extra and Gambhir defends it to point"}, {"ball": 4.6, "isHighlight": false, "text": "Southee comes back to replace Tambe"}, {"ball": 5.1, "isHighlight": false, "text": "Southee to Uthappa,no run,charges down the pitch but finds the man at midwicket as this hits the inside half of the bat"}, {"ball": 5.2, "isHighlight": false, "text": "Southee to Uthappa,no run,sharp bouncer from Southee! Robin is surprised and doesn't expect it to rise so high, misses his pull shot"}, {"ball": 5.3, "isHighlight": false, "text": "Southee to Uthappa,1 run,length delivery on the pads, Robin is quick to flick this to deep square leg"}, {"ball": 5.3, "isHighlight": false, "text": "Pravin: \"With so much Aussie sledging going on this year RR will definitely not be a top contender to win the IPL fair play award this year.\""}, {"ball": 5.4, "isHighlight": false, "text": "Southee to Gambhir, $$FOUR$$ ,he makes little room by moving to the leg side and smashes the length delivery over mid-on for another boundary.. Gambhir is finding his way back"}, {"ball": 5.5, "isHighlight": false, "text": "Southee to Gambhir, $$FOUR$$ ,now inside out! this is even better! He moves to the leg side and drives the full delivery over extra cover.. That's a sign of Gambhir's confidence really"}, {"ball": 5.6, "isHighlight": false, "text": "Southee to Gambhir,2 runs,gets a yorker wide outside off and he squeezes it out to deep backward point for a couple"}, {"ball": 5.6, "isHighlight": false, "text": "Ankit: \"Key point is just about to begin now. Once power play is over, it has to be ticking singles doubles regularly. Keep churning 1's - 2's. That's where Nair and Samson were effective. Lets see what KKR have in their bags.\""}, {"ball": 5.6, "isHighlight": false, "text": "Bhatia comes in to the attack"}, {"ball": 6.1, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,length delivery on the stumps, the batsman comes forward and punches it calmly to long on"}, {"ball": 6.2, "isHighlight": false, "text": "Bhatia to Gambhir,1 run,back of length delivery outside off, Gambhir waits for it and then runs it down to short third man for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Bhatia to Uthappa, $$SIX$$ ,slower delivery! This was spotted very very early by Uthappa, who clobbers it over deep midwicket.. This has gone a long long way"}, {"ball": 6.4, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,another slower ball, this time it's not as full as the last ball, Uthappa comes forward and punches it to long on"}, {"ball": 6.5, "isHighlight": false, "text": "Bhatia to Gambhir,1 run,another slower delivery on the stumps, Gambhir, Bhatia's IPL teammate for six IPL seasons not to mention the times spent in Delhi, dabs it to short fine leg for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,he waits in the crease and punches the length delivery to deep midwicket"}, {"ball": 6.6, "isHighlight": false, "text": "Rahul Tewatia, the  $$left-arm$$ $$spinners$$  right-arm legspinner, comes in for the first time"}, {"ball": 7.1, "isHighlight": false, "text": "Tewatia to Uthappa,1 run,tossed up delivery on the stumps, he dabs it to midwicket for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Tewatia to Gambhir,1 run,comes round the wicket and pushes it through outside off, Gambhir punches it off the back foot to deep extra cover"}, {"ball": 7.3, "isHighlight": false, "text": "Tewatia to Uthappa,1 run,tossed up on the pads, the batsman nudges it to backward square leg for a single"}, {"ball": 7.4, "isHighlight": false, "text": "Tewatia to Gambhir,1 run,flatter and wider outside off, Gambhir waits and then punches it to deep cover"}, {"ball": 7.4, "isHighlight": false, "text": "Sriim: \"Isn't he bowling right arm?? Every record says left orm orthodox.. confused..\" --- Yes, confused everyone"}, {"ball": 7.5, "isHighlight": false, "text": "Tewatia to Uthappa,no run,looks to work the wrong 'un away to the leg side, but gets hit on the pads"}, {"ball": 7.6, "isHighlight": false, "text": "Tewatia to Uthappa,1 run,very slow from Tewatia, the batsman goes deep in the crease to punch it to long on for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Aashish Dadhich: \"I m from tewatia's district and for a quick reminder let me tell you that tewatia can bowl from both hands. Right arm leggie and left arm orthodox. This is the main reason he's playing.\""}, {"ball": 7.6, "isHighlight": false, "text": "Tambe is back"}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to Uthappa,1 run,bowls it slow on off stump, Robin picks up a single to midwicket with a soft dab"}, {"ball": 8.2, "isHighlight": false, "text": "Tambe to Gambhir,1 run,loopy delivery, Gambhir is out of the crease and drives it along the ground to long on"}, {"ball": 8.3, "isHighlight": false, "text": "Tambe to Uthappa,1 run,now Robin steps out of the crease and flicks it to deep square leg"}, {"ball": 8.4, "isHighlight": false, "text": "Tambe to Gambhir,2 runs,he is very lucky again! Gambhir throws his bat at this wide delivery and gets a toe-end to it, it just loops over the point fielder"}, {"ball": 8.5, "isHighlight": false, "text": "Tambe to Gambhir,no run,now he is almost beaten by a googly! He looks to drive through extra cover, but gets a thick outside edge that lands short of short third man"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to Gambhir, $$FOUR$$ ,nothing unconvincing about this one! He gets a short ball and he rocks back to thwack it over midwicket for his 300th IPL boundary"}, {"ball": 8.6, "isHighlight": false, "text": "Anuj Kulkarni: \"Uthappa is playing a perfect cameo. KKR have found the reliable opening partner for GG. He indeed has had dismal outings over a past few seasons, but today he is playing sensibly; rotating strike & dispatching poor balls to the fence. Good to see an aspiring Indian living up to his potential.\""}, {"ball": 8.6, "isHighlight": false, "text": "Bhatia comes back"}, {"ball": 9.1, "isHighlight": false, "text": "Bhatia to Uthappa,no run,back of length delivery on off, this is the quicker one, the batsman defends it to cover"}, {"ball": 9.1, "isHighlight": false, "text": "Pravin: \"Can Rahul Tewatia introduce the 'switch Ball' into cricket !!\""}, {"ball": 9.2, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,slower legcutter on the stumps, Robin waits in the crease and punches it to long on for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Bhatia to Gambhir,1 run,the offcutter now, Gambhir clears his front leg and sweeps it powerfully to the leg side, but straight to the man at deep square leg"}, {"ball": 9.4, "isHighlight": false, "text": "Bhatia to Uthappa,1 leg bye,he misses out on this one! It was a high full toss and Robin was looking to guide it down the leg side, but misses.. Bhatia appeal for lbw, but that would have missed leg"}, {"ball": 9.5, "isHighlight": false, "text": "Bhatia to Gambhir,1 run,fires in a yorker outside off, Gambhir manages to dig it out to deep midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,gets a legcutter and chooses to play straight, punches it to long on for a single"}, {"ball": 9.6, "isHighlight": false, "text": "Tewatia comes back"}, {"ball": 10.1, "isHighlight": false, "text": "Tewatia to Uthappa, $$SIX$$ ,he greets the bowler with a neat strike over long off! That's Robin's fifty too.. it was beautifully timed, no real effort there really"}, {"ball": 10.2, "isHighlight": false, "text": "Tewatia to Uthappa,no run,tossed up wide outside off, the batsman drives it straight to extra cover"}, {"ball": 10.3, "isHighlight": false, "text": "Tewatia to Uthappa,1 run,another one tossed up outside off, this time Robin drives it to long off for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Tewatia to Gambhir,1 run,now Gambhir looks to smash Tewatia out of the ground, but gets an outside edge to short third man"}, {"ball": 10.5, "isHighlight": false, "text": "Tewatia to Uthappa,1 run,slower and on the stumps, Robin stays back and punches it to long on"}, {"ball": 10.6, "isHighlight": false, "text": "Tewatia to Gambhir, $$FOUR$$ ,Gambhir wants to impose himself! He steps out again and gets this one off the middle.. There is not much timing, but he manages to hit in the gap at deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Shawn: \"I've heard of ambidextrous basketballers. Mainly because they require the use of both hands quite frequently.. But, An ambidextrous bowler in cricket is new to my ears.. Any other bowler who was ambidexterous known?\" --- Hashan Tillakaratne has done it in the same over.."}, {"ball": 11.1, "isHighlight": false, "text": "Tambe to Uthappa,1 run"}, {"ball": 11.2, "isHighlight": false, "text": "Tambe to Gambhir,1 run,tossed up delivery on the pads, the batsman drives it to wide long on for a single"}, {"ball": 11.3, "isHighlight": false, "text": "Tambe to Uthappa,1 run,steps out of the crease and flicks the fuller delivery to deep square leg"}, {"ball": 11.4, "isHighlight": false, "text": "Tambe to Gambhir,1 run,another outside edge for Gambhir as he looks to slog the googly to the leg side! Again, it lands short of backward point"}, {"ball": 11.5, "isHighlight": false, "text": "Tambe to Uthappa,1 run,he works it away to deep square leg for another single"}, {"ball": 11.6, "isHighlight": false, "text": "Tambe to Gambhir,no run,he fails to beat the man at short fine leg with his crisply timed sweep"}, {"ball": 11.6, "isHighlight": false, "text": "Bhatia continues"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,he charges down the pitch and smashes this down the ground to long on"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Gambhir,1 run,much slower and on the pads, Gambhir waits in the crease, then pulls it to deep square leg to bring up the 100 of the stand"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Uthappa,1 run,fuller on off, creams it to long-off for a single"}, {"ball": 12.3, "isHighlight": false, "text": "Vinay: \"I have recently read that Hanif Mohammed, when bowling to Garry Sobers who was about to break the world record for the highest score in Tests (in the innings he got 365), decided to try bowling both right arm and left arm in the same over to stop him. Didn't work though :)\""}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Gambhir, $$SIX$$ ,he has seen enough of the slower ones from Bhatia! He charges down the pitch and gets it on the middle of the middle of the bat.. That has sailed deep over wide long on, into the stands"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Gambhir,1 leg bye,fails to get bat on a leg-sidish delivery, but picks up a leg bye"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Uthappa, $$SIX$$ ,this is superbly timed! Robin waits in the crease for this really slow ball and even though he only gets a toe end to it, manages to clear the rope straight behind the bowler"}, {"ball": 12.6, "isHighlight": false, "text": "Vikas: \"Its amazing how much difference it makes when an opener is in form. Gambhir, we need you back in the Indian team. If Sehwag also clicks towards the end of this IPL, it will be very difficult for Rohit Sharma to keep his place. We all know how slow his starts are, and then he does not guarantee that he will convert those starts. \""}, {"ball": 12.6, "isHighlight": false, "text": "Faulkner comes back"}, {"ball": 13.1, "isHighlight": false, "text": "Faulkner to Gambhir,no run,length delivery on off, Gambhir punches it straight back at the bowler"}, {"ball": 13.2, "isHighlight": false, "text": "Faulkner to Gambhir, $$FOUR$$ ,on the pads and Gambhir gets to his half-century with a swipe to deep backward square leg boundary.. relief writ over his face"}, {"ball": 13.3, "isHighlight": false, "text": "Faulkner to Gambhir,1 run,gets into a tangle as he tries to whip it to the leg side, gets hit on the body but gets a single to short third man"}, {"ball": 13.4, "isHighlight": false, "text": "Faulkner to Uthappa,2 runs,misfield at short third man by Bhatia allows an extra couple.. It was a simple chopped shot to the fielder, but he takes his eyes off the ball"}, {"ball": 13.5, "isHighlight": false, "text": "Faulkner to Uthappa,no run,fuller on the pads, driven straight to midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Faulkner to Uthappa,no run,looks to play a reverse paddle to an angled delivery, makes no connection"}, {"ball": 14.1, "isHighlight": false, "text": "Watson to Gambhir, $$OUT$$ ,Watson strikes first ball! Gambhir cleared his front leg out and was looking to crash it over extra cover, but gets a thick outside edge to the keeper"}, {"ball": 14.1, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$†Samson$$ $$b$$ $$Watson$$ $$54$$ $$(62m$$ $$34b$$ $$6x4$$ $$1x6)$$ $$SR:$$ $$158.82$$"}, {"ball": 14.1, "isHighlight": false, "text": "Excellent stand from the KKR openers"}, {"ball": 14.1, "isHighlight": false, "text": "Andrew: \"It is incredibly frustrating that Indian fans keep thinking that one or two IPL innings suddenly merits a recall to the Indian team. The true measure of form should be gauged from FC and List A cricket and both Gambhir and Sehwag were woeful this year.\""}, {"ball": 14.1, "isHighlight": false, "text": "$$Andre$$ $$Russell$$ $$to$$ $$face$$ $$Watson..$$ $$This$$ $$is$$ $$interesting$$"}, {"ball": 14.1, "isHighlight": false, "text": "Mani J: \"No super over today please.... We had twice already with these two teams in the past...!\""}, {"ball": 14.2, "isHighlight": false, "text": "Watson to Russell,1 run,no dramas from Watson.. he bowls a good yorker that Russell blocks out on the crease. Robin charges down all the way and was going to struggle has Watson hit the stumps, they get a single"}, {"ball": 14.3, "isHighlight": false, "text": "Watson to Uthappa, $$OUT$$ ,second one in three balls now! Slower delivery, Uthappa flicks it straight to deep square leg.. that didn't even threaten the boundary.. Tame dismissal. Never too far from some late drama"}, {"ball": 14.3, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Bhatia$$ $$b$$ $$Watson$$ $$65$$ $$(66m$$ $$52b$$ $$5x4$$ $$3x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 14.3, "isHighlight": false, "text": "Manish Pandey is in.. But it's Russell on strike"}, {"ball": 14.4, "isHighlight": false, "text": "Watson to Russell,no run,good short ball that flies close to the batsman's gloves! Watson asks the umpire for a caught behind, but that didn't touch anything"}, {"ball": 14.5, "isHighlight": false, "text": "Watson to Russell, $$OUT$$ ,he has knocked the middle stump down! perfect slower delivery! The batsman moved to the leg side and played down the wrong line.. Watson gives him a cold stare of death..no words.. The eyes said it all"}, {"ball": 14.5, "isHighlight": false, "text": "$$AD$$ $$Russell$$ $$b$$ $$Watson$$ $$1$$ $$(5m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 14.5, "isHighlight": false, "text": "Binu: \"KKR bridge is falling down...falling down...falling down...\""}, {"ball": 14.5, "isHighlight": false, "text": "Suresh: \"Faulkner over in last match and now Watson over in this match turning the match upside down!! KKR became complacent and might end up regretting..\""}, {"ball": 14.5, "isHighlight": false, "text": "Shakib now.. he was out first ball in the last match"}, {"ball": 14.6, "isHighlight": false, "text": "Watson to Shakib Al Hasan,no run,length delivery on off, the batsman drives it straight to cover.. no run"}, {"ball": 14.6, "isHighlight": false, "text": "What an over from Watson! KKR are the ones feeling the pinch now"}, {"ball": 14.6, "isHighlight": false, "text": "Tambe now"}, {"ball": 15.1, "isHighlight": false, "text": "Tambe to Pandey,1 wide,  $$OUT$$ ,he is gone! Common sense is up in smoke! Manish walks out of the crease far too early and Tambe fires this down the leg side.. He had no chance"}, {"ball": 15.1, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$st$$ $$†Samson$$ $$b$$ $$Tambe$$ $$0$$ $$(4m$$ $$0b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$-$$"}, {"ball": 15.1, "isHighlight": false, "text": "Time out called! What a disaster this is turning out to be.. Four wickets in seven balls.. and after that superb opening stand.. Not much has gone right for KKR since that surprising win over RCB when Lynn's catch won them the match"}, {"ball": 15.1, "isHighlight": false, "text": "Yusuf Pathan is the new man"}, {"ball": 15.1, "isHighlight": false, "text": "Tambe to Pathan, $$OUT$$ ,this is madness! Yusuf has got a golden duck! This was full and Yusuf drives it back to the bowler.. KKR are imploding in the most incredible fashion"}, {"ball": 15.1, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$c$$ $$&$$ $$b$$ $$Tambe$$ $$0$$ $$(3m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 15.1, "isHighlight": false, "text": "Tambe on hat-trick, Tendo is in next"}, {"ball": 15.1, "isHighlight": false, "text": "Harish: \"OMG what's is happening here, i went to kitchen to bring snacks when 121 - 0, i'm still refreshing the page and checking any commentary mistake was there, can't believe this one. Oh no.. seriously no..\""}, {"ball": 15.2, "isHighlight": false, "text": "Tambe to ten Doeschate, $$OUT$$ ,Tambe, you beaut!!! he is got the hat-trick! Tendo watches the umpire for some time.. He is surprised but the call.. but this is over.. He tossed it up, Tendo was coming forward to play and gets hit on the toe on full.. that is an excellent decision.. What drama!"}, {"ball": 15.2, "isHighlight": false, "text": "$$RN$$ $$ten$$ $$Doeschate$$ $$lbw$$ $$b$$ $$Tambe$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 15.2, "isHighlight": false, "text": "Amogh Chaphalka: \"After the opening partnership of 121 - \"All things digital\" for KKR. 1,0,1,0 :)\""}, {"ball": 15.2, "isHighlight": false, "text": "ravi: \"what an anti climax ? kkr deserves to win and if they lose its one of the cruel turnarounds that can happen only in t20s more and more we see its just a gamble and no more cricket\""}, {"ball": 15.3, "isHighlight": false, "text": "Tambe to SA Yadav,no run,pushed through outside off, Surya chops it on to point"}, {"ball": 15.4, "isHighlight": false, "text": "Tambe to SA Yadav,1 run,flatter on the pads, Surya nudges it to square leg for a single"}, {"ball": 15.4, "isHighlight": false, "text": "Nick Sharland: \"I can only explain this as divine retribution for dropping Kallis!\""}, {"ball": 15.5, "isHighlight": false, "text": "Tambe to Shakib Al Hasan,1 run,it's a googly, but it's short enough for Shakib to go back and punch it to midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Tambe to SA Yadav,1 run,full and flighted outside off, the batsman drives it down to long off for a single"}, {"ball": 15.6, "isHighlight": false, "text": "What did just happen!"}, {"ball": 15.6, "isHighlight": false, "text": "What looked like a jaunt two overs ago has become a cliff.. but these two can bat.. No respite though.. here is Faulkner"}, {"ball": 16.1, "isHighlight": false, "text": "Faulkner to SA Yadav,1 run,length delivery outside off, the batsman punches it in the air almost into the hands of mid-off."}, {"ball": 16.2, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,1 run,length delivery on the stumps, Shakib calmly drives it down to long on"}, {"ball": 16.2, "isHighlight": false, "text": "Hitesh: \"I always get the feeling that teams really miss the player they drop for that game. Wonder how much KKR would give for the calm of Kallis in this old creeky bridge they call a batting line up. \""}, {"ball": 16.3, "isHighlight": false, "text": "Faulkner to SA Yadav,1 run,fuller on the stumps, Surya shuffles across and whips it to deep backward square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Rinku Singh: \"A perfect script for a bollywood movie and it may win an Oscar as well\""}, {"ball": 16.4, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,2 runs,he comes out of the crease and chips the slower delivery in the gap at midwicket.. Calls for a couple and makes it back in time"}, {"ball": 16.4, "isHighlight": false, "text": "Sid: \"Its all my fault, the whole innings I stopped myself going to bathroom and when I felt that KKR are home, I went to release myself and so did KKR..\""}, {"ball": 16.5, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,1 run,fires this on the body, the batsman manages to nudge it down to fine-leg"}, {"ball": 16.6, "isHighlight": false, "text": "Faulkner to SA Yadav,no run,looks to smash it over deep square leg, but this slips under the bat"}, {"ball": 16.6, "isHighlight": false, "text": "Mahesh Balaji: \"Kolkata Nightmarers!!! \""}, {"ball": 16.6, "isHighlight": false, "text": "Tim Southee comes in to bowl the 18th .."}, {"ball": 17.1, "isHighlight": false, "text": "Southee to Shakib Al Hasan,1 run,short of length delivery, Shakib gets a single to long on with a flat-batted swipe"}, {"ball": 17.1, "isHighlight": false, "text": "Round the wicket"}, {"ball": 17.2, "isHighlight": false, "text": "Southee to SA Yadav,1 wide,bowls a slower delivery, but this too far down the leg side"}, {"ball": 17.2, "isHighlight": false, "text": "Southee to SA Yadav,no run,he charges down the pitch and looks to drive it through the off side, but plays inside the line and is beaten"}, {"ball": 17.3, "isHighlight": false, "text": "Southee to SA Yadav,1 leg bye,he looks to sweep this round-the-wicket yorker and gets hit on the pads, but that hit him outside the line of  leg stump"}, {"ball": 17.3, "isHighlight": false, "text": "Gsn: \"Got to admire Watson here..Not sure how many captains would have stopped bowling themselves after taking 3 turning point wkts in an over.. he feels Southee and Faulkner are the better death bowlers and sticks to them..RR and selfish dont go in together!\""}, {"ball": 17.4, "isHighlight": false, "text": "Southee to Shakib Al Hasan, $$SIX$$ ,Up, up and over! Shakib gives this length ball his all, swings and swings bit to hoist it to the sight screen"}, {"ball": 17.4, "isHighlight": false, "text": "Over the wicket"}, {"ball": 17.5, "isHighlight": false, "text": "Southee to Shakib Al Hasan,1 wide,bowls a bouncer this time, but this is down the leg side.. Who is holding that pressure bowl now?"}, {"ball": 17.5, "isHighlight": false, "text": "Southee to Shakib Al Hasan, $$FOUR$$ ,fuller delivery outside off, Shakib is bringing back KKR to life.. Breath by breath.. He smashes it over extra cover for a boundary"}, {"ball": 17.6, "isHighlight": false, "text": "Southee to Shakib Al Hasan,1 run,Watson  $$drops$$  it at mid-off! Shakib hammers the low full toss, Watson moved to his left, dived, got both hands to it, but couldn't hold on.."}, {"ball": 17.6, "isHighlight": false, "text": "Ravi: \"What a equalizer this game is? Shakib and Yadav are getting chances to make mense for their unfinished task with the same opposition last time round. \""}, {"ball": 18.1, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,1 run,he charges down the pitch, gets a slower bounces, but he plays a double-handed fore-hand down to long-on for a single"}, {"ball": 18.2, "isHighlight": false, "text": "Faulkner to SA Yadav,no run,superb yorker at 137 kph! Surya just brings his bat down in time to dig that one out"}, {"ball": 18.3, "isHighlight": false, "text": "Faulkner to SA Yadav,1 run,another yorker, this time Surya manages to squeeze it to wide long on for a single"}, {"ball": 18.3, "isHighlight": false, "text": "Shakib on strike now"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,1 run,gets a short one on the body and pulls it down to deep backward square leg.. Tambe runs around from fine leg and keeps them to one"}, {"ball": 18.5, "isHighlight": false, "text": "Faulkner to SA Yadav,1 run,fuller delivery, that is some firm hit! But this is straight down to long-on, just a single.. KKR running out of time here"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to Shakib Al Hasan,(no ball) 1 run,what a time to overstep! it was a good length ball and Shakib had missed it.. Was just about to finish a good over, but he has given an extra ball.. Huge no-ball. The keeper didn't take it cleanly, giving away a single"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to SA Yadav,1 leg bye,bowls a slower yorker! Surya misses his sweep and only gets a leg bye.. Not a good choice of shot with fine leg placed at the boundary"}, {"ball": 18.6, "isHighlight": false, "text": "Watson to bowl the last over.. 17 to win.. How did it ever come to this. Phew!.. Round the wicket he comes"}, {"ball": 19.1, "isHighlight": false, "text": "Watson to SA Yadav,1 no ball,another no-ball.. ! He oversteps from round the wicket.. this would have been a wide down the leg side too"}, {"ball": 19.1, "isHighlight": false, "text": "16 off six now.. and this is a free ball"}, {"ball": 19.1, "isHighlight": false, "text": "Watson to SA Yadav,1 run,he charges down the pitch and drives it to cover, but can't beat the fielder.. Just a single"}, {"ball": 19.1, "isHighlight": false, "text": "15 off 5.."}, {"ball": 19.2, "isHighlight": false, "text": "Watson to Shakib Al Hasan,1 leg bye,he misses out on this full delivery! This could have been flicked anywhere and he takes it on the pads"}, {"ball": 19.2, "isHighlight": false, "text": "14 off 4"}, {"ball": 19.3, "isHighlight": false, "text": "Watson to SA Yadav,no run,slower bouncer, Surya was down on his knees and lets this one go over him.. Looks to the umpire, but this one is not called wide"}, {"ball": 19.4, "isHighlight": false, "text": "Watson to SA Yadav,1 run,low full toss, he can only hit it to mid-off for a single.. The match is almost gone now"}, {"ball": 19.4, "isHighlight": false, "text": "Two sixes needed.. Shakib? Can you?"}, {"ball": 19.5, "isHighlight": false, "text": "Watson to Shakib Al Hasan,1 run,superb yorker! this is done and dusted now. Shakib digs it out to long on"}, {"ball": 19.6, "isHighlight": false, "text": "Watson to SA Yadav,1 run,they have done it again! Royals, take a bow. Surya gets some bat on this, but can only hit it to deep square leg"}, {"ball": 19.6, "isHighlight": false, "text": "What a horrible dream for KKR! They had a similar outing against Royals a week ago, but this is going to hurt even more. From 121 for 0, they went to 123 for 6.. Don't ask me how.. First there was a triple-strike over from Watson, then a hat-trick (in two legal balls) for Pravin Tambe. Blank expressions on KKR players' face. Time to move over to the next game.. no escape."}, {"ball": 19.6, "isHighlight": false, "text": "\"It was a nice way to close out a game,\" says  $$Watson$$ . \"That's what we talk about in our team set up. PT (Tambe) just keeps going and going, getting big batsmen out all the time. he deserves a pay rise and he is making my life easier for sure. Definitely few things went my way in that over. Hadn't had much of an impact with the ball, so it was good to get those wickets.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Tambe$$  takes the purple cap and the man-of-the-match award. He says, \"The confidence the team gives me, I will never forget. This was my first hat-trick. At this level you have to keep the energy throughout.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir$$  says, \"It's a hard pill to swallow. I have not seen this kind of cricket. We have to move on. We still have 8 games left. We still need to work on bowling as apart from Sunil and Shakib, others need to take the responsibility.\""}, {"ball": 19.6, "isHighlight": false, "text": "Mohandas Menon, on twitter, writes, \"KKR becomes the 1st team in #IPL history to lose a match after a 100+ opening stand while chasing a target!\""}, {"ball": 19.6, "isHighlight": false, "text": "Kuldeep: \"Rajasthan have now stolen two games from Kolkata!! I anticipate 'Wanted For Felony' posters of all RR players on Kolkata streets, with higher rewards for Faulkner, Watson and Tambe (top 'felons' across the two games)!!!\""}, {"ball": 19.6, "isHighlight": false, "text": "Senthil: \"KKR just messed up everything when things are going their way. There is no need to promote A Russel and when they are sailing smooth that was not at all needed. \""}, {"ball": 19.6, "isHighlight": false, "text": "Mayank Sharma: \"The importance of that Watson over can't be overstated. What followed was largely self inflicted but that three wicket over from Watson clinched it, no doubt, especially as he removed the two openers.\""}], "name": "Rajasthan Royals v Kolkata Knight Riders", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733979.html?innings=2;view=commentary", "match_num": 25}