{"commentary": [{"ball": 0, "isHighlight": false, "text": "Around five minutes to go for the first ball."}, {"ball": 0, "isHighlight": false, "text": "Some support for Manhas.."}, {"ball": 0, "isHighlight": false, "text": "Anjan: \"I don't understand the fuss about dropping Manhas and playing Aparajith. Sure, he might have had a good outing in the domestic season but what wrong has manhas done? He hasn't blasted his way with the opportunities that he has got but he hasn't wasted that much either. Sounds silly when you want to drop a player without any proper reason. Be reasonable and give me one reason why you want to drop him.\""}, {"ball": 0, "isHighlight": false, "text": "kamalnivas: \"@sudarsanan: MSD is one of the rigid captains will see who does not beleive in newcomers right away. I remember a CSK match where Ashwin was selected in the team but did not bowl a ball while Raina did!!\""}, {"ball": 0, "isHighlight": false, "text": "More support for Aparajith.."}, {"ball": 0, "isHighlight": false, "text": "Senthil: \"Dhoni when are you going to give chance to Baba Aparajith? Apart from a good batsman and a handy bowler he is also a great fielder. He is really young and he deserves chances ahead of Mithun Manhas who is anyway not getting a chance to showcase his talent and he is also getting old, if you can't afford Badrinath, you have to give it to Aparajith at least. If nobody given a chance to you like this you wouldn't have come to this level as well\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$ : Chennai Super Kings have won the toss and they are  $$bowling$$ $$first$$ ."}, {"ball": 0, "isHighlight": false, "text": "Super Kings are  $$unchanged$$ . Delhi have made one change - Laxmi Ratan Shukla comes in for Rahul Sharma."}, {"ball": 0, "isHighlight": false, "text": "The teams are updated above."}, {"ball": 0, "isHighlight": false, "text": "sudarsanan nara: \"Still wondering why dhoni is not giving a chance to Baba Aparajith. \""}, {"ball": 0, "isHighlight": false, "text": "Arun: \"MS, please remove Manhas as we have nothing to do with him.. Give a chance to other locals who can contribute if top order fails.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$ : 24 required off 12 as I write this, but this is the KKR v Royals game we are waiting to see off. Once that's done and dusted, it's Delhi Daredevils v Chennai Super Kings at the Kotla. Till the toss happens, you may read the  $$preview$$  of this game."}, {"ball": 0, "isHighlight": false, "text": "So Royals snatch the game from behind. We are waiting on the toss from Delhi."}, {"ball": 0, "isHighlight": false, "text": "Lots of questions facing Delhi Daredevils as the aim to reignite their IPL campaign. Answering them could give them victory today. There are lots of questions for the cricket fan in  $$CricIQ$$  - answering them could get you on an all-expenses paid trip to Lord's to watch India play England.  $$Play$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Hilfenhaus to de Kock,4 leg byes,swings on the pads and he flicks it away with ease down to fine leg off the pads, Hilfenhaus bowling the wrong line"}, {"ball": 0.2, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,good length on middle, better line and he flicks it to the on side"}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,swings it in to the left-hander again and he knocks it to midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,good length outside off and he gets across and punches it to the off side"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,stays beside the line and works it to the off side"}, {"ball": 0.6, "isHighlight": false, "text": "Hilfenhaus to de Kock, $$FOUR$$ ,De Kock goes over the infield, this was a length ball on the stumps, he was forward and lofted it high over mid-on"}, {"ball": 0.6, "isHighlight": false, "text": "guhan: \"Manhas has not done any harm or merry. He got his chances and we expect the equal chance to be given out to Aparajith, he has proven his muscle in the domestic seasons and only with a chance in IPL he can move further.\""}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Vijay,no run,gets forward and across and pushes it to the off side"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Vijay,no run,this one moves away, genuine outswing from Pandey and he has Vijay chasing it and he is beaten"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Vijay,no run,Pandey probes just outside the off stump, Vijay is uncertain with his movement and pokes his bat out again"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Vijay,no run,three out of three! Different kind of hat trick this... Pandey teases him outside off again, away movement and beaten"}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Vijay,no run,finally Vijay gets some bat on ball, behind the line and pushed to mid-off"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Vijay,no run,now he brings one back in and traps him on the pads, playing across the line and shuffling, missing leg, that's a fine over, a maiden"}, {"ball": 2.1, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,the maiden over has forced de Kock to go for the big hit, he misses it completely because the ball has moved away"}, {"ball": 2.1, "isHighlight": false, "text": "Joshua W: \"Thats some Test match bowling from Pandley right there!\""}, {"ball": 2.2, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,de Kock makes some room this time but he can only punch it to the off side"}, {"ball": 2.3, "isHighlight": false, "text": "Hilfenhaus to de Kock,1 wide,Hilfy fails to control the movement and he strays down the leg side"}, {"ball": 2.3, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,slower ball and a touch wide outside off, de Kock swings and misses"}, {"ball": 2.4, "isHighlight": false, "text": "Hilfenhaus to de Kock, $$FOUR$$ ,finally de Kock connects well, he fetches this from outside off and swings and smashes it along the ground wide of midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Hilfenhaus to de Kock, $$FOUR$$ ,goes over cover this time, this was a length ball outside off and he has the width to launch this over cover"}, {"ball": 2.6, "isHighlight": false, "text": "Hilfenhaus to de Kock,no run,another big swing and a miss, this one was bending in a bit and he swings and misses"}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Vijay, $$FOUR$$ ,quite stylish! After playing out a maiden Vijay responds by chipping this elegantly over mid-on, not the right length, a bit too full"}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Vijay,1 run,he stays beside the line and pushes it to the off side"}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to de Kock, $$SIX$$ ,that went quickly off the bat, this was a length ball on middle and it was a pick up shot from de Kock, timed it so well and he launched that into the second tier over deep square leg"}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to de Kock,no run,makes room and drills a low full toss down to cover"}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to de Kock,no run,this was a slightly slower ball, he made room and thudded it straight to cover again"}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to de Kock, $$SIX$$ ,where did that come from? De Kock is seeing it like a football, sent this soaring over long-on and it's several rows back, fetched it from outside off, great bat speed"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Vijay,2 runs,  $$OUT$$ ,terrible mixup! Vijay went forward and pushed this behind point and they set off quickly and completed two, Raina dived at the boundary and parried it to Jadeja who flung it to the bowler, however Vijay was keeping his eye on the fielder and didn't want the third, de Kock had charged off for the third and was halfway down and had to scamper back, Mohit took aim and de Kock was out by miles"}, {"ball": 4.1, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$run$$ $$out$$ $$24$$ $$(17m$$ $$16b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Vijay,1 run"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Pietersen, $$OUT$$ ,the off stump's down and KP's gone for a golden duck! The keeper was up to the stumps, Mohit bowled a length ball on the off stump and it skidded through, KP played down the wrong line and his stump was flattened"}, {"ball": 4.3, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$b$$ $$Sharma$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Karthik,no run,he stays back and defends down the track"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Karthik,no run,fuller in length and he pushes this to the off side"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Karthik,no run,keeps it tight again, on the stumps and defended down the track"}, {"ball": 4.6, "isHighlight": false, "text": "Aayush: \"People always point out how no one from Karnataka is in the RCB team. Interesting to see it's the same case with Delhi today.\""}, {"ball": 5.1, "isHighlight": false, "text": "Pandey to Vijay,1 run,punches this towards cover point and there's a fumble"}, {"ball": 5.2, "isHighlight": false, "text": "Pandey to Karthik,no run,fetches that from outside off and pulls but straight to midwicket"}, {"ball": 5.3, "isHighlight": false, "text": "Pandey to Karthik, $$FOUR$$ ,solidly punched! He gave him a bit of width, Karthik maintained his balance well and timed it well and placed it even better wide of extra cover, bisected the gap"}, {"ball": 5.4, "isHighlight": false, "text": "Pandey to Karthik,3 runs,on the pads and he whips it away behind square and they take three"}, {"ball": 5.5, "isHighlight": false, "text": "Pandey to Vijay,no run,drifts on the pads and he mistimes the flick"}, {"ball": 5.6, "isHighlight": false, "text": "Pandey to Vijay,1 run,gets away with a leading edge, looking to play this to the on side, the ball lobs up behind the bowler and du Plessis dives in vain running forward from mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "DM: \"Reality check guys, it's not the Barclays Premier league where you need a few homegrown players, this is the IPL and the only thing you need is 7 INDIAN players. That's a restriction enough - how many Chennai players are in their first XI apart from Ashwin? what about Punjab? They're doing well and noone seems to complain about that just because of that..\""}, {"ball": 6.1, "isHighlight": false, "text": "Jadeja to Vijay,1 run,full on middle and leg and worked to mid-on"}, {"ball": 6.2, "isHighlight": false, "text": "Jadeja to Karthik,no run,tossed up and he pushes it to the off side"}, {"ball": 6.3, "isHighlight": false, "text": "Jadeja to Karthik,no run,goes for the drive and gets an inside edge to Dhoni's boot"}, {"ball": 6.4, "isHighlight": false, "text": "Jadeja to Karthik,no run,comes forward and drives towards cover"}, {"ball": 6.5, "isHighlight": false, "text": "Jadeja to Karthik,no run,plays the reverse sweep and cannot beat short third man"}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja to Karthik,2 runs,bit of confusion, he pushes this towards point and Vijay wasn't quick on the first run, he was watching the fielder, then the overthrow"}, {"ball": 7.1, "isHighlight": false, "text": "Ashwin to Vijay,1 run"}, {"ball": 7.2, "isHighlight": false, "text": "Ashwin to Karthik,no run"}, {"ball": 7.3, "isHighlight": false, "text": "Ashwin to Karthik,1 run,punches it down to long-on"}, {"ball": 7.4, "isHighlight": false, "text": "Ashwin to Vijay,1 run,works it to midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Ashwin to Karthik,no run,comes forward and pushes it to the off side"}, {"ball": 7.6, "isHighlight": false, "text": "Ashwin to Karthik,1 run,gets forward and drives to long-on"}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Karthik, $$SIX$$ ,that was flat! Karthik was on his knee for the slog and he hit it flat and Hilfenhaus was brave to try and catch that at deep midwicket"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Karthik, $$FOUR$$ ,6 + 4! This was a low full toss on the pads and swept firmly to fine leg, beat the sweeper"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Karthik,1 run,gets forward and pushes it to long-on"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Vijay,1 run,comes forward and drives to long-on"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Karthik,no run"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Karthik,1 run,flatter delivery and he sweeps him down to square leg"}, {"ball": 8.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 8.6, "isHighlight": false, "text": "mayank: \"Its baffling to see DK coming ahead of Duminy.You can't send your in-form player for facing few deliveries for slogging and then complain about losing\""}, {"ball": 8.6, "isHighlight": false, "text": "Padmanabhan: \"@DM - Right, but Chennai developed a lot of players. Murali Vijay, Ashwin have come through only because of Chennai Super Kings. Badri played all matches for CSK, its a pity that we could get him back. That's not the case with RCB or other franchises though as they expected quick returns.\""}, {"ball": 9.1, "isHighlight": false, "text": "Smith to Karthik,1 run,low full toss outside the off stump and he plays the reverse sweep down to third man"}, {"ball": 9.2, "isHighlight": false, "text": "Smith to Vijay,2 runs,good running, he pushes it down to long-on and takes the first run quickly"}, {"ball": 9.3, "isHighlight": false, "text": "Smith to Vijay, $$FOUR$$ ,bashed that through the gap, this was a half volley outside off and he gets forward and smashes it wide of cover"}, {"ball": 9.4, "isHighlight": false, "text": "Smith to Vijay,1 run,flicked off the pads down to deep midwicket"}, {"ball": 9.5, "isHighlight": false, "text": "Smith to Karthik,1 run,digs out a yorker down to third man"}, {"ball": 9.6, "isHighlight": false, "text": "Smith to Vijay,no run,defends and the ball lands on the pitch and they try a cheeky single but decide against it"}, {"ball": 10.1, "isHighlight": false, "text": "Sharma to Karthik, $$FOUR$$ ,shot of intent, this was a length ball on the off stump and Karthik was forward early and smashed this over mid-off"}, {"ball": 10.2, "isHighlight": false, "text": "Sharma to Karthik,1 run,quick single, he pushes this towards point and Karthik sets off quickly, Vijay has to hurry, there's an under-arm flick to the striker's end but it's wide"}, {"ball": 10.3, "isHighlight": false, "text": "Sharma to Vijay,1 run,slower ball and he pushes it down to third man"}, {"ball": 10.4, "isHighlight": false, "text": "Sharma to Karthik,no run,tries to pull a length ball but mistimes it to square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Sharma to Karthik, $$SIX$$ ,heads up! This was a friendly full toss and Karthik wasn't going to miss out, bashed that several rows over deep midwicket"}, {"ball": 10.5, "isHighlight": false, "text": "Sam: \"DD have done surprisingly good today. Not many would have expected a 7.5 RPO from them for the first half of their innings against CSK. And Duminy still to come, they might just post a competitive total.\""}, {"ball": 10.6, "isHighlight": false, "text": "Sharma to Karthik,1 run,defends and the ball rolls towards the keeper and Vijay responds well to the single"}, {"ball": 11.1, "isHighlight": false, "text": "Ashwin to Karthik,1 run,comes down the track and checks the shot down to long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Vijay,2 wides,slides this wide down the leg side"}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Karthik,no run,clips it to the on side"}, {"ball": 11.3, "isHighlight": false, "text": "Ashwin to Karthik,1 run,drifts on the pads and worked to the leg side"}, {"ball": 11.4, "isHighlight": false, "text": "Ashwin to Vijay,2 runs,works it with the turn to fine leg"}, {"ball": 11.5, "isHighlight": false, "text": "Ashwin to Vijay,1 run,tossed up and he comes down the track and chips it down to deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin to Karthik,1 run,that's a low full toss and he sweeps him down to deep square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Michael Arnette: \"All Tamil Nadu show now with Ashwin bowling to Vijay and Karthik\""}, {"ball": 12.1, "isHighlight": false, "text": "Hilfenhaus to Karthik, $$SIX$$ ,innovative! Karthik improvises by shuffling across the stumps very early, exposed all three, Hilfenhaus was kind enough to bowl a full toss and Karthik scooped that over fine leg, like AB"}, {"ball": 12.2, "isHighlight": false, "text": "Hilfenhaus to Karthik,no run,he tries the same shot and moves right across the stumps but this was sprayed wide outside off, didn't make contact"}, {"ball": 12.3, "isHighlight": false, "text": "Hilfenhaus to Karthik,1 run,full on the stumps and worked to midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Hilfenhaus to Vijay,1 run,not in control of that loft, it was a full ball and chipped down the ground and drops short of long-on"}, {"ball": 12.5, "isHighlight": false, "text": "Hilfenhaus to Karthik, $$FOUR$$ ,finds the big gap on the off side, this was full and wide and he didn't hit it too hard, just timing and he picks the gap at deep cover"}, {"ball": 12.6, "isHighlight": false, "text": "Hilfenhaus to Karthik, $$OUT$$ ,Mohit's claimed the catch inches off the ground at square leg and Karthik's waiting for the umpires to have a look. Hilfenhaus came round the wicket, Karthik looked to whip it across the line and it went flat to Mohit, he dived forward and to his left and the third umpire Shamsuddin takes his time on this one and Karthik has to go"}, {"ball": 12.6, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Sharma$$ $$b$$ $$Hilfenhaus$$ $$51$$ $$(35m$$ $$36b$$ $$4x4$$ $$3x6)$$ $$SR:$$ $$141.66$$"}, {"ball": 12.6, "isHighlight": false, "text": "A wicket against the run of play. Shukla walks in"}, {"ball": 13.1, "isHighlight": false, "text": "Ashwin to Vijay,2 runs,skids through and he knocks it to the on side"}, {"ball": 13.2, "isHighlight": false, "text": "Ashwin to Vijay,1 leg bye,fired it on the pads and he clips it to short fine leg"}, {"ball": 13.3, "isHighlight": false, "text": "Ashwin to Shukla,1 leg bye,comes round the wicket and he looks to sweep but the ball clips the body and rolls away"}, {"ball": 13.4, "isHighlight": false, "text": "Ashwin to Vijay, $$SIX$$ ,the switch hit! Vijay shows he can play it too, changed his grip quickly and sent that rows over deep cover"}, {"ball": 13.5, "isHighlight": false, "text": "Ashwin to Vijay,1 run,pushes it down to backward point for a single"}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin to Shukla, $$OUT$$ ,soft dismissal! Tossed up and he was down the track and ended up getting a leading edge that lobbed to Pandey at long-off"}, {"ball": 13.6, "isHighlight": false, "text": "$$LR$$ $$Shukla$$ $$c$$ $$Pandey$$ $$b$$ $$Ashwin$$ $$0$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 13.6, "isHighlight": false, "text": "It's the Time Out."}, {"ball": 13.6, "isHighlight": false, "text": "Qursheed: \"So KP does not want to send an inform JP with just 6 overs remaining... I cant understand this logic..\""}, {"ball": 13.6, "isHighlight": false, "text": "Your wish might be granted..."}, {"ball": 13.6, "isHighlight": false, "text": "Aayush: \"It's clear, DD wants to hold back Duminy for the pace at the end of the innings and not expose him to Chennai's spin duo. Not sure if that plan worked though..\""}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Duminy,1 run,drifts on the pads and he works it to short fine leg"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to Vijay, $$OUT$$ ,Vijay can't clear long-off! This was a length ball outside off and Vijay was at the crease and on his knee looking to slap that over long-off, went off the bottom half of the bat and du Plessis runs to his right and takes it"}, {"ball": 14.2, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Jadeja$$ $$35$$ $$(64m$$ $$30b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to Duminy,no run,stays back and works it to the on side"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Duminy,no run,worked away towards short fine leg and Duminy had to head back, there's a direct hit by Smith but he is safe"}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Duminy,1 run,takes a single to deep square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Jadhav,1 run,works it against the turn to square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Aayush: \"That's the third time Vijay has got out to a similar shot in this IPL. Time for him to try and hit it square or through midwicket instead of down the ground when trying to hit out?\""}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Jadhav,1 wide,slides it wide down the leg side"}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Jadhav,1 run,works it it to deep midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Ashwin to Duminy,1 run,he goes back at the crease and punches it down the ground to long-on"}, {"ball": 15.3, "isHighlight": false, "text": "Ashwin to Jadhav,1 run,fetches that from outside off and sweeps to deep square leg"}, {"ball": 15.4, "isHighlight": false, "text": "Ashwin to Duminy,1 run,stays back, waits for the turn and flicks it to square leg"}, {"ball": 15.5, "isHighlight": false, "text": "Ashwin to Jadhav,1 wide,fires that wide down the leg side again"}, {"ball": 15.5, "isHighlight": false, "text": "Ashwin to Jadhav,1 run,quicker and flatter and he works it to square leg"}, {"ball": 15.6, "isHighlight": false, "text": "Ashwin to Duminy,1 run,softly guides it down to short third man and sets off"}, {"ball": 16.1, "isHighlight": false, "text": "Jadeja to Duminy,1 run,flatter one and he works it down to square leg"}, {"ball": 16.2, "isHighlight": false, "text": "Jadeja to Jadhav,1 run,he comes down the track and forces it down to long-on"}, {"ball": 16.3, "isHighlight": false, "text": "Jadeja to Duminy,1 run,on the pads and whipped away to square leg"}, {"ball": 16.4, "isHighlight": false, "text": "Jadeja to Jadhav,no run,flatter and on the stumps and he makes room and drives square but can't beat point"}, {"ball": 16.5, "isHighlight": false, "text": "Jadeja to Jadhav,1 run,down the track and he works it to long-on"}, {"ball": 16.6, "isHighlight": false, "text": "Jadeja to Duminy,no run,flatter one and he pushes it down to point"}, {"ball": 16.6, "isHighlight": false, "text": "Avi: \"Ashwin's bowling is so negative that it is painful to watch. Has he bowled a single ball outside the off stump to any of the right handed batsman?\""}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Jadhav,no run,Dhoni goes back for Mohit this time, Jadhav uses his feet and comes down the pitch but ends up chopping it down the track"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Jadhav,1 run,that's a good slower ball and he didn't pick it right, ended up chopping it towards Dhoni  but they take the single"}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to Duminy, $$FOUR$$ ,that was comical just for Manhas scampering to stop that! Duminyu moved across the stumps and paddled that just over Manhas at square leg, he ran back and failed to catch, gathered himself quickly and scampered on all fours twice to try and stop it, good attempt but entertaining nevertheless"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Duminy, $$FOUR$$ ,Duminy goes for the slog but ends up getting an outside edge down to third man, nobody there to stop it"}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to Duminy, $$FOUR$$ ,in control of this one! Length ball on middle and leg and he whips it wide of midwicket, places it well and beats the sweeper"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Duminy, $$FOUR$$ ,four out of four! Over cover this time, length ball outside the off stump and he chipped it over cover and du Plessis makes a good attempt at the slide but he can only deflect it to the rope"}, {"ball": 18.1, "isHighlight": false, "text": "Hilfenhaus to Jadhav,no run"}, {"ball": 18.2, "isHighlight": false, "text": "Hilfenhaus to Jadhav,no run,Jadhav fails to make contact again, outside off and a swing and a miss, Duminy has a word with him"}, {"ball": 18.3, "isHighlight": false, "text": "Hilfenhaus to Jadhav,no run,Jadhav moves across the stumps and it's a fuller ball which he fails to dig out, three dot balls!"}, {"ball": 18.4, "isHighlight": false, "text": "Hilfenhaus to Jadhav, $$FOUR$$ ,lucky this time, swings at a fuller ball on the stumps and gets an inside edge that trickles past short fine leg"}, {"ball": 18.5, "isHighlight": false, "text": "Hilfenhaus to Jadhav,1 run,digs out a fuller ball and it's an outside edge to third man"}, {"ball": 18.5, "isHighlight": false, "text": "Fine leg is up"}, {"ball": 18.6, "isHighlight": false, "text": "Hilfenhaus to Duminy, $$FOUR$$ ,after three dot balls the over ends with nine, Hilfy errs by straying on the pads with the fine leg up, Duminy helps himself with a swing and sends it to deep square leg"}, {"ball": 18.6, "isHighlight": false, "text": "jose: \"Duminy, the diminutive giant! At least in this IP, L roles of KP the giant, and Duminy seem to be reversed.\""}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Jadhav,1 run,that was the leg cutter, Jadhav was down the track and he skied that over backward point, McCullum ran forward from the deep and dived and couldn't catch it, just dropped short"}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to Duminy,no run,Duminy looks to play the reverse paddle down to third man, quick fuller delivery outside off, didn't get bat on it"}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Duminy,1 run,just the single and Duminy's off strike, fuller ball and drilled to long-off"}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Jadhav, $$SIX$$ ,that should make DD feel much better! He was back on strike, he danced down the track and launched that flat over long-off"}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to Jadhav, $$SIX$$ ,Jadhav makes up for those dots in the previous over! Mohit bowls length, Jadhav comes down the track and gets to the pitch of it and launches it over wide long-off"}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Jadhav, $$FOUR$$ ,18 off the last over! Jadhav continues to use his feet and Mohit bowls this a touch wider, he has to chase this one and gets an outside edge but bisects the gap neatly between point and short third man and he has outscored Duminy too"}, {"ball": 19.6, "isHighlight": false, "text": "Royals chased down 153 with ease at this ground the other night but this will be tough nevertheless. Daredevils did well to get past the psychological 170 mark. Late  hitting by Duminy and Jadhav got them there. Now it's up to their bowlers to show up."}, {"ball": 19.6, "isHighlight": false, "text": "CSK's death bowling wasn't the best today. One positive for CSK was that they got in their 20 overs on the dot at 9.30.  Join us shortly"}], "name": "Delhi Daredevils v Chennai Super Kings", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733981.html?innings=1;view=commentary", "match_num": 26}