{"commentary": [{"ball": 0, "isHighlight": false, "text": "There was some drizzle during Daredevils' innings and it's persisted during the break. Nothing alarming though, remember the umpires made the call to play on and I suppose they might do the same now. Yep, here's Mohammed Shami with a slip. Dwayne Smith on strike"}, {"ball": 0.1, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,and he's in business straight away! Just back of a length and it darts away off the flashing blade of Smith. Good zip off the deck"}, {"ball": 0.2, "isHighlight": false, "text": "Mohammed Shami to Smith, $$FOUR$$ ,this time he goes full and though the ball swings away, Smith leans into a square drive. He had to reach out a little and that made the top hand come off the bat. But it didn't hamper the power on the stroke"}, {"ball": 0.3, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,cut him in half and the Daredevils have gone up in appeal. This time the ball ducks in after pitching and Smith is caught in his crease. Goes for an across-the-line flick and is glances the back pad. Ump says it was too high"}, {"ball": 0.4, "isHighlight": false, "text": "Mohammed Shami to Smith,1 run,angled into him on a good length and Smith works it away through square leg"}, {"ball": 0.4, "isHighlight": false, "text": "Baz has a slip and four men in the circle on the off side."}, {"ball": 0.5, "isHighlight": false, "text": "Mohammed Shami to McCullum,no run,good length ball on off stump, pushed into the covers off a bit of an open face"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami to McCullum,2 runs,little more bounce on this occasion as he goes back of a length. McCullum is cramped for room and guides it one-handed to deep third man"}, {"ball": 0.6, "isHighlight": false, "text": "Wayne Parnell from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Parnell to Smith,no run,more swing! This was full and curls back in late. Smith loses his balance as he looks for a flick and wears one on the pads. Promising start for Parnell"}, {"ball": 1.2, "isHighlight": false, "text": "Parnell to Smith,3 leg byes,back of a length and on the hips, Smith glances it away off his thighs and fine leg has a bit of work to do. Shami pulls out the boot on the last minute and saves a run"}, {"ball": 1.3, "isHighlight": false, "text": "Parnell to McCullum,no run,this was full and pushing across him, McCullum's hands move towards the ball while his feet stay rooted. Finds the man at cover"}, {"ball": 1.4, "isHighlight": false, "text": "Parnell to McCullum,no run,back of a length on middle to push the batsman back. McCullum blocks into the off side"}, {"ball": 1.5, "isHighlight": false, "text": "Parnell to McCullum, $$FOUR$$ ,on the pads and McCullum's flicked it to the square leg boundary. Poor end to the over, he took the pace off the ball but ended up bowling a half-volley."}, {"ball": 1.6, "isHighlight": false, "text": "Parnell to McCullum,1 run,appreciable inswing again, but it's starting a little too straight. McCullum struggles to maintain his balance while he tries to flick to midwicket"}, {"ball": 2.1, "isHighlight": false, "text": "Mohammed Shami to McCullum, $$FOUR$$ ,bowl short to McCullum at your own peril, Shami make the mistake this time and he pounds this over midwicket"}, {"ball": 2.2, "isHighlight": false, "text": "Mohammed Shami to McCullum,no run,nearly lost his stumps there, he went down the track this time, swung and missed it and it just cleared the stumps"}, {"ball": 2.3, "isHighlight": false, "text": "Mohammed Shami to McCullum,no run,length ball on the off stump and he pushes this down to point"}, {"ball": 2.3, "isHighlight": false, "text": "Aayush: \"Wonder why teams don't open with spin against this Chennai opening pair. They seem to love pace bowling, maybe spin can keep them quiet in the powerplay? Dhoni would have done it, too bad he's on the same team.\""}, {"ball": 2.4, "isHighlight": false, "text": "Mohammed Shami to McCullum,no run,this was full on the pads and he looked to flick this away and the ball rolled off his pads"}, {"ball": 2.5, "isHighlight": false, "text": "Mohammed Shami to McCullum,no run,bad ball and equally bad shot, this was short and wide and looking to be slapped, McCullum made too much room and chopped it to cover"}, {"ball": 2.6, "isHighlight": false, "text": "Mohammed Shami to McCullum, $$FOUR$$ ,another short one is punished, sat up nicely for McCullum who swiveled at the crease and hooked it over short fine leg"}, {"ball": 3.1, "isHighlight": false, "text": "Unadkat to Smith,no run,strange shot by Smith, he was too early on the pull and the ball deflected off his pads"}, {"ball": 3.2, "isHighlight": false, "text": "Unadkat to Smith,no run,another swing, and a miss this time because he didn't read the slower ball"}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Smith, $$SIX$$ ,gets it right on the third attempt, this was dragged short and Smith swiveled and pulled it flat over fine leg"}, {"ball": 3.4, "isHighlight": false, "text": "Unadkat to Smith, $$SIX$$ ,flat, quick and deadly! Smith's on fire, this was the slower ball and bowled short, he swiveled and clubbed it over deep square leg, great bat speed"}, {"ball": 3.5, "isHighlight": false, "text": "Unadkat to Smith, $$SIX$$ ,down the ground this time, Unadkat comes round the wicket and bowls it full, in the slot for Smith to loft through the line"}, {"ball": 3.6, "isHighlight": false, "text": "Unadkat to Smith,no run,fullish outside off and pushed to the off side, Delhi can breathe better now"}, {"ball": 4.1, "isHighlight": false, "text": "Nadeem to McCullum, $$FOUR$$ ,this is not good bowling, Nadeem dragged this one short, McCullum was waiting for it and he pulled over midwicket"}, {"ball": 4.2, "isHighlight": false, "text": "Nadeem to McCullum,no run,much better, went through with the arm and skidded, just about kept it out"}, {"ball": 4.3, "isHighlight": false, "text": "Nadeem to McCullum,1 run,flatter and tucked away to the on side"}, {"ball": 4.4, "isHighlight": false, "text": "Nadeem to Smith,no run,this one drifted in and he managed to get behind the line"}, {"ball": 4.5, "isHighlight": false, "text": "Nadeem to Smith,no run,really holds back on the pace there, Smith had to change his shot and defend"}, {"ball": 4.6, "isHighlight": false, "text": "Nadeem to Smith,1 run,flatter and he punches this one down the ground, Delhi need to get both out or else it could be one-way traffic"}, {"ball": 4.6, "isHighlight": false, "text": "Yogesh: \"Seeing the way smith is playing, you cant help but feel sorry for the West Indies team, they are not utilizing the talent they have.\""}, {"ball": 5.1, "isHighlight": false, "text": "Parnell to Smith,1 leg bye,Parnell drifts on the pads and he tucks it to the leg side"}, {"ball": 5.2, "isHighlight": false, "text": "Parnell to McCullum,no run,keeps it nice and straight and cramps him up for room, he pushes it to the off side"}, {"ball": 5.3, "isHighlight": false, "text": "Parnell to McCullum,no run,a bit too straight and he goes for the pull and the ball deflects off the body to the off side"}, {"ball": 5.4, "isHighlight": false, "text": "Parnell to McCullum,1 run,this was a short of a length ball and he couldn't resist the pull, didn't fully control it and the ball dropped short of deep square leg"}, {"ball": 5.5, "isHighlight": false, "text": "Parnell to Smith,no run,keeps it nice and straight and he stays back and defends"}, {"ball": 5.6, "isHighlight": false, "text": "Parnell to Smith,no run,lands outside leg and he works it to the on side"}, {"ball": 5.6, "isHighlight": false, "text": "Shahid Majeed: \"@ Yogesh u may be kidding, he has played about 100 international matches for WI without any success, International cricket is not IPL.\""}, {"ball": 6.1, "isHighlight": false, "text": "Nadeem to McCullum,no run,flatter one and he gets forward and defends"}, {"ball": 6.2, "isHighlight": false, "text": "Nadeem to McCullum,no run,went through with the arm, made room and punched it to point"}, {"ball": 6.3, "isHighlight": false, "text": "Nadeem to McCullum,no run,spins away and he punches it towards KP at point, three dot balls"}, {"ball": 6.4, "isHighlight": false, "text": "Nadeem to McCullum,1 run,this was quicker and on the yorker length and he drills it to long-off, that's the 4th fifty stand between these two"}, {"ball": 6.5, "isHighlight": false, "text": "Nadeem to Smith,1 run,flatter one and worked down to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "Nadeem to McCullum,1 run,keeps it tight again, flicked to deep square leg, just three off the over"}, {"ball": 6.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 6.6, "isHighlight": false, "text": "MrGarreth: \"Must say I'm completely underwhelmed by Pietersen's captaincy. He has hardly bowled Duminy in his tenure as DD captain and his field placements and general use of bowlers leaves a lot to be desired.\""}, {"ball": 6.6, "isHighlight": false, "text": "John: \"@Yogesh you should have watched Dwayne Smith play swing bowlers like Bhuvi(forget abt Steyn) he looks completely out of place........I think he's more of an indian domestic bowlers bully,targets a couple of weak indian bowlers n takes them apart which is not possible in intl cricket\""}, {"ball": 6.6, "isHighlight": false, "text": "Here's Shukla"}, {"ball": 7.1, "isHighlight": false, "text": "Shukla to McCullum,no run, $$Dropped$$  by Jadhav at backward point! Would have been brilliant had he held on, this was slapped hard by McCullum, Jadhav threw himself to his right, held out his right hand but it popped out"}, {"ball": 7.2, "isHighlight": false, "text": "Shukla to McCullum,no run,beaten all ends up, late away movement squaring him up"}, {"ball": 7.3, "isHighlight": false, "text": "Shukla to McCullum,no run,he makes room and punches it down to mid-off"}, {"ball": 7.4, "isHighlight": false, "text": "Shukla to McCullum,1 run,he comes down the track and gets an outside edge that rolls to third man"}, {"ball": 7.5, "isHighlight": false, "text": "Shukla to Smith,4 byes,that beat everyone including Karthik, Shukla really got it to cut back in and it cut the batsman in half, cleared the stumps and Karthik somehow lost it as well and he couldn't get his glove behind it, a fine delivery but four byes, Shukla didn't deserve that"}, {"ball": 7.6, "isHighlight": false, "text": "Shukla to Smith,1 run,he chips this down to long-off, good over"}, {"ball": 8.1, "isHighlight": false, "text": "Nadeem to Smith, $$SIX$$ ,quite effortless, tossed up on middle, the arm ball and he chips this with ease over wide long-on, timed it well"}, {"ball": 8.2, "isHighlight": false, "text": "Nadeem to Smith,no run,punched it down the track and he runs to his right and stops it"}, {"ball": 8.3, "isHighlight": false, "text": "Nadeem to Smith,no run,stays back and punches against the turn to the off side"}, {"ball": 8.4, "isHighlight": false, "text": "Nadeem to Smith,1 run,skids through and he clips it to midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Nadeem to McCullum,1 run,sweeps too early and the ball clips his body and rolls away, half hearted appeal by Nadeem"}, {"ball": 8.6, "isHighlight": false, "text": "Nadeem to Smith,1 run,works it behind square on the on side"}, {"ball": 9.1, "isHighlight": false, "text": "Shukla to Smith,1 run,fires in the yorker and he digs it out to the on side"}, {"ball": 9.2, "isHighlight": false, "text": "Shukla to McCullum,no run,Baz tries the AB scoop, moved right across his stumps and looked to ramp that over the keeper but missed"}, {"ball": 9.2, "isHighlight": false, "text": "Fahad: \"This pair has a weakness, if the teams can spot it. They are reluctant to rotate strike. Smarter fielding units can strangulate them.\""}, {"ball": 9.3, "isHighlight": false, "text": "Shukla to McCullum,1 run,he fires it full on seeing him advance and he drills it to long-off"}, {"ball": 9.4, "isHighlight": false, "text": "Shukla to Smith,no run,that's a very good inswinging yorker, really had to dig that out and he nearly lost his balance"}, {"ball": 9.5, "isHighlight": false, "text": "Shukla to Smith,no run,strange old shot, he was looking to pull and then realised it wasn't short enough, had to check the pull and the ball rolled back to the bowler"}, {"ball": 9.6, "isHighlight": false, "text": "Shukla to Smith,no run,testing his patience by bowling a slower ball, blind swing and a miss"}, {"ball": 10.1, "isHighlight": false, "text": "Nadeem to McCullum,no run,flatter one and he makes room and mistimes it to the off side"}, {"ball": 10.2, "isHighlight": false, "text": "Nadeem to McCullum,1 run,he makes room and slaps this down to long-on"}, {"ball": 10.3, "isHighlight": false, "text": "Nadeem to Smith, $$SIX$$ ,A pressure relieving six! This was a half tracker, he waited for it and slapped it flat and a few rows over deep midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Nadeem to Smith,no run,cleverly tossed up and held back on the pace, big swing and a miss outside off"}, {"ball": 10.5, "isHighlight": false, "text": "Nadeem to Smith,1 run,pushed towards long-on"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to McCullum,1 run,makes room and pushes it down to cover and they hurry the single"}, {"ball": 10.6, "isHighlight": false, "text": "Raghu Ifmr: \"For the first time, this pair is looking a bit tense and seems like the pressure is getting to them.. Getting a feeling one or both of them are gonna get out or explode within one over max..\""}, {"ball": 11.1, "isHighlight": false, "text": "Shukla to McCullum, $$FOUR$$ ,rare full toss from Shukla, this slipped out and McCullum waited for it and smacked it down to long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Shukla to McCullum, $$OUT$$ ,finally a wicket for Delhi, this was a length ball on middle and McCullum made a bit of room to pound this over long-on, didn't time it very well and it went flat to Vijay"}, {"ball": 11.2, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Vijay$$ $$b$$ $$Shukla$$ $$32$$ $$(48m$$ $$35b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$91.42$$"}, {"ball": 11.3, "isHighlight": false, "text": "Shukla to Raina,no run,nearly punched this back on the full back to Shukla, he checked his shot and Shukla fields it in his follow through"}, {"ball": 11.4, "isHighlight": false, "text": "Shukla to Raina, $$FOUR$$ ,heads up! This rocketed off the middle of the bat, length ball and Raina bashed this flat and quick down the ground and the umpire did well to get out of the way"}, {"ball": 11.5, "isHighlight": false, "text": "Shukla to Raina,1 wide,saw him advance and fired that wide outside off, the umpire reckoned that had to be penalised"}, {"ball": 11.5, "isHighlight": false, "text": "Shukla to Raina, $$FOUR$$ ,tried the short ball on Raina but it didn't work, not quick enough to intimidate Raina and he pulled it down to deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Shukla to Raina,1 run,full outside off and he drilled it down to long-off"}, {"ball": 11.6, "isHighlight": false, "text": "Karthik: \"Taking out the 4s and 6s, Smith has scored 8 off 27 balls and B.Mac 12 off 30. Very poor.\""}, {"ball": 12.1, "isHighlight": false, "text": "Mohammed Shami to Raina,1 run,full outside off and he pushes it to the off side"}, {"ball": 12.1, "isHighlight": false, "text": "Karan: \"I think India should seriously considering changing their team colors to yellow for Raina's sake. \""}, {"ball": 12.2, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,that's a really good yorker, aiming on middle and he did well to dig it out"}, {"ball": 12.3, "isHighlight": false, "text": "Mohammed Shami to Smith,1 leg bye,that was a short ball and slower, Smith was too early on the pull and it deflected off the body"}, {"ball": 12.3, "isHighlight": false, "text": "It's starting to rain in Delhi"}, {"ball": 12.4, "isHighlight": false, "text": "Mohammed Shami to Raina,1 wide"}, {"ball": 12.4, "isHighlight": false, "text": "Steady drizzle"}, {"ball": 12.4, "isHighlight": false, "text": "Mohammed Shami to Raina,1 run,this was short and he made room and pulled it flat and down to deep midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Mohammed Shami to Smith, $$SIX$$ ,flat six! This was a length ball and he gets forward and whips it flat over deep midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "Mohammed Shami to Smith,1 run,follows it up with a slower ball and he pushes it to the off side"}, {"ball": 12.6, "isHighlight": false, "text": "Rohan: \"@Karthik, what's the point in taking out the 4s and 6s? Are you saying a batsman should score only through running in between the wickets? That's absurd if you ask me, it's like saying lbws shouldn't count for wickets towards the bowler. \""}, {"ball": 12.6, "isHighlight": false, "text": "They are playing on. CSK were behind by six runs at the end of the 13th over as per the D/L calculation"}, {"ball": 13.1, "isHighlight": false, "text": "Shukla to Smith, $$FOUR$$ ,these boundaries might count if it buckets down! Shukla erred by bowling on the pads, Smith swiveled and pulled this one wide of short fine leg and that's his fifty!"}, {"ball": 13.2, "isHighlight": false, "text": "Shukla to Smith, $$SIX$$ ,that one rocketed off the bat! This was a length ball on the off stump and he pulled that flat and it reached deep midwicket in no time, CSK ahead by one run"}, {"ball": 13.3, "isHighlight": false, "text": "Shukla to Smith,1 run,slower ball on the stumps and he knocks it to the off side, CSK still ahead by a run"}, {"ball": 13.4, "isHighlight": false, "text": "Shukla to Raina,no run,this one angles across him and he chases and misses"}, {"ball": 13.5, "isHighlight": false, "text": "Shukla to Raina,2 runs,full on the pads and he whips it with ease wide of midwicket, the sweeper picks up"}, {"ball": 13.6, "isHighlight": false, "text": "Shukla to Raina,no run,good length outside the off stump and he punches it to point"}, {"ball": 14.1, "isHighlight": false, "text": "Unadkat to Smith,1 run,this was a low full toss outside off and he chips it flat but on the bounce to long-off"}, {"ball": 14.2, "isHighlight": false, "text": "Unadkat to Raina, $$FOUR$$ ,slower ball, Raina made room and knew that third man was up and cleverly guided that wide of short third man, CSK narrowing this down with rain in the air"}, {"ball": 14.3, "isHighlight": false, "text": "Unadkat to Raina,2 runs,makes room and mistimes it to the deep on the on side"}, {"ball": 14.3, "isHighlight": false, "text": "The par score is 123"}, {"ball": 14.4, "isHighlight": false, "text": "Unadkat to Raina,no run,follows that up with an excellent yorker, Raina nearly lost his balance trying to dig that out"}, {"ball": 14.5, "isHighlight": false, "text": "Unadkat to Raina, $$FOUR$$ ,a lucky outside edge! This was a yorker outside off and Raina looked to dig it out and he gets an outside edge and Karthik dives in vain"}, {"ball": 14.6, "isHighlight": false, "text": "Unadkat to Raina,no run,this was a slower ball and on the pads, he swings and misses and gets hit on the pad and Unadkat appeals"}, {"ball": 14.6, "isHighlight": false, "text": "Suren: \"Delhi continue committing the same mistake from the last match of not leveraging bowling skills of JP Duminy \""}, {"ball": 15.1, "isHighlight": false, "text": "Parnell to Smith,1 run,he fires that full on the stumps and he whips it powerfully down to deep midwicket, bat speed that"}, {"ball": 15.2, "isHighlight": false, "text": "Parnell to Raina,1 run,looks to play the on drive and he gets an inside edge to the boot, just a single"}, {"ball": 15.2, "isHighlight": false, "text": "Looks like the drizzle has lessened"}, {"ball": 15.3, "isHighlight": false, "text": "Parnell to Smith,1 run,that's a good yorker and he manages to dig it out for a single to midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Parnell to Raina, $$FOUR$$ ,didn't expect that to reach the boundary but that was quality timing by Raina, this was a yorker and the flicked it off the middle of the bat and bisected the gap between two men at deep midwicket"}, {"ball": 15.5, "isHighlight": false, "text": "Parnell to Raina, $$SIX$$ ,Parnell attempted another yorker and it was a full toss, Raina was happy to send that a few rows over deep square leg. Looks like the rain is making it hard for Parnell to grip the ball"}, {"ball": 15.5, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 15.5, "isHighlight": false, "text": "umair: \"DD are not smart at all here. All they need to do is to bowl and length and place fielder to dry up runs to be ahead of DL score. For example bowl full outside of and keep a third man.\""}, {"ball": 15.5, "isHighlight": false, "text": "Don: \"@Suren - Not sure giving the ball to a part time spinner when its raining is the best way if you want to win, especially with a guy like Raina out there. Although i do agree that they're under-bowled JP so far in the tournament.\""}, {"ball": 15.6, "isHighlight": false, "text": "Parnell to Raina,1 run,this was fired full outside off and he drives firmly to nadeem at deep cover"}, {"ball": 16.1, "isHighlight": false, "text": "Unadkat to Raina,no run,swing and a miss and this was very close to shaving the off stump"}, {"ball": 16.2, "isHighlight": false, "text": "Unadkat to Raina,1 run,pitched up on the pads and he whips it down to long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Muqeet Ahmed: \"CSK showing how to keep calm and make most of opening stand in chase of big score. Even under D/L par score pressure smith and raina playing sensibly. on the other hand Gambhir team crumble.\""}, {"ball": 16.3, "isHighlight": false, "text": "Unadkat to Smith,1 run,fires a full ball outside off and he digs it out to deep point"}, {"ball": 16.4, "isHighlight": false, "text": "Unadkat to Raina,2 runs,digs out a yorker towards long-on and he sets off quickly and Raina completes the second"}, {"ball": 16.5, "isHighlight": false, "text": "Unadkat to Raina,1 run,made room to slap that through the off side and he ended up chopping it towards short third man"}, {"ball": 16.5, "isHighlight": false, "text": "Raj: \"@Umair: It is very difficult for the bowlers to get the length right with a wet ball. I believe they definitely do need the run rate to slow down and the best way to potentially do that is to get a wicket. That would consequently change the DL equation as well. \""}, {"ball": 16.6, "isHighlight": false, "text": "Unadkat to Smith,no run,looked to slog that away but ended up getting an inside edge onto the body, the ball rolls back to the bowler"}, {"ball": 17.1, "isHighlight": false, "text": "Mohammed Shami to Raina,1 run,this was full and wide outside off and he drills this down to Nadeem at deep cover"}, {"ball": 17.2, "isHighlight": false, "text": "Mohammed Shami to Smith,1 run,Smith made room and smoked that square on the off side towards deep point, went quickly and he fumbled"}, {"ball": 17.3, "isHighlight": false, "text": "Mohammed Shami to Raina,1 run,fires that full outside off and he drills it down to third man"}, {"ball": 17.4, "isHighlight": false, "text": "Mohammed Shami to Smith, $$FOUR$$ ,that's a poor ball! Third man was up and Shami had to bowl it short outside off, a slower ball too, Smith reached out and carved it over short third man"}, {"ball": 17.5, "isHighlight": false, "text": "Mohammed Shami to Smith, $$SIX$$ ,4 + 6! Shami looked for the yorker, ended uo being a knee high full toss and smoked several rows over deep midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Mohammed Shami to Smith, $$FOUR$$ ,the over gets worse for DD, this was another slower ball and dug in short, Smith swiveled and pulled it over short fine leg"}, {"ball": 18.1, "isHighlight": false, "text": "Parnell to Raina, $$FOUR$$ ,the boundaries are bleeding, this time Raina improvises, a fast yorker outside off, he reaches out and almost guides it off the face of the bat wide of short third man and point"}, {"ball": 18.2, "isHighlight": false, "text": "Parnell to Raina,1 run,this was a low full toss mistimed to square leg"}, {"ball": 18.3, "isHighlight": false, "text": "Parnell to Smith,no run,this was a full ball outside off and moving away and he fails to dig it out"}, {"ball": 18.4, "isHighlight": false, "text": "Parnell to Smith, $$OUT$$ ,Vijay takes it at the edge of the straight boundary! It was a full ball outside off and Smith stayed at the crease and lofted it down the ground, it went really high and really tested Vijay near the rope but he kept his cool and took it nonchalantly"}, {"ball": 18.4, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Vijay$$ $$b$$ $$Parnell$$ $$79$$ $$(95m$$ $$51b$$ $$4x4$$ $$8x6)$$ $$SR:$$ $$154.90$$"}, {"ball": 18.4, "isHighlight": false, "text": "Nandakiran N: \"CSK have decided, even if they lose wicket, it would be, to an Ex-CSK player. Monk everywhere!\""}, {"ball": 18.4, "isHighlight": false, "text": "Dhoni walks in"}, {"ball": 18.5, "isHighlight": false, "text": "Parnell to Dhoni,no run,this was a length ball which Dhoni looked to pull but played it straight to Jadhav at short midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Parnell to Dhoni,no run,and it's a dot ball! Parnell ends the over and his spell with a good yorker, too good for Dhoni to make something of it, he could only drill it down the track"}, {"ball": 18.6, "isHighlight": false, "text": "Can Unadkat defend 11?"}, {"ball": 19.1, "isHighlight": false, "text": "Unadkat to Raina,1 run,gets away with a low full toss as Raina swung it to deep midwicket"}, {"ball": 19.1, "isHighlight": false, "text": "Vikram: \"If CSK lose this it could very well be because both Raina and Smith were ball watching instead of crossing over.\""}, {"ball": 19.2, "isHighlight": false, "text": "Unadkat to Dhoni, $$SIX$$ ,there's the big hit! Unadkat bowls it in the spot for Dhoni to have a free swing and take him downtown, not sure how many rows over long-on but that was massive"}, {"ball": 19.3, "isHighlight": false, "text": "Unadkat to Dhoni,2 runs,this is a low full toss and he looks to play straighter and gets an outside edge that clears cover, two added"}, {"ball": 19.3, "isHighlight": false, "text": "pravin: \"@vikram : why worry when you have Dhoni in the last over !! He has been in this position so many times !! :)\""}, {"ball": 19.3, "isHighlight": false, "text": "KP has a chat with Unadkat while the batsmen chat too. Third man and fine leg up"}, {"ball": 19.4, "isHighlight": false, "text": "Unadkat to Dhoni, $$FOUR$$ ,the captain does the honours! Unadkat bowls one full toss too many, it was outside off and he reached out and cracked this wide of cover who throws himself to his left in vain, raced away, that CSK's sixth consecutive win over Daredevils and their sixth in a row in this tournament"}, {"ball": 19.4, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.4, "isHighlight": false, "text": "$$Dhoni$$ : \"We played good cricket  but we gave away too many in tje last two or three overs. The rain helped us, their bowlers found it tough. This was one of the best Delhi wickets I have seen. Shukla bowled well. Smith and McCullum were brilliant. Raina made sure he batted till the end. We need to improve our bowling. We need a couple of fast bowlers who can bowl well in the death.\""}, {"ball": 19.4, "isHighlight": false, "text": "$$Smith$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ : \"Meant to stay out there. It was a good track to me as well. Me and McCullum keep encouraging each other. It was a very good chase for us. It's a great team.\""}, {"ball": 19.4, "isHighlight": false, "text": "$$Pietersen$$ : \"We thought we lost a bit of momentum. I thought some of our boys played some good cricket. Wayne Parnell was beautiful, the wicket was quite slow before the rain came and the rain sort of affected it but no excuses. CSK played really well. Nobody's here to blame anyone, we probably have to win most of our games here and I still believe our team can make the playoffs.\""}, {"ball": 19.4, "isHighlight": false, "text": "That's much easier said than done. Delhi have lost 5 out of 7 and they have seven more to play. Their road ahead gets tougher."}, {"ball": 19.4, "isHighlight": false, "text": "That's it from us here. Thanks for your company. One more game tomorrow. Cheers!"}, {"ball": 19.4, "isHighlight": false, "text": "Pratyush: \"KP needs a bowler, desperately. They should have won this one. Shami has disappointed all of us. Feel really bad for him.\""}, {"ball": 19.4, "isHighlight": false, "text": "Venkat: \"Feel for KP here... He has been very classy off the field and has conducted himself brilliantly in the interviews, and on the field it is obvious that he is tuned in and in charge. Hopefully fortunes change for DD !\""}], "name": "Delhi Daredevils v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733981.html?innings=2;view=commentary", "match_num": 26}