{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase. Gayle and Parthiv to open. Suyal with the new ball"}, {"ball": 0, "isHighlight": false, "text": "nikhil: \"Maybe time for introducing red cards in cricket?\""}, {"ball": 0.1, "isHighlight": false, "text": "Suyal to Gayle,1 run,starts off with a full toss around off, Gayle pushes it softly into the gap at extra cover for a single"}, {"ball": 0.2, "isHighlight": false, "text": "Suyal to PA Patel,no run,back of a length, moving away a bit from the left-hander, who defends it square on the off side"}, {"ball": 0.3, "isHighlight": false, "text": "Suyal to PA Patel,no run,good length ball, going away from Parthiv, he punches to cover"}, {"ball": 0.4, "isHighlight": false, "text": "Suyal to PA Patel, $$FOUR$$ ,he moves it away again, but this is much fuller, Parthiv comes forward and times it superbly through extra cover"}, {"ball": 0.5, "isHighlight": false, "text": "Suyal to PA Patel,1 run,nice touch from Parthiv again, this is almost in the blockhole outside off, he opens the face and runs it past backward point"}, {"ball": 0.6, "isHighlight": false, "text": "Suyal to Gayle,no run,tries to thrash this pitched up delivery through the off side but short extra dives and takes pace off it"}, {"ball": 0.6, "isHighlight": false, "text": "Bumrah to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Bumrah to PA Patel,no run,sees this shortish ball angled across him, and tries a pull, ends up swinging over the line and is beaten"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to PA Patel, $$FOUR$$ ,dug in short again, and this time Parthiv goes off side, he is in the air as he slaps it well in front of square"}, {"ball": 1.3, "isHighlight": false, "text": "Bumrah to PA Patel, $$FOUR$$ ,and again, short, slanted across, quite some width, and Parthiv cuts in the gap between cover and backward point"}, {"ball": 1.4, "isHighlight": false, "text": "Bumrah to PA Patel,no run,similar length, similar line, hurrying across him, Parthiv tries another pull now and is beaten again"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to PA Patel,1 run,this is fuller, and Parthiv gets a thick edge that flies past slip, was looking to play it to leg initially, then jabbed at it in the end"}, {"ball": 1.6, "isHighlight": false, "text": "Bumrah to Gayle,no run,pitched up ball on the stumps played down the track"}, {"ball": 2.1, "isHighlight": false, "text": "Suyal to PA Patel,1 wide,he drifts too wide down the leg side, Parthiv looks to pull"}, {"ball": 2.1, "isHighlight": false, "text": "Suyal to PA Patel,1 wide,he totally lost control of that one! Too wide outside off and work for the keeper"}, {"ball": 2.1, "isHighlight": false, "text": "Suyal to PA Patel, $$FOUR$$ ,streaky though, it was chipped down the ground and Rayudu did really well at mid-on to throw himself to his right to try and pluck that, beat him and raced away"}, {"ball": 2.2, "isHighlight": false, "text": "Suyal to PA Patel,1 run,he drifts on the pads and he works it away down to Malinga at deep square leg"}, {"ball": 2.2, "isHighlight": false, "text": "Kaustubh Soman: \"Whenever I see \"Bang\" on my chrome tab, I get confused. I start thinking about which country is playing against Bangladesh and when exactly did I start following that scorecard ???\""}, {"ball": 2.3, "isHighlight": false, "text": "Suyal to Gayle, $$SIX$$ ,down the ground! This was pitched up by Suyal, in Gayle's zone and he lofts through the line, a few rows over long-off"}, {"ball": 2.4, "isHighlight": false, "text": "Suyal to Gayle,1 wide,Suyal bangs this in short and it's down the leg side and Gautam does well to take it one handed"}, {"ball": 2.4, "isHighlight": false, "text": "Suyal to Gayle, $$FOUR$$ ,he bowls length and gets punished, a bit too straight, he has swing to the on side and over midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Suyal to Gayle, $$SIX$$ ,another one over long-off and this was higher in the air, pitched up and Gayle stays at the crease and takes him downtown again, over long-off"}, {"ball": 2.6, "isHighlight": false, "text": "Suyal to Gayle, $$FOUR$$ ,the over costs four more! Suyal tries for the inswinging yorker and it's a low full toss and he whips it to deep midwicket, 28 off the over, nuff said"}, {"ball": 2.6, "isHighlight": false, "text": "Harbhajan for damage control"}, {"ball": 3.1, "isHighlight": false, "text": "Harbhajan Singh to PA Patel,no run,he goes back and chops it to the off side"}, {"ball": 3.2, "isHighlight": false, "text": "Harbhajan Singh to PA Patel, $$FOUR$$ ,that was a clean slog, Parthiv shuffled across the stumps quickly and picked it from middle and slogged him over short fine leg"}, {"ball": 3.3, "isHighlight": false, "text": "Harbhajan Singh to PA Patel,no run,stays back and punches it to the off side"}, {"ball": 3.4, "isHighlight": false, "text": "Harbhajan Singh to PA Patel,2 runs,gives the charge and lofts just wide of mid-on, deep midwicket cuts it off"}, {"ball": 3.5, "isHighlight": false, "text": "Harbhajan Singh to PA Patel,no run,he chips it down to long-off and it goes quickly to Pollard but for some reason they don't run! Pollard was also not deep at long-off"}, {"ball": 3.6, "isHighlight": false, "text": "Harbhajan Singh to PA Patel,no run,he makes room to slog and misses and Gautam whips off the bails, Parthiv's back foot shifted slightly, but he's safe"}, {"ball": 3.6, "isHighlight": false, "text": "Uzair: \"Sorry to say but this is bad captaincy from Rohit. He should have started with Bhajji against Gayle considering his reluctance against the off spin,rather than giving 2 new comers a go against mighty Gayle.\""}, {"ball": 4.1, "isHighlight": false, "text": "Malinga to Gayle,no run,slower ball and he gets forward and drops it to the off side"}, {"ball": 4.2, "isHighlight": false, "text": "Malinga to Gayle,1 run,slower ball on the pads and whipped away to fine leg"}, {"ball": 4.3, "isHighlight": false, "text": "Malinga to PA Patel,1 run,fires a yorker outside off and it's a controlled glide to third man"}, {"ball": 4.3, "isHighlight": false, "text": "jainendra tarun: \"Last year MI had started with Johnson and Malinga against Gayle. What a great spell that was! Look whom they started with today. Rohit is today too defensive to win this one.\""}, {"ball": 4.4, "isHighlight": false, "text": "Malinga to Gayle,2 runs,this was banged in short on the body and Gayle pulled along the ground, looked a bit ungainly but kept it along the ground"}, {"ball": 4.5, "isHighlight": false, "text": "Malinga to Gayle,no run,follows that up with a yorker to keep him quiet, pushed to cover"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga to Gayle,no run,now it's the short one and Gayle can't resist the pull, swings and misses"}, {"ball": 5.1, "isHighlight": false, "text": "Harbhajan Singh to PA Patel, $$OUT$$ ,slog and a miss, Harbhajan tosses it up from round the wicket, lands on a good length and Parthiv plays too early and the ball hits his stumps"}, {"ball": 5.1, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$26$$ $$(27m$$ $$19b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$136.84$$"}, {"ball": 5.2, "isHighlight": false, "text": "Harbhajan Singh to Kohli,no run,continues round the wicket to Kohli, he knocks it to the on side"}, {"ball": 5.3, "isHighlight": false, "text": "Harbhajan Singh to Kohli,1 run,turned towards square leg for a single"}, {"ball": 5.3, "isHighlight": false, "text": "Menon: \"Inspite of having some strong brains in MI staff, i dont understand why no one told Rohit against Gayle's susceptibility against off spin. Every team used that against Gayle even in World t20.\""}, {"ball": 5.4, "isHighlight": false, "text": "Harbhajan Singh to Gayle,no run,Gayle looks to sweep and he places it to square leg"}, {"ball": 5.5, "isHighlight": false, "text": "Harbhajan Singh to Gayle, $$FOUR$$ ,that was good adjustment! Gayle was down the track and it was outside off and nearly beaten in flight, he quickly adjusted and swung across the line instead and placed it to deep midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Harbhajan Singh to Gayle, $$SIX$$ ,nothing risky about that! Tossed up and Gayle went forward and clubbed that flat over deep midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 5.6, "isHighlight": false, "text": "Saleel: \"people need to stop bashing Rohit here, the think tank involves some of the world's best in Sachin Ricky and Kumble ... clearly RCB has a spread out attack with Kohli and ABD! in the team and without Zaheer, Rohit has to keep enough of Malinga to weather the storm and take some risk somewhere. \""}, {"ball": 6.1, "isHighlight": false, "text": "Bumrah to Kohli,no run,Kohli gets an inside edge to the boot and the ball rolls to the off side"}, {"ball": 6.2, "isHighlight": false, "text": "Bumrah to Kohli,no run,punches it down the track and Bumrah stretches his left hand and the ball hits the stumps, Gayle grounds his bat and Harbhajan is the only one interested in appealing and the bowler himself can't be bothered! I don't think it brushed the finger in the first place"}, {"ball": 6.3, "isHighlight": false, "text": "Bumrah to Kohli,1 run"}, {"ball": 6.4, "isHighlight": false, "text": "Bumrah to Gayle,1 run,slower ball on the leg side and he nudges it to fine leg"}, {"ball": 6.5, "isHighlight": false, "text": "Bumrah to Kohli,1 leg bye,nudges it to short fine leg and Gayle has to hurry the single"}, {"ball": 6.6, "isHighlight": false, "text": "Bumrah to Gayle,no run,awkward shot from Gayle as he stabbed at it to the off side"}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Kohli,1 run,tossed up on middle and leg and worked to fine leg"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Gayle,no run,tries to drive and gets an inside edge to the pad, Kohli is sent back"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Gayle,1 leg bye,comes down the track and checks his shot to Malinga at short fine leg, Gayle has to hurry"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Kohli,no run,round the wicket to Kohli and he dances down the track, the ball hits his pad and rolls away"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Kohli,2 runs,flatter one and he works it away down to square leg"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Kohli,1 run,full on middle and leg and he pushes it down to long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Barath: \"Saleel, RCB do not have depth in their batting line up.They have top heavy batting line up. Rohit should have used couple of overs of Mallinga and Harbhajan to pick up few early wickets and put some pressure on the RCB batting line up.When they come in to bowl after the likes of Kholi and Gayle have settled in, their role changes from wicket takers to damage control bowlers \""}, {"ball": 7.6, "isHighlight": false, "text": "Pollard to bowl. But Starc's not batting..."}, {"ball": 8.1, "isHighlight": false, "text": "Pollard to Kohli, $$SIX$$ ,gives him a warm welcome, lobbed up on the off stump and he comes down the track and lofts him just over long-off's reach"}, {"ball": 8.2, "isHighlight": false, "text": "Pollard to Kohli,no run,Gautam up to the stumps now, Kohli runs it down to short third man"}, {"ball": 8.3, "isHighlight": false, "text": "Pollard to Kohli,1 run,length ball and softly pushed towards long-off"}, {"ball": 8.4, "isHighlight": false, "text": "Pollard to Gayle,1 run,good length and he tucks it away down to deep midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Pollard to Kohli,1 run,drags it a bit short and he pulls with force to deep midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Pollard to Gayle,1 run,short again and pulled down the ground to deep midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Uzair: \"@Barath- you must be watching another RCB, they have the best batsman in the world coming in at 6, yet you are saying they are top heavy. \""}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to Gayle,4 leg byes,he makes the mistake of drifting down leg with fine leg up, sweeps and places it fine, down to fine leg"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to Gayle,1 run,he comes down the track and he mistimes it to deep midwicket"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to Kohli, $$SIX$$ ,over the sight screen! That was clean, Kohli saw the extra flight, came down the track and had a free swing"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to Kohli,1 run,Harbhajan fires that flat and quick and he whips it to square leg"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Gayle, $$OUT$$ ,Harbhajan's got the Big Fish and Gayle can't believe it! Harbhajan bowls round the wicket and the ball straightens, Gayle was down to slog and he was too early on the shot and the ball struck the off stump, Harbhajan is on his knee and pumps his fist and stays there"}, {"ball": 9.5, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$38$$ $$(50m$$ $$24b$$ $$3x4$$ $$3x6)$$ $$SR:$$ $$158.33$$"}, {"ball": 9.5, "isHighlight": false, "text": "No Yuvi, it's AB"}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to de Villiers, $$FOUR$$ ,no sighter needed, he plays the reverse sweep! There was a slip in place but that didn't deter him, placed it wide of slip"}, {"ball": 9.6, "isHighlight": false, "text": "Shravan: \"Kohli activated his Chase cheat-code\""}, {"ball": 10.1, "isHighlight": false, "text": "Pollard to Kohli,no run,he opens the face of the bat and drops it to third man"}, {"ball": 10.2, "isHighlight": false, "text": "Pollard to Kohli, $$FOUR$$ ,that was raw power! Half volley on the off stump and he gets forward and bashes it so hard that long-off can't cut it off"}, {"ball": 10.3, "isHighlight": false, "text": "Pollard to Kohli, $$FOUR$$ ,a freebie from Pollard, down the leg side, keeper was up, all it needed was a gentle tickle"}, {"ball": 10.4, "isHighlight": false, "text": "Pollard to Kohli,no run,AB was in trouble but Gautam fumbles! Kohli dropped it to the off side and AB charged off but Kohli was quick to send him back, Gautam ran across to gather but he failed to pick up the ball properly, AB hurried back"}, {"ball": 10.5, "isHighlight": false, "text": "Pollard to Kohli,2 runs,turned away wide of square leg and they take the first run quickly"}, {"ball": 10.6, "isHighlight": false, "text": "Pollard to Kohli,1 run,fires it full on the pads and he whips it to deep midwicket"}, {"ball": 11.1, "isHighlight": false, "text": "Malinga to Kohli,1 run, $$Dropped$$  by Bumrah at short fine leg! Malinga drifted on the pads, Kohli flicked it fine, Bumrah moved to his right and appeared to have it covered but it came on quickly and slipped away"}, {"ball": 11.2, "isHighlight": false, "text": "Malinga to de Villiers,no run,nearly another boundary as AB smashed it off the front foot and went on the bounce to cover"}, {"ball": 11.3, "isHighlight": false, "text": "Malinga to de Villiers,1 run,full outside the off stump and he drills it down to long-on"}, {"ball": 11.4, "isHighlight": false, "text": "Malinga to Kohli,no run,fires this on a yorker length outside the off stump and he squirts it out to point"}, {"ball": 11.5, "isHighlight": false, "text": "Malinga to Kohli,1 run,Malinga was lucky to get away with this one, low full toss on the pads and whipped away and Bumrah was sharp at short fine leg"}, {"ball": 11.6, "isHighlight": false, "text": "Malinga to de Villiers, $$FOUR$$ ,that confounded the fielder at sweeper cover, this was full, fast and outside off and AB didn't hit it too hard, used the pace of the ball and placed it wide of sweeper cover"}, {"ball": 12.1, "isHighlight": false, "text": "Bumrah to Kohli,1 run,full and drilled down to long-on"}, {"ball": 12.2, "isHighlight": false, "text": "Bumrah to de Villiers,no run,good length outside off and he punches it to the off side"}, {"ball": 12.2, "isHighlight": false, "text": "Paul: \"Waiting for the end of the game when the handshakes go on, to see how Pollard and Starc handle it. IPL is infamously living up to its guaranteed entertainment.\""}, {"ball": 12.3, "isHighlight": false, "text": "Bumrah to de Villiers,no run,he stays back at the crease and he punches it to midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Bumrah to de Villiers, $$OUT$$ ,Bumrah does what Steyn couldn't do the other night! He knocks down the leg stump as AB attempts one of his audacious sweep shots, moved right across his stumps, the angle was taking it towards the leg stump, it goes for a spin and lands a few yards back"}, {"ball": 12.4, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Bumrah$$ $$9$$ $$(15m$$ $$7b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$128.57$$"}, {"ball": 12.4, "isHighlight": false, "text": "Yuvraj and Kohli again. Memories of Mirpur?"}, {"ball": 12.5, "isHighlight": false, "text": "Bumrah to Yuvraj Singh,no run,he stays back and defends back to the bowler"}, {"ball": 12.6, "isHighlight": false, "text": "Bumrah to Yuvraj Singh,1 run,shuffles across and he flicks it wide of square leg"}, {"ball": 12.6, "isHighlight": false, "text": "Harshad: \"@Uzair Do you think RR Rossouw is best batsman in the world? because he will come at No.6 today.\""}, {"ball": 12.6, "isHighlight": false, "text": "Just when you thought you saw the last of Suyal, he's back"}, {"ball": 13.1, "isHighlight": false, "text": "Suyal to Yuvraj Singh,1 run,good length outside off and he punches it down to sweeper cover"}, {"ball": 13.2, "isHighlight": false, "text": "Suyal to Kohli,no run,that was a good ball, this was on a yorker length and he got an inside edge to the boot"}, {"ball": 13.3, "isHighlight": false, "text": "Suyal to Kohli, $$OUT$$ ,Anderson plucks that at long-off and Kohli has to go, this was pitched up on the off stump and Kohli aims for a flat six over long-off, Anderson moved to his right quickly and judged it well, it must have thudded onto his palm because Kohli hit that hard"}, {"ball": 13.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Anderson$$ $$b$$ $$Suyal$$ $$35$$ $$(43m$$ $$28b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 13.4, "isHighlight": false, "text": "Suyal to Yuvraj Singh,no run,he stays back and punches it to the off side"}, {"ball": 13.5, "isHighlight": false, "text": "Suyal to Yuvraj Singh,no run,he fires that full and he works it to midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Suyal to Yuvraj Singh,no run,that's the end of a good over, Yuvraj tucked for room and he  can only push it towards the bowler"}, {"ball": 13.6, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 13.6, "isHighlight": false, "text": "Nishant Joshi tweets: \"Bumrah gave AB de Villiers a send-off, which is a bit like a graffiti artist abusing Matisse about his painting technique. #IPL\""}, {"ball": 13.6, "isHighlight": false, "text": "Aayush: \"Just like Raina only performs in a yellow uniform, I think Kohli only performs in a blue uniform. Maybe switching over to Mumbai would bring out Kohli, the Indian batsman, in him?\""}, {"ball": 14.1, "isHighlight": false, "text": "Sharma to Rossouw,1 run,he drags it short and he pulls along the ground to midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,that was short again and Yuvraj can only pull it to long-on"}, {"ball": 14.3, "isHighlight": false, "text": "Sharma to Rossouw,1 run,this is a full toss and he can only push it to long-on"}, {"ball": 14.4, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,Yuvraj sizes up for the big hit and he mistimes it to deep midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Sharma to Rossouw,1 run, $$Dropped$$  by Rohit, Rossouw hammered a low full toss to the bowler's left and Rohit was a bit slow to react, it popped out and rolled behind him"}, {"ball": 14.6, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,in the air and hammered really hard down the ground and Anderson had to quickly cut that off"}, {"ball": 14.6, "isHighlight": false, "text": "Rishi: \"I think we Indians suffer from a low sense of self esteem, what is wrong with young Bumrah giving ABD a send off. I grew up with the sight of Javagal Srinath walking up to Ponting apologizing for the bouncer and Ponting basically shooing him back to the bowling corner to do his job....\""}, {"ball": 15.1, "isHighlight": false, "text": "Pollard to Yuvraj Singh,1 run,a bit too straight and Yuvraj swings this to deep square leg, he can't find the boundary"}, {"ball": 15.2, "isHighlight": false, "text": "Pollard to Rossouw, $$SIX$$ ,that was a clean hit, lobbed up on middle and he slogs him across the line, didn't hit it too hard and it went back a few rows over deep midwicket"}, {"ball": 15.3, "isHighlight": false, "text": "Pollard to Rossouw, $$OUT$$ ,that's a goal by Pollard! Rossouw looks to pull and gets an inside edge to the body and the ball drops in front of him, they take the single and Yuvraj was struggling, Pollard senses he wouldn't have time to pick up and throw so he settles for the kick and boots the ball towards the stumps and Yuvi was short"}, {"ball": 15.3, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$run$$ $$out$$ $$6$$ $$(17m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 15.3, "isHighlight": false, "text": "Pollard does a rather strange dance, not sure what to call it!"}, {"ball": 15.4, "isHighlight": false, "text": "Pollard to Starc,1 run,pulled and it lobs off the glove and drops short of Malinga at short fine leg"}, {"ball": 15.5, "isHighlight": false, "text": "Pollard to Rossouw,no run,drives a low full toss back to the bowler"}, {"ball": 15.6, "isHighlight": false, "text": "Pollard to Rossouw,1 run,comes down the track and forces it to long-off"}, {"ball": 15.6, "isHighlight": false, "text": "Mumbai on the upswing here"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Rossouw,1 run,full on the off stump and he pushes it to the off side"}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to Starc, $$FOUR$$ ,bit streaky, this was fired full and he sliced it and ended up getting an outside edge that cleared point"}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Starc,no run,full outside off and he fails to dig out the yorker"}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to Starc, $$OUT$$ ,and as many of you would have hoped for Starc's gone and with a little help from Pollard, this was fired full outside off and he tries to clear the off side and ends up scooping it to Pollard at cover"}, {"ball": 16.4, "isHighlight": false, "text": "$$MA$$ $$Starc$$ $$c$$ $$Pollard$$ $$b$$ $$Malinga$$ $$5$$ $$(6m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Ishan Jain: \"That \"direct kick\" was so typically West Indian. It brings images of the past to my memory, when Ambrose used to try out the similar things on the field. Direct kick and using his massive feet to stop the ball from touching the rope.\""}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Rossouw, $$FOUR$$ ,he got his placement right, shuffles across his stumps and swings a length ball over midwicket, plenty of open space there"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Rossouw,1 run,full outside off and drilled down to long-off"}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Rossouw,1 run,drilled towards long-on and they set off for the second but Anderson attacks the ball and fires it to the keeper, Patel had to scamper back and dive, third umpire takes a look"}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to HV Patel, $$SIX$$ ,Harshal showing he can tonk it too, this was fired full and he made room and swung at it and sent it a few rows over deep cover"}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to HV Patel, $$OUT$$ ,knocks the off stump down this time, it was the off cutter, Harshal shuffled across and he wasn't too sure what he was trying, walked all around it and the ball brushed his hip and hit the off stump which lands a couple of yards back"}, {"ball": 17.3, "isHighlight": false, "text": "$$HV$$ $$Patel$$ $$b$$ $$Bumrah$$ $$6$$ $$(6m$$ $$2b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$300.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Girish: \"Starc throws ball at Pollard! Pollard throws bat at Starc! Starc runs out Pollard!! Pollard caught Starc!! Both involved in each other's dismissal without taking their wicket! So battle ends in tie!\""}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Aaron,1 run,he pushes it behind point"}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Rossouw,1 run,makes room and looks to slog and he gets an inside edge to the body"}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Aaron,no run,pacy delivery outside off, he makes room to swing and he's beaten"}, {"ball": 18.1, "isHighlight": false, "text": "Malinga to Rossouw, $$SIX$$ ,Rossouw's not given up on this! Malings fires a length ball, in the slot for him and he swings and sends it soaring over wide long-on"}, {"ball": 18.2, "isHighlight": false, "text": "Malinga to Rossouw, $$OUT$$ ,scoops to cover, this was the slower ball by Malinga, Rossouw gave the charge and looked to clear the off side, chipped it to Rohit at cover"}, {"ball": 18.2, "isHighlight": false, "text": "$$RR$$ $$Rossouw$$ $$c$$ $$Sharma$$ $$b$$ $$Malinga$$ $$24$$ $$(31m$$ $$14b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$171.42$$"}, {"ball": 18.3, "isHighlight": false, "text": "Malinga to Dinda,no run,good yorker on middle and Dinda can only drill it back to the bowler"}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Dinda,1 run,the yorker length again and he makes room and carves it down to deep cover"}, {"ball": 18.5, "isHighlight": false, "text": "Malinga to Aaron,1 run,low inswinging full toss and he gets an inside edge to the pads"}, {"ball": 18.6, "isHighlight": false, "text": "Malinga to Dinda,no run,he makes room and has a swing and misses"}, {"ball": 19.1, "isHighlight": false, "text": "Pollard to Aaron,no run,comes down the track to have a swing at Pollard and misses, slower ball"}, {"ball": 19.2, "isHighlight": false, "text": "Pollard to Aaron, $$FOUR$$ ,Aaron comes forward and has another free swing at a short ball and that clears the keeper"}, {"ball": 19.3, "isHighlight": false, "text": "Pollard to Aaron,no run,drifts on the leg side and he gets an inside edge and the ball rolls to the off side"}, {"ball": 19.4, "isHighlight": false, "text": "Pollard to Aaron,no run,slower ball and he swings and misses and that sneaks past the stumps"}, {"ball": 19.5, "isHighlight": false, "text": "Pollard to Aaron,1 run,fires that on a yorker length and he makes room and drills it to the off side"}, {"ball": 19.6, "isHighlight": false, "text": "Pollard to Dinda,1 wide,a wide to delay the inevitable, this was short and too wide outside off, swings at it"}, {"ball": 19.6, "isHighlight": false, "text": "Pollard to Dinda,1 run,shuffles at the crease and pulls a slower ball down to long-on"}, {"ball": 19.6, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.6, "isHighlight": false, "text": "$$Rohit$$ : \"By far the best game so far. This is what MI is all about, we took some brilliant catches. Wankhede always has some dew and the bowlers did very well. Suyal came back very well and things slowed down for RCB. We kept taking wickets. Important for me to step up and I'm glad I played an important knock. We're keeping our heads up. We need to be positive. Next game against CSK is also very important.\""}, {"ball": 19.6, "isHighlight": false, "text": "Rohit is the  $$Man$$ $$of$$ $$the$$ $$Match$$  as well."}, {"ball": 19.6, "isHighlight": false, "text": "$$Kohli$$ : \"Very gettable, we could have batted smarter, one more partnership was needed. It was a dream start, we could not capitalise on it. Every team plays hard and these sort of things happen. If we had applied ourselves we could have crossed the line. Not losing hope, we need to win at least five out of the next seven.\""}, {"ball": 19.6, "isHighlight": false, "text": "That's it from us here. Double-header tomorrow. Thanks for your company. For now, this is Kanishkaa signing off. Good night!"}, {"ball": 19.6, "isHighlight": false, "text": "$$End$$ $$of$$ $$the$$ $$match$$ : Mumbai win their second game at the Wankhede and a good comeback after their UAE horror. They have batted RCB out of this match. We had the Pollard-Starc incident to spice things up."}, {"ball": 19.6, "isHighlight": false, "text": "Anish: \"Field day for the match referee, match got over in 4 hours (probably fines for both the captains) and then the fight between Pollard and Starc. IPL Committee will be loving this !! \""}, {"ball": 19.6, "isHighlight": false, "text": "Pramod Bhushan: \"\"Extras\" was the difference between the 2 teams\""}], "name": "Mumbai Indians v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733983.html?innings=2;view=commentary", "match_num": 27}