{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.00$$ $$pm$$  All set to go. The umpires are here. KKR go into a huddle.. Vijay and QdK are here too - both of them looked in good touch in the last game. De Kock on strike.. Strange move,  $$Surya$$  to start the bowling.. he is warming up with some offspin.. so that is what he is going to bowl.. from round the wicket"}, {"ball": 0, "isHighlight": false, "text": "\"I know numerology plays a huge role in India, especially within Bollywood. Would Gambhir be the sort of person, who practice such regressive stuff? \" --- Adam, I am not sure about what Gambhir believes in but the people who own KKR are from the film industry.."}, {"ball": 0, "isHighlight": false, "text": "Subham: \"so again yousuf Pathan will be playing for KKR. I understand he was taken in the team just for that one game where he would take his side to victory. But, unfortunately that 1 game is not coming. Maybe it will come today, or sometime in this edition of IPL, or in 2015 or 2016......\""}, {"ball": 0, "isHighlight": false, "text": "$$3.30$$ $$pm$$  Gautam Gambhir has changed his shirt no. from 77 to 23 but it hasn't helped, at least for now.  $$Delhi$$ $$Daredevils$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$are$$ $$batting$$ $$first.$$  They have made one change - Sid Kaul in for Unadkat. KKR have made one change - Kallis is back, Russell makes way."}, {"ball": 0, "isHighlight": false, "text": "Shahed: \"While it is very encouraging to see the likes of Mohit Sharma, Ishwar Pandey, and Bhuvaneshwar Kumar do well, it is disappointing to see the continuous bad performances of Shami, Ishant and Umesh Yadav - possibly the four fastest Indian bowlers along with Aaron. Each of the three just runs up and bowls fast, and most of the times on length - which is the easiest of hits in 20-20. They just don't seem to know how to bowl back of hand slower ones(like Mohit, Parnell) or the wide yorkers (like Kulasekra).\""}, {"ball": 0, "isHighlight": false, "text": "Ananya: \"Dont know why everyone is criticizing Shami.... he was very good for India over the last year where even Bhuvi was struggling..... He prized out Amla many times in the test series in SA... Just that he is striving for pace and is struggling here.... otherwise, he is a good bowler \""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  Hello and welcome to our coverage from a match of teams fighting for survival in the darkness of the dungeons. Delhi Dardevils and Kolkata Knight Riders both appeared insipid in thee UAE and if anyone hoped the form would change in India, it has not happened. There problems seem to be opposite of each other; DD's batting is not looking bad - they had a very good game against CSK and that too without KP firing - but the problem is their bowling. For KKR, their batsmen seem to be playing that old nintendo game called Duck Hunt rather than cricket - they have collected 13 ducks this season, six more than the next team (RCB)...Delhi playing at home definitely have the edge here."}, {"ball": 0, "isHighlight": false, "text": "\"Since we haven't heard anything are we to assume the Starc/Pollard confrontation has gone unpunished?\" --- Brian, yes, we haven't heard anything.. That incident was at least one-match ban worthy for both players."}, {"ball": 0, "isHighlight": false, "text": "\"Im interested on your take on the incident from last night. As far as I am concerned, I think although Starc didnt exactly help to extinguish the anger, Pollard was really the only player in the wrong. What makes you think both should have been punished?\" --- Mark, Starc did follow Pollard with a full delivery and deserves punishment. However, Pollard for me, deserves even more.. To throw a bat at someone is just not on. For me that calls for more than a match ban."}, {"ball": 0, "isHighlight": false, "text": "Rahul Dravid, Sambit Bal, Gaurav Kalra...  $$Everyone's$$ $$playing$$ $$CricIQ$$ . What about you?  $$Play$$ $$here.$$"}, {"ball": 0.1, "isHighlight": false, "text": "SA Yadav to de Kock, $$FOUR$$ ,this has been easily punched through cover! Nothing more than a push, but the short length of the ball gave de Kock all the time"}, {"ball": 0.2, "isHighlight": false, "text": "SA Yadav to de Kock,1 run,makes room and punches this to wide mid-off for another easy single"}, {"ball": 0.3, "isHighlight": false, "text": "SA Yadav to Vijay,no run,tossed up delivery on the stumps, Vijay drives to midwicket where Gambhir misfields.. But QdK is not running for those after the previous match."}, {"ball": 0.4, "isHighlight": false, "text": "SA Yadav to Vijay,no run,oye! That almost sneaked under the bat.. The batsman was making room to carve it through cover, but it didn't bounce much and an underedge saves Murali"}, {"ball": 0.5, "isHighlight": false, "text": "SA Yadav to Vijay,2 runs,moves to the leg side again and pushes the flatter delivery through cover for an easy couple"}, {"ball": 0.6, "isHighlight": false, "text": "SA Yadav to Vijay,1 run,stays in his stance and whips the floated delivery to deep midwicket with ease"}, {"ball": 0.6, "isHighlight": false, "text": "Kallis is back"}, {"ball": 1.1, "isHighlight": false, "text": "Kallis to Vijay,no run,length delivery on the stumps, the batsman whips it straight to square leg"}, {"ball": 1.2, "isHighlight": false, "text": "Kallis to Vijay,1 run,another length delivery on off, the batsman pushes it to wide mid-on to turn the strike over"}, {"ball": 1.3, "isHighlight": false, "text": "Kallis to de Kock, $$FOUR$$ ,only marginally short of length and de Kock smashes it off the front foot towards deep midwicket where Tendo dives, but just parries the ball to the boundary"}, {"ball": 1.4, "isHighlight": false, "text": "Kallis to de Kock,no run,he walks into this length ball and drives it on the up to cover"}, {"ball": 1.5, "isHighlight": false, "text": "Kallis to de Kock,no run,this one shoots off the pitch and surprises the batsman with the bounce.. flies past the shoulder of the bat"}, {"ball": 1.6, "isHighlight": false, "text": "Kallis to de Kock,1 run,he clips this one off his thigh pad to midwicket for an easy single"}, {"ball": 1.6, "isHighlight": false, "text": "Umesh Yadav comes in now to replace Surya"}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to de Kock,no run,gets a good shape on this one, it starts from leg stump and swings into the batsman, hits the pads"}, {"ball": 2.2, "isHighlight": false, "text": "UT Yadav to de Kock,no run,similar delivery, swings into the pads and rolls towards point.. Vijay, however, is charging down the pitch and has to scamper back.. a direct hit would have had him"}, {"ball": 2.3, "isHighlight": false, "text": "UT Yadav to de Kock, $$OUT$$ ,one dot, two dot, and here comes the wicket! He looked to clear this fuller delivery over mid-on, but is hit high on the bat and lobs up for Gambhir at mid-on. After two inswinging deliveries, this one went straight on"}, {"ball": 2.3, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$c$$ $$Gambhir$$ $$b$$ $$UT$$ $$Yadav$$ $$10$$ $$(11m$$ $$9b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$111.11$$"}, {"ball": 2.3, "isHighlight": false, "text": "Here's the big man.. KP comes in"}, {"ball": 2.4, "isHighlight": false, "text": "UT Yadav to Vijay,no run,he is beaten by this one, but this on-the-up drive was not really on here.. He was looking to play this away from his body"}, {"ball": 2.5, "isHighlight": false, "text": "UT Yadav to Vijay, $$FOUR$$ ,full and swinging, but it also invites Murali to drive and drive he does, through the gap at extra cover. it was in the air for a bit, but in the gap"}, {"ball": 2.6, "isHighlight": false, "text": "UT Yadav to Vijay,no run,almost a yorker outside off, the batsman drives it straight to cover"}, {"ball": 2.6, "isHighlight": false, "text": "Some left-arm spin for KP.. Shakib is here"}, {"ball": 3.1, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,no run,he comes down the pitch and pushes outside the line, hit on the pads"}, {"ball": 3.2, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,no run,flatter delivery on the leg stump line, he clips is straight to square leg"}, {"ball": 3.3, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,no run,this is outside off but KP is predetermined to play a sweep, gets hit on the front pad but the impact was outside the line"}, {"ball": 3.4, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,1 run,stays in the crease and dabs the flatter delivery to midwicket for a single"}, {"ball": 3.5, "isHighlight": false, "text": "Shakib Al Hasan to Vijay,no run,tossed up and slower, keeps coming in with the angle, the batsman defends"}, {"ball": 3.6, "isHighlight": false, "text": "Shakib Al Hasan to Vijay,1 run,fuller and on the pads, the batsman pushes it softly to midwicket for a single"}, {"ball": 3.6, "isHighlight": false, "text": "More spin.. Narine rises early today"}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Vijay,1 run,he shuffles across the crease and pushes it softly towards mid-on for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Pietersen,no run,the sweep again, the ball is well outside off and slips under to beat the bat"}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Pietersen, $$FOUR$$ ,that's a good shot! Looks like he spotted the doosra and went ahead with an inside out drive, using his long reach, to scoop it over cover"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Pietersen,no run,defends this off the front foot"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Pietersen,no run,didn't read this one! He was again shaping for the big drive but it cut back into him.. he manages to defend it to the leg side"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Pietersen,1 run,stays on the back foot and dabs this to cover for a quick single"}, {"ball": 5.1, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,no run,he was in trouble for a moment! He came out of the crease, defended as he was not to the pitch of the ball, but the ball clipped the inside edge and rolled towards the leg stump"}, {"ball": 5.2, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen,no run,looks to whip it to the leg side but gets hit on the pads"}, {"ball": 5.3, "isHighlight": false, "text": "Shakib Al Hasan to Pietersen, $$OUT$$ ,what has he done! This is the most stupid dismissal. He comes forward, defends it to cover and just starts running like a mad man. There was no run there.. The keeper moves forward, picks up the ball and runs him out.. KP never really looked back.."}, {"ball": 5.3, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$run$$ $$out$$ $$6$$ $$(10m$$ $$12b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 5.3, "isHighlight": false, "text": "What was he thinking really! KP's poor spell continues.. He has gifted his wicket away. Now it's DK"}, {"ball": 5.4, "isHighlight": false, "text": "Shakib Al Hasan to Karthik,1 run,tossed up outside off, he pushes it to long on for an easy single"}, {"ball": 5.5, "isHighlight": false, "text": "Shakib Al Hasan to Vijay,1 run,he moves well down the leg side to make room and punches this to cover"}, {"ball": 5.6, "isHighlight": false, "text": "Shakib Al Hasan to Karthik,1 run,he comes forward and tucks this to square leg for another easy single"}, {"ball": 5.6, "isHighlight": false, "text": "Umesh to continue"}, {"ball": 6.1, "isHighlight": false, "text": "UT Yadav to Karthik,1 run,the batsman comes forward and square drives this to deep point for a single"}, {"ball": 6.1, "isHighlight": false, "text": "rssampat: \"KP's playing & running between the wickets show's how unsure he is of his own batting. He simply cannot keep coming in at No:3 with this mindset which is seriously creating problems for the DD cause as soon as they lose 1, they are down 2 without much on the board.\""}, {"ball": 6.2, "isHighlight": false, "text": "UT Yadav to Vijay,1 leg bye,tries to flick the length delivery to fine leg, but it runs to short fine leg off the pads"}, {"ball": 6.3, "isHighlight": false, "text": "UT Yadav to Karthik,1 wide,attempts a slower delivery, but this is way down the leg side"}, {"ball": 6.3, "isHighlight": false, "text": "UT Yadav to Karthik,no run,that's solid Test-match like defence from DK. He comes forward, meets the ball under his eye, hold the defensive pose for a few seconds"}, {"ball": 6.4, "isHighlight": false, "text": "UT Yadav to Karthik,2 runs,rises with the ball and punches it to deep extra cover for a couple"}, {"ball": 6.5, "isHighlight": false, "text": "UT Yadav to Karthik, $$FOUR$$ ,that's hard on the bowler as this runs off the glove.. It shot up from a length, but to kiss the glove and run down fine on the off side"}, {"ball": 6.6, "isHighlight": false, "text": "UT Yadav to Karthik,1 run,he comes forward and punches the length delivery to long on"}, {"ball": 6.6, "isHighlight": false, "text": "Sajid: \"Poor KP. I think as always slow left arm did the tricks.. tight bowling from Shakib. Seems like KP just wanted to get rid of the strike from Slow-left arm! \""}, {"ball": 6.6, "isHighlight": false, "text": "Vinay Kumar comes in to bowl"}, {"ball": 7.1, "isHighlight": false, "text": "Vinay Kumar to Karthik,1 leg bye,starts off with a length delivery on the pads, the batsman looks to flick it, but gets an inside edge to fine leg"}, {"ball": 7.2, "isHighlight": false, "text": "Vinay Kumar to Vijay, $$SIX$$ ,here comes the big shot! Effortlessly down. He makes early move down the pitch and just chips the length delivery over the umpire's head.. all the way to the sight screen"}, {"ball": 7.3, "isHighlight": false, "text": "Vinay Kumar to Vijay,1 run,he moves across and punches the length delivery to deep midwicket for a single"}, {"ball": 7.3, "isHighlight": false, "text": "Prabhash Miri: \"KP has to prove a lot for ECB for his termination of contract. The way he is going to do that will prove ECB is 100% correct. \""}, {"ball": 7.4, "isHighlight": false, "text": "Vinay Kumar to Karthik,1 run,slower delivery, the batsman dabs it to point and calls for a quick single"}, {"ball": 7.4, "isHighlight": false, "text": "TJ: \"is it like when the international stars stop training with their international team they lose their steam...i remember a lot of players who couldnt keep up to etheir standards after they ended their net sessions with the national team...ponting, hussey, sachin, gillie, hayden... \""}, {"ball": 7.5, "isHighlight": false, "text": "Vinay Kumar to Vijay,1 run,he pushes the slower delivery softly towards midwicket for an easy single"}, {"ball": 7.6, "isHighlight": false, "text": "Vinay Kumar to Karthik, $$FOUR$$ ,he goes down on his knee even as the ball is released, picks it from wide outside off and drags it to deep backward square leg boundary"}, {"ball": 7.6, "isHighlight": false, "text": "Kallis comes back"}, {"ball": 8.1, "isHighlight": false, "text": "Kallis to Vijay,1 run,bowls an offcutter on the stumps, the batsman dabs it to cover and calls for a quick single"}, {"ball": 8.2, "isHighlight": false, "text": "Kallis to Karthik,no run,pushes this one wide outside off and DK has a poke at that, but he plays inside the line to be beaten"}, {"ball": 8.3, "isHighlight": false, "text": "Kallis to Karthik,2 runs,that's stylish! DK takes a step down the pitch and chases the wide delivery to chip it over extra cover.. But it lands well within the boundary"}, {"ball": 8.3, "isHighlight": false, "text": "Karthick: \"@prabhash: He had some bad times with ECB.That's the reason he was axed!!! It doesn't deal with his temporary form right now!! Well from your point of view,ECB should have axed entire ECB due to their bad performance after Ashes tour!! \""}, {"ball": 8.4, "isHighlight": false, "text": "Kallis to Karthik,1 run,walks across and whips the length delivery to midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Kallis to Vijay, $$FOUR$$ ,he shuffles across a touch to the offside and picks up the slower ball from the middle stump to flick it behind square .. Tendo slides in to stop that, but his boot was kissing the skirting.."}, {"ball": 8.6, "isHighlight": false, "text": "Kallis to Vijay, $$OUT$$ ,he has given it away.. Murali looks to launch the length delivery outside off to the long-on boundary.. But he never really looked in control.. Easy catch for Narine at the boundary"}, {"ball": 8.6, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$Narine$$ $$b$$ $$Kallis$$ $$24$$ $$(39m$$ $$20b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$120.00$$"}, {"ball": 8.6, "isHighlight": false, "text": "VN: \"I just fail to understand how can KP/Kirsten send Delhi's best batsman on current form so low in the order. It is just common sense that your best batsman (Duminy) needs to be out their in the middle and not warming the benches!\" --- They are working well to bring in JP early"}, {"ball": 8.6, "isHighlight": false, "text": "Shakib comes back after the time-out"}, {"ball": 9.1, "isHighlight": false, "text": "Shakib Al Hasan to Karthik,1 run,pushed through on the pads, the batsman defends it towards the vacant midwicket region for an easy single"}, {"ball": 9.1, "isHighlight": false, "text": "Over the wicket he goes"}, {"ball": 9.2, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,1 run,tossed up outside off, JP paddles it fine on the leg side"}, {"ball": 9.3, "isHighlight": false, "text": "Shakib Al Hasan to Karthik,1 run,he comes forward and drives this to long-on for a single"}, {"ball": 9.4, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,no run,he uses his feet and drives it back to the bowler"}, {"ball": 9.5, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,1 run,he stays deep in the crease and punches it down to long on for a single"}, {"ball": 9.6, "isHighlight": false, "text": "Shakib Al Hasan to Karthik,1 run,stays back and taps the quicker delivery to short fine leg for a single"}, {"ball": 10.1, "isHighlight": false, "text": "Kallis to Karthik, $$SIX$$ ,this is the same shot that AB played off Steyn the other night! Doesn't go that long, but goes long enough to clear the fine-leg boundary. He is down on his knee, across to the offside and helps it on its way over his shoulder"}, {"ball": 10.2, "isHighlight": false, "text": "Kallis to Karthik,no run,the bowler responds with a quick delivery outside off that beats the outside edge!"}, {"ball": 10.3, "isHighlight": false, "text": "Kallis to Karthik,1 run,gets hit on the body as he looks to clip this back of length delivery to the leg side"}, {"ball": 10.4, "isHighlight": false, "text": "Kallis to Duminy,1 run,slower delivery on off, the batsman waits an extra second and dabs it to point for a single"}, {"ball": 10.5, "isHighlight": false, "text": "Kallis to Karthik, $$FOUR$$ ,slower delivery, he spots it early and whacks it from wide outside off to the deep midwicket boundary.. He is playing some 100 million rupee shots here"}, {"ball": 10.6, "isHighlight": false, "text": "Kallis to Karthik, $$FOUR$$ ,and another one! This doesn't have that much room, but the batsman manages to cut it hard past point for yet another boundary"}, {"ball": 11.1, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,no run,he comes down the pitch and punches the flatter delivery to midwicket"}, {"ball": 11.2, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,2 runs,shorter and wider outside off, JP waits and cuts it behind point to pick up a couple to the deep"}, {"ball": 11.3, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,no run,he comes down the pitch again, the batsman though only pushes it back to Shakib"}, {"ball": 11.4, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,1 run,stays in the crease and punches it down to long on for a single"}, {"ball": 11.5, "isHighlight": false, "text": "Shakib Al Hasan to Karthik, $$OUT$$ ,it's the end! He was looking so good, but as he looks to whack this leg side delivery to deep backward square leg, what he manages is a top-edge that lobs up for Kallis at short fine leg"}, {"ball": 11.5, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Kallis$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$36$$ $$(28m$$ $$22b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$163.63$$"}, {"ball": 11.5, "isHighlight": false, "text": "Laxmi Shukla, out first ball in his last innings, is the next man"}, {"ball": 11.6, "isHighlight": false, "text": "Shakib Al Hasan to Duminy,no run,stays back and pushes the flatter delivery straight to midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Kishore: \"Not even a single player is from Delhi's playing XI. Like we have conditions for selecting foreign players in the playing XI, there should be a condition to include 3-4 local players in each team. There is no meaning in calling the team Delhi without even a player from Delhi representing it. It will also help the players in the domestic circuit to have exposure against international players.\""}, {"ball": 11.6, "isHighlight": false, "text": "Umesh comes back"}, {"ball": 12.1, "isHighlight": false, "text": "UT Yadav to Shukla,1 run,length delivery on off, the batsman pushes it straight to cover"}, {"ball": 12.2, "isHighlight": false, "text": "UT Yadav to Duminy,1 run,slower delivery on the pads, JP punches it to long-on with ease"}, {"ball": 12.3, "isHighlight": false, "text": "UT Yadav to Shukla,1 run,length delivery on the pads, clipped to fine leg for a single"}, {"ball": 12.3, "isHighlight": false, "text": "Rajat B: \"Can't really understand what prompted DD management to handover the captaincy to KP. Did they really check his record the last time he led RCB in 2009 - 2 wins in 6 maches to go with his 93 runs. Fast forward 2014 - 1 win in 4 matches and 56 runs. KP has scored a paltry 155 runs in the 11 IPL games (including today's game) as captain at an average of 15.5\""}, {"ball": 12.4, "isHighlight": false, "text": "UT Yadav to Duminy,1 wide,short ball attempted, but this is one is pounded on the bowler's half, sails way over the batsman"}, {"ball": 12.4, "isHighlight": false, "text": "UT Yadav to Duminy,no run,another good ball, it's slightly slower and on the stumps, the batsman pushes it straight to midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "UT Yadav to Duminy,1 run,another good ball, this is short of length and on the stumps, the batsman gets an inside edge to square leg for a single"}, {"ball": 12.5, "isHighlight": false, "text": "Sai: \"Again delhi doing the same mistake again and again. Why can't they send inform Jadhav ahead of Shukla? This is frustrating to see these delhi matches.\""}, {"ball": 12.6, "isHighlight": false, "text": "UT Yadav to Shukla, $$FOUR$$ ,whoa! He pulls out a boundary from nowhere and that too to a good shot. It was a good delivery on off but Shukla punches it firmly through extra cover.. no chance for the fielder in the deep"}, {"ball": 12.6, "isHighlight": false, "text": "Vinay Kumar comes back, he comes round the wicket"}, {"ball": 13.1, "isHighlight": false, "text": "Vinay Kumar to Duminy,2 runs,neatly punches the length delivery to wide mid-off to pick up a couple"}, {"ball": 13.1, "isHighlight": false, "text": "Parth Goyal: \"Why are people cribbing abt lack of \"local players\" in the teams?. Atleast there are 7 Indian players in each team. I guess this is good enough. Look at EPL, hardly any British players in the top 5-6 teams. If every IPL team were to have players from their state, they would be left with few choices when it comes to selecting a team. Dont repair whats not broken.\""}, {"ball": 13.2, "isHighlight": false, "text": "Vinay Kumar to Duminy,1 run,back of length delivery with no room, JP drops it towards cover point for a quick single"}, {"ball": 13.2, "isHighlight": false, "text": "Dave: \"@Rajat you're forgetting a crucial aspect of IPL decision making. Franchises are trying to maximise revenue and so I expect by choosing KP (after being sacked) they are hoping for high media coverage and shirt sales \""}, {"ball": 13.3, "isHighlight": false, "text": "Vinay Kumar to Shukla,no run,no feet movement from Shukla as he tries to steer this length delivery down to third man, misses"}, {"ball": 13.4, "isHighlight": false, "text": "Vinay Kumar to Shukla,no run,he makes good contact this time! That was cracked hard towards point, but the fielder dives to his left to cut it off"}, {"ball": 13.4, "isHighlight": false, "text": "Shopnil: \"Everybody tends to forget how well Shakib Al Hasan has been bowling. An excellent bowling figure, did his part of checking runs while the other side is leaking it. Great work, best of luck to Shakib while he comes out to bat on behalf of 160 million Bangladeshis. \""}, {"ball": 13.5, "isHighlight": false, "text": "Vinay Kumar to Shukla,1 run,slower delivery outside off, Shukla stays in the crease and whips it to deep midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Vinay Kumar to Duminy,1 run,slower delivery outside off, JP waits before running it down to third man for a single"}, {"ball": 14.1, "isHighlight": false, "text": "UT Yadav to Duminy,1 run,length delivery outside off, JP comes forward and caresses it to deep cover"}, {"ball": 14.2, "isHighlight": false, "text": "UT Yadav to Shukla,no run,oh this almost carried to the keeper! it was a slower delivery and Shukla wanted to guide it to third man, ended up guiding it to the keeper.. it just drops short of him"}, {"ball": 14.3, "isHighlight": false, "text": "UT Yadav to Shukla,1 run,fires in a yorker that the batsman flicks straight to square leg.. Shakib fires a throw, but misses"}, {"ball": 14.4, "isHighlight": false, "text": "UT Yadav to Duminy,1 run,slower delivery on the pads, the batsman clips it to deep midwicket for a single"}, {"ball": 14.4, "isHighlight": false, "text": "Snehil: \"@Rajat, I agree with your point that KP has an abysmal record as captain in the IPL. But looking at the Delhi lineup, I don't see any player who can lead the team. And I was not at all impressed by DK's captaincy.\""}, {"ball": 14.5, "isHighlight": false, "text": "UT Yadav to Shukla,no run,he almost chops this on.. it was just about heading for the leg stump before Shukla booted it away"}, {"ball": 14.6, "isHighlight": false, "text": "UT Yadav to Shukla,1 run,slower delivery on the pads, Shukla was already making room and drives this to deep midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Harshil: \"@Snehil: You're forgetting that Delhi have Kiwis (ex) captain, Ross Taylor warming the bench\""}, {"ball": 14.6, "isHighlight": false, "text": "Narine comes back"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Shukla,no run,that's a  $$drop$$  by  Shakib! The batsman defends it to cover.. and Shakib ran in, got there, but is not able to hold on"}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Shukla,no run,now looks to sweep it across the line and gets punched on the helmet grill"}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Shukla,1 run,this one is on the leg stump line and Shukla gets some proper contact, sweeps it firmly to deep backward square leg"}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Duminy,1 run,he waits in the crease and defends the incoming delivery to point"}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Shukla, $$OUT$$ ,this is too good! it was quicker and honing in on the middle stump. Shukla moved to the leg side expecting it to turn into him, but this just goes straight on and flattens the middle stump"}, {"ball": 15.5, "isHighlight": false, "text": "$$LR$$ $$Shukla$$ $$b$$ $$Narine$$ $$10$$ $$(21m$$ $$14b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$71.42$$"}, {"ball": 15.5, "isHighlight": false, "text": "Kedar Jadhav comes in"}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Jadhav,1 run,walks across to the offstump, the batsman works it away to square leg for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Delhi need more runs here as this pitch seems to be very good for batting.. unlike the slow pitches of Kotla of old."}, {"ball": 15.6, "isHighlight": false, "text": "Vinay Kumar is in"}, {"ball": 16.1, "isHighlight": false, "text": "Vinay Kumar to Jadhav, $$FOUR$$ ,he gets room outside off and he cashes in on it, smashing it through backward point with a powerful cut shot"}, {"ball": 16.2, "isHighlight": false, "text": "Vinay Kumar to Jadhav,no run,length delivery outside off, Kadhav doesn't move his feet but punches it to mid-off"}, {"ball": 16.3, "isHighlight": false, "text": "Vinay Kumar to Jadhav, $$SIX$$ ,where has this gone! Over the ugly stands behind the bowler.. It was a slower ball.. KJ generated some momentum coming down the pitch and whacks it long .. All the way to the top"}, {"ball": 16.3, "isHighlight": false, "text": "Vinay gets some advice from Kallis and Gambhir"}, {"ball": 16.3, "isHighlight": false, "text": "Milind: \"This pair of Jadhav - JP needs to be promoted up the order. With 4 overs remaining , even if they add another 50 runs (best case) . A 150-160 target is pretty difficult to defend in Delhi!\""}, {"ball": 16.4, "isHighlight": false, "text": "Vinay Kumar to Jadhav,1 run,fuller delivery outside off, he crisply times it to deep cover but just a single this time"}, {"ball": 16.5, "isHighlight": false, "text": "Vinay Kumar to Duminy,1 run,it's a low full toss on off stump from round the wicket, JP drives it to long on for a single"}, {"ball": 16.6, "isHighlight": false, "text": "Vinay Kumar to Jadhav,1 run,moves to the leg side and Vinay chases him with a short of length delivery, the batsman flat-bats it to long on without much timing"}, {"ball": 17.1, "isHighlight": false, "text": "Narine to Jadhav,1 run,tossed up delivery on off, Jadhav calmly dabs it to long on for a single"}, {"ball": 17.2, "isHighlight": false, "text": "Narine to Duminy, $$SIX$$ ,that's flat and that's in the KKR dug out! It was full and JP stays low before pulling out a powerful slog sweep"}, {"ball": 17.3, "isHighlight": false, "text": "Narine to Duminy,1 run,flatter and on the pads, the batsman dabs it to square leg for a quick single"}, {"ball": 17.4, "isHighlight": false, "text": "Narine to Jadhav, $$FOUR$$ ,he is beaten by the wrong one here but he gets four for that! KJ was charging down the ground, gets a thick outside edge that sails between point and short third man"}, {"ball": 17.5, "isHighlight": false, "text": "Narine to Jadhav, $$FOUR$$ ,this round goes to the batsman! He waits and waits, before opening the face of the bat very late to steer it very fine on the off side"}, {"ball": 17.6, "isHighlight": false, "text": "Narine to Jadhav,1 run,tucks this one to square leg for an easy single"}, {"ball": 17.6, "isHighlight": false, "text": "Kallis replaces Vinay"}, {"ball": 18.1, "isHighlight": false, "text": "Kallis to Jadhav,1 run,bowls a short delivery on off but the batsman misses out as he hits it straight to point"}, {"ball": 18.2, "isHighlight": false, "text": "Kallis to Duminy, $$SIX$$ ,thank you very much says JP! he smashes this low full toss outside off to the top tier of that ugly stand again.."}, {"ball": 18.3, "isHighlight": false, "text": "Kallis to Duminy,no run,looks to play the ramp shot by moving way across to the off side.. but misses"}, {"ball": 18.3, "isHighlight": false, "text": "Mridul Shandily: \"At the risk of jinxing it, let me tell you that KJ has not been dismissed in 4 innings this IPL. \""}, {"ball": 18.4, "isHighlight": false, "text": "Kallis to Duminy,1 run,gets in a yorker outside off but JP thumps it all along the ground to long on"}, {"ball": 18.5, "isHighlight": false, "text": "Kallis to Jadhav,4 leg byes,the bowler wins this round, but the batsman takes the points.. KJ was looking to pull this sharp bouncer, but he misses, gets hit on his hip and the ball slides to the right of the keeper, all the way to the boundary"}, {"ball": 18.6, "isHighlight": false, "text": "Kallis to Jadhav,no run,bowls a wide yorker with which the batsman makes no connection"}, {"ball": 19.1, "isHighlight": false, "text": "Narine to Duminy,1 run,this one is a big offspinner and keeps spinning away from Duminy, but he still drags it to cow corner"}, {"ball": 19.2, "isHighlight": false, "text": "Narine to Jadhav,1 run,here comes the slog sweep that doesn't really care about which way the ball is spinning, picks up a single to deep backward square leg"}, {"ball": 19.3, "isHighlight": false, "text": "Narine to Duminy,2 runs,fires in a low full toss on the stumps that Duminy clips to deep square leg for a quick couple"}, {"ball": 19.4, "isHighlight": false, "text": "Narine to Duminy,1 run,wide outside off but JP drags it to the cow corner with a sweep.. there is a fielder in place for that"}, {"ball": 19.5, "isHighlight": false, "text": "Narine to Jadhav,1 run,this is fired in on off stump.. 119 kph.. The batsman digs it out to point for a single"}, {"ball": 19.6, "isHighlight": false, "text": "Narine to Duminy, $$SIX$$ ,Duminy was waiting for some space and he gets a low full toss on off that is hammered back over the bowler's head"}, {"ball": 19.6, "isHighlight": false, "text": "55 runs these two have added in 4.1 overs. That is exactly what they needed and this could be a good score given the fragility in KKR's batting. How DD would have hoped for this onslaught to last a little longer!"}, {"ball": 19.6, "isHighlight": false, "text": "Keshabraj: \"How come every-time around in 15th overs, Duminy and Jadav get together !! #coincidentOrMasterplan ?? \""}, {"ball": 19.6, "isHighlight": false, "text": "Bengani: \"With that 6 off the last ball, JP Duminy has joined the elite company of Suresh Raina and Manpreet Gony (Yes, that long lost medium pacer from CSK and Punjab) as the only batsmen to have hit Sunil Narine for 2 or more sixes. \""}], "name": "Delhi Daredevils v Kolkata Knight Riders", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733985.html?innings=1;view=commentary", "match_num": 28}