{"commentary": [{"ball": 0, "isHighlight": false, "text": "The teams are already here. it's a contest between the weaker suits of both teams - KKR's batting v DD's bowling.. Still, with a decent total on, DD might be feeling good about this. Robin Uthappa and Gautam Gambhir are here. Mohammed Shami to begin. One slip in place"}, {"ball": 0.1, "isHighlight": false, "text": "Mohammed Shami to Uthappa,no run,big outswinger at 140 kph from Shami.. Uthappa chases this one as this is wide but is beaten"}, {"ball": 0.2, "isHighlight": false, "text": "Mohammed Shami to Uthappa,1 run,fuller on the the off and middle line this time, there is still some shape on that but it's flicked down to fine leg for a single"}, {"ball": 0.2, "isHighlight": false, "text": "A leg slip in place for GG"}, {"ball": 0.3, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,good line to Gambhir! It swings a touch towards the off stump, Gambhir pushes it to cover"}, {"ball": 0.4, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,back of length delivery on the pads, Gambhir mistimes it to midwicket - it was in the air for a bit - and charges out of the crease before turning back. Vijay fires the throw in that misses the stumps"}, {"ball": 0.5, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,back of length delivery outside off, Gambhir plays his trademark guide down to third man"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami to Uthappa,no run,another one beats the outside edge! This one is outside off, pitches on a length before darting away. Uthappa looks to drives but is beaten by the movement"}, {"ball": 0.6, "isHighlight": false, "text": "Wayne Parnell to start from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Parnell to Gambhir,no run,he looks to flick this fuller length delivery to the leg side, but is beaten by the inward movement in it, gets hit on the pads.. he looks to sneak in a single but he doesn't know the ball is right in front of him.. Parnell boots it towards the stumps and would have got Gambhir had it hit"}, {"ball": 1.2, "isHighlight": false, "text": "Parnell to Gambhir, $$FOUR$$ ,marginally short! this is a superb pull. He leans back and cracks it over midwicket with a lot of timing"}, {"ball": 1.3, "isHighlight": false, "text": "Parnell to Gambhir,1 leg bye,on the pads again - there is a leg slip in place - but Gambhir misses his flick. Gets a leg bye instead"}, {"ball": 1.4, "isHighlight": false, "text": "Parnell to Uthappa,no run,he misses out - looks like he didn't spot this early enough - it was a low full toss and the batsman defends it to point"}, {"ball": 1.5, "isHighlight": false, "text": "Parnell to Uthappa, $$FOUR$$ ,that is past the bowler at a catchable height but it was hit with extreme timing! It was a length delivery that was punched past the left of the bowler"}, {"ball": 1.6, "isHighlight": false, "text": "Parnell to Uthappa,4 leg byes,full and swinging, but the line is wrong as it's down the leg side.. It clips the pads to run to the fine leg boundary"}, {"ball": 2.1, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,back of length delivery on off, Gambhir chops it down to third man"}, {"ball": 2.2, "isHighlight": false, "text": "Mohammed Shami to Uthappa, $$FOUR$$ ,that is beautifully punched over midwicket! Uthappa plays a short-arm jab to one that comes in to him, timed it perfectly. That actually hit the sticker of the bat first, then the middle  -  he hit it twice. Amazing replay that one"}, {"ball": 2.3, "isHighlight": false, "text": "Mohammed Shami to Uthappa, $$FOUR$$ ,a tailender's boundary this one! it was a short of length delivery outside off and Uthappa looks to pull it out of the ground only to get a thick outside edge to the third-man boundary"}, {"ball": 2.4, "isHighlight": false, "text": "Mohammed Shami to Uthappa,1 run,length delivery on off, the batsman pushes it to the left of mid-on for a single"}, {"ball": 2.5, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,slower short ball on the off stump line, Gambhir rolls his wrist as he plays this pull to deep square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Mohammed Shami to Uthappa,1 run,he comes forward and pushes this to mid-on for a single"}, {"ball": 3.1, "isHighlight": false, "text": "Parnell to Uthappa,1 run,looks to pull the short of length delivery from outside off but gets an inside edge on to his boots.. The ball is deflected to cover and it's almost a run-out.. The throw is a bit wild though"}, {"ball": 3.2, "isHighlight": false, "text": "Parnell to Gambhir,1 run,he presses forward and crashes the length delivery in front of point, but is not able to beat the fielder"}, {"ball": 3.3, "isHighlight": false, "text": "Parnell to Uthappa,no run,comes down the pitch but yorks himself, digs out the ball to cover"}, {"ball": 3.4, "isHighlight": false, "text": "Parnell to Uthappa,no run,another full delivery, this time it's on off stump. Uthappa punches it to mid-off"}, {"ball": 3.4, "isHighlight": false, "text": "Ramesh: \"That pull shot from Uthappa hit his bat twice. It was OUT in backyard cricket back in my childhood!\""}, {"ball": 3.5, "isHighlight": false, "text": "Parnell to Uthappa,1 run,length delivery on the pads, the batsman nudges it to the right of midwicket for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Parnell to Gambhir,no run,back of length delivery on the body, Gambhir looks to work it away on the on side but gets hit on the body"}, {"ball": 3.6, "isHighlight": false, "text": "Shukla comes in first change.. He has a good game with the ball the last time"}, {"ball": 4.1, "isHighlight": false, "text": "Shukla to Uthappa,1 wide,bowls this one smartly! He sees the batsman come out of the crease and fires it wide outside off.. Unfortunately the umpire calls it in the batsman's favour"}, {"ball": 4.1, "isHighlight": false, "text": "Shukla to Uthappa,1 run,this lands safely at midwicket! He looks to pull the short of length delivery - it surprises him with the pace and hits the splice of the bat to lob towards midwicket where there is no one"}, {"ball": 4.2, "isHighlight": false, "text": "Shukla to Gambhir,1 leg bye,back of length on the pads, the batsman picks a leg bye as it hits the thigh pad"}, {"ball": 4.3, "isHighlight": false, "text": "Shukla to Uthappa,no run,collision between the bowler and the batsman! Uthappa was looking to do a KP but common sense prevails.. He turns back but a charging Shukla barges into him"}, {"ball": 4.4, "isHighlight": false, "text": "Shukla to Uthappa,1 run,looks to work the length delivery to the leg side but gets an inside edge to square leg"}, {"ball": 4.5, "isHighlight": false, "text": "Shukla to Gambhir,2 runs,that's a hit me delivery! Shukla is lucky the fielder was there at the deep.. It was short, not so quick, outside off and Gambhir punched it hard to deep extra cover"}, {"ball": 4.6, "isHighlight": false, "text": "Shukla to Gambhir, $$SIX$$ ,the extra delivery brings bonus six runs! Full, on the pads, meets Gambhir's swing and disappears over midwicket"}, {"ball": 4.6, "isHighlight": false, "text": "Sid Kaul comes in"}, {"ball": 5.1, "isHighlight": false, "text": "Kaul to Uthappa,2 runs,starts off with a good back of length delivery that is clipped straight to square leg where Shukla allows it to go through his legs.."}, {"ball": 5.2, "isHighlight": false, "text": "Kaul to Uthappa,1 run,length delivery outside off, the batsman dabs it to point for a quick single"}, {"ball": 5.3, "isHighlight": false, "text": "Kaul to Gambhir,4 leg byes,beautiful delivery! It pitches on leg stump and curves in to the batsman to hit the thigh pad.. but it is deflected past a diving DK to the third man boundary"}, {"ball": 5.4, "isHighlight": false, "text": "Kaul to Gambhir,2 runs,back of length delivery on the stumps, Gambhir nudges it in the gap between short fine leg and backward square leg for a couple"}, {"ball": 5.5, "isHighlight": false, "text": "Kaul to Gambhir,no run,slower delivery from Kaul! It beats the batsman - it actually takes the edge and is dropping to DK who fluffs the low chance..DK had to dive forward as this was coming slow at him and looks like he misjudged the dipping trajectory. Goes down as a  $$drop$$"}, {"ball": 5.6, "isHighlight": false, "text": "Kaul to Gambhir,1 run,dabs the short of length delivery to short third man"}, {"ball": 5.6, "isHighlight": false, "text": "JP Duminy gets the ball, round the wicket he comes"}, {"ball": 6.1, "isHighlight": false, "text": "Duminy to Gambhir,1 run,tossed up delivery on the leg stump line, Gambhir neatly tucks it to deep backward square leg"}, {"ball": 6.2, "isHighlight": false, "text": "Duminy to Uthappa,1 run,flatter delivery outside off, the batsman waits on the back foot before punching it to wide long off"}, {"ball": 6.3, "isHighlight": false, "text": "Duminy to Gambhir,1 run,slower this time, it's loopy too.. Gambhir comes forward and nudges it to deep square leg"}, {"ball": 6.4, "isHighlight": false, "text": "Duminy to Uthappa,1 run,he comes down the pitch and punches the flatter delivery to deep midwicket for a single"}, {"ball": 6.5, "isHighlight": false, "text": "Duminy to Gambhir,1 run,tossed up, but this on the leg stump line, Gambhir tickles it down to fine leg for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Uthappa, $$SIX$$ ,he comes down the pitch, gets a tossed up delivery on the middle stump line and he launches into that one, hitting it over cow corner for a huge hit"}, {"ball": 6.6, "isHighlight": false, "text": "Kishore: \"KKR progressing in the same way they did in the last match. Hope their middle-order do not repeat what they did in the previous match.\""}, {"ball": 6.6, "isHighlight": false, "text": "Shahbaz Nadeem comes in for the first time"}, {"ball": 7.1, "isHighlight": false, "text": "Nadeem to Gambhir, $$FOUR$$ ,now Gambhir repeats the shot Robin played off the last ball, but he doesn't look to hit this to the Purana Qila, times it over midwicket for a one-bounce four"}, {"ball": 7.1, "isHighlight": false, "text": "Over the wicket now"}, {"ball": 7.2, "isHighlight": false, "text": "Nadeem to Gambhir,no run,tossed up delivery on off, comes in to Gambhir, who pushes it to cover"}, {"ball": 7.3, "isHighlight": false, "text": "Nadeem to Gambhir,1 leg bye,he comes out of the crease but is nowhere near the pitch of the ball, it hits the pads and they take a leg-bye to midwicket"}, {"ball": 7.3, "isHighlight": false, "text": "Back round the wicket"}, {"ball": 7.4, "isHighlight": false, "text": "Nadeem to Uthappa,1 run,he stays in the crease and works this away to deep midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Nadeem to Gambhir,2 runs,flatter and outside off, Gambhir chops it to the right of deep point for a couple"}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem to Gambhir,1 run,shorter this time, Gambhir pulls it down to long-on for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Cliff: \"Are KKR finally going to pull victory from the jaws of victory?\""}, {"ball": 7.6, "isHighlight": false, "text": "Shami comes back.. DD need a wicket"}, {"ball": 8.1, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,length delivery on off, Gambhir punches it back to the bowler"}, {"ball": 8.2, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,this stays a touch low after pitching short of length.. Gambhir, who was hopping, gets a toe end towards mid-off and calls for a quick single"}, {"ball": 8.3, "isHighlight": false, "text": "Mohammed Shami to Uthappa,1 run,slower delivery outside off, easily punched down to long on for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Dr.Purnesh: \"KKR need not to do anything foolish here. They hav done their hard work and now look for 1s-2s and for that odd boundary till the 13th over or so, need atleast one of these batsman to anchor the innings throughout and not to repeat the mistake of the last match\""}, {"ball": 8.4, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,short ball! Gambhir is always a keen puller.. he gets a top-edge that lands safely short of fine leg"}, {"ball": 8.5, "isHighlight": false, "text": "Mohammed Shami to Uthappa,1 run,he comes down the pitch and punches the length delivery to wide mid-off for a single"}, {"ball": 8.5, "isHighlight": false, "text": "andy: \"DD needs a miracle not a wicket...\""}, {"ball": 8.6, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,waits in the crease and slices the length delivery down to third man for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Kaul is here.."}, {"ball": 9.1, "isHighlight": false, "text": "Kaul to Gambhir, $$FOUR$$ ,bowls a short of length delivery outside off but at his pace he is not going to scare anyone.. Gambhir clears his front leg out and hammers it over midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Kaul to Gambhir,1 run,he calmly guides this one down to third man for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Kaul to Uthappa,2 runs,length delivery on the pads, Robin looks to clip it to square leg but gets a thick leading edge to deep midwicket"}, {"ball": 9.3, "isHighlight": false, "text": "$$Starc$$ $$fined$$ $$50%,$$ $$Pollard$$ $$fined$$ $$75%$$ $$of$$ $$their$$ $$match$$ $$fees$$ $$..$$ $$clearly$$ $$getting$$ $$away$$ $$with$$ $$a$$ $$deserved$$ $$harsher$$ $$punishment$$"}, {"ball": 9.4, "isHighlight": false, "text": "Kaul to Uthappa,1 run"}, {"ball": 9.5, "isHighlight": false, "text": "Kaul to Gambhir, $$FOUR$$ ,this is beautifully hit! Takes you back to the days when Gambhir was 28.. He plants his front foot out and drives it handsomely, in the air, through the gap at extra cover"}, {"ball": 9.6, "isHighlight": false, "text": "Kaul to Gambhir,1 run,length delivery on the stumps, Gambhir dabs it to cover and calls for a quick single"}, {"ball": 10.1, "isHighlight": false, "text": "Nadeem to Gambhir,1 run,flatter delivery on the stumps, Gamhbir stays back and pulls it to deep midwicket for a single"}, {"ball": 10.2, "isHighlight": false, "text": "Nadeem to Uthappa,1 run,he comes forward and pushes this softly to cover for a single"}, {"ball": 10.2, "isHighlight": false, "text": "Johan Rossouw: \"With all the money players are making these days, taking away their game time is really the only punishment that will really mean something.\""}, {"ball": 10.3, "isHighlight": false, "text": "Nadeem to Gambhir,1 run,he is very very very lucky here! Gambhir charged out of the pitch and looked to hit it over midwicket, but gets a thick edge that stays up for a long time only to descend at the vacant mid-off area"}, {"ball": 10.4, "isHighlight": false, "text": "Nadeem to Uthappa, $$FOUR$$ ,this is nicely done from Uthappa! it's a short delivery outside off, Uthappa waits on the back foot before punching it over extra cover"}, {"ball": 10.5, "isHighlight": false, "text": "Nadeem to Uthappa, $$FOUR$$ ,another short ball, this is asking to be hit.. Uthappa goes leg side this time, hammering it along the ground to deep midwicket boundary"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to Uthappa,1 run,length delivery on the stumps, the batsman punches it down to long on for a single"}, {"ball": 10.6, "isHighlight": false, "text": "Parnell comes back"}, {"ball": 11.1, "isHighlight": false, "text": "Parnell to Uthappa,no run,bowls length delivery outside off, the batsman comes forward and drives it straight to cover"}, {"ball": 11.2, "isHighlight": false, "text": "Parnell to Uthappa,1 run,another smart punch! He comes forward and punches it down to long off for a single.. no risks being taken"}, {"ball": 11.3, "isHighlight": false, "text": "Parnell to Gambhir,2 runs,fuller delivery outside off, Gambhir swipes at it to hit it to deep midwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Parnell to Gambhir,1 run,back of length delivery on the stumps, Gambhir tucks it to square leg for a single"}, {"ball": 11.4, "isHighlight": false, "text": "Anurag Arora: \"It's time ICC creates a new punishment where the player will have to play upcoming matches but they won't be allowed to bat or bowl and instead will have to field. In order to make this part of team decipline, they would not want any player to behave badly as the same player would become burden for the team in next matches. This penalty can be then be set of number of matches based on kind of offense player makes.\""}, {"ball": 11.5, "isHighlight": false, "text": "Parnell to Uthappa, $$OUT$$ ,the finger has been raised after a pause! Uthappa was looking to punch this down the ground, but he was walking into this shot.. so slightly off balance.. he plays outside the line of the delivery and is in front of off stump. Good decision by the umpire. Uthappa misses out on a half-century"}, {"ball": 11.5, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$lbw$$ $$b$$ $$Parnell$$ $$47$$ $$(59m$$ $$34b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$138.23$$"}, {"ball": 11.5, "isHighlight": false, "text": "Manish Pandey, out of 0 off 0 balls last match, is here"}, {"ball": 11.6, "isHighlight": false, "text": "Parnell to Pandey,1 run,not quite the delivery Tambe produced  as Parnell bowls length on the pads.. Pandey tucks it to square leg to get off the mark"}, {"ball": 11.6, "isHighlight": false, "text": "Hrishi: \"@Anurag: Why allow him field either? Show him red card and let team play with only 10 :)\""}, {"ball": 12.1, "isHighlight": false, "text": "Nadeem to Pandey,1 run,tossed up and full on off, the batsman drives it down to long off"}, {"ball": 12.2, "isHighlight": false, "text": "Nadeem to Gambhir,2 runs,he comes out of the crease to make the tossed up delivery a half-volley and chips it inside out for a couple of runs"}, {"ball": 12.3, "isHighlight": false, "text": "Nadeem to Gambhir,1 run,another one chipped, but this time over the midwicket fielder, for a single that brings him his  $$second$$ $$half-century$$"}, {"ball": 12.4, "isHighlight": false, "text": "Nadeem to Pandey,3 runs,tossed up delivery wide outside off, the batsman leans forward and slices it through the gap at backward point.. Lots of timing there and they pick up three"}, {"ball": 12.5, "isHighlight": false, "text": "Nadeem to Gambhir,1 run,slower and tossed up outside off, the batsman chops it towards point for a single"}, {"ball": 12.6, "isHighlight": false, "text": "Nadeem to Pandey,1 run,slower still, Pandey waits and pushes it to cover for asingle"}, {"ball": 12.6, "isHighlight": false, "text": "Shukla to start after the time out"}, {"ball": 13.1, "isHighlight": false, "text": "Shukla to Pandey, $$FOUR$$ ,bowls a gentle half-volley outside off, it's neatly driven through extra cover.. that is not going to test anyone"}, {"ball": 13.2, "isHighlight": false, "text": "Shukla to Pandey,1 run,length delivery on the stumps, Pandey pushes it to long on for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Shukla to Gambhir,1 run,length delivery outside off, Gambhir loves to dab to third man and he does it again"}, {"ball": 13.4, "isHighlight": false, "text": "Shukla to Pandey,1 run,length delivery on the pads, the batsman clips it straight to short fine leg"}, {"ball": 13.5, "isHighlight": false, "text": "Shukla to Gambhir,1 run,he looks to drive it over cover but gets a thick outside edge over the hovering gully fielder"}, {"ball": 13.5, "isHighlight": false, "text": "Gambhir is waving towards the dug out as something has gone in his eye.. A bug maybe.. There were a few of them - even big moths - the other night.. Don't see the big ones today though. This is something small that is bothering Gambhir.. It's not one of those $$Atlas$$ $$moths$$ .."}, {"ball": 13.6, "isHighlight": false, "text": "Shukla to Pandey,no run,length delivery outside off, Pandey leans into his drive but can't find the gap. hits it straight to cover"}, {"ball": 13.6, "isHighlight": false, "text": "Srini: \"It is so pleasing to see GG back in form and hitting those confident pulls thru mid wkt and inside out cover drives (not to mention those late square cuts). He is one of those rare talents at the top of the order who can bat well in either of the extreme formats (read Tests and 20-20). Keep it going pocket dynamo!!!\""}, {"ball": 13.6, "isHighlight": false, "text": "Shami comes back.. can he do a Watson?"}, {"ball": 14.1, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,almost! This skids past the outside edge as Gambhir looks to guide it to third man"}, {"ball": 14.2, "isHighlight": false, "text": "Mohammed Shami to Gambhir,1 run,this time he looks to hit the length ball to midwicket but gets a thick outside edge that just lands short of third man"}, {"ball": 14.3, "isHighlight": false, "text": "Mohammed Shami to Pandey,1 run,run-out chance! Gambhir had given up as Nadeem got to the ball quickly at midwicket and aimed at the non-striker.. but he misses, gives away an extra run too"}, {"ball": 14.4, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,slower delivery outside off, Gambhir cuts it straight to gully"}, {"ball": 14.5, "isHighlight": false, "text": "Mohammed Shami to Gambhir,no run,fires in a yorker and Gambhir digs it out to gully again"}, {"ball": 14.6, "isHighlight": false, "text": "Mohammed Shami to Gambhir,2 runs,shorter delivery on the body, it was a touch slower and Gambhir slaps it towards deep square leg.. Good that there is not much timing in this as it lands well short.. Slight fumble from Jadhav allows a second"}, {"ball": 14.6, "isHighlight": false, "text": "Sid Kaul comes back.. KP sets the field with him frantically"}, {"ball": 15.1, "isHighlight": false, "text": "Kaul to Pandey,2 runs,short of length delivery outside off, again, he lacks the pace to trouble the batsman.. Pandey pulls him off front foot to deep square leg"}, {"ball": 15.2, "isHighlight": false, "text": "Kaul to Pandey,2 runs,length delivery on the pads, easily punched to deep midwicket where fumble by Murali Vijay now allows a second"}, {"ball": 15.3, "isHighlight": false, "text": "Kaul to Pandey,1 run,he does a GG, guides the length delivery down to third man for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Sriram: \"So a great coach doesn't gaurantee a winning formula. Its the players that matters. Gary Kirsten does not gaurantee WC to SA or IPL Championship to DD. Its those men in the middle that need to do the job! #coachingoverhyped\""}, {"ball": 15.4, "isHighlight": false, "text": "Kaul to Gambhir,no run,fires in a yorker outside off, Gambhir looks to dig it out to third man but makes no connection"}, {"ball": 15.5, "isHighlight": false, "text": "Kaul to Gambhir, $$FOUR$$ ,Vijay is losing it in the field! It's a simple pick up at deep cover after Gambhir has played a solid punch, but he allows it to run through his legs"}, {"ball": 15.5, "isHighlight": false, "text": "Harish Varanasi: \"Required Hypnosis treatment for Murali Vijay, each match we need to get him to believe that he is still a part of CSK and that he is playing under Dhoni.\""}, {"ball": 15.6, "isHighlight": false, "text": "Kaul to Gambhir,1 run,fuller delivery outside off, Gambhir guides it to third man again.. JP, from gully, dives valiantly but he was not really close to that"}, {"ball": 15.6, "isHighlight": false, "text": "Naveed: \"Everyone is talking about Gambir's first four innings...Despite of failing in those innings he is ahead leading in score from Kohli...that shows how dangerous Gambir can be in-Form.\""}, {"ball": 15.6, "isHighlight": false, "text": "JP comes round the wicket"}, {"ball": 16.1, "isHighlight": false, "text": "Duminy to Gambhir,1 run,bowls this one wide outside off, easily pushed to deep cover for a single"}, {"ball": 16.1, "isHighlight": false, "text": "Aravind: \"@Sriram: That holds true only in IPL where there is no time to improve a team , work on strategies. Kirsten's coaching is surely not overhyped .. He worked with Indian team for a long time to get them to number 1 in tests and ODIs\""}, {"ball": 16.2, "isHighlight": false, "text": "Duminy to Pandey, $$FOUR$$ ,this one is short and wide, that is murdered through extra cover with a powerful front-foot swipe"}, {"ball": 16.3, "isHighlight": false, "text": "Duminy to Pandey,1 run,fuller and wider outside off, easily creamed to deep cover for a single"}, {"ball": 16.4, "isHighlight": false, "text": "Duminy to Gambhir,no run,slower this time, Gambhir looks to push it to cover, but gets an inside edge back down the pitch"}, {"ball": 16.5, "isHighlight": false, "text": "Duminy to Gambhir, $$SIX$$ ,he takes a step down and hammers it over the bowler's head.. clean hit, all the way to the sight screen"}, {"ball": 16.6, "isHighlight": false, "text": "Duminy to Gambhir,1 run,flatter delivery, easily punched to long off for a single"}, {"ball": 16.6, "isHighlight": false, "text": "Sam: \"The Indian opening pair candidates are doing so well, GG, Rohit, a couple of good innings by Shikhar as well and yet it always comes down to Virat Kohli to save India in every match.\""}, {"ball": 16.6, "isHighlight": false, "text": "Parnell comes back"}, {"ball": 17.1, "isHighlight": false, "text": "Parnell to Gambhir,no run,fires it full on the stumps, Gambhir looks to whack it across the line but gets an inside edge on to his body"}, {"ball": 17.2, "isHighlight": false, "text": "Parnell to Gambhir, $$OUT$$ ,Whoa! DK takes a screamer! I was looking at the boundary but DK has leaped a few feet in the air to pluck that out of nowhere! Gambhir went for the pull on a short delivery and got a thick top edge that looked like it was going over the keeper, but DK catches it with his right hand.. Parnell, KP .. all are impressed with that"}, {"ball": 17.2, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$†Karthik$$ $$b$$ $$Parnell$$ $$69$$ $$(91m$$ $$56b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$123.21$$"}, {"ball": 17.2, "isHighlight": false, "text": "Kallis is in now"}, {"ball": 17.2, "isHighlight": false, "text": "Ahsen: \"I am very interested in how Kolkata is goin to mess it up now :P \" ---why does everyone love a bit of schadenfreude?"}, {"ball": 17.3, "isHighlight": false, "text": "Parnell to Kallis,no run,length delivery on the stumps, Kallis is a bit surprised by the extra bounce as he defends down the pitch"}, {"ball": 17.4, "isHighlight": false, "text": "Parnell to Kallis,no run,length delivery on off, the batsman pushes it straight to point"}, {"ball": 17.5, "isHighlight": false, "text": "Parnell to Kallis, $$FOUR$$ ,outside edge! There was a slip in place, but this would have gone to a second slip. Kallis went for the big drive but is lucky to get four for it"}, {"ball": 17.5, "isHighlight": false, "text": "Senthil: \"DK is a different kind of player. He does exceptionally well in pressure situations and does the hard job with batting as well as keeping but his problems are with easy ones\""}, {"ball": 17.6, "isHighlight": false, "text": "Parnell to Kallis,1 run,short delivery, Kallis takes his eyes off while playing the pull but still manages to control it, picks up a single to deep square leg"}, {"ball": 18.1, "isHighlight": false, "text": "Nadeem to Kallis, $$FOUR$$ ,tossed up and Kallis shows his class, driving this on the up through extra cover"}, {"ball": 18.2, "isHighlight": false, "text": "Nadeem to Kallis,1 run,slower delivery on the stumps, easily tucked to midwicket for an easy single"}, {"ball": 18.2, "isHighlight": false, "text": "Thanks for your comments and feedback.. time to move over to the next window where Chennai and Kings XI are fighting for the top position. This is Devashish Fuloria signing off. ciao ciao"}, {"ball": 18.2, "isHighlight": false, "text": "\"Especially after the last game, we wanted to finish this game,\" says Gambhir, who is also the $$man$$ $$of$$ $$the$$ $$match$$ . \"We wanted someone to bat through and luckily it was me today. Runs on the board always benefit, but this was a good wicket - it was coming on nicely. But Robin and I got the start. We have a lot of talent in the team and we need to finish more games. The way i started the tournament, i couldnt get a run. I was smiling from outside but deep down I was anxious. \""}, {"ball": 18.2, "isHighlight": false, "text": "This is how the previous match should have gone for KKR, but they have managed to correct the mistake this time. A very important win for KKR team, helps them move one rung up on the ladder out from the dungeon, still a long way to go though. Gambhir and Uthappa put up a 100-run partnership again, closing out the game in the process.. Delhi, unfortunately, didn't have the bowling attack to trouble anyone. It turned out to be a jaunt."}, {"ball": 18.2, "isHighlight": false, "text": "Ali: \"Good day for the Bengalis today. Athletico Kolkata has been unveiled today and now Cricketico Kolkata is looking in good form !! \" --- Isn't Knight Riders a bad enough name that you invent another?"}, {"ball": 18.2, "isHighlight": false, "text": "Arpit: \"So, Who gets the credit? Gambhir or his T-shirt ?\""}, {"ball": 18.2, "isHighlight": false, "text": "Gunjandeep: \"Delhi's lack of good spin attack is only matched by Kolkata's indifferent form of middle order. However, Another brilliant opening stand ensures that KKR are still good, DD around 20 Runs Short. What's Duminy doing Sooooo Low down the order anyways???\""}], "name": "Delhi Daredevils v Kolkata Knight Riders", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733985.html?innings=2;view=commentary", "match_num": 28}