{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.55$$ $$pm$$  We have confirmation that Cheteshewar Pujara and L Balaji are out of the XI. So Virender Sehwag has a new partner in Mandeep Singh. Chennai Super Kings are in the middle of their huddle. There's a slip in place as Ben Hilfenhaus charges in"}, {"ball": 0, "isHighlight": false, "text": "Satrajit: \"I second Prashant... I think this concept of shifting home games from one stadium to another just for the sake of spreading the IPL (maybe not entirely the reason this season) is absolutely rubbish! I still remember Deccan's home game in the 2010 season against MI at the DY Patil stadium!! The whole stadium was cheering for Sachin and MI! Nonsense!\" I counter with this lovely  $$discussion$$ among our Huddle panel. And the fact that Delhi had several empty seats during the evening game and Cuttack looks packed."}, {"ball": 0, "isHighlight": false, "text": "$$7.45$$ $$pm$$  ram: \"whom does mandeep and murali replace ?\" Cheteshwar Pujara and L Balaji"}, {"ball": 0, "isHighlight": false, "text": "Nandakiran N: \"Russel Vs Watson was bad. Pollard Vs Starc was ugly. Smith and Johnson are playing today. Just saying!\" If they've been keeping tabs on the news, this might be a pretty tame game. Pollard and Starc have been placed with hefty  $$fines$$  by the IPL"}, {"ball": 0, "isHighlight": false, "text": "Prashant: \"I fail to understand this \"home\" ground concept. It's supposed to be the ground where your team plays the most and hence has an advantage over the visiting team in terms of awareness of the conditions. If every so-called \"home\" game is going to be in a different stadium, what's the point of even calling it a home/away game?\""}, {"ball": 0, "isHighlight": false, "text": "deepanshu: \"Will be interesting to see sandy vs smith and mitch vs baz. Who will win ?\" I'd like to be cheeky and say us because we get to sit back and watch one swinging around corners and the other hurtling it at batsmen's helmets."}, {"ball": 0, "isHighlight": false, "text": "\"I think Baba is providing commentary feedback under Senthil's name.\" Our first conspiracy of the night, courtesy Priyank"}, {"ball": 0, "isHighlight": false, "text": "\"Good decision by Dhoni and CSK, since they never know what is par score when the opponent have Sehwag, Maxwell and Miller, so it's better to chase against the, but when he is going to play Baba Aparajith? Perhaps waiting for the Chennai ground?\" Even if they do play, Senthil, do you really he'll get too many chances to bat with that juggernaut line-up?"}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$  George Bailey is excited by the large size of the ground tonight as he gets ready for the toss. A pretty decent crowd is already raising the decibels around Cuttack.  $$Chennai$$ $$Super$$ $$Kings$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$chose$$ $$to$$ $$bowl$$  \"I don't think it will change too much in the second innings. Played a fair amount of under-16 and under-19 cricket here, but now it has a bit more grass on it\", says MS Dhoni. Kings XI have two changes: Mandeep Singh and Murali Kartik are in. Bailey was unsure of the track. And he's the home captain, remember."}, {"ball": 0, "isHighlight": false, "text": "Nick: \"Will there ever be a chance for Badree to be playing for CSK? One of the best bowlers in the World T20 and hasn't been used yet. Unbelievable!! \""}, {"ball": 0, "isHighlight": false, "text": "\"what is the behavior of the pitch in cuttak\" Well Sunjid, from memory it usually offers a free ride to the batsmen. I think the average IPL score is around 160. Bowlers beware. But there are some good ones on show today though. For more detail, dig into the  $$preview$$ , also  $$hacked$$  penned by yours truly"}, {"ball": 0, "isHighlight": false, "text": "$$7.20$$ $$pm$$  Alright, folks. It's a top of the table clash. We've got the three top run-getters in the tournament on show. We've got a quick who's set the cricket world abuzz over the course of this 2013-14 season. And we've got Cuttack's return to the IPL 2012. Although funnily enough it's Kings XI Punjab's home ground. Isn't it a lot closer to Chennai? Sorry, I tend to get bogged down by trivial issues. Stop it, Alagappan Muthu. It doesn't matter. Oh and I guess I'm fond of referring to myself in the third person as well."}, {"ball": 0, "isHighlight": false, "text": "-------------------------"}, {"ball": 0, "isHighlight": false, "text": "Rahul Dravid, Sambit Bal, Gaurav Kalra...  $$Everyone's$$ $$playing$$ $$CricIQ$$ . What about you?  $$Play$$ $$here.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Hilfenhaus to Sehwag, $$FOUR$$ ,magnificent! Floats in a half-volley and though it swung away a touch, Sehwag eases into a drive through the covers. Minimum effort, maximum reward"}, {"ball": 0.2, "isHighlight": false, "text": "Hilfenhaus to Sehwag,2 runs,over compensation and Sehwag clips a fuller delivery off his toes through midwicket."}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to Sehwag,no run,the angled bat comes down on a back of a length ball that thuds into the hands of cover"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Sehwag,1 wide,bouncer, but it slides a little down leg. Hilfenhaus isn't too happy with the call, but it was a perfectly fair one"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Sehwag,1 wide,again, this one was short of a length and Sehwag misses a glance. Hilfy attempts an appeal to hoodwink the ump, but he already had his hands outstretched"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Sehwag,no run,gets across to middle and off, Sehwag looks to force it down the ground. The ball might have held onto the pitch a little more as the ball lobs back towards the bowler"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to Sehwag,no run,shortish and outside off, Sehwag caresses it behind point but Jadeja dives to his right to keep it under control"}, {"ball": 0.6, "isHighlight": false, "text": "Hilfenhaus to Sehwag,1 run,pushed into the covers and he will retain strike"}, {"ball": 0.6, "isHighlight": false, "text": "Vikram: \"Left arm spinner in Kartik replaces a Balaji on a batting track? Balaji knows conditions well and he is definitely street smart when the batsmen start attacking.. sometimes the decisions made in IPL are surprising and more surprising is the fact that many of those decisions yield great results!!\" The spotlight though is on Ishwar Pandey, who is ready to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Sehwag,no run,good length ball on off stump, Sehwag keeps to his crease and punches to mid-off"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,laced through midwicket, this time he's hit it hard enough to beat the fielder. A little too straight and that bottom hand is as strong as ever"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,carved over point! This is the Sehwag we've waited for. This was overpitched outside off and he threw his hands at it. Just a couple of bounces before hammering into the boundary boards"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Sehwag,no run,fullish on off stump, Sehwag drills it to mid-off"}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,over cover this time. No need to bother about footwork when you can time it like that. Another full delivery with ample room for him to free his arms"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Sehwag,no run,hint of swing away from the bat, but this was a little too far for him to reach and strike properly. Gets a bottom edge which wanders back to the bowler. Twelve runs off the over"}, {"ball": 1.6, "isHighlight": false, "text": "Shishank Dahiya: \"India's erstwhile openers on display today. After Gambhir it is Sehwag's turn now!!!\" Mohit Sharma for the third over"}, {"ball": 2.1, "isHighlight": false, "text": "Sharma to Mandeep Singh,no run,shortish and outside off, Mandeep slaps it to point. Strong wrists again"}, {"ball": 2.2, "isHighlight": false, "text": "Sharma to Mandeep Singh,no run,Jaddu has to dive to his right this time. A little fuller but it still had enough width for the cut. Struck it very well, but that off side field is packed"}, {"ball": 2.3, "isHighlight": false, "text": "Sharma to Mandeep Singh,no run,looks to hack a good length ball from outside off through the leg side and gets an inside edge. Still not off the mark yet"}, {"ball": 2.3, "isHighlight": false, "text": "Harsha: \"Iswar Pandey is bringing out the Pune Warrior in him today\""}, {"ball": 2.4, "isHighlight": false, "text": "Sharma to Mandeep Singh,no run,makes room as he steps down, Mohit follows him and the good length ball sneaks through bat and pad. Awful cross-bat swing."}, {"ball": 2.5, "isHighlight": false, "text": "Sharma to Mandeep Singh,1 run,this time he opens the face and steers a good length ball to deep third man"}, {"ball": 2.5, "isHighlight": false, "text": "Gully, Deep point. No third man"}, {"ball": 2.6, "isHighlight": false, "text": "Sharma to Sehwag,no run,targets off stump on a good length, Sehwag moves his weight across and tucks it to midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "Deepak: \"Don't dare jinxing Sehwang - pls stay away\" If ever there was an invitation..."}, {"ball": 3.1, "isHighlight": false, "text": "Hilfenhaus to Mandeep Singh,1 run,goes fuller but Mandeep manages to chop it past the flying Jadeja. He's been on fire at point, this time hurling himself to his left and saving a single"}, {"ball": 3.2, "isHighlight": false, "text": "Hilfenhaus to Sehwag, $$SIX$$ ,length and Sehwag has banished it over long-on! It was the change of pace from Hilfy, but Sehwag saw it early and exhibited a full, clean swing"}, {"ball": 3.3, "isHighlight": false, "text": "Hilfenhaus to Sehwag,1 leg bye,this time he gets cramped up on middle and leg. Hilfy appeals as the good length ball skids on to strike him on the pads"}, {"ball": 3.4, "isHighlight": false, "text": "Hilfenhaus to Mandeep Singh,1 run,steers a back of a length ball through point to trot across to the non-strikers'"}, {"ball": 3.5, "isHighlight": false, "text": "Hilfenhaus to Sehwag,no run,digs it in short but Sehwag doesn't bother with it. Good height on that"}, {"ball": 3.6, "isHighlight": false, "text": "Hilfenhaus to Sehwag,1 run,back of a length and Sehwag rises up on his toes and punches through the covers"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Sehwag,no run,short and wide, Sehwag goes for his patented cut but misses. Swings his bat in disappointment"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Sehwag,1 leg bye,spears it at his pads and Sehwag can't connect with the flick this time. Has to settle for a leg bye behind square leg"}, {"ball": 4.2, "isHighlight": false, "text": "R@mEez: \"Apart from the awesome bowling and batting lineup, its the fielding which keeps CSK ahead of every other IPL team. Baz, Raina, Jaddu, Faf and even Smith. Probably the best fielding unit of the season.\""}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Mandeep Singh, $$OUT$$ ,walks down, makes room and carves this straight down third man's throat. That was not his job, all he needed to do was put Sehwag on strike but he couldn't help himself. Tried to manufacture a stroke but gets more of a thick outside edge"}, {"ball": 4.3, "isHighlight": false, "text": "$$Mandeep$$ $$Singh$$ $$c$$ $$Pandey$$ $$b$$ $$Sharma$$ $$3$$ $$(20m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$37.50$$"}, {"ball": 4.3, "isHighlight": false, "text": "Glenn Maxwell is in the house. How bout this for a batting combination"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Sehwag, $$FOUR$$ ,this seemed to bounce a little more off the pitch. Mohit has a knack for that and though Sehwag was surprised, he drew his bottom hand off the bat and placed the steer past the waiting man at gully."}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Sehwag,no run,back of a length and outside off, Sehwag punches it towards point. And is also set to take advantage of an overthrow. When was the last time we saw that?"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Sehwag,no run,good length ball seeking middle of middle, but all he gets is the middle of Sehwag's bat"}, {"ball": 4.6, "isHighlight": false, "text": "Ravinder: \"Lack of patience has been the main feature of Mandeep so far in all IPL. Otherwise he is very talented.\""}, {"ball": 5.1, "isHighlight": false, "text": "Hilfenhaus to Maxwell,1 run,lured into pushing away from his body and he gets a thick outside edge to a back of a length delivery. Third man mops up"}, {"ball": 5.2, "isHighlight": false, "text": "Hilfenhaus to Sehwag, $$OUT$$ ,Oh, he's dragged on! He dabbed at a good length delivery with an angled blade and Hilfy manages to nip it back enough to take the inside edge, hit the pads and cannon into the stumps"}, {"ball": 5.2, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$b$$ $$Hilfenhaus$$ $$30$$ $$(26m$$ $$23b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$130.43$$"}, {"ball": 5.2, "isHighlight": false, "text": "David Miller comes out at No.4"}, {"ball": 5.3, "isHighlight": false, "text": "Hilfenhaus to Miller,no run,gets one to curl back in but Miller negotiates it well. Presents a straight bat and drives the fuller ball to mid-on"}, {"ball": 5.4, "isHighlight": false, "text": "Hilfenhaus to Miller,no run,good length ball on and around his off stump, pushed into the covers"}, {"ball": 5.4, "isHighlight": false, "text": "Senthil: \"Despite all the eye catching shots by Sehwag, KXIP RR is still under 8 and now have lost 2 wickets inside the powerplay. Important of rotating the strike\""}, {"ball": 5.5, "isHighlight": false, "text": "Hilfenhaus to Miller,no run,he's obviously got confidence from that strike. Produces a fine bouncer on middle and off and Miller sways away from the line"}, {"ball": 5.6, "isHighlight": false, "text": "Hilfenhaus to Miller,no run,walks down and drives the fuller ball outside off into the covers"}, {"ball": 5.6, "isHighlight": false, "text": "Finny: \"Hilfenhas bowling third over.! How often have you seen this.? And say what he gets the danger man, That is captiancy boss!!\" Technically, quite often. Sandeep does it, Bhuvi does it"}, {"ball": 5.6, "isHighlight": false, "text": "Dwayne Smith, with a slip in place"}, {"ball": 6.1, "isHighlight": false, "text": "Smith to Maxwell,1 run,full and outside off, Maxi drags it from outside off towards deep midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Smith to Miller,1 run,good length ball outside off, Miller drives on the up through the covers. McCullum is the man there but the ball sneaks past his dive"}, {"ball": 6.3, "isHighlight": false, "text": "Smith to Maxwell,no run,fires in a yorker on off stump, but this time Maxi is able to dig it out."}, {"ball": 6.4, "isHighlight": false, "text": "Smith to Maxwell,1 run,a little slower on off stump, Maxi plants his front leg down the pitch and flicks it through midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Smith to Miller, $$FOUR$$ ,a little too full and Miller's been timing the drive brilliantly so far. This time he finds the gap too. Hit straight down the ground"}, {"ball": 6.6, "isHighlight": false, "text": "Smith to Miller,no run,good length ball just outside off, defended into the covers"}, {"ball": 6.6, "isHighlight": false, "text": "Sridhar: \"It's great decision by KXIP to send their in-form batsman as early as they sent Maxwell now. It is obvious that your best player should face more number of balls in order to have a winning chance. Something that other teams like DD and MI have failed to do. There is no point holding them back till 16th over. \""}, {"ball": 6.6, "isHighlight": false, "text": "Ishwar for another spell"}, {"ball": 7.1, "isHighlight": false, "text": "Pandey to Maxwell,1 leg bye,just short of a good length and Maxi shuffles across to try and pick it off his hips. Wears it on the thigh but these are two quick runners out there"}, {"ball": 7.2, "isHighlight": false, "text": "Pandey to Miller,no run,walks down the pitch and nudges the back of a good length ball into the midwicket region"}, {"ball": 7.3, "isHighlight": false, "text": "Pandey to Miller,no run,a little more bounce as he saw the batsman start advancing. Switches his length shorter and Miller's flash doesn't connect. He was a little cramped as well"}, {"ball": 7.4, "isHighlight": false, "text": "Pandey to Miller,no run,keeps to a good length on off stump, Miller's nudge is taken care of by a diving midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Pandey to Miller, $$FOUR$$ ,that time he errs in length and Miller has pulled it behind square leg. He's catching up on those dot balls now"}, {"ball": 7.6, "isHighlight": false, "text": "Pandey to Miller,1 run,good length ball on middle and leg and it holds up a touch to make Miller's nudge travel in the air for a while before finding long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Here's Jaddu"}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Miller, $$FOUR$$ ,tossed up outside off, Miller drills it through extra cover. Smith was the man at long-off and he presents the old bridge through the legs to let the ball through"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Miller,1 run,good length ball, pushed flatter on middle. Pushed down to long-on"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Maxwell,2 runs,leans forward and beats extra cover on his left to pick up a well-placed couple to the deep"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Maxwell,no run,that might have stayed a touch low. Jaddu gave this a little more air and the ball straightened a touch to beat his outside edge"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Maxwell,1 run,goes for the reverse scoop, but this was slower as well and doesn't have the pace he wanted. Lobbed up in the air but there was no short third man"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Miller,1 run,flighted outside off, driven through the covers"}, {"ball": 8.6, "isHighlight": false, "text": "That's the time out. Rahul Dravid, Sambit Bal, Gaurav Kalra...  $$Everyone's$$ $$playing$$ $$CricIQ$$ . What about you?  $$Play$$ $$here.$$"}, {"ball": 9.1, "isHighlight": false, "text": "Smith to Miller,1 run,doesn't want to give Miller any room. Understandable considering how sweetly he's driven in this little innings. Goes for a flick and has to settle for a single in front of square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Smith to Maxwell, $$FOUR$$ ,clears midwicket. That was pure power. Raina leaps as high as he could but the flat missile soars past his extended fingertips. Midwicket slog mightily executed"}, {"ball": 9.3, "isHighlight": false, "text": "Smith to Maxwell,1 run,stays back to the short delivery, lets it come on and then dab it behind point with soft hands"}, {"ball": 9.4, "isHighlight": false, "text": "Smith to Miller,1 run,full and just outside off, Miller punches to long-off"}, {"ball": 9.5, "isHighlight": false, "text": "Smith to Maxwell,1 run,slower ball angled in at him, Maxi was almost deceived but went through the shot anyway and pushes down the ground"}, {"ball": 9.6, "isHighlight": false, "text": "Smith to Miller,1 run,good length ball on and around leg stump, Miller clips to deep midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "CSKfan: \"@Sridhar: It is not that obvious really. If Maxwell gets out and pressure is piled on Miller you never know what total they will get to. You want to send your best bat too early or too late and depends on opponent bowlers and your role in the team. Which is why finishing is a seriously difficult role in cricket.\""}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin, around the wicket"}, {"ball": 10.1, "isHighlight": false, "text": "Ashwin to Miller,no run,no spin on offer for him as this goes on with the arm, Miller pushes to the left of the bower but Ashwin gets to it"}, {"ball": 10.2, "isHighlight": false, "text": "Ashwin to Miller,1 run,a little slower through the air and Miller drives a little uppishly down the ground to long-off"}, {"ball": 10.2, "isHighlight": false, "text": "stats around to Maxi, Long-on, deep midwicket and square leg on the boundary"}, {"ball": 10.3, "isHighlight": false, "text": "Ashwin to Maxwell, $$SIX$$ ,I was expecting a reverse sweep, but Maxi goes for the orthodox one and has sent it sailing over square leg."}, {"ball": 10.4, "isHighlight": false, "text": "Ashwin to Maxwell, $$SIX$$ ,this legspinner becomes a full toss and Maxi stands and thumps it into the crowd behind square leg. That was massive"}, {"ball": 10.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,he doesn't want to get in Maxi's range and ends up bowling it wide down leg"}, {"ball": 10.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,and now he's shot one way down the off side. Ashwin is completely rattled"}, {"ball": 10.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,flighted on middle and off, Maxi drags it to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Ashwin to Miller,1 run,tossed up just outside off, driven through extra"}, {"ball": 10.6, "isHighlight": false, "text": "Dave: \"I love watching Ashwin bowl to Maxwell. Lots of mind games going on with Maxwell publicly saying (on @Altcricket) he loves facing Ashwin and can pick him easily... \""}, {"ball": 11.1, "isHighlight": false, "text": "Jadeja to Miller, $$SIX$$ ,it's getting infectious here. Miller races down the track, gets to the pitch and once it's in the arc.... Long-on had no chance"}, {"ball": 11.2, "isHighlight": false, "text": "Jadeja to Miller,1 run,this time makes a little room for himself to shovel the length ball, pushed flatter on middle, towards short third man"}, {"ball": 11.3, "isHighlight": false, "text": "Jadeja to Maxwell,1 run,slower and nicely tossed up on middle, Maxi opens the face towards short third man for a quick single"}, {"ball": 11.4, "isHighlight": false, "text": "Jadeja to Miller,1 run,fires it thorugh against Miller and he can't control the punch back at him. Pick up a singe as the ball wanders away towards midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "Jadeja to Maxwell, $$FOUR$$ ,wild slog off a good length ball that kicked off the pitch. Dhoni can't get behind it and the ball runs away to the third man boundary. Such a good ball, but you won't realise it on the scorecard later on"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja to Maxwell,1 run"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Maxwell, $$SIX$$ ,this time it's the straight boundary! Tossed up on and around off stump and Maxi wound up and launched it into a desk full of security."}, {"ball": 12.2, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,through the fielder at deep midwicket! It was McCullum too. He's a pretty decent man to have on the boundary but Maxi had just hit it too hard!"}, {"ball": 12.3, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,reverse swept and it sails over the boundary at deep third man. Maxi is making my fingers bleed here. Shot after shot after shot"}, {"ball": 12.4, "isHighlight": false, "text": "Ashwin to Maxwell,no run,flighted outside off, a little slower this time. Maxi nudges into the covers quite calmly"}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Maxwell, $$SIX$$ ,and we're back to regularly scheduled programming. Length ball outside off, Maxi gets forward and slog sweeps it into the crowd at midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,driven down the ground to keep strike. Phew. What an over"}, {"ball": 12.6, "isHighlight": false, "text": "sathya: \"When maxwell and miller takes single every ball, its like they fight saying \" you hit six this ball, no no you hit.....\" Ishwar Pandey comes on for his third over. CSK's spin attack has been negated"}, {"ball": 13.1, "isHighlight": false, "text": "Pandey to Maxwell, $$SIX$$ ,there was a man there at long-on. He flung himself up in search of the ball, but it beat him comfortably. length from the bowler and Maxi slammed it"}, {"ball": 13.2, "isHighlight": false, "text": "Pandey to Maxwell,1 run,that's about the only ball that seems to keep him quiet. Fires in a yorker which is dug out for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Pandey to Miller, $$FOUR$$ ,goes for the yorker and it ends up a low full toss. Miller flays his bat at it and gets a boundary off the outside edge"}, {"ball": 13.4, "isHighlight": false, "text": "Pandey to Miller,1 run,offcutter on middle, Miller adjusts and pushes to long-off"}, {"ball": 13.5, "isHighlight": false, "text": "Pandey to Maxwell,2 runs,he has flicked this from way outside off to deep square leg. The full toss helped him but the strength of his bottom hand is startling"}, {"ball": 13.6, "isHighlight": false, "text": "Pandey to Maxwell, $$FOUR$$ ,length ball outside off and it's a one-bounce four. Maxi and Miller punch their gloves as they record a hundred stand. Carted away off the front foot and deep midwicket had no chance"}, {"ball": 13.6, "isHighlight": false, "text": "price: \"The best thing about this pair is that even hitting 4s and 6s, they have been rotating strikes very well and there are very less dol balls. \""}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Miller,1 run,races down the track but this was pushed through flat, Miller can only get it as far as long-on"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to Maxwell,1 run,tossed up and he looks to play against the spin towards his favourite midwicket region. Jaddu slowed it up and fooled Maxi in flight."}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to Miller, $$FOUR$$ ,looks to slash it through the covers, but he mis-hits it. Gets a thick edge that beats short third man"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Miller,2 runs,more use of the feet as he swipes a flatter delivery away to the left of long-on"}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Miller,no run,hurled in at the pads and strikes the batsman there"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Miller, $$SIX$$ ,that's a monster! Had the width and he got under it to carve it into the crowd behind cover. That ball followed a hyberbolic trajectory. Flat and kept gaining height"}, {"ball": 14.6, "isHighlight": false, "text": "Last five overs have fetched 84 runs. CSK definitely needed that time out"}, {"ball": 14.6, "isHighlight": false, "text": "Gopal: \"This is like watching my buddy Rohan play Brian lara Cricket on my PC all the time during College..!! \""}, {"ball": 14.6, "isHighlight": false, "text": "Dwayne Smith into the attack"}, {"ball": 15.1, "isHighlight": false, "text": "Smith to Maxwell, $$SIX$$ ,he's caught! But by the ball boy beyond the boundary! There is no stopping that reverse slog from Maxi. And this was the perfect length too, sat up for the hot"}, {"ball": 15.2, "isHighlight": false, "text": "Smith to Maxwell, $$SIX$$ ,another one! This was in the slot and Maxi made sure he was on the leg side of it and pummeled it straight down the ground. Slower ball picked and massacred"}, {"ball": 15.3, "isHighlight": false, "text": "Smith to Maxwell,no run,goes for the up and over point, but he went a little too far under the short ball outside off"}, {"ball": 15.4, "isHighlight": false, "text": "Smith to Maxwell, $$SIX$$ ,Dhawan catches it at the dug out this time. Maxi is just having some fun with those reverse slogs! Got under it and powered it comfortably over the rope"}, {"ball": 15.5, "isHighlight": false, "text": "Smith to Maxwell,1 run,full and outside off, whipped down to long-on. Is he going to get that three-figure mark finally?"}, {"ball": 15.6, "isHighlight": false, "text": "Smith to Miller,1 wide,slides too far down the leg side with a short ball. Misses the pull"}, {"ball": 15.6, "isHighlight": false, "text": "Smith to Miller, $$OUT$$ ,Smith does it again! Last time he got Maxi, this time he gets Miller! It was full and he was looking to lash it through the covers. Gets an inside edge that uproots off stump. Threw his head back in disappointment, he was three away from a fifty but besides that Punjab were batting Chennai into submission"}, {"ball": 15.6, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$b$$ $$Smith$$ $$47$$ $$(44m$$ $$32b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$146.87$$"}, {"ball": 15.6, "isHighlight": false, "text": "CSK sense an opening. George Bailey, the Kings XI captain, has not been in the best of form"}, {"ball": 16.1, "isHighlight": false, "text": "Pandey to Maxwell,1 leg bye,went for a reverse slog again, but this time the ball was a little too full and spearing in on leg. Gets struck on the pads. Pandey goes up in appeal, but that was sliding down"}, {"ball": 16.2, "isHighlight": false, "text": "Pandey to Bailey,1 leg bye,full and angled into him, Bailey goes for the flick but doesn't connect. Settles for a leg-bye and puts Maxwell on strike"}, {"ball": 16.3, "isHighlight": false, "text": "Pandey to Maxwell, $$FOUR$$ ,how unlucky is that. It was lovely yorker, tailing in on middle and leg. Maxi looked to belt it through midwicket again, but gets an inside edge that wanders away to the fine leg boundary"}, {"ball": 16.4, "isHighlight": false, "text": "Pandey to Maxwell,no run,saw him backing away and he sends in a slower yorker outside off, Maxi reaches out and bunts it back to the bowler."}, {"ball": 16.5, "isHighlight": false, "text": "Pandey to Maxwell,1 run,full toss on middle, Maxi clears his front leg and slams it down the ground. Went off the bottom of the bat and he gets a single. He's in those nervous nineties now"}, {"ball": 16.6, "isHighlight": false, "text": "Pandey to Bailey,1 run,seeks the yorker and gets it to tail in a touch, Bailey swings and gets a thick outside edge to third man"}, {"ball": 16.6, "isHighlight": false, "text": "Meet Kachhy: \"How genuine are the bowling speeds shown on the TV in the IPL?\" Sometimes they cause a few double takes, don't they?"}, {"ball": 16.6, "isHighlight": false, "text": "Mohit Sharma is in now"}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Bailey,1 run,shortish and outside off, Bailey dabs it to third man to get Maxi back on strike"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Maxwell, $$OUT$$ ,again! He's holed out at deep midwicket. This was a little slower and fuller outside off, Maxi wound up and slogged. Dragging it might have hurt him for power and Jaddu took it safely inside the rope and then teased fate by walking back to the boundary and acting as if he was about to step over it. What's the point of a wicket if you can't have a bit of fun with it"}, {"ball": 17.2, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Jadeja$$ $$b$$ $$Sharma$$ $$90$$ $$(58m$$ $$38b$$ $$6x4$$ $$8x6)$$ $$SR:$$ $$236.84$$"}, {"ball": 17.2, "isHighlight": false, "text": "Mitchell Johnson takes guard"}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to Johnson, $$FOUR$$ ,a taste of his own medicine to start and Mitch was a little surprised. Manages to dab it fine enough to beat deep third man though"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Johnson,no run,good length ball, punched into the covers"}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to Johnson,1 run,short of a length on middle, Mitch tries to pull it away but inside edges it. The ball stops beside his legs and Bailey races off for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Bailey, $$FOUR$$ ,shortish and it's been placed brilliantly. Walked across to off stump and pulled it well fine of the man at deep square leg"}, {"ball": 17.6, "isHighlight": false, "text": "kishore: \"Maxwell must be wondering if there is way to get to 100 by skipping the 90s.. :) nevertheless great innings yet again.. \""}, {"ball": 17.6, "isHighlight": false, "text": "Here's Hilfy"}, {"ball": 18.1, "isHighlight": false, "text": "Hilfenhaus to Johnson,1 run,starts with a yorker that targets leg stump, Mitch is beside it and pushes to long-off"}, {"ball": 18.1, "isHighlight": false, "text": "ShankarC: \"KXIP need to finish strongly, otherwise CSK batting arsenals will explode to the target..\""}, {"ball": 18.2, "isHighlight": false, "text": "Hilfenhaus to Bailey, $$FOUR$$ ,did I say he was out of form? He must have heard me and taken offense. This was in the slot, half-volley outside off and Bailey has hammered it past extra cover"}, {"ball": 18.3, "isHighlight": false, "text": "Hilfenhaus to Bailey, $$FOUR$$ ,terrific placement again. The bowler switched around the wicket and sought a wide yorker, Bailey got down with it and let it run off the face to the point boundary"}, {"ball": 18.4, "isHighlight": false, "text": "Hilfenhaus to Bailey, $$FOUR$$ ,mid-off was inside the circle and Bailey has lofted this length ball to the boundary. All he wanted was to lob it over the fielder as he made room and though the bowler followed him, he made good enough connection"}, {"ball": 18.4, "isHighlight": false, "text": "Long-off is back, fine leg is in"}, {"ball": 18.5, "isHighlight": false, "text": "Hilfenhaus to Bailey,no run,slower ball outside off, Bailey slams it down the ground but a couple of fingers from the bowler on his follow through saves it"}, {"ball": 18.6, "isHighlight": false, "text": "Hilfenhaus to Bailey, $$FOUR$$ ,that's the fourth four of the over. Cleared his front leg and blasted this fuller ball over the covers"}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Johnson, $$FOUR$$ ,that's gone through. Faf ran in to try and take the catch, but then seeing the ball was dipping he tried to get the body in line with it. But in the end it strikes him and sneaks off to the long-on boundary. Short ball, slogged away"}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to Johnson,1 run,goes for the wide yorker and Mitch juts his bat out and collects a single to third man"}, {"ball": 19.2, "isHighlight": false, "text": "Sahiba: \"CSK made 205 in last match against Punjab, and Punjan won. Can CSK do return the favour?\""}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Bailey, $$FOUR$$ ,full and outside off, Bailey walks across to try and scoop the ball. Gets just enough bat on it to trickle down to the fine leg boundary. Very cheeky"}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Bailey,2 runs,slower ball, on a length. Bailey waited for it and slogged it to deep midwicket for a couple. We're already well into the highest score of the season"}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to Bailey, $$SIX$$ ,slower ball and Bailey has launched it over long-on. What a hit! Came forward and let that bat swing right back to his shoulder"}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Bailey, $$SIX$$ ,this is flatter but still carried over the rope. Bailey has made 40 off 13 balls! In the slot again and Bailey slapped it straight down the ground. James Anderson must be smiling somewhere"}, {"ball": 19.6, "isHighlight": false, "text": "$$9.35$$ $$pm$$  It was always expected to be a high-scoring encounter. A Kings-XI and Super Kings clash fetches over 320 runs on average. But this is way better. Glenn Maxwell was unstoppable. At one point, I thought he was just trying one shot after the next to see which would get him the bigger six. After his 90 off 38, Miller hung around for 47 off 32 and George Bailey put the most emphatic finishing touches. This is going be a  $$tall$$  chase, but the pitch is good and Super Kings have the fire power. So don't rule this one dead yet, folks"}, {"ball": 19.6, "isHighlight": false, "text": "\"Hopefully it's a winning total,\" says David Miller. \"I don't really say much [in a partnership with Maxwell], he just says I'm going again and I just and watch. That's his plan, he goes hard and he's done really well so far\""}, {"ball": 19.6, "isHighlight": false, "text": "Yashwant: \"This has to be one of the most intelligent batting displays by a team in T20! Miller attacking Jaddu, Maxwell tearing into Ashwin and Bailey toying with the field. Brains and Brawn. \""}, {"ball": 19.6, "isHighlight": false, "text": "Indranil: \"I am so sure Maxwell is some terminator sent from the future..there is no other possible explanation \""}], "name": "Kings XI Punjab v Chennai Super Kings", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733987.html?innings=1;view=commentary", "match_num": 29}