{"commentary": [{"ball": 0, "isHighlight": false, "text": "Smith and McCullum are here.. Now what do the have in their tanks? They need to explode too - CSK don't have an option. Smith will take strike against Sandeep"}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Smith,1 wide,lovely outswinger that beats the outside edge! Smith was poking his bat at that one but didn't account for that shape"}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Smith, $$FOUR$$ ,no, they are not going to wait! Another outswinger, but this is full enough for Smith to get under.. he just chips it over extra cover for a one-bounce four"}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Smith,no run,superb delivery! It's short of length and curves away from the batsman after pitching to beat the outside edge"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Smith,no run,closer to the offstump line and still has that shape. Smith defends it to midwicket off the back foot"}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Smith, $$OUT$$ ,they get the big fish early! Smith looks to hoick the back of length delivery over point, but gets a thick edge that lobs up for Mitchell Johnson at backward point"}, {"ball": 0.4, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Johnson$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$4$$ $$(3m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to McCullum,no run,another beautiful delivery! It's on a length, pitches outside off, keeps curving away. Baz leaves it alone"}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to McCullum,no run"}, {"ball": 0.6, "isHighlight": false, "text": "Mitch has Raina in his sights"}, {"ball": 1.1, "isHighlight": false, "text": "Johnson to Raina,no run,goes for a just short of a length and outside off, dabs towards backward point"}, {"ball": 1.2, "isHighlight": false, "text": "Johnson to Raina,no run,jumps back in his crease as he blocks a 145kph thunderbolt back at the bowler"}, {"ball": 1.3, "isHighlight": false, "text": "Johnson to Raina,no run,went a little wide of the crease and gets a back of a length delivery to straighten. Raina blocks down the wrong line and is well beaten."}, {"ball": 1.4, "isHighlight": false, "text": "Johnson to Raina,no run,steered to gully as this is shortish and just a shade outside off. They're cutting out a rich scoring area for Raina"}, {"ball": 1.5, "isHighlight": false, "text": "Johnson to Raina,2 runs,shortish but it only rises up to Raina's hips, nudged behind square leg for a couple. Not exactly comfortably though."}, {"ball": 1.6, "isHighlight": false, "text": "Johnson to Raina,1 run,walks across to off stump and pulls the shortish ball down to long leg. Made a little tonk as bat made contact off the bottom of the bat"}, {"ball": 1.6, "isHighlight": false, "text": "Vikas: \"I sense a huge Dhoni innings today! \" They definitely need one and he has a history with Kings XI"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Raina,no run,had to reach out as the length ball drifts away off the bat. Point keeps it down to nothing"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Raina,2 runs,pokes his bat outside off and gets a couple to the sweeper. Another away swinger on a good length outside off"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Raina,2 runs,Mandeep, you beauty! This was struck very hard by Raina. Took it on the up and punched it through the covers. It looked set for the boundary until the fielder hurls himself at the ball and kept it to two"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Raina,no run,short of a good length around the off stump, Raina dabs it to gully"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar: \"It was good to see Bailey convert a difficult total to unassailable with that innings. Well finished! Otherwise, he was in danger of becoming a decorative captain- just like Ponting for MI 2013\""}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Raina,1 run,chipped up in the but midwicket is on the fence. Wanted to tuck him up on the pads and Raina doesn't quite time the flick"}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to McCullum,no run,fullish and straightening on off stump, Baz couldn't do much else than a defensive"}, {"ball": 2.6, "isHighlight": false, "text": "Gaurav Sethi: \"Just a orange cap? make Glenn Maxwell wear an orange space suit and launch him into the stratosphere\""}, {"ball": 3.1, "isHighlight": false, "text": "Johnson to Raina,1 run,keeps it fullish and outside off, Raina slices it behind point. Where's the bouncer?"}, {"ball": 3.2, "isHighlight": false, "text": "Johnson to McCullum,2 runs,straight down the ground, but he hasn't got it quite off the middle. Full on off stump, he strides forward and punches down the ground. Akshar Patel raced from mid-off to pull it back"}, {"ball": 3.3, "isHighlight": false, "text": "Johnson to McCullum,1 run,shortish and outside off, McCullum taps it to deep third man"}, {"ball": 3.4, "isHighlight": false, "text": "Johnson to Raina,no run,gets a bottom edge which doesn't go too far. It was shortish and outside off, he looked to run it off the face, but doesn't get it past gully"}, {"ball": 3.5, "isHighlight": false, "text": "Johnson to Raina,no run,bit of width but Raina has slapped this straight to point. Still nervous about moving his feet and I don't blame him, Mitch is bowing some serious pace"}, {"ball": 3.6, "isHighlight": false, "text": "Johnson to Raina, $$FOUR$$ ,one-bounce four over point. Backed away to try and gain some room and he carved this short ball clean over point"}, {"ball": 3.6, "isHighlight": false, "text": "Murali Kartik into the attack. Spin leaked a lot of runs for CSK"}, {"ball": 4.1, "isHighlight": false, "text": "Kartik to McCullum,no run,tossed up on middle and off, he comes forward and blocks with an open face"}, {"ball": 4.2, "isHighlight": false, "text": "Kartik to McCullum, $$FOUR$$ ,makes a little room and lashes this over the top and finds a boundary to extra cover. Calculated shot from McCullum as he beats long-off who was running to his left"}, {"ball": 4.3, "isHighlight": false, "text": "Kartik to McCullum,1 run,goes down the track but the length is pulled back and pushed on his pads, nudges for a single through midwicket"}, {"ball": 4.3, "isHighlight": false, "text": "pavithran: \"This is the first time CSK has looked so dependent on a single player for powerplays in last 7 seasons. Smith really have made an impact!\""}, {"ball": 4.4, "isHighlight": false, "text": "Kartik to Raina, $$FOUR$$ ,thumped straight down the ground. It was bowled flatter but Raina's footwork pipped him. And a straight bat helps his cause"}, {"ball": 4.5, "isHighlight": false, "text": "Kartik to Raina,no run,pushed through on the pads, Raina works to midwicket"}, {"ball": 4.6, "isHighlight": false, "text": "Kartik to Raina, $$FOUR$$ ,panicked as he saw Raina making room and looped up a full toss. Calmly punched through the covers"}, {"ball": 4.6, "isHighlight": false, "text": "Sandeep's back. Look out for that outswinger"}, {"ball": 5.1, "isHighlight": false, "text": "Sandeep Sharma to McCullum,1 run,slower ball on off stump, Baz uses soft hands towards point"}, {"ball": 5.1, "isHighlight": false, "text": "Darryl: \"Is there anything more daunting than hitting 13 runs off the 5th over and the RRR still goes up?\""}, {"ball": 5.2, "isHighlight": false, "text": "Sandeep Sharma to Raina, $$SIX$$ ,how bout that! Raina stayed put on the crease and swiped a length ball over the boundary at wide long-on. Picked up and dispatched. Terrific strike"}, {"ball": 5.3, "isHighlight": false, "text": "Sandeep Sharma to Raina,1 run,tempts him outside off with a back of a length ball, Raina slashes and picks up a single to the sweeper"}, {"ball": 5.4, "isHighlight": false, "text": "Sandeep Sharma to McCullum,2 runs,chips down the track but his launch over the top came off the bottom of the bat. Gained way more height than he liked and Mitch was chasing after it. Lunged after it with both hands but he never looked in control. Swirler that was, no one would blame Johnson for not grabbing that"}, {"ball": 5.5, "isHighlight": false, "text": "Sandeep Sharma to McCullum,1 run,slower ball, just back of a length, Baz taps towards point for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Sandeep Sharma to Raina,1 run,grants him width and Raina smacks it over the covers. But there is protection in the deep"}, {"ball": 5.6, "isHighlight": false, "text": "That's the powerplay done. 46 for 1 is usually a good start, but they still need 186 runs. Akshar Patel is the new bowler"}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Raina,1 run,skips down the track, but he doesn't reach the pitch and bunts it down to long-on"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to McCullum,1 run,not too much spin out there as he targets off stump, Baz backs away to cut but doesn't connect too well"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to Raina,1 run,pushes it through at the base of middle, Raina looks to flick across the line and is lucky for that ball deflecting away from the stumps"}, {"ball": 6.4, "isHighlight": false, "text": "Patel to McCullum,1 run,cuts from around off stump, but sweeper keeps it to a single"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to Raina,2 runs,comes down the track and steers the flat, length ball through the covers"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to Raina,1 run,this stayed low as Akshar fires it in. Raina works it away through midwicket to retain strike"}, {"ball": 6.6, "isHighlight": false, "text": "Kuldeep: \"Time for McCullum to step up and play more aggressively. He has been in good form, but he can be more aggressive than he has been and the situation dictates that from him.\"  $$He$$  has the ball in hand now."}, {"ball": 7.1, "isHighlight": false, "text": "Maxwell to Raina,1 run,pushed in on the pads, Raina is down the track but can only push it to long-on"}, {"ball": 7.2, "isHighlight": false, "text": "Maxwell to McCullum,1 wide,stays around the wicket to the right-hander too, but this is fired in way too wide outside off"}, {"ball": 7.2, "isHighlight": false, "text": "Maxwell to McCullum,1 run,pushed back towards the bowler, Maxi tries a flick off the back of his hand to try and run Raina out and he would have been had that hit the target"}, {"ball": 7.3, "isHighlight": false, "text": "Maxwell to Raina, $$OUT$$ ,Maxi and Miller, they combine well even with the ball in hand! Raina dances down the track to heave a flighted ball over extra cover. But he doesn't get enough timing on it. Long off runs up and dives forward to complete the catch."}, {"ball": 7.3, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Miller$$ $$b$$ $$Maxwell$$ $$35$$ $$(30m$$ $$27b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$129.62$$"}, {"ball": 7.3, "isHighlight": false, "text": "That is the time out"}, {"ball": 7.3, "isHighlight": false, "text": "Ali Asgar: \"end of over no.6 CSK are 8 runs ahead of KXIP can they do the blasting KXIP did \""}, {"ball": 7.3, "isHighlight": false, "text": "Hello, hello! Ravindra Jadeja is the new batsman"}, {"ball": 7.4, "isHighlight": false, "text": "Maxwell to McCullum,no run,pushed through on the pads, McCullum looks to nudge, but doesn't connect"}, {"ball": 7.5, "isHighlight": false, "text": "Maxwell to McCullum, $$FOUR$$ ,tossed up outside leg, McCullum opts for the sweep and beats Sehwag at short fine leg. He's not going to chase after that. Actually signals the ball boy"}, {"ball": 7.6, "isHighlight": false, "text": "Maxwell to McCullum,1 run,loopy delivery well outside off, McCullum lashes it through extra cover"}, {"ball": 8.1, "isHighlight": false, "text": "Patel to McCullum,1 run,shuffles across to off stump and nudges through midwicket. Is McCullum CSK's anchor today?"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to Jadeja, $$FOUR$$ ,that was in the slot, Jaddu loaded up and slams it down the ground. Long-off can only usher it to the boundary"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to Jadeja,1 run,pulls his length back a touch and Jaddu turns it away to long-on"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to McCullum, $$FOUR$$ ,carved through extra, that's a McCullum special! Raced down the track and though the ball was flat, he made enough room to give it a good whack"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to McCullum,no run,this one skidded on with the arm and McCullum was hurried into protecting his stumps. Well bowled"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to McCullum,1 run,fired in on middle and leg, McCullum pushes down the ground. it was hit hard but the bowler gets a hand to it to keep it to a single"}, {"ball": 8.6, "isHighlight": false, "text": "Kuldeep: \"@Ali Asgar: McCullum is comparable to Maxwell, but Jadeja is no Miller. The Kings from the north have prevailed over the Super Kings from the south this IPL.\""}, {"ball": 9.1, "isHighlight": false, "text": "Maxwell to McCullum,1 run,flighted on leg stump, Baz keeps his legs out of the way and pushes down the ground"}, {"ball": 9.2, "isHighlight": false, "text": "Maxwell to Jadeja, $$FOUR$$ ,short and wide and he's cut it brilliantly between short third man and backward point. How bout that for timing"}, {"ball": 9.3, "isHighlight": false, "text": "Maxwell to Jadeja,1 run,a little turn again as he gets the tossed up delivery to straighten outside off. Raina dabs towards short third man for a quick single"}, {"ball": 9.3, "isHighlight": false, "text": "McCullum has a change of bat. Is that the heavy one?"}, {"ball": 9.4, "isHighlight": false, "text": "Maxwell to McCullum,1 run,looped up into the block hole, McCullum pushes to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Maxwell to Jadeja, $$FOUR$$ ,pushed down leg and Jaddu uses the extra pace of the one that was pushed through. Glanced fine to the boundary behind him"}, {"ball": 9.6, "isHighlight": false, "text": "Maxwell to Jadeja,2 runs,a little room outside off and Jaddu has cut it fine of the sweeper. Collects a couple. He's looked in prime touch so far. Guess Dhoni really knows his stuff. Plus remember, Punjab have two left-arm spinners"}, {"ball": 9.6, "isHighlight": false, "text": "Rishi Dhawan to take over with 147 needed off 60. No, I'm not kidding. Keeper standing up"}, {"ball": 10.1, "isHighlight": false, "text": "Dhawan to McCullum,no run,pushes it on a good length just outside off, McCullum goes for a cut but inside edges it"}, {"ball": 10.2, "isHighlight": false, "text": "Dhawan to McCullum,1 run,cut away and he's struck it well, but the sweeper races to his left and keeps it to a single"}, {"ball": 10.3, "isHighlight": false, "text": "Dhawan to Jadeja,1 run,comes down the track and punches the back of a length delivery to mid-off"}, {"ball": 10.4, "isHighlight": false, "text": "Dhawan to McCullum,1 leg bye,goes for the slog sweep, but it strikes him on the ribs. A little bit of a leg cutting knuckle ball and it beats him for lack of pace. Might have been too high for the leg before appeal"}, {"ball": 10.5, "isHighlight": false, "text": "Dhawan to Jadeja, $$OUT$$ ,was that bowled? The good length ball stayed a little low and skidded through Jaddu's hurried prod. They're going to the third ump to see if the bails were disturbed by the ball and not the keeper's gloves. And we have confirmation of that. Except, Dhawan's front foot almost seemed to have toed the line. It certainly slipped over, but when he landed it he was fine. Well, it doesn't matter now. Jaddu has to walk back"}, {"ball": 10.5, "isHighlight": false, "text": "$$RA$$ $$Jadeja$$ $$b$$ $$Dhawan$$ $$17$$ $$(16m$$ $$8b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$212.50$$"}, {"ball": 10.5, "isHighlight": false, "text": "No Dhoni yet, it's Faf at No.5"}, {"ball": 10.6, "isHighlight": false, "text": "Dhawan to du Plessis,2 runs,fullish and outside off, Faf tickles it to deep square leg and called for two straight away. Excellent running"}, {"ball": 10.6, "isHighlight": false, "text": "AKC(Chaubey): \"I wonder how many times \"the biggest hitter\" Dhoni has played a hiding game like this. Its very annoying.\" Kartik comes back for a second over"}, {"ball": 11.1, "isHighlight": false, "text": "Kartik to McCullum,2 runs,clears his front leg and slashes the length ball to deep point and again some fine running gets a couple"}, {"ball": 11.2, "isHighlight": false, "text": "Kartik to McCullum,1 run,pulls this off middle but straight to deep midwicket. Looks like McCullum's going to go for it now"}, {"ball": 11.3, "isHighlight": false, "text": "Kartik to du Plessis,1 run,flatter and outside off, Faf flicks it deep mdiwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Kartik to McCullum,1 run,backs away and shovels it through to deep cover"}, {"ball": 11.5, "isHighlight": false, "text": "Kartik to du Plessis,2 runs,goes deep in his crease and works it through the midwicket region and since both men are back, it's an easy couple"}, {"ball": 11.6, "isHighlight": false, "text": "Kartik to du Plessis,1 run,  $$OUT$$ ,skips down the track for a couple to deep midwicket, but wait this is a direct hit! Mitchell Johnson collected the ball with one hand and hurled it on target at the bowlers'. McCullum was carrying his helmet while he was rushing between the wickets and is caught short by a few inches. What a throw, swift, flat and dead on."}, {"ball": 11.6, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$run$$ $$out$$ $$33$$ $$(57m$$ $$29b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$113.79$$"}, {"ball": 11.6, "isHighlight": false, "text": "So MS Dhoni finally arrives to the crease, with chants of his name from the crowd"}, {"ball": 12.1, "isHighlight": false, "text": "Patel to Dhoni,1 run,flat on middle and leg, Dhoni clips off his legs through midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to du Plessis,1 run,goes back and punches the flatter, length ball to Maxi at deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to Dhoni,1 run,chips down the track and picks up a single to Maxwell who is prowling at the midwicket boundary"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to du Plessis,no run,moves way outside leg and the bowler follows him. Takes it off leg stump but can only tap it to extra cover"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to du Plessis,1 run,flighted delivery, driven to long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Dhoni,1 run,hustles through for a quick single after nudging to extra cover"}, {"ball": 12.6, "isHighlight": false, "text": "Abhishek: \"Kings XI's next sponsor is going to be M&M chocolates.\""}, {"ball": 13.1, "isHighlight": false, "text": "Kartik to Dhoni,no run,chopped into the covers as he backs away against a flat, length ball"}, {"ball": 13.2, "isHighlight": false, "text": "Kartik to Dhoni,no run,this time he waits on it but still can't beat backward point"}, {"ball": 13.3, "isHighlight": false, "text": "Kartik to Dhoni,1 run,no flight offered to Dhoni, who goes deep in his crease and pushes through extra cover"}, {"ball": 13.4, "isHighlight": false, "text": "Kartik to du Plessis,2 runs,comes down the track and nurdles it straight of deep midwicket and this time it's a well run two to Johnson"}, {"ball": 13.5, "isHighlight": false, "text": "Kartik to du Plessis, $$FOUR$$ ,there's a little more intent. Faf dances down and pummels it down the ground. Kartick dived to try and stop it but it was struck far too hard for him"}, {"ball": 13.6, "isHighlight": false, "text": "Kartik to du Plessis, $$FOUR$$ ,saw the batsman stepping down and bowled it flat, only Faf was making room outside leg and had enough room to free his arms and drill it past the dive of the sweeper. Consecutive fours for CSK"}, {"ball": 14.1, "isHighlight": false, "text": "Patel to Dhoni,1 run,ran down the track and turned it away to short fine leg"}, {"ball": 14.2, "isHighlight": false, "text": "Patel to du Plessis,1 run,pulled to deep square leg as Akshar fires it flat on off stump"}, {"ball": 14.3, "isHighlight": false, "text": "Patel to Dhoni,no run,chopped back to the bowler as he doesn't afford him any room"}, {"ball": 14.4, "isHighlight": false, "text": "Patel to Dhoni,1 run,dabbed between backward point and short third man"}, {"ball": 14.5, "isHighlight": false, "text": "Patel to du Plessis,no run,good work from Bailey at extra cover. Faf came down the track and thumps it through the off side, but the fielder ran across to his left and planted enough doubts"}, {"ball": 14.6, "isHighlight": false, "text": "Patel to du Plessis,2 runs,worked away through midwicket and there's two for the taking. This is a very big ground"}, {"ball": 14.6, "isHighlight": false, "text": "Roy: \"Has Chennai Surrendered, already ? Looks like.\""}, {"ball": 14.6, "isHighlight": false, "text": "Kunaal Verma: \"Wake me up when September ends, or when these two stop treating this as a test match, whichever is earlier.\" It's the time out, so we'll have to wait on that. Kartik is back"}, {"ball": 15.1, "isHighlight": false, "text": "Kartik to Dhoni,2 runs,tapped calmly into midwicket where deep square leg beats Maxwell to the ball"}, {"ball": 15.2, "isHighlight": false, "text": "Kartik to Dhoni,no run,goes for it, but this was slid a little too quickly on his pads to connect with the bat"}, {"ball": 15.3, "isHighlight": false, "text": "Kartik to Dhoni,1 run,stays back and pushes to extra cover for a single"}, {"ball": 15.3, "isHighlight": false, "text": "CSK: \"equation is simple, Helicopter needs to launch for 20 times\" Also sounds impossible"}, {"ball": 15.4, "isHighlight": false, "text": "Kartik to du Plessis,1 run,backs away and slogs the flat, length ball down to long-on"}, {"ball": 15.5, "isHighlight": false, "text": "Kartik to Dhoni,2 runs,another nudge to midwicket, another couple."}, {"ball": 15.6, "isHighlight": false, "text": "Kartik to Dhoni,2 runs,skips down the track and works it to deep midwicket for a couple"}, {"ball": 15.6, "isHighlight": false, "text": "Martin Jose: \"Is Dhoni & Duplesis trying to win this match by running!!!!\" They might just have decided to let things go their course"}, {"ball": 15.6, "isHighlight": false, "text": "Mitch has another go"}, {"ball": 16.1, "isHighlight": false, "text": "Johnson to du Plessis, $$SIX$$ ,launched back over his head! Terrific strike, but one feels it's a little too late. It was length and he swung the bat through the line of the ball."}, {"ball": 16.2, "isHighlight": false, "text": "Johnson to du Plessis,1 run,walks across and looks to slash the slower delivery outside off, gets an inside edge to the left of the keeper"}, {"ball": 16.3, "isHighlight": false, "text": "Johnson to Dhoni,1 run,there's the elusive short ball at over 145kph. Dhoni is caught hopping at the crease and picks up a single of the glove"}, {"ball": 16.4, "isHighlight": false, "text": "Johnson to du Plessis, $$FOUR$$ ,slower bouncer and Faf checks his pull. Still goes where he did not intend it to as the glove gives the ball enough impetus to beat the leaping keeper"}, {"ball": 16.5, "isHighlight": false, "text": "Johnson to du Plessis, $$FOUR$$ ,down the track and hammers it over extra cover. That's another magnificent strike. Again it was in the slot and he turned it into an overpitched delivery too"}, {"ball": 16.6, "isHighlight": false, "text": "Johnson to du Plessis,1 run,yorker just outside off, Faf picks up a single to point to make it 17 off the over"}, {"ball": 16.6, "isHighlight": false, "text": "Sandeep to finish off. Around the wicket"}, {"ball": 17.1, "isHighlight": false, "text": "Sandeep Sharma to du Plessis, $$FOUR$$ ,Faf jumped outside leg, Sandeep went further down and played into his hands. Glanced to the fine leg boundary"}, {"ball": 17.2, "isHighlight": false, "text": "Sandeep Sharma to du Plessis, $$FOUR$$ ,makes room as he chips down the track and lashes it through the covers"}, {"ball": 17.3, "isHighlight": false, "text": "Sandeep Sharma to du Plessis, $$FOUR$$ ,this is the slower ball, a response to seeing the batsman moving around in his crease. But as the ball was bowled he was waiting on leg stump and tickled it fine again to bring up his fifty, off 22 balls"}, {"ball": 17.4, "isHighlight": false, "text": "Sandeep Sharma to du Plessis,1 run,advances down again, but this time he can only down to long-on"}, {"ball": 17.4, "isHighlight": false, "text": "Santosh: \"Faf is doing his part. Is Dhoni saving his energy for the last two?\" Moves over the wicket"}, {"ball": 17.5, "isHighlight": false, "text": "Sandeep Sharma to Dhoni,1 run,wide yorker, Dhoni stays rooted to his crease as he looks to chop at the ball. Gets an inside edge for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Sandeep Sharma to du Plessis,1 run,full and wide outside off, Faf drills it to long-off"}, {"ball": 17.6, "isHighlight": false, "text": "Sai Kiran: \"Need a six every ball from now !! can they do it ?? even that brings to super over \""}, {"ball": 17.6, "isHighlight": false, "text": "Swagath Subrama: \"Looks like Kings XI Punjab just like to break streaks. They broke MI's losing streak(by breaking their own winning one), and now breaking CSK's winning streak.\""}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to du Plessis, $$OUT$$ ,goes outside off to try and scoop it over the head of short fine leg, but the connection is too feeble. Kartik moves to his left and collects a simple catch"}, {"ball": 18.1, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$c$$ $$Kartik$$ $$b$$ $$Johnson$$ $$52$$ $$(31m$$ $$25b$$ $$7x4$$ $$1x6)$$ $$SR:$$ $$208.00$$"}, {"ball": 18.1, "isHighlight": false, "text": "Mithun Manhas comes out with 11 balls left in the innings"}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to Dhoni,no run,full toss outside off, belted to midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Johnson to Dhoni, $$SIX$$ ,gets under this length ball and sent it soaring over the long-on boundary. Think he held the pace off on that and gets punished"}, {"ball": 18.4, "isHighlight": false, "text": "Johnson to Dhoni,2 runs,shortish and outside off, steered through point to the man in the deep"}, {"ball": 18.5, "isHighlight": false, "text": "Johnson to Dhoni, $$OUT$$ ,the top hand came off the bat as he goes for the pull. But this Johnson short ball was a little too quick for him. Top edge caught easily at midwicket"}, {"ball": 18.5, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ $$c$$ $$Bailey$$ $$b$$ $$Johnson$$ $$23$$ $$(29m$$ $$20b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$115.00$$"}, {"ball": 18.5, "isHighlight": false, "text": "R Ashwin comes out the middle and taps gloves with Manhas"}, {"ball": 18.6, "isHighlight": false, "text": "Johnson to Manhas,1 run,walks across and drags this short ball to square leg"}, {"ball": 18.6, "isHighlight": false, "text": "$$We$$ $$will$$ $$rock$$ $$you$$  plays out with 64 needed off the final over. CSK well and truly rocked. Ironically, Rishi Dhawan still takes his time to set his field"}, {"ball": 19.1, "isHighlight": false, "text": "Dhawan to Manhas,1 run,just short of a good length and Manhas lofts it down to long-off"}, {"ball": 19.2, "isHighlight": false, "text": "Dhawan to Ashwin,2 runs,fires it in full and on middle, they pick up a couple to deep midwicket"}, {"ball": 19.2, "isHighlight": false, "text": "akshs: \"really a lack of heart by CSK.. they have waited till the !&th over to explode.. too late.. after the required run rate was above 26 RPO.. they should have given it a try in the 11th over.. when the required rate was 14.7 and had 8 wickets in hand.. really heart broken.. :'(\""}, {"ball": 19.3, "isHighlight": false, "text": "Dhawan to Ashwin, $$FOUR$$ ,gets a lucky outside edge that dribbles away. this was the legcutter and the deflection beats the dive of the keeper"}, {"ball": 19.4, "isHighlight": false, "text": "Dhawan to Ashwin, $$FOUR$$ ,another outside edge and another four to third man. Backed away but the bowler tried to put it out of his reach outside off, but Ashwin is able to get just enough bat"}, {"ball": 19.5, "isHighlight": false, "text": "Dhawan to Ashwin,1 run,keeps it full on middle, tucked to deep midwicket"}, {"ball": 19.6, "isHighlight": false, "text": "Dhawan to Manhas,1 wide,he has to bowl that again. Slower ball slanted well down the off side"}, {"ball": 19.6, "isHighlight": false, "text": "Maxi and Miller are playing with the crowd at the boundary. Asking them to make some more noise"}, {"ball": 19.6, "isHighlight": false, "text": "Dhawan to Manhas, $$SIX$$ ,short ball, hurries him as he goes for a pull. Sails over the fine leg boundary to end a thorough thumping. And that's saying something considering CSK made 187"}, {"ball": 19.6, "isHighlight": false, "text": "Kings XI are 2-0 against Super Kings now and some of our commenters are already predicting another showdown in the final. I for one won't rule that out. They look the two strongest batting line-ups and showcased that today. Amid today's manic game, Kieron Pollard and Mitchell Starc were fined for their distasteful confrontation. Our Assistant Editor Nagraj Gollapudi weighs in on the incident and the  $$message$$ IPL sends. That's all for now, this is Alagappan Muthu, signing off"}, {"ball": 19.6, "isHighlight": false, "text": "$$Glenn$$ $$Maxwell$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Pitch was lovely, coming on quite well. The spinners held up a little and we got away quickly. We [him and Miller] love batting together, we talking about it a lot and it was fun to have a big partnership together and hit a few out of the park. Practice it and keep trying to expand my game and try and hit the ball to different parts of the ground. Keep trying to do what I'm doing and we're winning as well. We didn't have an idea in mind, thought the pitch would get better in the second innings but once we went there we saw how good it was and we just kept going. Kings XI fans have been great and hopefully the fans come out again for us\""}, {"ball": 19.6, "isHighlight": false, "text": "Just fyi, Kings XI go top of the table on the basis of a spectacular net run-rate. \"Dont relaly know what to say about it. It was something brilliant,\" $$George$$ $$Bailey$$  says. \"It was almost the future what we saw there. Maxi and Davey, the shots they played and even the other young players and their shots. They gave themselves a little time and that was crucial. I had a bit of luck tonight as well. Nice to see a good sized ground, I think we could have defended a little better and it was about being smart and our bowlers are clever. Chennai are the benchmark and for us to beat them a couple of times it gives us confidence\""}, {"ball": 19.6, "isHighlight": false, "text": "\"Maxwell batted exceptionally well and he was supported by the other batsmen as well. Where we lost the game was when our spinners came on and they got plenty out of them. The first 10 overs they were only 70 but the next 10, Maxwell got them to 40 over par,\" says  $$MS$$ $$Dhoni$$ , \"You [Maxwell's reverse slogs] can try, but you need some serious talent to do it one after the other. He is someone who is very different, like Sehwag or Tendulkar and he is batting at his best. Very good wicket, bit of bounce for the quicks but in the second innings it became two-paced. it's very important in a tournament like this, looking to score 230 and getting out for 130, then in the coming games we wouldn't be able to make it up. If we had got off to a great start, we could have gone for it. But we lost Smith and Jadeja was our final throw of the die but when he fell, we decided to just play it out\""}, {"ball": 19.6, "isHighlight": false, "text": "K SHANKAR: \"George Bailey must be the MAN of Match .. It was his innings that put the final score of Punjab out of the reach of CSK .... Maxwell's hitting is a common occurrence.. and Punjab have lost even when he scored \" Not likely, but I can understand the sentiment"}, {"ball": 19.6, "isHighlight": false, "text": "$$11.25$$ $$pm$$  Super Kings tried to pace this chase. But they lost Dwayne Smith in the first over. As is their wont, they tried to get it into the last few overs but Kings XI Punjab's spinners adapted to their task well. Faf du Plessis managed a few late hits to get to a half-century but Maxwell, Miller and Bailey had put the game beyond one of the better batting line-ups this season"}], "name": "Kings XI Punjab v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733987.html?innings=2;view=commentary", "match_num": 29}