{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$2.30$$ $$pm$$  The umpires are first out onto the field. Punjab are milling around the boundary rope and with a couple of taps to the shoulder, they jog out as well. And we've got two brand new openers for Chennai in Brendon McCullum and Dwayne Smith. Spin to start off with as Akshar Patel is given the ball"}, {"ball": 0, "isHighlight": false, "text": "Mohit: \"Badree would have been great choice in place of Pawan Negi, as he would have give extra variety to spin and Smith could make way for Baba Aprajith\""}, {"ball": 0, "isHighlight": false, "text": "Hiteshwar: \"Also a lil bit surprised by the exclusion of Murali Kartik. Dont know how good is akshar in front of an old war horse kartik. Further, hope viru fires this tournament and takes punjab to win.\""}, {"ball": 0, "isHighlight": false, "text": "$$2.20$$ $$pm$$  We've got about ten minutes till the start of this double-header. A few of our readers can't piece together why Manan Vohra was retained by Punjab and yet doesn't make their XI. But what's this extravaganza without a couple of strange calls?"}, {"ball": 0, "isHighlight": false, "text": "Sampritha: \"Excited to see young talented all rounders Rishi Dhawan and Akshar Patel get a game. A bit surprised by the exclusion of Manan Vohra. Go Punjab!!\""}, {"ball": 0, "isHighlight": false, "text": "$$2.00$$ $$pm$$ $$Chennai$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bat$$  \"First game of the tournament, get some runs on the board. It will have a bit of pace for the quicks but the base of the pitch is pretty dry. The grass will make sure the ball comes onto the bat,\" says MS Dhoni, Faf, McCullum, Dwaynes Bravo and Smith are the overseas players"}, {"ball": 0, "isHighlight": false, "text": "$$Chennai$$ $$XI$$ : McCullum, Dwayne Smith, Raina, Faf, Dhoni, Bravo, Jadeja, Ashwin, Negi, Nehra, Mohit"}, {"ball": 0, "isHighlight": false, "text": "$$Punjab$$ $$XI$$ : Sehwag, Pujara, Miller, Maxwell, Bailey, Saha, Johnson, Akshar Patel, Rishi Dhawan, Parvinder Awana, L Balaji"}, {"ball": 0, "isHighlight": false, "text": "\"Couple of reasonable quicks so we don't mind bowling, Mitchell Johnson can hopefully be fired up,\" says George Bailey the Punjab captain"}, {"ball": 0, "isHighlight": false, "text": "Wasim Kazmi: \"Of course Chennai bat; who wants to field in the 40 deg C oven!!!\""}, {"ball": 0, "isHighlight": false, "text": "Sahil: \"Would like to see Baba Aparajith in the scheme of things. I believe he and Sanju Samson are the young Indian players to watch out for.\""}, {"ball": 0, "isHighlight": false, "text": "$$1.45pm$$  Mitch will be making his first appearance since a toe infection and he's been  $$raring$$ to go, as usual. Are Chennai ready for the Man with the 'Mo? At the other end is Suresh Raina, the most prolific run-scorer in the tournament, set to make his 100th appearance in yellow"}, {"ball": 0, "isHighlight": false, "text": "Sameer Karkhani: \"Chennai should go with B McCullum, D Bravo, D Smith and S Badree, they can afford to drop Faf for few games to see if Smith fits in the playing XI.\""}, {"ball": 0, "isHighlight": false, "text": "Sai: \"Eagerly waiting for Viru's comeback.. had a feast yesterday from Yuvi.. Its show time now..\""}, {"ball": 0, "isHighlight": false, "text": "Sahil: \"Disagree completely with those who call Chennai pace attack as weak. I think the addition of Ashish Nehra in the side opens a slot for an overseas spinner or all rounder (previously occupied by an overseas fast bowler). D Smith, D Bravo, M Sharma and A Nehra (provided he is fit) form a varied and good attack which can ably support the spin trio (R Jadeja, R Ashwin and S Badree) while McCullum can come in as the fourth overseas player.\""}, {"ball": 0, "isHighlight": false, "text": "Today is the seventh-year anniversary for this tournament, seven years since Brendon McCullum collared the world's attention with one of the most famous  $$centuries$$ in recent time. Wonder how he's going to commemorate the occasion..."}, {"ball": 0, "isHighlight": false, "text": "sudha: \"Till now we have seen most of the T20 known big hitters could not blast in their first match (likes of Pathan, Shakib, Pollard, Anderson)..do you think today's hitters will make the difference.. I'm eager to see..how Maxwell will continue his recent form\""}, {"ball": 0, "isHighlight": false, "text": "$$1.30$$ $$pm$$  Two teams hunting for redemption will be in action throughout the day today and first up it will be Chennai who will take on a revamped Punjab. This is Alagappan Muthu again (I never go off comms, ever!) and  $$here$$  is all you need to know about the ins and outs of this match, provided by Abhishek Purohit"}, {"ball": 0, "isHighlight": false, "text": "Still not figuring at the top end of the  $$CricIQ$$  leaderboard? Fret not - the best thing about CricIQ is that you get to wipe the slate clean every day and start afresh. And all it takes is one good attempt. The Greatest Test ever rolls on.. Pad up.  $$Play!$$"}, {"ball": 0.1, "isHighlight": false, "text": "Patel to Smith,1 run,drifting on the pads and Smith eases it to deep midwicket"}, {"ball": 0.2, "isHighlight": false, "text": "Patel to McCullum,2 runs,shortish and cut behind square. Sloppy work from short third man. Seemed to have had it covered but then he mistimed the dive and gifts a single. Not the best start to the match for Sehwag"}, {"ball": 0.3, "isHighlight": false, "text": "Patel to McCullum,5 wides,fires a flatter one down the leg side, Baz goes for a pull but it is too far for him to reach and the ball skims off the turf"}, {"ball": 0.3, "isHighlight": false, "text": "Patel to McCullum,no run,tossed up outside off, driven into the covers"}, {"ball": 0.4, "isHighlight": false, "text": "Patel to McCullum,no run,goes on with the arm and Baz takes it off middle stump and chops to backward point"}, {"ball": 0.5, "isHighlight": false, "text": "Patel to McCullum,no run,flighted on middle and off, he comes forward to block"}, {"ball": 0.6, "isHighlight": false, "text": "Patel to McCullum,1 run,hustles for a quick single and had the bowler's throw broken the stumps things might have been interesting. Baz nudged to the right of the bowler and took off just that smallest bit late"}, {"ball": 0.6, "isHighlight": false, "text": "Parvinder Awana from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Awana to McCullum,no run,cracked off the back foot as he starts off with a shortish delivery with a bit of room. Baz's flaying blade finds cover"}, {"ball": 1.2, "isHighlight": false, "text": "Awana to McCullum, $$FOUR$$ ,he tried to outsmart him by bowling short but McCullum's so good square of the wicket. Raced down the track and though it was dug in short he lashed it over the infield to the point boundary"}, {"ball": 1.3, "isHighlight": false, "text": "Awana to McCullum, $$FOUR$$ ,got a lot closer to off stump with the back of a length delivery, McCullum goes for the pull and gets a top edge that sails over the keeper's desperate leap"}, {"ball": 1.4, "isHighlight": false, "text": "Awana to McCullum,no run,charges him and looks to smash the length ball into the leg side. Inside edges it to short fine. Played way too early"}, {"ball": 1.4, "isHighlight": false, "text": "MrGarreth: \"Chennai's top 8 have all played over a 100 T20 games! Phenomenal stat and shows how much they value experience particularly when it comes to batting.\""}, {"ball": 1.5, "isHighlight": false, "text": "Awana to McCullum,1 wide,Punjab need to get their lines right, that's their second spill down the leg side"}, {"ball": 1.5, "isHighlight": false, "text": "Awana to McCullum,no run,shortish and just enough room for Baz to tap it into the covers where Rishi Dhawan sprawls to left to save a boundary"}, {"ball": 1.6, "isHighlight": false, "text": "Awana to McCullum,1 run,fullish and on the stumps, he pushes it down to mid-on"}, {"ball": 1.6, "isHighlight": false, "text": "Mridul Shandily: \"Saving Johnson for Raina? Smart move in my opinion!\" Not quite"}, {"ball": 2.1, "isHighlight": false, "text": "Johnson to McCullum,1 run,138 kph, the lack of pace surprised Baz. Think this held in the pitch a little more Baz who was looking to drive on the up had to check his shot. Went uppishly but it evaded the cover field"}, {"ball": 2.2, "isHighlight": false, "text": "Johnson to Smith, $$FOUR$$ ,smashed! Overpitched from Johnson and he eases onto his front foot and drills it through extra cover"}, {"ball": 2.3, "isHighlight": false, "text": "Johnson to Smith,1 leg bye,back of a length on middle and leg, he goes back and blocks and manages an inside edge that squirts out into the on side"}, {"ball": 2.4, "isHighlight": false, "text": "Johnson to McCullum,2 runs,dug in short and Baz was cramped for room, looks to pull it down to long leg but he wasn't in control of that"}, {"ball": 2.5, "isHighlight": false, "text": "Johnson to McCullum,no run,fires it in full and outside off, Baz was rooted to the crease and goes for an expansive cover drive but only manages an inside edges it"}, {"ball": 2.6, "isHighlight": false, "text": "Johnson to McCullum, $$SIX$$ ,phew, what a strike! It was short and afforded him enough room to upper cut it and he's put enough muscle into it to clear the ropes"}, {"ball": 2.6, "isHighlight": false, "text": "L Balaji is the new bowler"}, {"ball": 3.1, "isHighlight": false, "text": "Balaji to Smith,no run,back of a length on off stump, Smith punches down to mid-on"}, {"ball": 3.2, "isHighlight": false, "text": "Balaji to Smith, $$FOUR$$ ,shifted his weight onto the back foot and he's just picked up this short ball from outside off and carted it to the square leg boundary. Whistled away to the boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Balaji to Smith,1 wide,shortish and outside off, Smith doesn't bother with the feet again as he flashes outside off. Ump says he's toed the wrong side of the line"}, {"ball": 3.3, "isHighlight": false, "text": "Balaji to Smith,1 leg bye,pushes this on the pads and Smith tries to work it into the midwicket, doesn't get bat to it though"}, {"ball": 3.4, "isHighlight": false, "text": "Balaji to McCullum,no run,charges down the track and the change of pace deceives Baz. Looks to lash through the off side but gets a bottom edge to mid-on"}, {"ball": 3.5, "isHighlight": false, "text": "Balaji to McCullum,1 run,waits on this nicely, stays beside the shortish ball and taps to deep cover"}, {"ball": 3.5, "isHighlight": false, "text": "Gaurav w: \"There is the difference in t20 approach, CSK began with two most powerful hitters Baz and Smith in their team. KXIP should have begun with Mitch straight away. Always start with our best bowler.\""}, {"ball": 3.6, "isHighlight": false, "text": "Balaji to Smith,1 run,full and angled into the pads, Smith isn't able to whip it away and has to settle for a single"}, {"ball": 4.1, "isHighlight": false, "text": "Awana to Smith, $$FOUR$$ ,digs it into the middle of the deck again and Smith is comfortably pulling them from the crease to the square leg boundary"}, {"ball": 4.2, "isHighlight": false, "text": "Awana to Smith, $$FOUR$$ ,bit of extra bounce outside off the off and Smith rides it well enough with a cut that sails well over the infield. Couple of bounces and into the hoardings"}, {"ball": 4.3, "isHighlight": false, "text": "Awana to Smith,1 run,continues back of a length but this is the slower one, Smith works it into the leg side to bring up the Chennai fifty"}, {"ball": 4.3, "isHighlight": false, "text": "Kewadoo: \"As a Kiwi, hate seeing McCullum wearing yellow, it feels like he's playing for Australia.\""}, {"ball": 4.4, "isHighlight": false, "text": "Awana to McCullum,no run,shortish delivery, pulled to square leg. Didn't get the middle"}, {"ball": 4.5, "isHighlight": false, "text": "Awana to McCullum,1 wide,he tried his hardest to reach the short ball outside off but it was just too far away."}, {"ball": 4.5, "isHighlight": false, "text": "Awana to McCullum,2 runs, $$dropped$$ , it's the captain himself at mid-on who spills it. It was a length ball on off stump, Baz plants his front leg down and slaps it down the ground. Doesn't time it at all and the fielder had to go to his left a bit. Dives at the last minute but the ball bursts through. That's 5000 T20 runs for McCullum"}, {"ball": 4.6, "isHighlight": false, "text": "Awana to McCullum, $$SIX$$ ,into orbit! Races down the track to pick it up off a length and deposit well into the crowd behind long-on. McCullum's done away with defensive strokes"}, {"ball": 4.6, "isHighlight": false, "text": "Sudipta: \"@Kewadoo, don't worry Australia wears mostly green nowadays with only a speck of yellow here and there :)\""}, {"ball": 5.1, "isHighlight": false, "text": "Johnson to Smith,no run,fullish on middle and leg, nudged to short midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Johnson to Smith,1 run,a little slower on off stump, Smith is wise to it and guides it off the back foot to third man"}, {"ball": 5.3, "isHighlight": false, "text": "Johnson to McCullum, $$FOUR$$ ,offers up another overpitched delivery outside off, Baz says thank you very much and lofts it over extra cover"}, {"ball": 5.4, "isHighlight": false, "text": "Johnson to McCullum,no run,skips down the track and looks to smash it down the ground, but swings down the wrong line. Well beaten"}, {"ball": 5.5, "isHighlight": false, "text": "Johnson to McCullum, $$SIX$$ ,pummeled into the grass banks! It's short, it's on the leg stump and it's been pulled with the utmost authority. No point keeping it down when you can hit it that far"}, {"ball": 5.6, "isHighlight": false, "text": "Johnson to McCullum,no run,fires it in on off stump, McCullum drills it back down the ground and it's so straight it hits the timber at the bowler's end"}, {"ball": 5.6, "isHighlight": false, "text": "Patel's back"}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Smith,1 wide,slides a length ball down the leg side"}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Smith,1 run,flatter delivery on the stumps, picked away through midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to McCullum,1 run,shuffles across a bit and turns the tossed up ball off his pads for a single in front of square leg"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to Smith,no run,a lot quicker this time and it goes on with the arm, defended"}, {"ball": 6.4, "isHighlight": false, "text": "Patel to Smith,1 run,stays back and tucks the short of a length ball away into the square leg region"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to McCullum,1 wide,fires it down the leg side again, that's the second one off target"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to McCullum,no run,goes for the sweep this time as he sees a bit more flight on it, struck on the front pad but it might have been sliding down leg"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to McCullum,1 run,good length ball cut off the stumps for a single through the covers"}, {"ball": 6.6, "isHighlight": false, "text": "Kapil: \"That's the prob with T20. There aren't many bowlers who can challenge a batter with good line and length. Punjab have bowled really wayward here.\""}, {"ball": 6.6, "isHighlight": false, "text": "Rishi Dhawan, the highest wicket-taker in the Ranji season, comes on"}, {"ball": 7.1, "isHighlight": false, "text": "Dhawan to McCullum, $$SIX$$ ,oh dear, he can't bowl short at his pace. Baz saw it early and hammers it over the square leg boundary."}, {"ball": 7.2, "isHighlight": false, "text": "Dhawan to McCullum,1 run,this time on the diametrically opposite side of the field. Punjab are spraying it around here. Short ball outside off slapped to the sweeper"}, {"ball": 7.3, "isHighlight": false, "text": "Dhawan to Smith,1 run,that's better. Tighter line on off stump and a fuller length. Pushed to long-on"}, {"ball": 7.4, "isHighlight": false, "text": "Dhawan to McCullum, $$FOUR$$ ,slashed behind point and this time Johnson isn't quick enough to cut it off. That's  $$fifty$$  for McCullum on Chennai debut and on the seventh-year anniversary of his 158"}, {"ball": 7.4, "isHighlight": false, "text": "Rakesh Jain: \"Dhoni once said that Baz cannot hit 300 for him, But he can sure target half of it if he continues at the same pace !!!\""}, {"ball": 7.5, "isHighlight": false, "text": "Dhawan to McCullum,1 run,slower ball angled into him, worked away into the midwicket region"}, {"ball": 7.6, "isHighlight": false, "text": "Dhawan to Smith,no run,little too ambitions from Smith. It was back of a length and the width lured him into chasing it. But he was on the front foot, which foiled his chances of connecting. And Punjab breathe a sigh of relief as the strategic time out is called"}, {"ball": 7.6, "isHighlight": false, "text": "ragu: \"@Kewadoo: Fleming was with us in yellow for almost 7 yrs now ;) \""}, {"ball": 7.6, "isHighlight": false, "text": "nagaraju mallis: \"haahhh.......thoughtless bowling......hold your nerve Punjab....just maintain you line and length....And Bailey get spinners on....\""}, {"ball": 8.1, "isHighlight": false, "text": "Patel to McCullum,no run,nice bowling that, tossed up on middle and keeps McCullum to a defensive push"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to McCullum,1 run,pulls the flight back a bit which allows Baz to go back and nudge it around the corner"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to Smith, $$FOUR$$ ,that's a bazooka down the ground! Loved the flight on this and just bludgeoned it off the front foot"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to Smith,1 run,goes shorter and quicker, Smith works it for a single to midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to McCullum,no run,shortish and angled into him, Baz pushes down the ground"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to McCullum,1 run,fired in on middle and leg, Baz shuffles across and clips it behind square leg"}, {"ball": 8.6, "isHighlight": false, "text": "Balaji comes back"}, {"ball": 9.1, "isHighlight": false, "text": "Balaji to McCullum,1 run,full and just outside off, he drives all along the ground to deep cover"}, {"ball": 9.2, "isHighlight": false, "text": "Balaji to Smith,2 runs,width outside off and Smith comes forward and powers it to the left of mid-off"}, {"ball": 9.3, "isHighlight": false, "text": "Balaji to Smith,1 run,pulls all the pace off this ball as he targets the wide line. He reaches out and slashes it over the infield for the fastest hundred of the tournament so far"}, {"ball": 9.4, "isHighlight": false, "text": "Balaji to McCullum,1 run,dances down the track while making room for himself and laces a drive to long-off"}, {"ball": 9.5, "isHighlight": false, "text": "Balaji to Smith,no run,keeps him quiet with a very full delivery just outside off"}, {"ball": 9.6, "isHighlight": false, "text": "Balaji to Smith,1 run,fullish and outside off, he goes for a hack to midwicket and gets an inside edge"}, {"ball": 9.6, "isHighlight": false, "text": "Sidharth: \"Had George forgot about maxwell ? he should give him bowling, he always picks up few wickets at crucial points\" Maxi around the wicket"}, {"ball": 10.1, "isHighlight": false, "text": "Maxwell to Smith, $$SIX$$ ,again offers him room and the length to get under and Smith has carted it over long-on"}, {"ball": 10.2, "isHighlight": false, "text": "Maxwell to Smith,2 runs,fired in outside off, driven down the ground for a couple. Good running"}, {"ball": 10.3, "isHighlight": false, "text": "Maxwell to Smith,no run,pulls the pace off it and this turns away from the bat, it was the legspinner from Maxi and Smith was well beaten"}, {"ball": 10.4, "isHighlight": false, "text": "Maxwell to Smith,1 run,flat-batted down the ground as this is shortish and outside off"}, {"ball": 10.5, "isHighlight": false, "text": "Maxwell to McCullum,1 run,short again, McCullum rocks back and cuts to the sweeper"}, {"ball": 10.6, "isHighlight": false, "text": "Maxwell to Smith,no run,he waited on it but the cut shot still finds point, that first ball six has made him fire the rest in"}, {"ball": 10.6, "isHighlight": false, "text": "Darshan Singh: \"I think Sehwag can bowl a few good overs to stop Baz and Smith.\" It'll be Rishi Dhawan though. Keeper standing up"}, {"ball": 11.1, "isHighlight": false, "text": "Dhawan to McCullum,1 run,length ball outside off, McCullum is balanced at the crease and pulls it to deep midwicket"}, {"ball": 11.2, "isHighlight": false, "text": "Dhawan to Smith,1 run,good length ball on and around off stump, Smith punches it down to long-off"}, {"ball": 11.3, "isHighlight": false, "text": "Dhawan to McCullum,no run,back of a length and it gets a little extra from the pitch as McCullum's slash comes out second best"}, {"ball": 11.4, "isHighlight": false, "text": "Dhawan to McCullum,1 run,drags it from well outside off and pulls down to long-on. Short of a good length again"}, {"ball": 11.5, "isHighlight": false, "text": "Dhawan to Smith,1 run,good length ball outside off, it was a little slower too and he taps it down to the man at deep cover"}, {"ball": 11.6, "isHighlight": false, "text": "Dhawan to McCullum,no run,flighted on middle and off, he goes for a sweep but manages an inside edge which must have saved him"}, {"ball": 12.1, "isHighlight": false, "text": "Patel to Smith,1 run"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to McCullum, $$SIX$$ ,races down the track as he makes some room and launches this over the man at long-off"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to McCullum,no run,stays beside the ball which is fired in outside off, steered to point"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to McCullum, $$OUT$$ ,pushed through on middle and leg as he rocks back and goes for an almighty pull. Hasn't connected it properly and Maxi at deep midwicket takes a tumbling catch to break Chennai's seventh century opening partnership"}, {"ball": 12.4, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Maxwell$$ $$b$$ $$Patel$$ $$67$$ $$(45b$$ $$4x4$$ $$5x6)$$ $$SR:$$ $$148.88$$"}, {"ball": 12.4, "isHighlight": false, "text": "Suresh Raina walks out to bat in his 100th match"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to Smith,1 run,full toss outside off, pushed down the ground to long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Raina, $$FOUR$$ ,dabs it nice and fine and gets off the mark with a boundary. Hint of room outside off and Raina goes back and opens the face to beat short third man"}, {"ball": 12.6, "isHighlight": false, "text": "AJ: \"Lets have some chin music please!!!!!\""}, {"ball": 13.1, "isHighlight": false, "text": "Dhawan to Smith,no run,full and on off stump, Smith pushes back to the bowler"}, {"ball": 13.1, "isHighlight": false, "text": "Munish Yadav: \"The way Baz's innings was played it seemed he was scoring at a strike rate of 300 !!! But the strike rate was just 148. I thought he just throws his bat around and nothing more. Duminy also scored some 60 odd runs yesterday, but his innings looked of an accomplished batsman. \""}, {"ball": 13.2, "isHighlight": false, "text": "Dhawan to Smith,1 run,fires it in on middle and leg and it's punched down to long-on. Nicely bowled"}, {"ball": 13.3, "isHighlight": false, "text": "Dhawan to Raina,no run, $$dropped$$  by the keeper. Slower ball off the back of the hand, Raina made some room to drive through the off side and gets a thick edge which the Saha can't rein in"}, {"ball": 13.4, "isHighlight": false, "text": "Dhawan to Raina,1 run,shortish and on middle, pulled to deep midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Dhawan to Smith,1 run,stays put to loft the overpitched delivery to long-off. Hit in the air bit falls short of the man rushing in"}, {"ball": 13.6, "isHighlight": false, "text": "Dhawan to Raina,1 run,full on middle, clipped away to deep midwicket"}, {"ball": 14.1, "isHighlight": false, "text": "Maxwell to Raina,no run,tossed up on middle, Raina looks to drive through extra and gets an inside edge onto pad"}, {"ball": 14.2, "isHighlight": false, "text": "Maxwell to Raina,1 run,skips down the track and looks to beat short cover but has to settle for the single when Bailey misfields"}, {"ball": 14.3, "isHighlight": false, "text": "Maxwell to Smith,1 run"}, {"ball": 14.4, "isHighlight": false, "text": "Maxwell to Raina,1 run"}, {"ball": 14.5, "isHighlight": false, "text": "Maxwell to Smith, $$FOUR$$ ,flighted outside off, Smith gets down on one-knee and reverses sweeps it to the third man boundary"}, {"ball": 14.6, "isHighlight": false, "text": "Maxwell to Smith, $$SIX$$ ,tossed up on off stump, Smith gets onto the front foot and slams it down the ground. Soaring six over long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Johnson's back"}, {"ball": 15.1, "isHighlight": false, "text": "Johnson to Raina,1 run,goes for the yorker on off stump, Raina is good enough to dig it out past the bowler's extended left hand"}, {"ball": 15.1, "isHighlight": false, "text": "goes around the wicket"}, {"ball": 15.2, "isHighlight": false, "text": "Johnson to Smith, $$SIX$$ ,doesn't find the block hole this time and Smith sees it in the slot and pummels it to the long-on boundary"}, {"ball": 15.3, "isHighlight": false, "text": "Johnson to Smith,1 run,141kph, nice and full outside off as he drags it away wide of long-on"}, {"ball": 15.4, "isHighlight": false, "text": "Johnson to Raina, $$FOUR$$ ,length ball on off stump, Raina swings madly and gets it more off a thickish inside edge than anything. But it's got enough wood on it to find the boundary at deep midwicket"}, {"ball": 15.5, "isHighlight": false, "text": "Johnson to Raina,1 run,fired in full and outside off, Raina steers it through point with an open face"}, {"ball": 15.5, "isHighlight": false, "text": "akshdp: \"@munish.. for that matter.. see Raina's career strike rate... more than many power hitters like McCullum, AB.. and Raina doesnt seems to be that threatening as he doesnot concede many dots.. singles and doubles are always on with him.. \""}, {"ball": 15.6, "isHighlight": false, "text": "Johnson to Smith,(no ball) 1 run,he's  $$overstepped$$ . What is happening with Mitchell Johnson?! He got the length right though, fullish delivery pushed down to mid-off"}, {"ball": 15.6, "isHighlight": false, "text": "Johnson to Raina,no run,low full toss on off stump, Raina opts for a nudge to the free-hit delivery and can't even beat the bowler"}, {"ball": 16.1, "isHighlight": false, "text": "Balaji to Smith,1 wide,Slower full toss and he directs it a little too far outside off"}, {"ball": 16.1, "isHighlight": false, "text": "Balaji to Smith,no run,Pitches the wide Yorker right this time and though Smith shuffles across and looks to steer it to third man, he can't connect"}, {"ball": 16.2, "isHighlight": false, "text": "Balaji to Smith, $$OUT$$ ,one slog too many for Smith and he has to walk back dismissed off a full toss. Sought the wide yorker again but it ends up a lovely delivery to be smacked over the covers but Smith swing across the line and got a leading edge which is taken by Bailey in the covers"}, {"ball": 16.2, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Bailey$$ $$b$$ $$Balaji$$ $$66$$ $$(43b$$ $$6x4$$ $$3x6)$$ $$SR:$$ $$153.48$$"}, {"ball": 16.3, "isHighlight": false, "text": "Balaji to Raina,1 run,backs away and slashes a length ball behind point to bring MS Dhoni the new batsman on strike"}, {"ball": 16.4, "isHighlight": false, "text": "Balaji to Dhoni, $$FOUR$$ ,low full toss wide of off stump and Dhoni squeezes it away to the third man boundary"}, {"ball": 16.5, "isHighlight": false, "text": "Balaji to Dhoni,2 runs,good length ball, possibly a bit slower outside off. Dhoni was down the track and guides it to short third man. An overthrow allows for a second"}, {"ball": 16.6, "isHighlight": false, "text": "Balaji to Dhoni, $$FOUR$$ ,gets another fortuitous edge to the third man boundary. This is what happens when you can't execute that wide yorker, too much room on offer and an open blade is enough to take advantage"}, {"ball": 17.1, "isHighlight": false, "text": "Johnson to Raina,2 runs,full on off stump, carted down the ground to long-on"}, {"ball": 17.1, "isHighlight": false, "text": "Jeeves: \"Bowl wide of the off stump with no 3rd man and 3 men in the deep on the legside? Bizarre field placement from Bailey and Balaji\""}, {"ball": 17.2, "isHighlight": false, "text": "Johnson to Raina,2 runs,length ball on off stump, Raina swings it down to deep square leg. Hadn't middled it properly"}, {"ball": 17.3, "isHighlight": false, "text": "Johnson to Raina,no run,slower ball outside off, Raina was backing away towards the leg side though and had reach out for it. Finds point"}, {"ball": 17.4, "isHighlight": false, "text": "Johnson to Raina,1 run,thumped down the ground but long-off is on hand to keep it to a single. Doesn't get the yorker right"}, {"ball": 17.4, "isHighlight": false, "text": "Around the wicket to Dhoni"}, {"ball": 17.5, "isHighlight": false, "text": "Johnson to Dhoni,1 run,fullish and outside off, Dhoni drags it out to midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Johnson to Raina,2 runs,fullish on off stump, hacked down to long-on"}, {"ball": 17.6, "isHighlight": false, "text": "Dijo: \"Why isn't Johnson bowling short and fast? He has always been off when he tries to bowl length. I thought this was the great revelation of the Australian summer.\" Parvinder Awana returns"}, {"ball": 18.1, "isHighlight": false, "text": "Awana to Dhoni,2 runs,length ball with loads of room and Dhoni belts it to the man at deep cover"}, {"ball": 18.2, "isHighlight": false, "text": "Awana to Dhoni,1 run,again ample opportunity to swing those shoulders and Dhoni lashes to the sweeper again"}, {"ball": 18.3, "isHighlight": false, "text": "Awana to Raina,2 runs,shortish and on the stumps, Raina was cramped while he was trying to pull that away. Gets it off the higher part of the bat to long-on"}, {"ball": 18.4, "isHighlight": false, "text": "Awana to Raina, $$OUT$$ ,scooped it straight into the hands of Sehwag at short fine leg. It was the offcutter which did not allow Raina the pace he wanted. Walked right across his stumps to manufacture a big shot and perishes"}, {"ball": 18.4, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Sehwag$$ $$b$$ $$Awana$$ $$24$$ $$(19b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$126.31$$"}, {"ball": 18.4, "isHighlight": false, "text": "Dwayne Bravo comes out for the last eight balls of the innings"}, {"ball": 18.5, "isHighlight": false, "text": "Awana to Bravo,1 run,shortish and ducking back in at him, Bravo rides it down to deep third man"}, {"ball": 18.6, "isHighlight": false, "text": "Awana to Dhoni,1 run,slower ball outside off, Dhoni eases it through point with an open face"}, {"ball": 18.6, "isHighlight": false, "text": "Balaji for the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Balaji to Dhoni, $$SIX$$ ,and offers up a length ball with enough room for Dhoni to crunch it over long-on. Massive six"}, {"ball": 19.2, "isHighlight": false, "text": "Balaji to Dhoni,1 run,full and wide outside off, Dhoni has one foot off the ground and laces it to deep point"}, {"ball": 19.3, "isHighlight": false, "text": "Balaji to Bravo, $$SIX$$ ,full tos outside off and Bravo has crashed it over the man at deep cover. Punjab, as they have been doing all innings, are missing their lengths"}, {"ball": 19.4, "isHighlight": false, "text": "Balaji to Bravo,1 run,another full toss on middle and leg, Bravo flicks wide of long-on"}, {"ball": 19.5, "isHighlight": false, "text": "Balaji to Dhoni, $$FOUR$$ ,races down the track and though the bowler went short and tried to put it past the reach of Dhoni's lashing blade, the captain connects and powerfully enough to beat the fielder at deep midwicket"}, {"ball": 19.6, "isHighlight": false, "text": "Balaji to Dhoni, $$OUT$$ ,holes out at long-off and Chennai finish at 205. Another full toss outside off but Dhoni can't get the meaty part of the bat on this. Lofts it down the throat of Rishi Dhawan"}, {"ball": 19.6, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ $$c$$ $$Dhawan$$ $$b$$ $$Balaji$$ $$26$$ $$(11b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$236.36$$"}, {"ball": 19.6, "isHighlight": false, "text": "$$4.10$$ $$pm$$  Chennai rode on the back of a belligerent opening partnership, which raised their best score after the powerplay in the Indian T20. But both McCullum and Smith were helped in no small extent by some extremely wayward bowling. They were short, they were wide and they overpitched way too often as well. A lack of variety hurt Punjab and Mitchell Johnson's threat did not make an appearance at all."}, {"ball": 19.6, "isHighlight": false, "text": "Suresh Raina was quite pleased with their new acquisitions and praised McCullum and Smith for the start they provided but cautioned saying it was still a pretty good deck and Chennai would have to execute their plans well to restrict Punjab"}], "name": "Chennai Super Kings v Kings XI Punjab", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729283.html?innings=1;view=commentary", "match_num": 3}