{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.20pm$$  Punjab have been set a target over 200 five times but they've pulled it down only once. Not the best omen, but this batting order is stocked with enough fire power to turn that stat around. Cheteshwar Pujara will take strike. Viru, in glasses, is camped at the other end. Nehra has the ball in hand"}, {"ball": 0, "isHighlight": false, "text": "Sai: \"Anyone feeling warm out there? Cheer up guys, we needed that minimal score for Viru to explode :)\""}, {"ball": 0.1, "isHighlight": false, "text": "Nehra to Pujara,no run,hint of inward dip to start off, Pujara negotiates it well by coming forward and presenting a straight bat"}, {"ball": 0.2, "isHighlight": false, "text": "Nehra to Pujara,1 run,good length ball just outside off, Pujara guides it to deep third man"}, {"ball": 0.3, "isHighlight": false, "text": "Nehra to Sehwag,1 run,as ever minimum footwork but those hands are good enough to cut the shortish delivery down to deep third man"}, {"ball": 0.4, "isHighlight": false, "text": "Nehra to Pujara,no run,full and outside off, Pujara looks to blast it through the covers but mistimes it. Baz cuts the angle and dives to his right to keep it to none"}, {"ball": 0.5, "isHighlight": false, "text": "Nehra to Pujara,1 run,back of a length on off stump, Pujara waits on the back foot and tucks it into the midwicket region"}, {"ball": 0.6, "isHighlight": false, "text": "Nehra to Sehwag,no run,short but not quite wide enough, Viru flat bats it down to mid-off."}, {"ball": 0.6, "isHighlight": false, "text": "Cheteshwar Pujara is the 266th Test player for India, hence the number on the back of his shirt. Mohit with the keeper stand up"}, {"ball": 1.1, "isHighlight": false, "text": "Sharma to Pujara,1 run,good length ball outside off, Pujara slashes with an open face and finds deep third man"}, {"ball": 1.1, "isHighlight": false, "text": "Keeper back for Sehwag"}, {"ball": 1.2, "isHighlight": false, "text": "Sharma to Sehwag, $$FOUR$$ ,crisp! It was length with just the smallest bit of room but Viru was onto it in a flash. A little shuffle back and he punches it through point and watched the ball whistle away ."}, {"ball": 1.3, "isHighlight": false, "text": "Sharma to Sehwag,no run,a little more effort behind this delivery and the bounce beats Sehwag's cut"}, {"ball": 1.4, "isHighlight": false, "text": "Sharma to Sehwag, $$FOUR$$ ,on the pads and he flicks it smartly behind square. Bad line with the fine leg inside the circle and all Viru had to do was give it direction"}, {"ball": 1.5, "isHighlight": false, "text": "Sharma to Sehwag,no run,back of a good length and outside off, Viru slashes and misses. A sight as common as those booming boundaries"}, {"ball": 1.6, "isHighlight": false, "text": "Sharma to Sehwag,2 runs,Jadeja races back, keeping his eyes on the ball over his shoulder and flings both hands out in front of him but the ball doesn't stay inside. How costly will that  $$drop$$  be? It was full and Sehwag shoveled it straight over the top with very little timing."}, {"ball": 2.1, "isHighlight": false, "text": "Nehra to Pujara, $$FOUR$$ ,fullish and on the pads, Pujara whips it through midwicket. What lovely wristwork!"}, {"ball": 2.2, "isHighlight": false, "text": "Nehra to Pujara, $$FOUR$$ ,picked up off his hips and dropped into the square leg boundary. Nehra, as a few of our readers suspected, has begun to leak runs. Short in length and on leg stump. Looks like he hasn't learned from Punjab's bowling display earlier"}, {"ball": 2.3, "isHighlight": false, "text": "Nehra to Pujara,1 run,fullish and outside off, driven to mid-off"}, {"ball": 2.3, "isHighlight": false, "text": "goes around the wicket"}, {"ball": 2.4, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,backs away and mauls this over point. Short and wide and that was just begging to be hit. Viru, of course, is not known for holding back"}, {"ball": 2.5, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,lifted over the covers. Just clean hand-eye coordination and the fuller delivery on off stump is hoisted away. Opened the face on impact to place it in the gap"}, {"ball": 2.6, "isHighlight": false, "text": "Nehra to Sehwag, $$OUT$$ ,leg stump cartwheels! It was length and he was looking to slog it across the line seeking the stands at midwicket. Missed it by several inches as the ball sneaks between the bat and pad. Nehra exults!"}, {"ball": 2.6, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$b$$ $$Nehra$$ $$19$$ $$(10b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$190.00$$"}, {"ball": 2.6, "isHighlight": false, "text": "Maxwell arrives at No. 3, but his tournament strike-rate is only 110. Ashwin is the new bowler"}, {"ball": 3.1, "isHighlight": false, "text": "Ashwin to Pujara,1 run,flighted on leg stump as Pujara comes down the track and pushes down to long-on"}, {"ball": 3.2, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,no need to get your eye in, just pull out that reverse sweep and drag the carrom ball from  $$way$$  outside leg stump to the point boundary. That is just a top shot"}, {"ball": 3.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,doesn't bother with this length ball down the leg side. Think it was the carrom again"}, {"ball": 3.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,clears his front leg and drives down to long-off. Tossed up offspinner that time"}, {"ball": 3.4, "isHighlight": false, "text": "Ashwin to Pujara, $$OUT$$ ,it's given! That's a pretty tight call from the ump and Pujara walks back looking a little bemused. It pitched in line and went on with the arm as he went for a sweep. Struck low on the front pad and it might just have grazed off stump."}, {"ball": 3.4, "isHighlight": false, "text": "$$CA$$ $$Pujara$$ $$lbw$$ $$b$$ $$Ashwin$$ $$13$$ $$(10b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$130.00$$"}, {"ball": 3.4, "isHighlight": false, "text": "Gaurav w: \"A sensible game is important. Pitch is great for batting, just stay there runs will come. Maxwell the key man, if he stays for more than 10 overs; Game is on...\""}, {"ball": 3.4, "isHighlight": false, "text": "Akshar Patel is the new man in"}, {"ball": 3.5, "isHighlight": false, "text": "Ashwin to Patel,no run,tossed up on middle and leg, Akshar plays across the line and is struck on the knee-roll. Big shout from the bowler again but this time the ump doesn't agree. It was tighter than the Pujara one..."}, {"ball": 3.6, "isHighlight": false, "text": "Ashwin to Patel,2 runs,whipped away as he meets the ball in front of his pad and picks up a couple to deep square leg"}, {"ball": 3.6, "isHighlight": false, "text": "Sarath: \"Just when everything is going good for Punjab, Sehwag has committed crime. Now Ashwin n co can build more pressure.\""}, {"ball": 3.6, "isHighlight": false, "text": "Mohit has switched ends"}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Maxwell, $$FOUR$$ ,magnificent! Just a little overpitched and he leans into the most correct off drive. Effortlessly punched away and Bravo's dive is not enough to stop it"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Maxwell,no run,back of a length and he was setting up for the front foot pull, doesn't succeed"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Maxwell,no run,charges down the track and the room he's made for himself allows the carve into the covers but McCullum dives to his right and keeps it to none"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Maxwell,no run,slower ball accompanied by a big grunt. Maxi was on the front foot and goes for that pull again, but the ball just scuttles underneath his bat"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Maxwell, $$FOUR$$ ,down the ground and picks this up off a length and thumps it to the long-off boundary. Didn't get it off the meat but with his power you don't really need to"}, {"ball": 4.5, "isHighlight": false, "text": "keeper comes up"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Maxwell, $$FOUR$$ ,strays in line in addition to length this time as he bowls on the pads, Maxi whips it away to the square leg boundary with ease"}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Patel, $$OUT$$ ,trapped in the crease and Akshar has to trudge back. No doubt about this one. This came on with the arm and struck him on the back pad as he was looking to clip to midwicket. The ball skids on and he's a goner"}, {"ball": 5.1, "isHighlight": false, "text": "$$AR$$ $$Patel$$ $$lbw$$ $$b$$ $$Ashwin$$ $$2$$ $$(3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 5.1, "isHighlight": false, "text": "Bailey's keeping himself for later. It's Miller time"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Miller,1 run,flighted on middle and leg, clipped to long-on"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,the amount of power he can get into that stroke is unbelievable. Tossed up outside leg and the bat speed while he reverse sweeps that gives it all the legs it needs to reach the point boundary"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,makes room outside leg and lofts this over the covers. Opens the face of the bat to hoist it over mid-off and extra cover. Neat placement"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,carrom ball goes awry and Dhoni does well to collect it way down the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,flighted down the leg side and though Maxi was looking for the sweep, he holds his pose and collects the extra"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Maxwell,no run,pushed through quicker on off stump, he goes for the sweep but gets an inside edge"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,tossed up on off stump, defended with soft hands into the covers"}, {"ball": 5.6, "isHighlight": false, "text": "Satwik: \"Bailey should have been the one to come in now. Maxwell is in a fiery mood. Would have been great had he strengthened one end and kept Miller for the later overs\" Pawan Negi now"}, {"ball": 6.1, "isHighlight": false, "text": "Negi to Maxwell,2 runs,flighted on the pads, worked away to deep midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Negi to Maxwell,2 runs,short and pushed through on off stump, Maxi is on the back foot and pulls wide of long-on"}, {"ball": 6.3, "isHighlight": false, "text": "Negi to Maxwell,1 run,beaten by flight but the leading edge face safely. This gripped into the pitch and turned away and with Maxwell going across the line with a flick, the ball loops straight into the air but clears cover and mid-off"}, {"ball": 6.4, "isHighlight": false, "text": "Negi to Miller,no run,shortish on off stump, Miller punches it back to the bowler"}, {"ball": 6.5, "isHighlight": false, "text": "Negi to Miller,1 run,defeats the left-hander in flight this time. He was coming down the track but the ball dips before he could reach the pitch of it. Leading edge into the covers while he was trying to flick it"}, {"ball": 6.6, "isHighlight": false, "text": "Negi to Maxwell,2 runs,stays in his crease this time and clips the length ball to deep square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Joy: \"@ Satwik - It may also be to counter the two left-arm spinners who will now come in play. Dhoni likes to choke right-handed batsmen with left arm spinners. So Miller's presence can stop that.\""}, {"ball": 6.6, "isHighlight": false, "text": "Jaddu's into the attack"}, {"ball": 7.1, "isHighlight": false, "text": "Jadeja to Miller,2 runs,starts off with a short one which Miller has no problem cutting behind square"}, {"ball": 7.2, "isHighlight": false, "text": "Jadeja to Miller,no run,comes forward and pushes at the length ball on off stump. Gets an inside edge to mid-on"}, {"ball": 7.3, "isHighlight": false, "text": "Jadeja to Miller, $$FOUR$$ ,short and wide again, Miller slaps it through the covers this time and the man out in the deep cannot pull it back. Excellent placement"}, {"ball": 7.4, "isHighlight": false, "text": "Jadeja to Miller,1 run,tossed up on off stump, Miller is forward and drives it past a diving Jadeja to long-on"}, {"ball": 7.5, "isHighlight": false, "text": "Jadeja to Maxwell,no run,fired in on the pads, Maxi can't put it away with the flick. Shakes his head"}, {"ball": 7.6, "isHighlight": false, "text": "Jadeja to Maxwell, $$FOUR$$ ,laps it over the keeper for a neat little boundary. Long leg was too square and can only collect the ball after it crossed the boundary"}, {"ball": 8.1, "isHighlight": false, "text": "Negi to Miller, $$SIX$$ ,lovely footwork as he leaves the crease to reach the pitch and a full swing of the arms brings up another straight six"}, {"ball": 8.2, "isHighlight": false, "text": "Negi to Miller,no run,shortish delivery on leg stump, worked to midwikcet"}, {"ball": 8.3, "isHighlight": false, "text": "Negi to Miller,no run,fires it in on middle and off, which is whipped into leg side"}, {"ball": 8.4, "isHighlight": false, "text": "Negi to Miller,no run,pushed down the ground as he pushes it through on off stump"}, {"ball": 8.5, "isHighlight": false, "text": "Negi to Miller,no run,has trouble beating that man at midwicket as Negi continues darting in length balls on the stumps"}, {"ball": 8.6, "isHighlight": false, "text": "Negi to Miller,1 run,punched down the ground to long-off and that will be a strategic time out"}, {"ball": 8.6, "isHighlight": false, "text": "SHANKER RAJ SAJ: \"I have seen KP switch hit, Dilshan scoop, Dhoni helicopter, Sachin/Sehwag uper cut etc but i feel Maxwell is the combined package of all these..See the way he innovates his own shots..nice to see, that he is putting pressure on Dhoni\""}, {"ball": 9.1, "isHighlight": false, "text": "Jadeja to Miller,no run,charges at him but as he finds the length is a little shorter he settles for a nudge through square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Jadeja to Miller,1 run,turned away with the turn through square leg again"}, {"ball": 9.3, "isHighlight": false, "text": "Jadeja to Maxwell,1 run, $$dropped$$  and it is the most comical of the lot. Maxi goes for the reverse sweep but this time he gets it off the shoulder of the bat and it goes straight up. Nehra is at short third man and he lunges at the ball with both hands outstretched. Only kisses the fingers. VIntage Nehra"}, {"ball": 9.4, "isHighlight": false, "text": "Jadeja to Miller,no run"}, {"ball": 9.5, "isHighlight": false, "text": "Jadeja to Miller,no run,Miller gets a life now. It was flighted outside off and he thumps it into the covers. Faf dives full length to his right and almost hand it but it popped out"}, {"ball": 9.6, "isHighlight": false, "text": "Jadeja to Miller,1 run,rocks back and cuts the shortish ball outside off to the sweeper"}, {"ball": 10.1, "isHighlight": false, "text": "Ashwin to Miller,1 run,rushes down the track and swings off his feet, only manages an inside edge behind square leg"}, {"ball": 10.2, "isHighlight": false, "text": "Ashwin to Maxwell,2 runs,carrom ball pitching outside leg, Maxi was setting up to launch it over cow corner but the length was too full. Squirts it away to deep square leg"}, {"ball": 10.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,full toss on leg stump, swept away to deep square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Ashwin to Miller,1 run,fired in on leg stump, Miller's inside edge allows him a single through square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Ashwin to Maxwell,2 runs,carted away to deep midwicket. Charged at the carrom ball and slogged it away"}, {"ball": 10.6, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,he's switch hit to the point boundary! Changed his stance and then the grip on his bat and blasted it away to Bravo who was down there. Pulled out a diving effort but couldn't pull it back"}, {"ball": 11.1, "isHighlight": false, "text": "Jadeja to Miller,1 run"}, {"ball": 11.2, "isHighlight": false, "text": "Jadeja to Maxwell,no run,comes down the track to work it into the leg side and gets an inside edge onto pad. Jaddu appeals but is turned down"}, {"ball": 11.3, "isHighlight": false, "text": "Jadeja to Maxwell, $$FOUR$$ ,drifting down on the pads and he sweeps him one-bounce to the long leg boundary to raise his fifty"}, {"ball": 11.4, "isHighlight": false, "text": "Jadeja to Maxwell,2 runs,pulled wide of long-on as this was fired in short on middle"}, {"ball": 11.5, "isHighlight": false, "text": "Jadeja to Maxwell,1 leg bye,big appeal from the bowler, who trips over his feet and falls flat on his back. Maxi went down for the sweep again only this skidded on and strikes him on the back pad. No bat involved. This was plumb, but the umpire hasn't spotted it"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja to Miller, $$FOUR$$"}, {"ball": 11.6, "isHighlight": false, "text": "rssampat: \"11 required off every over and if the Punjab target around 10 per over and have one of these two at the end with 2-3 overs to go, then Punjab will be be home well and clear.\""}, {"ball": 12.1, "isHighlight": false, "text": "Negi to Maxwell, $$FOUR$$ ,tossed up on off stump, Maxi plants his front leg down the pitch and slogged it away to the deep midwicket boundary. The fielder tried to flick it back into the field of play, but he was stamping on the boundary ropes while doing so"}, {"ball": 12.2, "isHighlight": false, "text": "Negi to Maxwell, $$SIX$$ ,short ball on off stump, Maxi rocks back and smashes it way into the grass banks at cow corner"}, {"ball": 12.3, "isHighlight": false, "text": "Negi to Maxwell, $$FOUR$$ ,there wasn't much room to get under this but somehow he does and the sweep skims hard and flat to the deep midwicket boundary"}, {"ball": 12.4, "isHighlight": false, "text": "Negi to Maxwell,1 wide,backs away and fools the bowler to bowling a wide down the off side"}, {"ball": 12.4, "isHighlight": false, "text": "Negi to Maxwell, $$FOUR$$ ,flighted outside off and he essays a lovely, orthodox cover drive. All along the ground and stamped with his considerable power. There is no stopping him today"}, {"ball": 12.5, "isHighlight": false, "text": "Negi to Maxwell,1 run,fired in on middle and off, Maxi closed the face too early and gets a leading edge to long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Negi to Miller,2 runs,backs away and drives past the man at extra cover"}, {"ball": 12.6, "isHighlight": false, "text": "Sriram: \"Why is Bravo not bowling?\" He took a tough tumble at point, might have injured his shoulder. Smith to bowl"}, {"ball": 13.1, "isHighlight": false, "text": "Smith to Maxwell,1 run,fullish and outside off, pushed down the ground"}, {"ball": 13.2, "isHighlight": false, "text": "Smith to Miller,1 run,nearly a yorker on middle and leg, dug out to long-on"}, {"ball": 13.3, "isHighlight": false, "text": "Smith to Maxwell, $$FOUR$$ ,big full toss outside of and Maxi's reverse pulled it over the head of short third man"}, {"ball": 13.4, "isHighlight": false, "text": "Smith to Maxwell,1 run,another  $$drop$$ , by Badree the substitute fielder. It was short and outside off. Maxi pulls it to deep square leg who had to come forward as the ball was dipping."}, {"ball": 13.5, "isHighlight": false, "text": "Smith to Miller,2 runs,fullish and outside off, he pushes it down to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Smith to Miller,no run,shortish and outside off, Miller cracks it to point"}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin is back"}, {"ball": 14.1, "isHighlight": false, "text": "Ashwin to Maxwell, $$FOUR$$ ,starts off with a legspinner which Maxi picks as he charges down the track and slams it to the long-off boundary"}, {"ball": 14.2, "isHighlight": false, "text": "Ashwin to Maxwell,2 runs,clipped away neatly off his legs as Ashwin fears to toss the ball up. That's the 100 partnership. Maxi's got 67 of them"}, {"ball": 14.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,it's the carrom ball this time and he's pitched it rather wide outside leg. Maxi goes for a swat seeking the long leg boundary, but misses"}, {"ball": 14.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,short and on the pads again, Maxi pulls to deep square leg"}, {"ball": 14.4, "isHighlight": false, "text": "Ashwin to Miller,1 run,skips down the track but has to settle for an inside edge that squirts off to deep square leg. He's been off colour all through but Punjab are still in the driver's seat"}, {"ball": 14.5, "isHighlight": false, "text": "Ashwin to Maxwell,no run,was that another switch hit? He changed his stance but not the grip on his bat as he reverse swept to third man"}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin to Maxwell,no run,flighted on the pads, nudged into midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Mazhar: \"this is very ugly kind of bowling by Ashwin..very much negative\""}, {"ball": 14.6, "isHighlight": false, "text": "Devika: \"Maxwell was ridiculed for his price tag early on. But I think he is a wonderful wonderful limited overs cricketer and whoever spotted his talent was a genius.\""}, {"ball": 15.1, "isHighlight": false, "text": "Smith to Miller,1 run,fired in full on leg stump to cramp him for room, Miller clips to deep square leg"}, {"ball": 15.2, "isHighlight": false, "text": "Smith to Maxwell, $$SIX$$ ,length ball on off stump, Maxwell's hammered it down the ground. Just throw the ball back from beyond the boundary"}, {"ball": 15.3, "isHighlight": false, "text": "Smith to Maxwell, $$FOUR$$ ,sliding down the pads and he's whipped it away to the long leg boundary. He's stormed into the mid-nineties now"}, {"ball": 15.4, "isHighlight": false, "text": "Smith to Maxwell, $$OUT$$ ,what a yorker! Leg stump has been uprooted. There was no room to manoevre it, which was what Maxi was trying to do with a bit of an open face but the ball just kept coming in at him and cramping him up. He also seemed a little surprised by the extra pace on that and walks off the field with his bat raised. He's missed a personal landmark, but has placed his team in a very good position"}, {"ball": 15.4, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$b$$ $$Smith$$ $$95$$ $$(43b$$ $$15x4$$ $$2x6)$$ $$SR:$$ $$220.93$$"}, {"ball": 15.4, "isHighlight": false, "text": "The captain strides out with 39 off 26 left"}, {"ball": 15.5, "isHighlight": false, "text": "Smith to Bailey,1 run,fullish on off stump, eased through point to get off the mark"}, {"ball": 15.6, "isHighlight": false, "text": "Smith to Miller, $$FOUR$$ ,that was clever. Waited on this shortish ball with just a little room and he dabbed it fine of short third man and it just skimmed away"}, {"ball": 16.1, "isHighlight": false, "text": "Jadeja to Bailey,2 runs,darted in on leg stump, Bailey swivels on the back foot and sweeps it down to long leg"}, {"ball": 16.2, "isHighlight": false, "text": "Jadeja to Bailey,1 run,a little more flight but he's pushing towards leg stump. Bailey works it away behind square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Jadeja to Miller, $$SIX$$ ,offers length and Miller has pounced. He was down the track and belts it way into the crowd behind long-on"}, {"ball": 16.4, "isHighlight": false, "text": "Jadeja to Miller, $$SIX$$ ,over long-off this time. Punjab are in a hurry to finish this off. Another little trip down the track and though it hit the bottom of the bat, it had enough to clear the fielder in the deep"}, {"ball": 16.5, "isHighlight": false, "text": "Jadeja to Miller,2 runs,good length ball on middle and leg, turned away to deep square leg for a couple that brings Miller his fifty"}, {"ball": 16.6, "isHighlight": false, "text": "Jadeja to Miller,1 run,good length ball on middle and off, he strides forward to push it down the ground to long-on"}, {"ball": 16.6, "isHighlight": false, "text": "Wayne: \"Chennai could have gone with Badree instead of either Bravo or Faf. The bowling looked slightly weak with this lineup and Badree's 4 overs could have made the difference.\" Nehra's back"}, {"ball": 17.1, "isHighlight": false, "text": "Nehra to Miller,1 run,full toss on leg stump, picked away to deep midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Nehra to Bailey,1 run,slower ball on off stump, Bailey isn't fooled as he dabs into the covers and rotates the strike. That's all that's needed with an equation reading 14 off 16"}, {"ball": 17.3, "isHighlight": false, "text": "Nehra to Miller,1 run,low full toss outside off, Miller opens the face and slices it to deep point"}, {"ball": 17.3, "isHighlight": false, "text": "Nehra around the wicket"}, {"ball": 17.4, "isHighlight": false, "text": "Nehra to Bailey,no run,full and speared in on the pads, Bailey looks to swipe it away but gets struck on the pads. No appeal, would have gone well down leg"}, {"ball": 17.5, "isHighlight": false, "text": "Nehra to Bailey,1 run,finds the yorker outside off and Bailey pushes it down to long-on"}, {"ball": 17.6, "isHighlight": false, "text": "Nehra to Miller,no run,walked at the bowler who fired in a leg stump yorker, misses the flick and the stumps en route to the keeper"}, {"ball": 17.6, "isHighlight": false, "text": "Run-a-ball needed now. 12 off 12"}, {"ball": 17.6, "isHighlight": false, "text": "Vikram: \"@Sahil, who disagreed with people calling the Chennai attack weak. The telling stat here is that all the Chennai bowlers have gone above 10 an over. They lack a quality fast bowler and if the pitches don't favor spin, they will be regularly taken to the cleaners.\" Mohit is back as well"}, {"ball": 18.1, "isHighlight": false, "text": "Sharma to Bailey,1 run,shortish and outside off, cut away strongly to deep extra cover"}, {"ball": 18.1, "isHighlight": false, "text": "switches around to the left-hander"}, {"ball": 18.2, "isHighlight": false, "text": "Sharma to Miller,1 run,full toss outside off, Miller flashes and gets a thick outside edge to third man"}, {"ball": 18.3, "isHighlight": false, "text": "Sharma to Bailey,2 runs,good length ball which grips the pitch and darts outside off, Bailey muscles a mistimed pull through midwicket"}, {"ball": 18.4, "isHighlight": false, "text": "Sharma to Bailey, $$FOUR$$ ,in the slot and Bailey has hoicked it over the long-on boundary. Cleared his front leg and let the hands go"}, {"ball": 18.5, "isHighlight": false, "text": "Sharma to Bailey, $$FOUR$$ ,that's emphatic! Short ball pulled powerfully to the deep midwicket boundary and the two Punjab batsman exchange big smiles and a hug as well"}, {"ball": 18.5, "isHighlight": false, "text": "So we've had our first run fest of the Indian T20 but the action still doesn't stop. We have Rajasthan v Hyderabad coming up in a few minutes so do stick around for that as well."}, {"ball": 18.5, "isHighlight": false, "text": "$$Glenn$$ $$Maxwell$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"I play with the bowler to try and upset the bowler and find the gaps. Feels pretty good to chase down 200+ against Chennai, they're a pretty good team. Hopefully the batsmen can keep it up and the bowlers can chip in as well\""}, {"ball": 18.5, "isHighlight": false, "text": "\"Just try and be positive. It was a pretty good wicket. We pulled it back with the ball in the middle overs considering they were heading for 230,\" George Bailey says, \"Maxi has been in great touch and we hope he carries on for Punjab\""}, {"ball": 18.5, "isHighlight": false, "text": "\"When you score 200, you have to remember the opposition has every chance of scoring it as well,\" says  $$MS$$ $$Dhoni$$ . \"Fantastic wicket, they batted really well. We should have done better with the ball. [Bravo going off injured] Still he was not fit to bowl today, we played him as a batsman so we were a bowler short. Batsmen did their job, bowlers should have had different plans for different individuals. Bowl right areas. The margin of error is very small. Overall it will be difficult for the bowlers. Not much spin. The game was down to the batsman, we did well but they beat us fair and square\""}, {"ball": 18.5, "isHighlight": false, "text": "Danish Patel: \"Entertaining it surely has been, but worrying more-so for Indian cricket! Both innings were constructed by foreign players and in both innings Indian bowlers were taken to the cleaners! \""}, {"ball": 18.5, "isHighlight": false, "text": "Siddharth: \"You know your bowling attack is weak when your most economical bowler of the day is Ashish Nehra!\""}, {"ball": 18.5, "isHighlight": false, "text": "$$5.50$$ $$pm$$  You would have thought Chennai got enough on the board after making the first 200-plus total this year, but their bowling had no answer to the wiles of Glenn Maxwell. His sweeps and reverse sweeps and switch hits and the occasional orthodox cover drives ushered Punjab to their second victory chasing over 200 in the League. Of course he was helped in his endeavor by a couple of drops and some ordinary, leg-stump bowling"}], "name": "Chennai Super Kings v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729283.html?innings=2;view=commentary", "match_num": 3}