{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$Almost$$ $$8$$ $$pm$$  All set to go. The umpires walk in followed by the Royals..followed by Dhawan and Finch.. Dhawan takes the strikes as the clock hits 8. Richardson to start off"}, {"ball": 0, "isHighlight": false, "text": "Manoj: \"The way RR rotate their bowlers is just too good...they provide them enough rest and be 100% through out the season and also provide equal chances in all games and the rest given will produce some great results...!! Great cricketing brain behind RR all the time...!!\""}, {"ball": 0, "isHighlight": false, "text": "$$7.45$$ $$pm$$  In other news, Praveen Kumar will soon be seen on the cricket field.. He has replaced the injured Zaheer Khan at Mumbai Indians."}, {"ball": 0, "isHighlight": false, "text": "\"If you feel that dropping Ishant has deprived us of some entertainment then i would like to mention that Amit Mishra has done no good this time and has conceded more than 50 runs in 2 matches.\".... Ashwin, even if a bowler gets hit for 100 in four overs, it is unlikely he will match Ishant for unpopularity that easily."}, {"ball": 0, "isHighlight": false, "text": "\"Why is no one talking of Parvez Rasool? He could have been an easy replacement for Ishant instead of an out of form Mishra. He would have given depth to SRH batting and also, he would have added variety to the attack as he is an off spinner.\" --- Sahil, don't worry.. you are not alone.. Plenty of similar feedback pouring in."}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$ $$Royals$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$will$$ $$bowl.$$ . Shikhar Dhawan would have bowled too as he expects  $$dew$$  to show up in the second half. Two changes for Sunrisers - Henriques and Mishra come in for Sammy and Ishant (thus robbing us of some entertainment). Royals have also made two changes - Kulkarni and Richardson replace Tewatia and Southee."}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  Hello and welcome to our coverage of the match between the Ahmedabadi Royals and the Sunrisers Hyderabad. One team is perched near the top wearing a cloak of invisibility and the other is still near the bottom of the tree. Royals are favourites despite never really looking like favourites and Sunrisers, despite that demolition at the hands of AB, are actually playing well... Will Tambe/Watson duo rule over Dhawan/Warner/Finch? or do we get some entertainment when Watson and Sammy come face to face? Sorry, Faulkner- Sammy.. that's the bigger draw, isn't it?"}, {"ball": 0, "isHighlight": false, "text": "Priyadarsh: \"I think its time for Shikhar Dhawan to play a responsible innings being the captain of the side. Loved the way other team captains like Shane Watson, Bailey, Rohit sharma, Dhoni rose to the occasion and played some wonderful knocks. !!! \" --- Dhoni? who dropped himself down the order when quick runs were needed?"}, {"ball": 0, "isHighlight": false, "text": "Devashish: \"He meant Gambhir but typed Dhoni by mistake ... \""}, {"ball": 0, "isHighlight": false, "text": "Rahul Dravid, Sambit Bal, Gaurav Kalra...  $$Everyone's$$ $$playing$$ $$CricIQ$$ . What about you?  $$Play$$ $$here.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Richardson to Dhawan, $$FOUR$$ ,he runs in to the din from the crowd and almost gets a wicket! Dhawan looks to punch this length delivery to off, but gets a thick inside edge past the stumps all the way to the boundary"}, {"ball": 0.2, "isHighlight": false, "text": "Richardson to Dhawan,no run,length delivery on the stumps, now Dhawan gets behind the line and defends it back to the bowler"}, {"ball": 0.3, "isHighlight": false, "text": "Richardson to Dhawan,no run,another tight delivery on off stump, Dhawan punches it straight to the gully fielder"}, {"ball": 0.3, "isHighlight": false, "text": "Fine-leg, third-man up in the circle.."}, {"ball": 0.4, "isHighlight": false, "text": "Richardson to Dhawan, $$FOUR$$ ,this time he cracks it with a lot of power! Only a tiny bit of room there and he cashes on it, smacking it behind point and beats the deep point fielder"}, {"ball": 0.5, "isHighlight": false, "text": "Richardson to Dhawan,no run,he comes forward for the first time, drives the fuller delivery straight to cover"}, {"ball": 0.6, "isHighlight": false, "text": "Richardson to Dhawan,1 run,he moves forward and pushes the length delivery to deep cover for a single"}, {"ball": 0.6, "isHighlight": false, "text": "Dhawal Kulkarni comes from the other end.."}, {"ball": 1.1, "isHighlight": false, "text": "Kulkarni to Dhawan,no run,pushes it fuller wide outside off, Dhawan doesn't go fully forward in his drive, gets an inside edge back to the bowler"}, {"ball": 1.2, "isHighlight": false, "text": "Kulkarni to Dhawan, $$FOUR$$ ,whoa! This is a typical Dhawan drive.. Just a checked push off a length ball and that burns the grass as it screeches to the cover boundary"}, {"ball": 1.3, "isHighlight": false, "text": "Kulkarni to Dhawan,no run,slower delivery, he gets an outside edge on it as he looks to run it down to third man, but that drops well short of Samson, the wicketkeeper"}, {"ball": 1.4, "isHighlight": false, "text": "Kulkarni to Dhawan,2 runs,he stays in the crease and punches the back of the length delivery to deep point for a couple"}, {"ball": 1.5, "isHighlight": false, "text": "Kulkarni to Dhawan, $$FOUR$$ ,he finds the gap at backward point! Dhawan opens the face of the bat really late to this offcutter and manages to bisect that tiny gap between short third man and backward point"}, {"ball": 1.6, "isHighlight": false, "text": "Kulkarni to Dhawan,no run,length delivery on the stumps, the batsman comes forward and pushes it to cover"}, {"ball": 2.1, "isHighlight": false, "text": "Richardson to Finch,1 run,interesting! He walks out of the crease to punch his first delivery, gets an inside edge back towards the non-striker and the bowler is not able to bend down in time.. giving Finch his first run"}, {"ball": 2.2, "isHighlight": false, "text": "Richardson to Dhawan,1 run,short delivery, Dhawan gets on top of that nicely as he pulls this along the ground to deep square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Richardson to Finch,1 run,fires it full on the pads, Finch looks to flick it to square leg but gets an inside edge on to his pads, takes a single to the leg side"}, {"ball": 2.4, "isHighlight": false, "text": "Richardson to Dhawan,1 run,he is timing it beautifully! This one is punched to wide mid-off, but that made a nice sound of the bat"}, {"ball": 2.5, "isHighlight": false, "text": "Richardson to Finch,1 run,now Finch looks for that gap at backward point but the short third-man dives and gets a hand to it to prevent the boundary"}, {"ball": 2.5, "isHighlight": false, "text": "Round the wicket now"}, {"ball": 2.6, "isHighlight": false, "text": "Richardson to Dhawan, $$FOUR$$ ,he offers a lot of width this time and Dhawan obliges by cracking it past a diving backward point to the boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Bowling change, Watson comes in"}, {"ball": 3.1, "isHighlight": false, "text": "Watson to Finch,1 leg bye,that leg side line is not going to help Royals but for now, it's ok.. Finch gets an inside edge to short fine leg and gets a single.. that could have been hit anywhere really"}, {"ball": 3.2, "isHighlight": false, "text": "Watson to Dhawan, $$FOUR$$ ,this is superb from Dhawan! Controlled shimmy down the pitch and punches it straight between the bowler and mid-off for a boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Watson to Dhawan,no run,this looked set for the boundary too, but the cut shot is saved by a diving Rahane at backward point"}, {"ball": 3.4, "isHighlight": false, "text": "Watson to Dhawan, $$FOUR$$ ,short ball and on the leg side! Fine leg is up and it's not a very smart line with that field, Dhawan hooks it over the short fine fielder and gets four as the reward"}, {"ball": 3.5, "isHighlight": false, "text": "Watson to Dhawan,no run,back of length delivery on the middle, punched back to the bowler"}, {"ball": 3.5, "isHighlight": false, "text": "Kapil: \"This is were Rajasthan need to get smart and learn from their earlier few errors. Richardson hasn't been bowling that well. Why not try someone like Kevon Cooper? He can surely be a handful against agressive batters and take pace off the ball. Royals need to be street smart if they are to compete against batting giants like CSK, BLR and PJB\""}, {"ball": 3.6, "isHighlight": false, "text": "Watson to Dhawan, $$OUT$$ ,he is got him! That has taken an outside edge from the offstump! Too close for a cut actually.. He was neither forward, nor backward.. A poor short from Dhawan just after he was starting to find his touch"}, {"ball": 3.6, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$b$$ $$Watson$$ $$33$$ $$(19m$$ $$20b$$ $$7x4$$ $$0x6)$$ $$SR:$$ $$165.00$$"}, {"ball": 3.6, "isHighlight": false, "text": "Kulkarni comes back.."}, {"ball": 4.1, "isHighlight": false, "text": "Kulkarni to Finch,1 run,fires it full on the stumps, easy delivery for the batsman as he flicks it to deep square leg"}, {"ball": 4.2, "isHighlight": false, "text": "Kulkarni to Rahul, $$FOUR$$ ,beautiful timing from Rahul! It's full delivery outside off and Rahul just punches it down the ground.. Not great work by mid-on, who doesn't bend down in time"}, {"ball": 4.3, "isHighlight": false, "text": "Kulkarni to Rahul,no run,length delivery on the stumps, the batsman defends it from the crease"}, {"ball": 4.4, "isHighlight": false, "text": "Kulkarni to Rahul, $$FOUR$$ ,superb shot! He leans into this length delivery wide outside off and just times in the gap at cover.. No effort made to whack it hard, just a push"}, {"ball": 4.5, "isHighlight": false, "text": "Kulkarni to Rahul,no run,good solid front foot defence from Rahul to the length delivery"}, {"ball": 4.6, "isHighlight": false, "text": "Kulkarni to Rahul,no run,stays on the back foot and defends the length delivery close to the stumps"}, {"ball": 4.6, "isHighlight": false, "text": "Faulkner for the first time"}, {"ball": 5.1, "isHighlight": false, "text": "Faulkner to Finch,no run,he comes round the wicket and bowls length on the stumps, the batsman defends it to midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Faulkner to Finch,1 leg bye,drifting on to the pads and Finch just needed a deflection, but misses out as he gets hit on the thigh pad..picks up a leg bye to short fine leg"}, {"ball": 5.2, "isHighlight": false, "text": "Over the wicket now"}, {"ball": 5.3, "isHighlight": false, "text": "Faulkner to Rahul,no run,he comes forward and defends the angled delivery to point"}, {"ball": 5.4, "isHighlight": false, "text": "Faulkner to Rahul,1 run,stays on the back foot and steers the back of length delivery to third man"}, {"ball": 5.4, "isHighlight": false, "text": "Anuj Kulkarni: \"It had to be Warner who should've walked in once Shikhar got out. No doubt on Lokesh's quality, but Warner would've carried on where Shikhar left!\""}, {"ball": 5.5, "isHighlight": false, "text": "Faulkner to Finch,1 run,starts moving towards the leg side and the bowler follows him from round the wicket line, the batsman glances but again, finds the man at short fine leg"}, {"ball": 5.5, "isHighlight": false, "text": "Sundar: \"@Anuj Kulkarni: That's called artificially elongating your batting order, to make it look longer than it actually is.\""}, {"ball": 5.6, "isHighlight": false, "text": "Faulkner to Rahul,1 run,just a single as Rahul comes forward and punches the length ball to the right of mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "A decent start, mostly because of Dhawan.. but again, he couldn't continue after getting a start"}, {"ball": 5.6, "isHighlight": false, "text": "Qursheed: \"Anuj.. I dont agree with you... Lokesh has been consistent in making valuable 20-30 runs in the previous matches for SRH. Aaron Finch can take on the charge... And then Warner can come and finish off the innings well..\""}, {"ball": 5.6, "isHighlight": false, "text": "Right, we are ready after a strategic time-out.. Some lack of pace now as Rajat Bhatia comes in"}, {"ball": 6.1, "isHighlight": false, "text": "Bhatia to Rahul,1 run,bowls his kind of ball just outside off, Rahul punches it to wide long-on off the back foot"}, {"ball": 6.2, "isHighlight": false, "text": "Bhatia to Finch, $$FOUR$$ ,that has been powered to the wide long-on boundary! it was slow.. maybe a bit too slow.. it gave Finch enough time to go deep in the crease and whack it to the boundary"}, {"ball": 6.3, "isHighlight": false, "text": "Bhatia to Finch, $$OUT$$ ,Rahane you beauty! He runs in from the deep midwicket boundary, dives forward and takes a blinder. This was a length ball and Finch, as is his wont, swung across the line but didn't make a great connection.. it looked like it was going to drop much short but Rahane ran in quick and slid under it.. A bit like Jadeja taking that catch to dismiss Allan Border in the 1992 WC"}, {"ball": 6.3, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$Rahane$$ $$b$$ $$Bhatia$$ $$9$$ $$(33m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$90.00$$"}, {"ball": 6.4, "isHighlight": false, "text": "Bhatia to Rahul,1 run,he comes forward and punches the length delivery to long on"}, {"ball": 6.4, "isHighlight": false, "text": "No Warner still"}, {"ball": 6.5, "isHighlight": false, "text": "Bhatia to Ojha,no run,back of length delivery on off, defended to point"}, {"ball": 6.6, "isHighlight": false, "text": "Bhatia to Ojha,1 run,slower, much slower, 93.7 kph, that is slower than Bhajji.. The batsman waits and punches it to deep cover for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Ok, here is Tambe.."}, {"ball": 7.1, "isHighlight": false, "text": "Tambe to Ojha,1 run,tosses it right up, the batsman takes it on the full and drives it to long-on"}, {"ball": 7.1, "isHighlight": false, "text": "watch for that drift .."}, {"ball": 7.2, "isHighlight": false, "text": "Tambe to Rahul,no run,clever! Rahul chooses to play the reverse sweep to one pitched on leg-stump.. hit straight to short third man.. I say not so clever with that drift"}, {"ball": 7.3, "isHighlight": false, "text": "Tambe to Rahul,1 run,this is better, he comes forward and drives it down to long on"}, {"ball": 7.4, "isHighlight": false, "text": "Tambe to Ojha,1 run,flatter and shorter on the pads, the batsman punches it to deep midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to Rahul,no run,floated on the stumps, the batsman defends it to cover"}, {"ball": 7.6, "isHighlight": false, "text": "Tambe to Rahul,1 run,tossed up delivery outside off, the batsman makes some room and drives it to deep cover"}, {"ball": 8.1, "isHighlight": false, "text": "Bhatia to Rahul,1 run,slower delivery outside off, the batsman moves to the leg side and drives it to deep cover"}, {"ball": 8.2, "isHighlight": false, "text": "Bhatia to Ojha,1 run,on the pads at no-so-fast kph, the batsman punches it to long-on for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Bhatia to Rahul,1 run,some room outside off, allows the batsman to punch it to deep cover for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Bhatia to Ojha,1 run,he comes forward and punches this past the non-striker for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Gaurav: \"For a moment, I was like - even Sir Jadeja couldn't have taken such a spectacular catch as a 4-year old!!! Then realized you were talking about Ajay Jadeja :-)\" --- Didn't Sir Jadeja catch himself when he popped out?"}, {"ball": 8.5, "isHighlight": false, "text": "Bhatia to Rahul,2 runs,this is a low full toss and it's driven to wide long-off for a couple"}, {"ball": 8.6, "isHighlight": false, "text": "Bhatia to Rahul, $$OUT$$ ,poor poor shot! Bhatia does what Bhatia does.. Slower delivery outside off, Rahul plays a sweep like he would have against a spinner, misses it completely and loses his offstump..What a shot to play after playing a number of good-looking straight-batted shots.. Sign of the tiimes"}, {"ball": 8.6, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$b$$ $$Bhatia$$ $$18$$ $$(23m$$ $$18b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to Ojha,1 wide,tossed up but this way down the leg side"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to Ojha,2 runs,the drift takes this one to the pads, Ojha clips it off his toes to deep backward square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Tambe to Ojha,no run,tossed up on off stump, the batsman waits as this is slow and pushes it to cover"}, {"ball": 9.3, "isHighlight": false, "text": "Tambe to Ojha,1 run,floated on the middle stump line, the batsman drives it to long off for a single"}, {"ball": 9.4, "isHighlight": false, "text": "Tambe to Warner,1 run,shorter and flatter, an easy first one for Warner, he cracks it to deep cover"}, {"ball": 9.4, "isHighlight": false, "text": "Sujan: \"There were waiting for dew to come in so that the ball gets slippery and Warner can cash in. They would have ideally liked to send Warner in by the 13th over.\""}, {"ball": 9.5, "isHighlight": false, "text": "Tambe to Ojha,1 run,pushed through to the stumps, the batsman defends it to the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Tambe to Warner,1 run,he almost traps Warner with that one! The batsman sees the flight and goes for a slog sweep, but there is no pace on the delivery. The batsman got a thick top edge that landed safely at midwicket.."}, {"ball": 10.1, "isHighlight": false, "text": "Bhatia to Warner,1 run,short of length delivery at a quicker pace, Warner punches it down to long-off"}, {"ball": 10.2, "isHighlight": false, "text": "Bhatia to Ojha,1 run,back to normalcy.. he delivers a slower one on off, the batsman pushes it through cover for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Bhatia to Warner,1 run,on the pads, Warner flicks it behind square leg for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Adib: \"Even though Warner batting in the middle order has worked, and I see the logic behind it as they need the stability their, I just feel opening the batting - where he was in the form of his life just recently is the area for him and he can be so dangerous playing out the full 20 overs from the start. I still remember his two champions league centuries which were outstanding. Then again he's the only one out of Dhawan and Finch who suits the middle role.\""}, {"ball": 10.4, "isHighlight": false, "text": "Bhatia to Ojha,1 run,almost hit back to the bowler! This was almost as slow as a Ramesh Powar delivery...85 kph!! The batsman looks to drive, but pushes it aerially past the bowler's left hand.. not too far"}, {"ball": 10.5, "isHighlight": false, "text": "Bhatia to Warner,1 run,he powers this down to long off for a single"}, {"ball": 10.5, "isHighlight": false, "text": "gav: \"Sujan: I guess that is why Hyderabad are where they are and why Punjab are where they are. Kings XI don't care about dew or what over a batsman should be in by, they send their best out first and they post big scores. \""}, {"ball": 10.6, "isHighlight": false, "text": "Bhatia to Ojha,no run,slower on the pads, the batsman looks to flick and gets hit on the pads"}, {"ball": 11.1, "isHighlight": false, "text": "Tambe to Warner,1 run,tossed up full across the left-hander, driven to long off"}, {"ball": 11.2, "isHighlight": false, "text": "Tambe to Ojha, $$FOUR$$ ,skips out, reaches the pitch and lifts it straight over the bowler, nothing desperate about the charge, and not hitting it too hard"}, {"ball": 11.3, "isHighlight": false, "text": "Tambe to Ojha,no run,pushed to extra cover"}, {"ball": 11.4, "isHighlight": false, "text": "Tambe to Ojha,1 run,drives a full delivery hard and it goes past extra cover to wide long off"}, {"ball": 11.5, "isHighlight": false, "text": "Tambe to Warner, $$OUT$$ ,superbly done from Tambe, tosses it up more than he usually does, the line is on middle, Warner takes the bait and rushes out, has a swipe, but this is the googly, turns away, and he is stumped"}, {"ball": 11.5, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$st$$ $$†Samson$$ $$b$$ $$Tambe$$ $$6$$ $$(9m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$85.71$$"}, {"ball": 11.6, "isHighlight": false, "text": "Tambe to Henriques,1 run,pitches it up, Henriques pushes it down to long off for one"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Henriques,1 run,that's a hard chance for the keeper, who is standing up. The batsman looks to play a cute little cut but gets a faint edge.. It deflects off the gloves to short third man"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Ojha,1 run,he comes forward and pushes the length delivery to cover"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Henriques,1 run,he moves to the leg side a touch before dabbing the length delivery to midwicket for a single"}, {"ball": 12.3, "isHighlight": false, "text": "Hitesh: \"I remember Naman Ojha once saying that his career was cut short after Dhoni became the wk/captain . He has played some good looking shots this ipl. Time to stand up and get his team to a good total now.\""}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Ojha,no run,slightly wider outside off, the batsman slices it straight to point"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Ojha, $$OUT$$ ,Bhatia downs another one! this is a slow legcutter on off, Naman Ojha tries to steer it fine on the off side and loses his offstump"}, {"ball": 12.5, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$b$$ $$Bhatia$$ $$17$$ $$(23m$$ $$19b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$89.47$$"}, {"ball": 12.5, "isHighlight": false, "text": "Irfan Pathan is in"}, {"ball": 12.5, "isHighlight": false, "text": "Prashanth: \"Rajat Bhatia and Pravin Tambe is used well by RR. They surely know how to get best out of their talents. Credit surely must go RD and Co. Smart pickings in the auction unlike other teams who go after star value..\" --- And they paid INR 10 lakh for Tambe.."}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Pathan,2 runs,on the pads, easy pickings for Irfan as he flicks this one fine on the leg side"}, {"ball": 12.6, "isHighlight": false, "text": "MeenaSathya: \"Ohja bowled Bhatia Jinxed Hitesh 17 (19b 1x4 0x6)\""}, {"ball": 13.1, "isHighlight": false, "text": "Tambe to Henriques,1 run,pushed through on the midde stump line, the batsman brings his bat down just in time to punch it to long off"}, {"ball": 13.2, "isHighlight": false, "text": "Tambe to Pathan,1 run,slides this one across the left-hander, who waits on the back foot before punching it to deep cover"}, {"ball": 13.3, "isHighlight": false, "text": "Tambe to Henriques,1 leg bye,bowls a googly, but this is going down the leg side.. the batsman goes for the pull but misses, gets hit on the pads"}, {"ball": 13.4, "isHighlight": false, "text": "Tambe to Pathan,1 run,another googly, but this is short enough for the batsman to punch to long off easily"}, {"ball": 13.5, "isHighlight": false, "text": "Tambe to Henriques,no run,fuller delivery, driven straight to extra cover"}, {"ball": 13.6, "isHighlight": false, "text": "Tambe to Henriques,no run,goes back to the slider, defends it to midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Faulkner comes back"}, {"ball": 14.1, "isHighlight": false, "text": "Faulkner to Pathan,1 leg bye,back of length but on the pads, it's clipped down to fine leg"}, {"ball": 14.2, "isHighlight": false, "text": "Faulkner to Henriques,no run,looks for a single after dabbing this to cover point, but he is rightly sent back by Irfan"}, {"ball": 14.3, "isHighlight": false, "text": "Faulkner to Henriques,no run,angled across the right-hander, beats the outside edge as the batsman looks to drive"}, {"ball": 14.3, "isHighlight": false, "text": "Muqeet Ahmed: \"artificially elongated batting line rubber band has stuck back badly SRH !!!\""}, {"ball": 14.4, "isHighlight": false, "text": "Faulkner to Henriques,1 run,short of length outside off, he steers it down to third man for a single"}, {"ball": 14.5, "isHighlight": false, "text": "Faulkner to Pathan,1 run,he comes forward and punches this length ball on the up to deep extra cover"}, {"ball": 14.6, "isHighlight": false, "text": "Faulkner to Henriques, $$FOUR$$ ,smashing shot! Henriques jumps out of the crease and whacks the length delivery straight past Irfan.. Powerful, precise"}, {"ball": 14.6, "isHighlight": false, "text": "They have crossed 100..but they need a lot more.."}, {"ball": 14.6, "isHighlight": false, "text": "Aman Parikh: \"As stupid as this sounds, SRH should bring in Brendon Taylor for Dale Steyn and play Ishant/Rasool. Their weak batting is the concern, and with Karn, Mishra, Bhuvi, Ishant, and Irfan they still have a decent bowling lineup. Taylor can be the key at number 3, and he must be given a go !!\""}, {"ball": 14.6, "isHighlight": false, "text": "The bearded one comes back.."}, {"ball": 15.1, "isHighlight": false, "text": "Richardson to Pathan,no run,fires it full and wide outside off, Irfan doesn't get close to the line but tries to drive it, beaten"}, {"ball": 15.2, "isHighlight": false, "text": "Richardson to Pathan,2 runs,this time he comes behind it and drives it smartly to deep extra cover"}, {"ball": 15.3, "isHighlight": false, "text": "Richardson to Pathan,no run,this one is not full enough but Irfan repeats the shot, misses again"}, {"ball": 15.4, "isHighlight": false, "text": "Richardson to Pathan,1 run,goes for the drive and gets a thick outside edge that drops a few meters short of the third man fielder"}, {"ball": 15.5, "isHighlight": false, "text": "Richardson to Henriques,1 leg bye,this was on the pads and the batsman misses his flick, takes leg-bye to point"}, {"ball": 15.5, "isHighlight": false, "text": "Andrew: \"@Aman: That would be a terrible idea for the simple reason that you do not turn a strength and a weakness into two mediocre suits. The Steyn-Bhuvneshwar axis means SRH have a chance to defend anything above 140 and breaking it up would just accelerate their already steep decline.\""}, {"ball": 15.6, "isHighlight": false, "text": "Richardson to Pathan,no run,good wide yorker outside off, he chases it but can't make contact"}, {"ball": 15.6, "isHighlight": false, "text": "Taran: \"@Aman Parikh: Go home, you are drunk.\""}, {"ball": 16.1, "isHighlight": false, "text": "Watson to Henriques, $$OUT$$ ,he comes and picks up the wicket immediately! What a guy.. That was a length delivery, asking to be hit, Henriques clobbers it flat towards long-off where Rahane takes another good catch.."}, {"ball": 16.1, "isHighlight": false, "text": "$$MC$$ $$Henriques$$ $$c$$ $$Rahane$$ $$b$$ $$Watson$$ $$9$$ $$(19m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$69.23$$"}, {"ball": 16.1, "isHighlight": false, "text": "Karn Sharma comes in"}, {"ball": 16.2, "isHighlight": false, "text": "Watson to Sharma, $$OUT$$ ,another one! This is a  $$hat-trick$$ for Watson. Angled delivery, it's steered straight to the hands of the keeper. Ahmedabad is proving real lucky for Royals! Second hat-trick in two games"}, {"ball": 16.2, "isHighlight": false, "text": "$$KV$$ $$Sharma$$ $$c$$ $$†Samson$$ $$b$$ $$Watson$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 16.2, "isHighlight": false, "text": "Wow.. That's incredible.. Two hat-tricks. I didn't really realise it till I heard the booming voice of the TV commentator wake me up"}, {"ball": 16.3, "isHighlight": false, "text": "Watson to Steyn,no run,is there some reverse swing! Comes in a touch and Steyn drives it to mid-off"}, {"ball": 16.4, "isHighlight": false, "text": "Watson to Steyn,1 run,another incoming delivery, Steyn pushes it straight to midwicket and sets off immediately.. The fielder from midwicket  fires in a throw at the non-striker's.. Was out had he hit"}, {"ball": 16.5, "isHighlight": false, "text": "Watson to Pathan,no run,he is keeping it on the stumps, the batsman punches it back to the bowler"}, {"ball": 16.6, "isHighlight": false, "text": "Watson to Pathan, $$FOUR$$ ,there is no first slip and that is exactly where Pathan gets this boundary from"}, {"ball": 16.6, "isHighlight": false, "text": "Now Faulkner"}, {"ball": 16.6, "isHighlight": false, "text": "RAvi: \"Did the \"shaking voice\" come from the \"tracer bullet\"?\" --- No, from \"the world is so wonderful\""}, {"ball": 17.1, "isHighlight": false, "text": "Faulkner to Steyn,1 run,he looks to play to leg side but gets a leading edge to cover"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner to Pathan,no run,a beautiful legcutter, it actually spins away from the batsman and beats the bat"}, {"ball": 17.2, "isHighlight": false, "text": "Alex: \"Not only was that hat-trick spread across two spells, but Watson took himself off after the first wicket, as he is the captain. I wonder if any other bowling captains have ever interrupted their own hat-trick? I think he may be the first!\""}, {"ball": 17.3, "isHighlight": false, "text": "Faulkner to Pathan,no run,another leg cutter and it spins past the outside edge.."}, {"ball": 17.4, "isHighlight": false, "text": "Faulkner to Pathan,1 run,this time Irfan gets some bat on it, pushes it to backward point"}, {"ball": 17.5, "isHighlight": false, "text": "Faulkner to Steyn,2 runs,fires in a quick yorker from round the stumps, the batsman gets a couple but it was only an inside edge to short fine leg"}, {"ball": 17.6, "isHighlight": false, "text": "Faulkner to Steyn,no run,cramps the batsman for room, he has no other option but to defend"}, {"ball": 17.6, "isHighlight": false, "text": "The bearded one comes back"}, {"ball": 18.1, "isHighlight": false, "text": "Richardson to Pathan,1 run,fuller delivery wide outside off, Irfan slices it to deep point.. just a single"}, {"ball": 18.1, "isHighlight": false, "text": "Sasikanth: \"Unless dew plays a spoil sport, i think 130 should be a good total for SRH with their bowling line-up..personally, i would prefer it if Dhawan gives Irfan an over at least within the first 6 for him to make an impact with the swing he can generate..\" ---- It's 2014, remember?"}, {"ball": 18.2, "isHighlight": false, "text": "Richardson to Steyn, $$FOUR$$ ,that is superbly played! He moves way towards the leg side and slives the full delivery over point"}, {"ball": 18.3, "isHighlight": false, "text": "Richardson to Steyn,no run,good comeback from the bowler! He chases the batsman as he is making room and beats the bat swing"}, {"ball": 18.4, "isHighlight": false, "text": "Richardson to Steyn,1 run,looks to swing it to the leg side and gets an inside edge on to his body, picks up a single to short third man"}, {"ball": 18.5, "isHighlight": false, "text": "Richardson to Pathan,no run,length delivery angled across the batsman, Irfan swings to the leg side but misses it completely"}, {"ball": 18.6, "isHighlight": false, "text": "Richardson to Pathan,1 run,swings his bat, but he is cramped for room, only manages a limp shot to long on"}, {"ball": 19.1, "isHighlight": false, "text": "Faulkner to Pathan,2 runs,slower delivery, Irfan charges out to launch it over cover, but ends up slicing it behind point"}, {"ball": 19.2, "isHighlight": false, "text": "Faulkner to Pathan,no run,another legcutter, wide outside off, Irfan throws his bat at that, misses it again"}, {"ball": 19.2, "isHighlight": false, "text": "pravin: \"I had heard that IKP had forgotten how to swing the ball , it seems that he has also forgotten how to swing the bat !!\""}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner to Pathan,1 wide,  $$OUT$$ ,and another one! This is too wide though but Irfan runs for a bye.. Steyn has to pay the price as Sanju takes down the stumps.."}, {"ball": 19.3, "isHighlight": false, "text": "$$DW$$ $$Steyn$$ $$run$$ $$out$$ $$9$$ $$(8m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 19.3, "isHighlight": false, "text": "Amit Mishra, who has a first-class double ton, comes in"}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner to Mishra,4 byes,superb yorker! But it's one of those times you are too good even for your own team.. Sanju is not able to dive and stop"}, {"ball": 19.4, "isHighlight": false, "text": "Faulkner to Mishra, $$OUT$$ ,What a comedy! The batsman misses the shot and runs out of the crease to pick up a bye.. Sanju fires the throw and misses.. Faulkner gathers the ball, he fires in a throw again as Mishra is still out of the crease.. He misses again.. Now Sanju takes it and he finally manages to strike the stumps.. Mishra could have saved himself but he had given himself up to the mercy of this funny game between Samson and Faulkner.. Irfan Pathan doesn't move, he had the best seat"}, {"ball": 19.4, "isHighlight": false, "text": "$$A$$ $$Mishra$$ $$run$$ $$out$$ $$0$$ $$(2m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Faulkner to Kumar,1 bye,slower delivery, Bhuvi misses.. Sanju lobs it up to the bowler, but it's lobbed all the way over the bowler.. The batsmen were not looking for a bye, but they get it finally"}, {"ball": 19.5, "isHighlight": false, "text": "Punya: \"Mishra's Runout would top 'The all time 10 Weird run outs' of cricket history even after 100 more years from now. I am sure going forward he would be the 11th batsmen for any given match be it International or Galli Cricket.. huh...\""}, {"ball": 19.6, "isHighlight": false, "text": "Faulkner to Pathan, $$FOUR$$ ,this is a half-volley that he was looking for, almost takes out the umpire's head with that hit"}, {"ball": 19.6, "isHighlight": false, "text": "Sunrisers got such an encouraging start that this final total looks like a joke. Unravel the innings and you would find the damage for done by Tambe and Bhatia, before Watson came in and completed a hat-trick, the team's second in two matches."}, {"ball": 19.6, "isHighlight": false, "text": "Prashant: \"Mishra's run-out just highlights the attitude and mindset in the team. SRH just don't have any self-confidence. They appear to be a team of mis-fits.\""}, {"ball": 19.6, "isHighlight": false, "text": "Venkat: \"Things are going according to the plan for the sunrisers. A low scoring game is what they needed to get back in the grove. Most of the games they won last year were defending scores less than 140\""}], "name": "Rajasthan Royals v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733989.html?innings=1;view=commentary", "match_num": 30}