{"commentary": [{"ball": 0, "isHighlight": false, "text": "Here's a constructive way to spend the innings break.  $$Answer$$ $$15$$ $$questions$$ $$in$$ $$quick$$ $$time$$ , and you could be on a flight to London to watch India play England at Lord's. Go."}, {"ball": 0, "isHighlight": false, "text": "I hope you have played CricIQ.. Rahane and Nair are already here. Bhuvi to kickstart"}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Rahane,no run,bowls length just outside off, not much swing and whatever there is, Rahane covers it with a good front foot defensive prod"}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Rahane,no run,poor delivery, it's full and down the leg side.. luckily for the bowler it brushed the batsman's pad"}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Rahane, $$OUT$$ ,first wicket! This is a loose loose shot! He comes forward to this length delivery and pushes at it away from the body, giving a simple head-high catch to the point fielder"}, {"ball": 0.3, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$Warner$$ $$b$$ $$Kumar$$ $$0$$ $$(2m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 0.3, "isHighlight": false, "text": "Who's next? Samson it is"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Samson,1 wide,poor delivery to the new man! This is headed for the first slip almost.. The keeper gets there eventually"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Samson,no run,length delivery with some awayswing, the batsman leaves it alone"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Samson,1 run,looks to bring this one in from wide of the crease, the batsman comes on top of that nicely and guides it to third man"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Nair,no run,super inswinger this one! The height on that has saved the batsman..He didn't account for this much movement and was hit on the knee-roll right in front of the middle.. The replays show there was a huge inside edge on that too"}, {"ball": 0.6, "isHighlight": false, "text": "Excellent start by Bhuvi.. now let's see what Steyn is up to"}, {"ball": 1.1, "isHighlight": false, "text": "Steyn to Samson,no run,starts off with a outswinger, left alone by the batsman"}, {"ball": 1.2, "isHighlight": false, "text": "Steyn to Samson,no run,bowls it full on the offstump line, the batsman leans forward and drives it down to mid-off"}, {"ball": 1.3, "isHighlight": false, "text": "Steyn to Samson,no run,superb delivery! This one pitches just outside off and shapes away late, the batsman was looking to play the drive and misses it completely.. That is one of those Steyn specials"}, {"ball": 1.4, "isHighlight": false, "text": "Steyn to Samson, $$FOUR$$ ,another superb delivery but Samson manages to get it away.. He chips it over mid-off and gets a boundary..not in complete control, but his aim for right"}, {"ball": 1.5, "isHighlight": false, "text": "Steyn to Samson,1 run,he throws his bat at this outswinger again, but this flies off the thick outside edge.. not very far from third man"}, {"ball": 1.6, "isHighlight": false, "text": "Steyn to Nair, $$FOUR$$ ,poor line! This is on the pads and all Nair needs to do is get some bat on it.. He deflects it fine on the leg side for a boundary"}, {"ball": 1.6, "isHighlight": false, "text": "Aditya Mandalem: \"Am I the only one who thinks Steyn is using his emotions more than his head these days? He used to use them equally before. I want to see that earlier Steyn as an SRH fan.\""}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Samson,no run,length delivery on off, the batsman comes forward and pushes it to cover"}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Samson,no run,another inswinger, Samson comes forward and drives it confidently to cover"}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Samson,1 run,this would have been game over for Nair! The batsman punched it to Karn Sharma at cover point and set off for a single straightaway.. Had Karn hit, Nair would have been out by a mile"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to Nair,no run,not much swing on this length delivery, Nair defends to point comfortably"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Nair,no run,slower delivery outside off, there is no hurry so Nair comes forward and defends"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to Nair, $$FOUR$$ ,there comes the indipper but Nair is on task, brings his bat down stylishly to time this superbly through midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "Steyn continues"}, {"ball": 3.1, "isHighlight": false, "text": "Steyn to Samson, $$SIX$$ ,whoa! This is superb! It was full on off, Samson didn't worry if it was swinging or not, he just lifts it over long-off with a straightest of bats.. That sails way beyond the boundary.. 146 kph that was bowled at.. Incredible shot"}, {"ball": 3.2, "isHighlight": false, "text": "Steyn to Samson,1 run,short of length of off, the batsman dabs it to point for a single"}, {"ball": 3.3, "isHighlight": false, "text": "Steyn to Nair,no run,he is not bowling full anymore.. Nair defends this back of length delivery to point"}, {"ball": 3.4, "isHighlight": false, "text": "Steyn to Nair,no run,that's a quick short delivery.. he is no mug with the ball. Nair looks to pull but he is clearly in no position.. He is lucky that hasn't taken his head off"}, {"ball": 3.5, "isHighlight": false, "text": "Steyn to Nair, $$FOUR$$ ,Nair has some timing too! This is back of length and offers some width, but Nair punches it superbly through point.. It flies past the fielder there"}, {"ball": 3.6, "isHighlight": false, "text": "Steyn to Nair, $$OUT$$ ,gets the wicket finally! Another back of length delivery swinging away from the batsman, the batsman pokes at it but only gets an outside edge to the keeper.."}, {"ball": 3.6, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$c$$ $$†Ojha$$ $$b$$ $$Steyn$$ $$12$$ $$(18m$$ $$9b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 3.6, "isHighlight": false, "text": "\"His body stance reminds me of Tendulkar and the legside flick of Steyn's first over last ball is no different. Does any one think so?\" This is Chaitanya, just before this ball was bowled"}, {"ball": 3.6, "isHighlight": false, "text": "Watson comes in.."}, {"ball": 4.1, "isHighlight": false, "text": "Kumar to Samson,no run,gets one to come in to the batsman, Sanju pushes it calmly to mid-on"}, {"ball": 4.1, "isHighlight": false, "text": "Mayank Aggarwal: \"That six off Steyn by Samson shows how fearless this young guy is.. He sure is a bright prospect for India.\""}, {"ball": 4.2, "isHighlight": false, "text": "Kumar to Samson,1 run,confidently comes forward and punches this to wide mid-off for an easy single"}, {"ball": 4.2, "isHighlight": false, "text": "One wide slip in place"}, {"ball": 4.3, "isHighlight": false, "text": "Kumar to Watson,no run,length delivery in the channel outside off, Watson comes forward before letting it go"}, {"ball": 4.4, "isHighlight": false, "text": "Kumar to Watson,1 wide,attempts a short delivery, but he has dug that in too short, sails way over the batsman's head"}, {"ball": 4.4, "isHighlight": false, "text": "Kumar to Watson,no run,back of length delivery on the stumps, the batsman defends it solidly to cover"}, {"ball": 4.5, "isHighlight": false, "text": "Kumar to Watson,no run,stays calm and defends the back of length delivery to the leg side"}, {"ball": 4.6, "isHighlight": false, "text": "Kumar to Watson,3 runs,just a punch to the off side, but this is expertly hit in the gap at cover, easy treble"}, {"ball": 4.6, "isHighlight": false, "text": "Steyn was seen conducting the crowd to get them behind him .."}, {"ball": 4.6, "isHighlight": false, "text": "No Steyn though.. Karn comes in"}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Watson,2 runs,flatter and on the pads, easily nudges away to deep square leg for a couple"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Watson,1 run,tossed up delivery on the stumps, the batsman eases it to long on for a single"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Samson,1 run,flatter now, Samson is cool to push it to long-on for another easy single"}, {"ball": 5.3, "isHighlight": false, "text": "Paul Eccles: \"My theory for why Steyn is bowling cross-seamed: because with the seam upright he gets too much movement, the batsmen don't even nick it ...\""}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Watson,1 run,that keeps coming in with the arm, Watson, who was playing back, gets an inside edge to short third man"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Samson, $$OUT$$ ,superb ball! Samson gives it away. It was tossed up on the off and middle, the drift brings it in, the loop draws Samson out of the crease.. But it doesn't turn, keeps going straight to hit the top of middle"}, {"ball": 5.5, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$b$$ $$Sharma$$ $$16$$ $$(26m$$ $$16b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 5.5, "isHighlight": false, "text": "Binny is the new guy"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Binny,no run,testing flighted delivery, Binny defends off the front foot"}, {"ball": 5.6, "isHighlight": false, "text": "Henriques it the new bowler"}, {"ball": 6.1, "isHighlight": false, "text": "Henriques to Watson, $$FOUR$$ ,oh this is crisply timed through midwicket! Watson leans into this legside halfvolley and hits the gap"}, {"ball": 6.1, "isHighlight": false, "text": "Luke: \"even after 8 (whatever) years of joyous spectatorship I still find T20 a complete mind-mush ... especially coming off some great test cricket bowling. Steyn lost that battle with Nair outright yet if that was a test it woukd have been an overwhelming victory to bowler. I cant rearrange my prejudices quickly enough - especially being a bowler myself !!\""}, {"ball": 6.2, "isHighlight": false, "text": "Henriques to Watson,no run,he comes forward and pushes the length delivery to mid-off"}, {"ball": 6.2, "isHighlight": false, "text": "Hrishi: \"Confused! Samson plays like this as per team plan or is this is natural game! Surely he has to stick in there!!!\""}, {"ball": 6.3, "isHighlight": false, "text": "Henriques to Watson, $$OUT$$ ,big big wicket! The tide is turning in Sunrises' favour.. Loose shot from Watson as he tries to cut this short of length delivery, it was too close to cut really.. He gets a faint nick to the keeper"}, {"ball": 6.3, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$†Ojha$$ $$b$$ $$Henriques$$ $$11$$ $$(13m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$110.00$$"}, {"ball": 6.3, "isHighlight": false, "text": "Who's in? Smith it is"}, {"ball": 6.4, "isHighlight": false, "text": "Henriques to Smith,no run,some energy in the field! Warner charges in from point to stop the defensive shot from Smith"}, {"ball": 6.4, "isHighlight": false, "text": "Two-Faced Riddl: \"Surely RR have to find a place for Hodge?! Kane Richardson can be sacrificed I think. They had 6 bowlers today and too without Binny. Surely him and Hodge can make up as 6th bowler if one of the others has an off day.\""}, {"ball": 6.5, "isHighlight": false, "text": "Henriques to Smith,1 run,he shuffles across to the off side and clips the back of length delivery to fine leg"}, {"ball": 6.6, "isHighlight": false, "text": "Henriques to Binny,no run,waits on the back foot and defends the length delivery to cover"}, {"ball": 6.6, "isHighlight": false, "text": "John: \"@Paul Eccles isn't getting nicks more important in tests where there r 3 odd slips n a gully????whereas in T20's dotballs r like gold dust though there's no better way of restricting than taking wickets.....and i'm not sure abt your theory as most of the nicks may fly away to the boundary or to third man as in T20's there isn't a slip usually..\""}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Smith,no run,loopy delivery outside off, Smith comes forward and drives it to cover"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Smith,1 run,uses his feet and eases the tossed up delivery to long on"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Binny,no run,flatter and spins away after pitching, the batsman defends it to point"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Binny,no run,he presses forward and defends the tossed up delivery"}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Binny,1 run,slower and loopy on off, the batsman drives it to deep cover for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Smith,1 run,bowls the googly which is spotted by Smith, he works it away to deep midwicket playing with the turn"}, {"ball": 7.6, "isHighlight": false, "text": "It's time-out in Ahmedabad. Here's Mansoor, taking more risks than necessary: \"I'm traveling Dubai to Oman by road, I put navigator on my mobile but always open cricinfo website\" .. Please don't cricket and drive"}, {"ball": 7.6, "isHighlight": false, "text": "Mishra comes into the attack.."}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to Smith,1 run,tossed up an full, Smith uses his feet and drives it to wide long-on"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to Binny,1 run,short enough for Binny to get back and punch it to deep cover"}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to Smith,no run,super googly! turns in big time and hits the front pad.. but that hit him just outside the line of off.. Good ball"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to Smith,1 wide,this one turns too much and is a wide down the leg side"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to Smith,no run,loopy delivery, dips on the batsman as he comes out of the crease, Smith defends eventually"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Smith,no run,another good ball, the batsman looks to work it to the leg side, but gets a leading edge towards the bowler"}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to Smith,1 run,floated up to the batsman, Smith pushes it to deep midwicket for a single"}, {"ball": 8.6, "isHighlight": false, "text": "He hasn't been the same bowler since he bowled that no-ball against SA in the WT20 semi.. But this is a decent start"}, {"ball": 9.1, "isHighlight": false, "text": "Sharma to Smith,2 runs,tossed up on the pads, the batsman flicks it past short fine leg for a couple"}, {"ball": 9.2, "isHighlight": false, "text": "Sharma to Smith,4 byes,stumping chance gone abegging! Another superb ball, dips, and spins past the outside edge.. Smith was offbalance but the keeper misses it completely"}, {"ball": 9.3, "isHighlight": false, "text": "Sharma to Smith,1 run,comes out of the crease and drives this fuller delivery to long on"}, {"ball": 9.4, "isHighlight": false, "text": "Sharma to Binny,1 run,now Binny comes out of the crease to ease it to long on"}, {"ball": 9.5, "isHighlight": false, "text": "Sharma to Smith,2 runs,flatter and shorter, the batsman pushes it to midwicket with soft hands and comes back for a quick second"}, {"ball": 9.6, "isHighlight": false, "text": "Sharma to Smith,1 run,tossed up delivery, pushed to mid-on with soft hands for a single"}, {"ball": 10.1, "isHighlight": false, "text": "Mishra to Smith,no run,tossed up delivery on off, the batsman comes forward to smother the spin with a defensive shot"}, {"ball": 10.2, "isHighlight": false, "text": "Mishra to Smith,no run,wonderful googly! Smith didn't see that coming but is lucky to get an inside edge on to his pads"}, {"ball": 10.3, "isHighlight": false, "text": "Mishra to Smith,1 run,straighter one now, the batsman goes deep into his crease to punch this to deep cover"}, {"ball": 10.4, "isHighlight": false, "text": "Mishra to Binny,1 run,tossed up delivery, the batsman comes out and almost yorks himself, manages to push this to deep cover"}, {"ball": 10.5, "isHighlight": false, "text": "Mishra to Smith,1 run,charges down the pitch - he loves doing that - and punches this tossed up delivery to long on"}, {"ball": 10.5, "isHighlight": false, "text": "Aditya Mandalem: \"Ojha missing the stumping. Warner missing Maxwell's catch. Four points depending on crucial things.\""}, {"ball": 10.6, "isHighlight": false, "text": "Mishra to Binny,1 run,almost! The batsman comes out, is beaten by the flight, but manages to get some bat on it to push the ball to cover"}, {"ball": 10.6, "isHighlight": false, "text": "abhinav: \"I didnt know irfan was taken into the team for his batting :o\""}, {"ball": 10.6, "isHighlight": false, "text": "Henriques now"}, {"ball": 10.6, "isHighlight": false, "text": "Ashok: \"I need to wash my mango-milk-shake glass which is important to keep peace in the neighborhood, but I tremor at the thought of another RR wicket. \" --- Mango.. slrrp!! Hail the EU Ban.."}, {"ball": 11.1, "isHighlight": false, "text": "Henriques to Binny,no run,bowls it full and Binny plays a straight drive to be proud of, but hits the stumps at the non-striker's end"}, {"ball": 11.2, "isHighlight": false, "text": "Henriques to Binny,2 runs,slower delivery on the pads, the batsman flicks it to deep backward square leg for a couple"}, {"ball": 11.3, "isHighlight": false, "text": "Henriques to Binny,1 run,another slower delivery, the batsman chops it to point softly and calls for a single early"}, {"ball": 11.4, "isHighlight": false, "text": "Henriques to Smith,1 run,walks across to the off side and whips the length delivery to fine leg for a single"}, {"ball": 11.5, "isHighlight": false, "text": "Henriques to Binny,1 run,short ball, Binny goes for the pull but is late on the shot.. good for him as his shot falls well short of deep square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Henriques to Smith,1 run,slower delivery on the off, the batsman chops it straight to Pathan at short third man and sets off for a single"}, {"ball": 11.6, "isHighlight": false, "text": "The required rate is over eight now..Mishra continues"}, {"ball": 11.6, "isHighlight": false, "text": "Ben: \"Alphonso mango henceforth has been renamed as Indian Mango to bypass EU ban. Thanks me, expatriates.... \""}, {"ball": 12.1, "isHighlight": false, "text": "Mishra to Smith,1 run,comes out of the crease and plays the googly to the right of midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Mishra to Binny,no run,another wicket! Loud appeal from the bowler and the keeper! That surely looked like a caught-behind.. I heard that edge in Mumbai.. Big Big edge.. as Binny went for the cut"}, {"ball": 12.3, "isHighlight": false, "text": "Mishra to Binny,no run,this is the googly now and Binny has no clue.. It hits the top of his back pad..Superb delivery"}, {"ball": 12.4, "isHighlight": false, "text": "Mishra to Binny,2 runs,he comes forward and pushes this to long-on softly.. calls for a quick couple"}, {"ball": 12.5, "isHighlight": false, "text": "Mishra to Binny,no run,tossed up delivery outside off, the batsman comes out of the crease and pushes it back at the bowler.. who fires it back at the keeper.. Binny has his head down.. he knows he edged it.."}, {"ball": 12.6, "isHighlight": false, "text": "Mishra to Binny,no run,tossed up delivery on off, the batsman drives it straight to Dhawan at cover"}, {"ball": 12.6, "isHighlight": false, "text": "Jury: \"After that run out, even umpires are not taking Mishra seriously.\""}, {"ball": 12.6, "isHighlight": false, "text": "Here comes the big-swinger.. Irfan"}, {"ball": 13.1, "isHighlight": false, "text": "Pathan to Smith,2 runs,slower delivery on the stumps, the batsman nudges it to midwicket softly and calls for a couple"}, {"ball": 13.2, "isHighlight": false, "text": "Pathan to Smith,1 run,another slower delivery, the batsman punches it to deep cover for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Pathan to Binny,1 run,direct hit and Smith was gone! Binny calls for a tight single to short third man.. Bhuvi misses"}, {"ball": 13.4, "isHighlight": false, "text": "Pathan to Smith,1 run,  $$OUT$$ ,Warner you beauty! This is sensational stuff. The batsman dabs it to midwicket and calls for a second.. This looked like a two.. but Warner hared in, swooped the ball and hit the stumps direct at non-striker's end.. Binny has to go back.. Binny is way way short.."}, {"ball": 13.4, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$run$$ $$out$$ $$12$$ $$(32m$$ $$19b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$63.15$$"}, {"ball": 13.5, "isHighlight": false, "text": "Pathan to Smith,1 run,slower delivery, the batsman pushes it to long on for a single"}, {"ball": 13.5, "isHighlight": false, "text": "rssampat: \"It's silly really, these rules. When a umpire has a doubt about a no-ball, it's checked 100 times. When it's a close catch or save near the boundary ropes, it's replayed 100 times for 1 run and when the Keeper & Bowler appeal so very strongly and it's such a close call, why the hell can't the umpire ask for a reply?\""}, {"ball": 13.6, "isHighlight": false, "text": "Pathan to Bhatia,no run,length delivery on the stumps, Bhatia punches it back to the bowler"}, {"ball": 13.6, "isHighlight": false, "text": "Fifty six off six overs.. this is slowly slipping for Royals"}, {"ball": 13.6, "isHighlight": false, "text": "Andrew: \"I am a supporter of technology in cricket but the standard of umpiring has drastically slipped as a result. They hardly ever call no-balls without checking with the third umpire and that last act of Tarapore (calling for the replay with Binny way out) just confirms that they simply do not have the incentive to be any better.\""}, {"ball": 13.6, "isHighlight": false, "text": "Mishra again"}, {"ball": 14.1, "isHighlight": false, "text": "Mishra to Smith,no run,comes down the pitch and plays outside the line of this, gets hit on the pads but this was drifting down leg"}, {"ball": 14.2, "isHighlight": false, "text": "Mishra to Smith,no run,flatter and quicker outside off, punched back to the bowler"}, {"ball": 14.3, "isHighlight": false, "text": "Mishra to Smith,no run,slower and tossed up outside off, the batsman chops it straight to point"}, {"ball": 14.4, "isHighlight": false, "text": "Mishra to Smith,1 run,he comes down the pitch and flicks the tossed up delivery to midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Mishra to Bhatia,1 run,he drags this from outside off to long-on for an easy single"}, {"ball": 14.6, "isHighlight": false, "text": "Mishra to Smith,no run,comes out of the pitch early, but can only drive it to Dhawan at cover"}, {"ball": 14.6, "isHighlight": false, "text": "Excellent over.. Steyn will be back soon too.."}, {"ball": 14.6, "isHighlight": false, "text": "Here's Steyn"}, {"ball": 15.1, "isHighlight": false, "text": "Steyn to Bhatia,no run,quick, very quick outside off, Bhatia looks to cut it but misses"}, {"ball": 15.2, "isHighlight": false, "text": "Steyn to Bhatia,1 leg bye,fires this on the leg stump, the batsman gets hit on the pads but picks up a leg bye"}, {"ball": 15.3, "isHighlight": false, "text": "Steyn to Smith,no run,short of length and quick, this time Smith is beaten.. outside off"}, {"ball": 15.3, "isHighlight": false, "text": "If Steyn is bowling, and the rate is up, who do you call, DE VILLIERS!"}, {"ball": 15.4, "isHighlight": false, "text": "Steyn to Smith, $$OUT$$ ,They are all on fire! Pathan completes an excellent catch.. With time running out, Smith looks for the big shot at this quick length delivery, he only manages a big top-edge. Irfan runs backwards from mid-off to settle under it"}, {"ball": 15.4, "isHighlight": false, "text": "$$SPD$$ $$Smith$$ $$c$$ $$Pathan$$ $$b$$ $$Steyn$$ $$22$$ $$(36m$$ $$33b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 15.4, "isHighlight": false, "text": "Faulkner.. is he the de Villiers Royals are looking for?"}, {"ball": 15.5, "isHighlight": false, "text": "Steyn to Bhatia,1 run,length delivery on the legs, Bhatia pulls it down to fine leg with one hand"}, {"ball": 15.6, "isHighlight": false, "text": "Steyn to Faulkner,1 run,fires it full on off stump, but it ends up being a low full toss and the batsman slices it past the diving Warner at point"}, {"ball": 15.6, "isHighlight": false, "text": "Karn is not an easy one to hit out"}, {"ball": 16.1, "isHighlight": false, "text": "Sharma to Faulkner,no run,bowls it flat and gets some turn, the batsman chops it straight to cover point"}, {"ball": 16.2, "isHighlight": false, "text": "Sharma to Faulkner,1 run,flatter and shorter, the batsman punches it to long on"}, {"ball": 16.3, "isHighlight": false, "text": "Sharma to Bhatia,1 run,he stays in the crease and punches the length delivery to wide long off"}, {"ball": 16.3, "isHighlight": false, "text": "Vaibhav: \"Faulkner must be looking for Ishant\""}, {"ball": 16.4, "isHighlight": false, "text": "Sharma to Faulkner,1 run,he goes deep in the crease to pick up another single to long on"}, {"ball": 16.5, "isHighlight": false, "text": "Sharma to Bhatia,1 run,quicker and shorter on off, only a single to deep midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Sharma to Faulkner,1 run,he is bowling flatter here, another single to deep midwicket off the back foot"}, {"ball": 16.6, "isHighlight": false, "text": "Bhuvi now. this is a good bowling attack.."}, {"ball": 17.1, "isHighlight": false, "text": "Kumar to Faulkner, $$OUT$$ ,slower delivery, Faukner has no option but to swing at it, he hits in the right area, plays his natural game, but unfortunately it doesn't work for him today .. Finch comes round from long on to take a neat catch"}, {"ball": 17.1, "isHighlight": false, "text": "$$JP$$ $$Faulkner$$ $$c$$ $$Finch$$ $$b$$ $$Kumar$$ $$4$$ $$(7m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 17.2, "isHighlight": false, "text": "Kumar to Bhatia, $$OUT$$ ,slower delivery, Bhatia swings this time.. he goes towards deep midwicket.. again more height than distance.. Warner takes a simple catch"}, {"ball": 17.2, "isHighlight": false, "text": "$$R$$ $$Bhatia$$ $$c$$ $$Warner$$ $$b$$ $$Kumar$$ $$4$$ $$(20m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 17.2, "isHighlight": false, "text": "Someone's on a $$hat-trick$$ .."}, {"ball": 17.3, "isHighlight": false, "text": "Kumar to Richardson,1 run,full and wide outside off, the batsman drives it to deep cover to throw water on possible celebrations"}, {"ball": 17.4, "isHighlight": false, "text": "Kumar to Kulkarni,no run,length delivery on the stump, Kulkarni cuts it straight to point"}, {"ball": 17.4, "isHighlight": false, "text": "Abhishek: \"Rajat Bhatia out on a slow ball. Karma!\""}, {"ball": 17.5, "isHighlight": false, "text": "Kumar to Kulkarni,1 run,fires in the yorker, the batsman digs it out to point for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Kumar to Richardson, $$OUT$$ ,slower ball, batsman swings, this time it doesn't even go beyond the square.. it goes high, touches the moon, but on its wayback, meets the bowler.. who was running backwards.. Superb catch again"}, {"ball": 17.6, "isHighlight": false, "text": "$$KW$$ $$Richardson$$ $$c$$ $$&$$ $$b$$ $$Kumar$$ $$1$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Steyn comes"}, {"ball": 18.1, "isHighlight": false, "text": "Steyn to Tambe,no run,fires in a yorker at Tambe, who somehow digs it out"}, {"ball": 18.1, "isHighlight": false, "text": "He runs it.. with his shirt looking like it's on fire.."}, {"ball": 18.2, "isHighlight": false, "text": "Steyn to Tambe,1 run,bowls it full outside off, the batsman slices it to deep point"}, {"ball": 18.3, "isHighlight": false, "text": "Steyn to Kulkarni,no run,length delivery on the middle stump line, the batsman gets his bat down in time to push it to cover"}, {"ball": 18.4, "isHighlight": false, "text": "Steyn to Kulkarni, $$FOUR$$ ,fuller and wider outside off, Kulkarni has to somehow get a thick outside edge, and he gets it, hitting it over point"}, {"ball": 18.5, "isHighlight": false, "text": "Steyn to Kulkarni,1 wide,looks for a slower ball but this is down the leg side"}, {"ball": 18.5, "isHighlight": false, "text": "Steyn to Kulkarni,1 wide,quicker one attempted, but again down the leg side"}, {"ball": 18.5, "isHighlight": false, "text": "Steyn to Kulkarni,1 run,back of length and rising, Kulkarni chops it down to third man for a single"}, {"ball": 18.6, "isHighlight": false, "text": "Steyn to Tambe,1 run,slower delivery, Tambe pushes to mid-off and would have been run-out had the fielder hit.. He survives to live another over"}, {"ball": 19.1, "isHighlight": false, "text": "Pathan to Tambe,1 run,length delivery at a slower pace from round the wicket, the batsman takes a single to point"}, {"ball": 19.2, "isHighlight": false, "text": "Pathan to Kulkarni,1 run,another slower delivery, aerially driven through cover"}, {"ball": 19.3, "isHighlight": false, "text": "Pathan to Tambe,no run,moves to the leg side and crashes it ... the ball dribbles to cover.."}, {"ball": 19.4, "isHighlight": false, "text": "Pathan to Tambe,no run,punches the fuller delivery, straight to Dhawan at cover again"}, {"ball": 19.5, "isHighlight": false, "text": "Pathan to Tambe, $$OUT$$ ,Game over! Tambe chips the length delivery straight to Steyn at long-off"}, {"ball": 19.5, "isHighlight": false, "text": "$$PV$$ $$Tambe$$ $$c$$ $$Steyn$$ $$b$$ $$Pathan$$ $$3$$ $$(8m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$42.85$$"}, {"ball": 19.5, "isHighlight": false, "text": "That's all from today. Tune in tomorrow for the twin matches.. DF signing off. ciao ciao."}, {"ball": 19.5, "isHighlight": false, "text": "\"We didn't have too many runs, so i said it was up to us if we played like warriors or losers,\"  $$Shikhar$$ $$Dhawan$$ says. \"The boys really responded really well. The wicket turned, especially Mishra turned the ball and also Karn.\""}, {"ball": 19.5, "isHighlight": false, "text": "$$Bhuvneshwar$$ $$is$$ $$the$$ $$man$$ $$of$$ $$the$$ $$match$$ . He says, \"Since coming into T20s, I have improved a lot in the death overs. The seam position is my strength in the early overs.\""}, {"ball": 19.5, "isHighlight": false, "text": "\"We bowled extremely well,\"  $$Shane$$ $$Watson$$  says. \"But more than anything, we misread the conditions a bit. I take the full responsibility for that as a captain. We are learning about these conditions, will get better. There weren't too many bad shots, just that the high-quality balls. They have world-class bowlers.\""}, {"ball": 19.5, "isHighlight": false, "text": "\"We just need the batting to click, otherwise our bowling is working really well. It's a different role for me in Sunrisers,\" Irfan Pathan says. \"I don't get the new ball but I try to contribute in the middle and death overs. \""}, {"ball": 19.5, "isHighlight": false, "text": "Sanju Samson gets INR 1 lakh for hitting the only six of the match. He gets another lakh for keeping calm while running out Mishra.. What a life!"}, {"ball": 19.5, "isHighlight": false, "text": "What a riposte by Sunrisers this! Superb bowling, brining back the memories of 2013 when they were regularly winning these matches. Bhuvneshwar, the legspinners, Steyn..all of them contributed. Much-needed win, it has put them back in the race. Royals weren't smart with their strokeplay."}, {"ball": 19.5, "isHighlight": false, "text": "Aravind: \"Look back..How important was Dhawan's knock on this slow pitch..Those are the runs given sun risers on winning margin..\""}, {"ball": 19.5, "isHighlight": false, "text": "Sai Kiran: \"I am just loving Shane Watson as a captain. Last night, he asked a pay rise for Pravin Tambe and today he has taken the full responsibility for the lose ! Only few can do it, not all !!\""}], "name": "Rajasthan Royals v Sunrisers Hyderabad", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733989.html?innings=2;view=commentary", "match_num": 30}