{"commentary": [{"ball": 0, "isHighlight": false, "text": "Gayle and Parthiv walk out to open. Sandeep Sharma to open"}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Gayle,no run,beats him first ball, pitches it on leg on a good length and swings it across pat Gayle's prod"}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Gayle,no run,pitches outside leg and swinging across again, Gayle leans forward and defends"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Gayle,no run,jags across him off a good length again, bounces too, Gayle takes a hand off the bat as he jabs it square"}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Gayle, $$FOUR$$ ,that's raced to the long off boundary, mid off's dive is in vain, this was bowled much fuller, and Gayle worked it from just outside off, it was in the air as it flew just past the bowler"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to Gayle,no run,beaten again, as it swerves and bounces past him from just back of a length"}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to Gayle,no run, $$dropped$$ , he's smacked it to the bowler, but that has burst out of Sandeep's hands and gone towards mid on"}, {"ball": 1.1, "isHighlight": false, "text": "Johnson to PA Patel,no run,straightening after being angled in towards off, Parthiv works it to mid on"}, {"ball": 1.2, "isHighlight": false, "text": "Johnson to PA Patel,no run,pitched up delivery holds the line and is hammered straight to mid off"}, {"ball": 1.3, "isHighlight": false, "text": "Johnson to PA Patel,no run,moving away from back of a length, pushed to covers"}, {"ball": 1.4, "isHighlight": false, "text": "Johnson to PA Patel, $$FOUR$$ ,shortish at 145 kph but Parthiv's swivelled and pulled it cleanly over square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Johnson to PA Patel,no run,that could have gone too, it was a length ball on the pad, but Parthiv missed the flick, Johnson appeals for lbw, but it was headed down"}, {"ball": 1.6, "isHighlight": false, "text": "Johnson to PA Patel,no run,bouncer at 142.8 kph, climbs high and Parthiv lets it go even as he moves outside the line"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Gayle, $$OUT$$ ,Sandeep's got Gayle again, anges it across Gayle, on a good length around off, it starts swinging away, Gayle goes after it, and edges it through to the keeper"}, {"ball": 2.1, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$c$$ $$†Saha$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$4$$ $$(10m$$ $$7b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$57.14$$"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Kohli, $$OUT$$ ,this is a very, very late reaction from the umpire on the appeal, but he's given Kohli, the batsman moved across to a length ball which was angled down the leg side, tried to flick it, there was a clear sound as ball passed the bat, it was dying on the keeper, he took it in his right glove, but it seems to have just brushed the ground for an instant after that, they go to the third umpire, it is not a front-foot no-ball, and they think the catch is also clean"}, {"ball": 2.2, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$†Saha$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$0$$ $$(3m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Rana,no run,very full just outside off and swinging in very late, dug out"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Rana,no run,short of a length ball defended"}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Rana,1 run,works this back of a length ball in the air and on the bounce to deep square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to PA Patel,no run,tries to cut the shortish one but is beaten"}, {"ball": 3.1, "isHighlight": false, "text": "Balaji to Rana,no run,beaten as he wafts at a wide length ball that holds the line and stays low too"}, {"ball": 3.2, "isHighlight": false, "text": "Balaji to Rana,no run,widish again, punched to point"}, {"ball": 3.3, "isHighlight": false, "text": "Balaji to Rana, $$FOUR$$ ,straightening outside off once more, Rana punches it, it flies in the air just past Maxwell's dive at shortish backward point"}, {"ball": 3.4, "isHighlight": false, "text": "Balaji to Rana, $$FOUR$$ ,short and wide, he comes out of the crease and cuts it hard over point"}, {"ball": 3.5, "isHighlight": false, "text": "Balaji to Rana,no run,full outside off now, he drives it quite crisply but cannot beat mid off"}, {"ball": 3.6, "isHighlight": false, "text": "Balaji to Rana,no run,short and wide once more, but this time he misses on the cut"}, {"ball": 3.6, "isHighlight": false, "text": "Deb: \"Kohli needs to walk after he is given out.....he tries to give an impression that he is not out....\""}, {"ball": 3.6, "isHighlight": false, "text": "Sukkrivaa: \"Wow, that was a great decision by the umpire. If they get it right in loud stadiums with unbelievable crowds, we continue with the game. If they get it wrong, we want them beheaded. Seems fair.\""}, {"ball": 4.1, "isHighlight": false, "text": "Johnson to PA Patel, $$FOUR$$ ,Parthiv has powered Johnson over short extra cover for four, got some width on this length ball and gave it everything"}, {"ball": 4.2, "isHighlight": false, "text": "Johnson to PA Patel,no run,now he tries to fetch it from outside off and pick it over square leg, connects very well but finds the man"}, {"ball": 4.3, "isHighlight": false, "text": "Johnson to PA Patel,no run,145.6 kph length ball, Parthiv tries to lift it over midwicket, but is beaten, it goes off the thigh pad to the keeper, appeal for caught behind turned down"}, {"ball": 4.4, "isHighlight": false, "text": "Johnson to PA Patel,1 run,hes been eyeing the area for some time, flicks cleanly and high over square leg now, but there is a man in the deep"}, {"ball": 4.5, "isHighlight": false, "text": "Johnson to Rana,no run,stays back to a pitched up delivery on the stumps and turns it to mid on"}, {"ball": 4.6, "isHighlight": false, "text": "Johnson to Rana,no run,short ball at 142.3 kph, he tries to ride the bounce and slash it, but is beaten"}, {"ball": 4.6, "isHighlight": false, "text": "SJ: \"Kohli was not out folks...well didn't you see that ball kissing the grass. It wasnt a clean catch. Poor umpiring.\""}, {"ball": 4.6, "isHighlight": false, "text": "Donald: \"Why do they bother with a third umpire if he cannot get it right? Kohli was not out, if there's any doubt that the ball touched the ground the benefit goes to the batsman, and the ball DID touch the ground.\""}, {"ball": 5.1, "isHighlight": false, "text": "Sandeep Sharma to PA Patel,no run,tries to go over square leg again, but this is a slower length ball outside leg, and Parthiv is hit on the pad"}, {"ball": 5.2, "isHighlight": false, "text": "Sandeep Sharma to PA Patel, $$FOUR$$ ,cracked over the bowler, Sandeep pitched it up to the stumps, Parthiv cranked up and flayed it back"}, {"ball": 5.3, "isHighlight": false, "text": "Sandeep Sharma to PA Patel, $$OUT$$ ,he's gone this time, Parthiv makes some room, comes out and tries to loft the length ball over the off side, he ends up slicing it, and they have a sweeper in place to take the catch"}, {"ball": 5.3, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$c$$ $$Mandeep$$ $$Singh$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$13$$ $$(29m$$ $$14b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$92.85$$"}, {"ball": 5.3, "isHighlight": false, "text": "Sabarinath: \"@SJ ever heard of the camera playing tricks on your eyes? The glove was under the ball, the catch was clean, technology here just creates confusion here because of the lack of sufficient frames. That was out!\""}, {"ball": 5.4, "isHighlight": false, "text": "Sandeep Sharma to Rana,no run,coming in from back of a length, punched to mid on"}, {"ball": 5.5, "isHighlight": false, "text": "Sandeep Sharma to Rana,2 runs,just over Miller at midwicket now as Rana flicks in the air off the pad"}, {"ball": 5.6, "isHighlight": false, "text": "Sandeep Sharma to Rana, $$SIX$$ ,a slower ball, full and under the bat, Rana has a crack at it and sends it sailing into the sightscreen"}, {"ball": 5.6, "isHighlight": false, "text": "Jury: \"Kohli was not out, but when a umpire says you are out, you walk. Never saw Sachin, Dravid or Gilly lumber around and kick the grass when they were given wrongfully out. If you want to be the future Indian captain, you need to behave like one\""}, {"ball": 6.1, "isHighlight": false, "text": "Patel to de Villiers,1 run,a length ball bouncing around off, he goes back and swats it down to long on"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to Rana,1 run,this is pushed in the air and fortunately for him, in the gap at cover, seemed to stop on him"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to de Villiers,2 runs,cut wide of Mandeep at sweeper cover"}, {"ball": 6.3, "isHighlight": false, "text": "Two-Faced Riddl: \"Kohli was absolutely out- the gloves were under the ball. Of course, the ball will move slightly even after lodging in the gloves, which is the case here! Further, it has been shown countless times that the camera distorts the pictures on low catches giving the impression that it bounced.\""}, {"ball": 6.4, "isHighlight": false, "text": "Patel to de Villiers,1 run,goes back to a flat length ball and pulls it to the right of long on"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to Rana, $$OUT$$ ,Akshar strikes now, Rana goes back to a quick and flat length delivery, it comes in with the angle, and crashes into middle stump"}, {"ball": 6.5, "isHighlight": false, "text": "$$S$$ $$Rana$$ $$b$$ $$Patel$$ $$18$$ $$(19m$$ $$16b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to Yuvraj Singh,no run,comes forward and defends a flighted ball just outside off"}, {"ball": 6.6, "isHighlight": false, "text": "Rahul Oak: \"To those giving Kohli a hard time about this and that: chill out. He's still young and his personality is not going to change overnight. He'll mature with age and some of these things will take care of themselves. Moreover, the umpiring standards at the IPL have been atrocious and it's hard not to feel for him. \""}, {"ball": 6.6, "isHighlight": false, "text": "Shivam Sharma on IPL debut"}, {"ball": 7.1, "isHighlight": false, "text": "Shivam Sharma to de Villiers,1 run,flat offbreak is pulled to deep midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,no run,Yuvraj is beaten on the forward push as Shivam spins and bounces it outside off"}, {"ball": 7.3, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,no run,Yuvraj clueless again, he comes out and tries to work it to the leg side, it pops up square on off"}, {"ball": 7.4, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,no run,loud appeal for leg before as Yuvraj misses the sweep on this full delivery, was that missing leg?"}, {"ball": 7.5, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,no run,beaten yet again, he pushes forward to one angled in on off, it then jags sharply across, lot of turn there"}, {"ball": 7.6, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,no run,what an over on debut, Yuvraj in a tangle for the umpteenth time against spin, comes outside the crease again, tries to work it to leg, cannot put bat to ball"}, {"ball": 7.6, "isHighlight": false, "text": "Louis: \"It's painful to watch Yuvi bat these days...\""}, {"ball": 7.6, "isHighlight": false, "text": "STR: \"It is hard to see Yuvi like this.... Why doesn't he give himself a break...\""}, {"ball": 8.1, "isHighlight": false, "text": "Patel to de Villiers,1 run,plenty of bounce as it comes in from a good length with the angle, cut to backward point"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to Yuvraj Singh,1 run,off the mark finally as he inside edges a slog to deep square leg"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to de Villiers, $$FOUR$$ ,AB goes straight over the bowler and beats the dive from Miller running across from long on"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to de Villiers,1 run,drives a full delivery to wide long off"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to Yuvraj Singh,no run,a straight length ball outside off, Yuvraj tries to dab it fine, misses"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to Yuvraj Singh,1 run,lunges forward and nudges a quick ball off the pad to square leg"}, {"ball": 9.1, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh,1 run,lunges at the sweep and hits it through square leg, Mandeep has running to do in the deep again"}, {"ball": 9.2, "isHighlight": false, "text": "Shivam Sharma to de Villiers,1 run,jumps out, takes it on the full and swats it on the bounce to long off"}, {"ball": 9.3, "isHighlight": false, "text": "Shivam Sharma to Yuvraj Singh, $$OUT$$ ,Yuvraj's struggle is over for tonight, he skips out, tries to go over midwicket, the turn takes the outside edge, and slip is waiting, Sehwag takes a sharp catch in front of his face, maiden IPL wicket for Shivam Sharma"}, {"ball": 9.3, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Sehwag$$ $$b$$ $$Shivam$$ $$Sharma$$ $$3$$ $$(11m$$ $$11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$27.27$$"}, {"ball": 9.4, "isHighlight": false, "text": "Shivam Sharma to Morkel,no run,punches a length ball to extra cover"}, {"ball": 9.5, "isHighlight": false, "text": "Shivam Sharma to Morkel,2 runs, $$chance$$  goes, past Sehwag at slip, Albie tries to force this from the crease, thick edge brushes the keeper's leg and flies to Sehwag's right, just grazes his fingers"}, {"ball": 9.6, "isHighlight": false, "text": "Shivam Sharma to Morkel,no run"}, {"ball": 10.1, "isHighlight": false, "text": "Maxwell to de Villiers, $$SIX$$ ,short delivery sitting up outside off, AB clobbers it over the bowler"}, {"ball": 10.2, "isHighlight": false, "text": "Maxwell to de Villiers,1 run,goes hard again but mishits down to long off now"}, {"ball": 10.3, "isHighlight": false, "text": "Maxwell to Morkel,1 run,length ball pushed to sweeper cover"}, {"ball": 10.4, "isHighlight": false, "text": "Maxwell to de Villiers,1 wide,sees him appear to skip out and sprays it short and wide outside off"}, {"ball": 10.4, "isHighlight": false, "text": "Maxwell to de Villiers,2 wides,comes across and tries to sweep but misses as this goes down leg, it is a very late call from the umpire for a wide, it is the correct call though"}, {"ball": 10.4, "isHighlight": false, "text": "Maxwell to Morkel, $$SIX$$ ,Albie clears front leg and slogs, it is a mammoth mishit, Miller keeps eyes on it as he runs to his left in front of the sightscreen, dives too, but the ball is already over the boundary as it hits his hand and rolls away"}, {"ball": 10.5, "isHighlight": false, "text": "Maxwell to Morkel, $$SIX$$ ,no catching this one, it is short from Maxwell and Morkel flays it high over long on"}, {"ball": 10.6, "isHighlight": false, "text": "Maxwell to Morkel,1 run,punched down to long off for a single"}, {"ball": 11.1, "isHighlight": false, "text": "Shivam Sharma to Morkel, $$OUT$$ ,Morkel has had one hit too many, he goes back and tries to pull a length offbreak, Bailey takes the top edge at short third man"}, {"ball": 11.1, "isHighlight": false, "text": "$$JA$$ $$Morkel$$ $$c$$ $$Bailey$$ $$b$$ $$Shivam$$ $$Sharma$$ $$16$$ $$(7m$$ $$8b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 11.2, "isHighlight": false, "text": "Shivam Sharma to de Villiers, $$SIX$$ ,AB will keep going, he comes out and goes through with the lofted shot, hits it over long on's jump"}, {"ball": 11.3, "isHighlight": false, "text": "Shivam Sharma to de Villiers,no run"}, {"ball": 11.4, "isHighlight": false, "text": "Shivam Sharma to de Villiers,1 run,jumps out, takes it on the full and hits it to long on"}, {"ball": 11.5, "isHighlight": false, "text": "Shivam Sharma to Starc,1 run,pushed in the air down to long off"}, {"ball": 11.6, "isHighlight": false, "text": "Shivam Sharma to de Villiers,1 run,full just outside off, powered straight down the ground, long off runs around"}, {"ball": 12.1, "isHighlight": false, "text": "Patel to de Villiers,no run,tries to go outside leg and pull but this is slanted in quick into him, and he misses"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to de Villiers,no run,tries to reverse hit it to third man but is beaten once more, the ball wasn't far from off"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to de Villiers,1 run,full and quick, hit down to long on"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to Starc,1 run,shortish, punched down to long on"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to de Villiers,1 run,backs away to leg and pulls to deep midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Starc,no run,length ball goes straight outside off and he is beaten"}, {"ball": 13.1, "isHighlight": false, "text": "Shivam Sharma to de Villiers, $$SIX$$ ,AB skips out, takes it on the full and hits it into the sightscreen, lone man fighting"}, {"ball": 13.2, "isHighlight": false, "text": "Shivam Sharma to de Villiers,1 run,comes out again, but can only mishit along the ground to long on"}, {"ball": 13.3, "isHighlight": false, "text": "Shivam Sharma to Starc, $$FOUR$$ ,Starc rocks back, slashes this 91 kph ball and it hurries to the third man boundary"}, {"ball": 13.4, "isHighlight": false, "text": "Shivam Sharma to Starc,no run,tries to slog this one angled in to middle, is beaten by big turn"}, {"ball": 13.5, "isHighlight": false, "text": "Shivam Sharma to Starc,no run,goes back and punches to extra cover"}, {"ball": 13.6, "isHighlight": false, "text": "Shivam Sharma to Starc,1 run,Starc gets hold of the slog-sweep, but only hits it on the bounce to long on"}, {"ball": 13.6, "isHighlight": false, "text": "Four overs, 26 runs, wickets of Yuvraj and Albie Morkel, not a bad debut for Shivam Sharma"}, {"ball": 14.1, "isHighlight": false, "text": "Johnson to Starc,1 run,Johnson gives the other Mitch a yorker, Starc digs it out and takes the single, Johnson kicks the ball but it misses the stumps"}, {"ball": 14.1, "isHighlight": false, "text": "kv: \"Don't understand why yuvraj is considered a serious option anymore. The sad reality is that since 2011, he's been a sentimental pick.\""}, {"ball": 14.2, "isHighlight": false, "text": "Johnson to de Villiers,2 runs,a yorker from round the stumps to AB, he makes room and forces it in front of square"}, {"ball": 14.3, "isHighlight": false, "text": "Johnson to de Villiers,1 run,a full toss, AB has a crack at it, only finds square leg"}, {"ball": 14.3, "isHighlight": false, "text": "Jess: \"Best batsmen in their side by a distance, probably the world - and they have him coming in at number 5? There's RCB's problem right there. Madness.\""}, {"ball": 14.4, "isHighlight": false, "text": "Johnson to Starc, $$FOUR$$ ,Starc hammers this full delivery back at AB, who gets out of the way, and the ball flies into the straight boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Johnson to Starc,no run,full again, squeezed out to sweeper cover"}, {"ball": 14.6, "isHighlight": false, "text": "Johnson to Starc,1 run,another full ball on the stumps, Starc drills it down to long on"}, {"ball": 14.6, "isHighlight": false, "text": "Aseem: \"Does anyone else think that AB is setting himself up for something superhuman?\""}, {"ball": 14.6, "isHighlight": false, "text": "jay: \"@kv: This is what will happen if decisions are made with heart instead of head.\""}, {"ball": 15.1, "isHighlight": false, "text": "Balaji to Starc,1 leg bye,Balaji starts with a slower bouncer that hits Starc on the left arm as he plays the pull too early"}, {"ball": 15.2, "isHighlight": false, "text": "Balaji to de Villiers,2 runs,wide length ball, AB hits it hard but not wide enough of the sweeper"}, {"ball": 15.3, "isHighlight": false, "text": "Balaji to de Villiers,(no ball)  $$SIX$$ ,this has slipped out from Balaji's hands and turned into a very high full toss at AB, way above waist height, he bends the back knee and swats it over the fine leg boundary, what reflexes, what a player"}, {"ball": 15.3, "isHighlight": false, "text": "Balaji to de Villiers, $$SIX$$ ,and another one, Balaji drops it short and harmless, AB powers it over deep midwicket, reaches 50, off 25"}, {"ball": 15.4, "isHighlight": false, "text": "Balaji to de Villiers, $$OUT$$ ,no miracle from AB tonight, Balaji goes full and wide, AB reaches out and slices it high and safely into the hands of sweeper cover"}, {"ball": 15.4, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$c$$ $$Patel$$ $$b$$ $$Balaji$$ $$53$$ $$(43m$$ $$26b$$ $$1x4$$ $$5x6)$$ $$SR:$$ $$203.84$$"}, {"ball": 15.4, "isHighlight": false, "text": "Time out"}, {"ball": 15.4, "isHighlight": false, "text": "Pradeep: \"Unless Kohli decides to ask Yuvraj to sit out, RCB is going nowhere. Remember he was the one who was so adamant in buying Yuvraj. \""}, {"ball": 15.5, "isHighlight": false, "text": "Balaji to Starc,1 run,in the blockhole just outside off, guided to short third man"}, {"ball": 15.6, "isHighlight": false, "text": "Balaji to HV Patel,2 runs, $$dropped$$ , a slower short ball is lifted weakly over point, Sehwag runs back, gets to it, and puts it down"}, {"ball": 16.1, "isHighlight": false, "text": "Johnson to Starc,1 run,length ball into the pad, worked to fine leg"}, {"ball": 16.2, "isHighlight": false, "text": "Johnson to HV Patel, $$FOUR$$ ,he makes room, Johnson goes full for the stumps, but Harshal clears front leg and lifts it well over mid off"}, {"ball": 16.3, "isHighlight": false, "text": "Johnson to HV Patel, $$OUT$$ ,Johnson responds with a 144.5 kph short ball, Harshal tries to make room but it cramps him on leg stump, he opens the face and glides it straight to the keeper"}, {"ball": 16.3, "isHighlight": false, "text": "$$HV$$ $$Patel$$ $$c$$ $$†Saha$$ $$b$$ $$Johnson$$ $$6$$ $$(6m$$ $$3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Johnson to Aaron,no run,has a go at the cut and is beaten"}, {"ball": 16.5, "isHighlight": false, "text": "Johnson to Aaron,1 run,arches back and chops it behind point, Aaron takes it easy on the single, Maxwell throws it at the non-striker's end, had he hit, Aaron was gone, but the throw is wild, and nearly hits the umpire"}, {"ball": 16.6, "isHighlight": false, "text": "Johnson to Starc,1 run,hit along the ground and down to long off"}, {"ball": 17.1, "isHighlight": false, "text": "Sandeep Sharma to Starc, $$FOUR$$ ,full and outside off, Starc bends the back leg and slices it over backward point"}, {"ball": 17.2, "isHighlight": false, "text": "Sandeep Sharma to Starc,2 runs,short ball, Starc flays it straight down the ground, long off gets to it"}, {"ball": 17.2, "isHighlight": false, "text": "Anand: \"Take a bow AB!!! You are trying too hard for a team that goes in a shell with every loss. But you are a role model for RCB!\""}, {"ball": 17.3, "isHighlight": false, "text": "Sandeep Sharma to Starc,no run,in the blockhole close to off and Starc misses"}, {"ball": 17.4, "isHighlight": false, "text": "Sandeep Sharma to Starc,1 run,slogs a slower one to Balaji at square leg"}, {"ball": 17.5, "isHighlight": false, "text": "Sandeep Sharma to Aaron,no run,a bouncer at 128 kph, Aaron has a swing at the hook and misses"}, {"ball": 17.6, "isHighlight": false, "text": "Sandeep Sharma to Aaron,1 run,mishits a slog off a length ball to long on"}, {"ball": 17.6, "isHighlight": false, "text": "Raj Mutreja: \"Dont understand the fuss over yuvi's batting .... its RCB who is failing at the top .. Gayle, Kohli, Patel have all been a disaster this season . Kohli averages less than yuvraj ...\""}, {"ball": 18.1, "isHighlight": false, "text": "Patel to Aaron,2 runs,skips out, Patel bowls it wide at 99 kph, he slices it past point in the end"}, {"ball": 18.2, "isHighlight": false, "text": "Patel to Aaron,no run,slows it down, finds some turn, and beats him close to off"}, {"ball": 18.3, "isHighlight": false, "text": "Patel to Aaron,1 run,forces it over cover out to the sweeper"}, {"ball": 18.4, "isHighlight": false, "text": "Patel to Starc,1 run,really slows it down by his standards at 85 kph, Starc waits and punches it to sweeper cover"}, {"ball": 18.5, "isHighlight": false, "text": "Patel to Aaron,1 run,Aaron heaves at a wide one, toe-ends it to backward point"}, {"ball": 18.6, "isHighlight": false, "text": "Patel to Starc,1 run,tries to get under it for a slog, but it is too full and he drills it to long off instead"}, {"ball": 19.1, "isHighlight": false, "text": "Balaji to Starc, $$FOUR$$ ,Balaji falls as he bowls it way down the leg side, Starc helps it fine, Mandeep is in the deep, he he's fielded well today, but this time he lets it slip through his hands"}, {"ball": 19.2, "isHighlight": false, "text": "Balaji to Starc, $$OUT$$ ,Starc clears front leg and slices a slog high in the air, Miller wants the catch, he runs in a long way from long on, dives forward and holds on"}, {"ball": 19.2, "isHighlight": false, "text": "$$MA$$ $$Starc$$ $$c$$ $$Miller$$ $$b$$ $$Balaji$$ $$29$$ $$(36m$$ $$23b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$126.08$$"}, {"ball": 19.3, "isHighlight": false, "text": "Balaji to Aaron,1 run,reaches out, opens the face to a wide length ball and guides it wide of third man"}, {"ball": 19.4, "isHighlight": false, "text": "Balaji to Chahal,1 wide,length ball slanted down the leg side"}, {"ball": 19.4, "isHighlight": false, "text": "Dhaval: \"At this rate it is only fair that Starc opens the batting with Gayle at the top.\""}, {"ball": 19.4, "isHighlight": false, "text": "Balaji to Chahal,1 run,pushes a length ball softly in front of cover for a single"}, {"ball": 19.5, "isHighlight": false, "text": "Balaji to Aaron, $$FOUR$$ ,charges out to a short and wide ball and flat-bats it over the bowler"}, {"ball": 19.6, "isHighlight": false, "text": "Balaji to Aaron, $$SIX$$ ,they will go down with a six, Aaron comes out and lofts this pitched up delivery over the wide long off boundary"}, {"ball": 19.6, "isHighlight": false, "text": "That is all for tonight. Good bye"}, {"ball": 19.6, "isHighlight": false, "text": "$$Sandeep$$ $$Sharma$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ . Sandeep: \"Having a good tournament, enjoying my bowling, Chris Gayle and Virat Kohli wickets are very important for me. We were talking in our meeting, he (Gayle) does not hit the ball going away, that was our plan. Thankful to George Bailey for showing faith in me and giving me the new ball.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Bailey$$ : \"The usual suspects with the bat, outstanding start, our best Powerplay, from Viru and Mandeep, late hitting from the tailenders got us to a really nice total. Sandeep has been outstanding, Shivam in his first game, bit of pressure, comes out and bowls outstandingly. For a guy who is as young as he is, he (Sandeep) comes to me and he knows what fields he wants. Hats off to our coach Sanjay Bangar. I was a bit tentative about playing as much spin here, it is a small ground. Sanjay thought the wicket was a bit slower and it paid off beautifully. Hopefully we are playing our best cricket at the back end of the tournament.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Kohli$$ : \"We did not play as a unit, that is something that has happened in the past few games. We paid the price. We could have bowled better. One or two unfortunate decisions blocked our way (with the bat). If you lose early wickets it gets difficult. We have chased close to 200 quite a few times at this ground but it does not happen every time. There is no room for complacency, might just be a blessing in disguise for us, we need to pull our socks up. We need to take more responsibility as a batting unit, things have not gone our way past few games, we need that bit of luck.\""}, {"ball": 19.6, "isHighlight": false, "text": "Yet another win for Kings XI, as they outclass RCB on their home ground. It was not a typical Bangalore pitch. There was quite some turn, but RCB did not have anyone to support Chahal"}, {"ball": 19.6, "isHighlight": false, "text": "Faisal: \"Kohli still thinks he didn't nick that... Someone show him the replays.\""}, {"ball": 19.6, "isHighlight": false, "text": "Yaswanth: \"As an Indian very happy with Virat's form!! Every player will have a bad period and I am more than happy if that happens to be IPL for Kohli and he gets back to form on England tour!\""}], "name": "Royal Challengers Bangalore v Kings XI Punjab", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733991.html?innings=2;view=commentary", "match_num": 31}