{"commentary": [{"ball": 0, "isHighlight": false, "text": "Game time. Sunrisers have finished huddling. Kevin Pietersen and Quinton de Kock are opening the batting for Daredevils. Pietersen's opening for the first time this season."}, {"ball": 0, "isHighlight": false, "text": "Dale Steyn with the new ball for Sunrisers."}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$3.30$$ $$pm$$  \"It builds character,\" says Kevin Pietersen when asked how tough it is to lead when the team is not doing well. He's lost the toss today - that's eight out of nine tosses lost - and  $$Sunrisers$$ $$Hyderabad$$ $$are$$ $$bowling$$ $$first$$ . KP said Daredevils wanted to bowl as well."}, {"ball": 0, "isHighlight": false, "text": "Sunrisers are unchanged, but Daredevils have made three changes. They have dropped seamer Wayne Parnell, opener M Vijay and left-arm spinner Shahbaz Nadeem, and replaced them with legspinner Imran Tahir, batsman Mayank Agarwal and seamer Rahul Shukla."}, {"ball": 0, "isHighlight": false, "text": "riad iftekhar: \"Imran Tahir should play today.as I personally feel Ross Taylor should get another chance and thus JPD can come earlier.\""}, {"ball": 0, "isHighlight": false, "text": "sathish: \"Lot of SH supporters. Well, How about I like to see some storming from KP, Karthick and de Kock. \""}, {"ball": 0, "isHighlight": false, "text": "MrGarreth: \"I don't even think DDs individuals have played that badly. Just think Pietersen has been flat as a captain. Doesn't know how to strategically get wickets.\""}, {"ball": 0, "isHighlight": false, "text": "Rahul Garg: \"I don't get it why can't DD play 5 bowlers and by dropping Parnell who has looked their best bowler and bringing in Tahir they have not solved the problem but just kept it same. Dekock or KP should have been dropped for Tahir. Though good to see Rahul play.\""}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  The last 24 hours have been tumultuous for Sunrisers allrounder Darren Sammy. He was  $$replaced$$ $$as$$ $$West$$ $$Indies$$ $$Test$$ $$captain$$ by Denesh Ramdin, after which  $$Sammy$$ $$promptly$$ $$retired$$ $$from$$ $$Test$$ $$cricket$$ , though he remains available for ODIs and is still West Indies' T20 captain. He has not had a good IPL season either and dropped by Sunrisers for their previous game. Sammy scored only 62 runs and bowled only 11 overs in five innings, taking three wickets and conceding 10.90 runs per over."}, {"ball": 0, "isHighlight": false, "text": "Harshil: \"I really want to see Ashish Reddy in playing XI today. He could be the batsmen SRH need in the final overs, and a valid bowling option too. As there's no need to play with Rahul and N Ojha, one of them is enough.\""}, {"ball": 0, "isHighlight": false, "text": "Samuel: \"Hope to see a good game!!! Dhawan needs to be more responsible and not throw his wicket like he did in the previous matches.\""}, {"ball": 0, "isHighlight": false, "text": "Harish Varansi: \"Looking forward to see how the JPD and De Kock deal with Dale Steyn. Hope there will not be a repeat of the rampage dealt gift wrapped by ABD.\""}, {"ball": 0, "isHighlight": false, "text": "Ashok: \"SRH should select Sammy. He would be roaring to put up a performance and prove himself!!!!\""}, {"ball": 0, "isHighlight": false, "text": "Sairama Krishna: \"It would be better to bring Brendon Taylor & Parvez Rasool dropping Henriques and Naman Ojha so that their batting becomes strong and keeping as well !! Parvez Rasool adds to their strength, bowling.....\""}, {"ball": 0, "isHighlight": false, "text": "$$3.10$$ $$pm$$  Good afternoon and welcome to ESPNcricinfo's ball-by-ball coverage of the double-header this Saturday. The first game is between Delhi Daredevils, who are foundering at the bottom of  $$the$$ $$points$$ $$table$$ , and Sunrisers Hyderabad, in fifth position and with a chance to break into the top four if they win today. Here's the  $$preview$$  for the game."}, {"ball": 0, "isHighlight": false, "text": "The script has gone horribly wrong for the Daredevils since the IPL returned to India. They left the UAE with two wins in five games, with an opportunity to climb the rungs because they had a stretch of matches at home. However, they have lost three out of three at the Kotla. Daredevils might not recover from a fourth straight defeat."}, {"ball": 0, "isHighlight": false, "text": "A lot of the focus on Daredevils' problems has centred around the poor form of their captain Kevin Pietersen, who quite frankly has looked listless so far. A turnaround from him will almost certainly mean a turnaround for the team. Daredevils, however, have another pressing problem - their bowling attack has been the least incisive of the tournament.  $$S$$ $$Rajesh$$ $$has$$ $$crunched$$ $$numbers$$ $$for$$ $$you$$ ."}, {"ball": 0, "isHighlight": false, "text": "Sunrisers, though better placed than Daredevils, have a problem of inconsistency. They win, then lose, win again, lose again … That inconsistency, however, is perhaps consistent with a team that has such an imbalance in its batting. Where will David Warner bat today? Up top, where he can be like fire and brimstone, or lower down, shoring up a flaky middle order? I'm George Binoy, your commentator for this game."}, {"ball": 0, "isHighlight": false, "text": "rajasahadevan: \"I think SRH should believe in their top 3!! There is no point holding back Warner. I would also like to see Rasool and Aniruda in the xi!!\""}, {"ball": 0.1, "isHighlight": false, "text": "Steyn to de Kock,no run,hits a good length around off stump with his first delivery from over the wicket, the ball angles across the left-hander and de Kock lets it go"}, {"ball": 0.2, "isHighlight": false, "text": "Steyn to de Kock,2 runs,straighter line, on middle stump, de Kock stays in his crease and turns the ball off his pads through square leg"}, {"ball": 0.3, "isHighlight": false, "text": "Steyn to de Kock,1 run,the line is straight once again, de Kock works the ball off his pads through square for more runs"}, {"ball": 0.3, "isHighlight": false, "text": "Sai Kiran: \"Sunrisers would have batted first instead. Now even if they get down Delhi to 140-150 it would be tough for them to chase it given their present batting form and Imran Tahir could be another burden for them too...\""}, {"ball": 0.3, "isHighlight": false, "text": "Aamir: \"Good to see KP opening the innings, this is what Delhi was lacking\""}, {"ball": 0.4, "isHighlight": false, "text": "Steyn to Pietersen,no run,pitches on a good length around off and bends away from KP, who moves forward and shoulders arms"}, {"ball": 0.5, "isHighlight": false, "text": "Steyn to Pietersen,1 run,too straight again from Steyn, he's trying to swing it from middle and leg away from the right-hander, KP moves across and glances the ball to fine leg"}, {"ball": 0.6, "isHighlight": false, "text": "Steyn to de Kock,no run,de Kock stays back to a fuller ball and defends awkwardly, dropping the ball by his feet"}, {"ball": 0.6, "isHighlight": false, "text": "Bhuvneshwar Kumar from over the wicket ..."}, {"ball": 1.1, "isHighlight": false, "text": "Kumar to Pietersen,1 run,KP gets on the front foot too early and then dabs towards mid-off and sprints, Henriques is the fielder and he misses at the bowler's end, that would have been close. KP was run out in the previous game too"}, {"ball": 1.2, "isHighlight": false, "text": "Kumar to de Kock,3 runs,de Kock uses the straighter line to drive the ball off his pads between mid-on and midwicket, Dhawan chases after it and pulls it in just in time"}, {"ball": 1.3, "isHighlight": false, "text": "Kumar to Pietersen,1 leg bye,KP moves across his crease to flick a full ball but misses and is hit on the pad, they run a leg bye towards midwicket, the fielder fails to pick up cleanly"}, {"ball": 1.4, "isHighlight": false, "text": "Kumar to de Kock,no run,de Kock gets an inside edge into the ground and on to his pad while defending a good length delivery angling across him from over the wicket"}, {"ball": 1.5, "isHighlight": false, "text": "Kumar to de Kock,no run,good length outside off, de Kock moves forward and plays into the covers"}, {"ball": 1.6, "isHighlight": false, "text": "Kumar to de Kock,1 run,he was a goner had Dhawan hit at the bowler's end from mid-on! De Kock pushed firmly to mid-on and set off for a crazy run ... would have been out by yards"}, {"ball": 1.6, "isHighlight": false, "text": "Venkatesh Wadaw: \"I feel KP opening is a good move, so that it will allow JP to come one down or two down based on scenario\""}, {"ball": 2.1, "isHighlight": false, "text": "Steyn to de Kock,no run,driven off the back foot to cover, Steyn is keeping it on a good length around off"}, {"ball": 2.2, "isHighlight": false, "text": "Steyn to de Kock,no run,de Kock hoicks across the line at a good length ball that pitches just outside off and bends into the left-hander, that was extremely close to off stump, the ball went between bat and body"}, {"ball": 2.3, "isHighlight": false, "text": "Steyn to de Kock,no run,defended back to the bowler"}, {"ball": 2.3, "isHighlight": false, "text": "Muqeet Ahmed: \"SRH already missing Sammy? he would have hit direct 9/10 from mid-off/mid-on.\""}, {"ball": 2.4, "isHighlight": false, "text": "Steyn to de Kock, $$OUT$$ ,caught at cover! De Kock has looked nervy today and he's been dismissed in such a tame way. He got on the front foot to a length ball and drove away from his body, hitting it on the up straight to Rahul at cover"}, {"ball": 2.4, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$c$$ $$Rahul$$ $$b$$ $$Steyn$$ $$7$$ $$(11m$$ $$12b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$58.33$$"}, {"ball": 2.4, "isHighlight": false, "text": "Aseem: \"An overseas specialist spinner, who isn't Shane Warne, included in the playing 11. Now I have seen everything.\""}, {"ball": 2.4, "isHighlight": false, "text": "Tahir's not batting yet though, it's Mayank Agarwal, who is playing in M Vijay's place."}, {"ball": 2.5, "isHighlight": false, "text": "Steyn to Agarwal,no run,a huge appeal for caught behind after Steyn fires the short ball at the batsman's body but strays down leg side, Mayank tried to pull but missed"}, {"ball": 2.6, "isHighlight": false, "text": "Steyn to Agarwal, $$FOUR$$ ,short and wide outside off, a loose ball from Steyn, Mayank gets going with a cracking cut, the ball raced through backward point for four"}, {"ball": 3.1, "isHighlight": false, "text": "Kumar to Pietersen, $$FOUR$$ ,shot! KP plays a well-placed square drive, splitting the gap between point and cover. He stayed in his crease and timed it well"}, {"ball": 3.2, "isHighlight": false, "text": "Kumar to Pietersen, $$FOUR$$ ,this boundary is not as good. KP tried to drive a good length ball that moved away from him around off stump and the outside edge flew through the vacant slip cordon"}, {"ball": 3.3, "isHighlight": false, "text": "Kumar to Pietersen,no run,defended on the off side"}, {"ball": 3.4, "isHighlight": false, "text": "Kumar to Pietersen,no run,KP moves across his crease and plays the ball from around off stump to mid on"}, {"ball": 3.5, "isHighlight": false, "text": "Kumar to Pietersen,1 run,KP tries to smash the ball too hard on the off side but gets a bottom edge into the ground near his feet, he sees Mayank running and responds quickly"}, {"ball": 3.6, "isHighlight": false, "text": "Kumar to Agarwal,no run,Naman Ojha appeals for a caught behind, Bhuvneshwar not so much. Mayank had a poke outside off at one that seamed away from him from a good length and was beaten"}, {"ball": 3.6, "isHighlight": false, "text": "Venkatesh Wadaw: \"Really happy to see five indian bowlers amongst top 6 wicket takers so far in the tournament.\""}, {"ball": 3.6, "isHighlight": false, "text": "The legspinner Karn Sharma from over the wicket ..."}, {"ball": 4.1, "isHighlight": false, "text": "Sharma to Pietersen,1 run,pushed off the front foot on the leg side for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Sharma to Agarwal,1 run,Mayank moves forward and nudges the ball off the pads towards square leg"}, {"ball": 4.3, "isHighlight": false, "text": "Sharma to Pietersen, $$SIX$$ ,there she goes! KP gets on to the front foot to reach a full ball on the bounce and lofts it cleanly over long off, superb execution of an uncomplicated shot"}, {"ball": 4.4, "isHighlight": false, "text": "Sharma to Pietersen,no run,defended from the crease"}, {"ball": 4.5, "isHighlight": false, "text": "Sharma to Pietersen, $$FOUR$$ ,he's cut that from middle and off stump off the back foot! KP goes depp in his crease and makes contact just in time to send the ball racing to the backward point boundary"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Pietersen,1 wide,fired down leg side, KP tries to sweep but can't connect"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma to Pietersen,1 run,dabbed close on the off side for a quick single"}, {"ball": 4.6, "isHighlight": false, "text": "Sharma: \"Adding to Venkatesh's comment, the Indian bowlers have shone in the IPL, whereas the Indian batsmen is an entirely other story...\""}, {"ball": 4.6, "isHighlight": false, "text": "Moises Henriques from over the wicket ..."}, {"ball": 5.1, "isHighlight": false, "text": "Henriques to Pietersen, $$SIX$$ ,that's a friendly half-volley first up, KP meets it on the front foot, outside his crease and clobbers it far over long on with a fearsome swing of the bat"}, {"ball": 5.2, "isHighlight": false, "text": "Henriques to Pietersen, $$FOUR$$ ,too full again from the bowler and KP blitzes it down the ground with a fierce straight drive, he hit that along the ground and he hit it so hard"}, {"ball": 5.3, "isHighlight": false, "text": "Henriques to Pietersen,1 run,Henriques shortens his length to a tighter one and KP dabs it close on the leg side for a single"}, {"ball": 5.4, "isHighlight": false, "text": "Henriques to Agarwal,no run,good length and straight, Mayank stays in his crease and defends"}, {"ball": 5.4, "isHighlight": false, "text": "JimMuffet: \"@Venkatesh: That is quite ironical considering the fact that Indians are known for their batting strength and very few of them have batted well.\""}, {"ball": 5.5, "isHighlight": false, "text": "Henriques to Agarwal, $$FOUR$$ ,a length ball and Mayank dispatches it, moving forward and lofting the ball on the up with an open face, slicing it over cover for another boundary"}, {"ball": 5.6, "isHighlight": false, "text": "Henriques to Agarwal,no run,a slower ball on a wicket to wicket line, Mayank defends on the leg side"}, {"ball": 5.6, "isHighlight": false, "text": "Dhawal: \"Brace yourself, KP is Back.! A bit too late for the tournament but good to see him finally firing.\""}, {"ball": 5.6, "isHighlight": false, "text": "Kunal: \"Dhawan should bring left arm spin (Finch) into the attack ASAP.. Pietersen's kryptonite !!\""}, {"ball": 5.6, "isHighlight": false, "text": "The fielding restrictions are no longer in place. Can Delhi consolidate their excellent start? Amit Mishra, of ridiculous run-out fame, is going to bowl from over the wicket."}, {"ball": 6.1, "isHighlight": false, "text": "Mishra to Pietersen,1 run,begins with a quick one that slides into the right-hander, Pietersen goes back and manages to squeeze the ball out on the leg side, towards midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Mishra to Agarwal,1 run,tossed up slower to Mayank, outside off, he pushes it into the covers for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Mishra to Pietersen, $$OUT$$ ,KP's gone! Too hasty too early against the leggie! That's Mishra's 100th IPL wicket too. KP gave Mishra the charge  and tried to loft over the off side, he wasn't to the pitch of the legbreak and mis-timed it straight to Dhawan, who caught it at head height at cover"}, {"ball": 6.3, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$c$$ $$Dhawan$$ $$b$$ $$Mishra$$ $$35$$ $$(31m$$ $$19b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$184.21$$"}, {"ball": 6.4, "isHighlight": false, "text": "Mishra to Karthik,1 run,pushed into the off side on the front foot"}, {"ball": 6.5, "isHighlight": false, "text": "Mishra to Agarwal, $$FOUR$$ ,that's deft from Mayank, he stayed in his crease, waited for the ball to pitch and turn, and cut it so late to beat the fielder at short third man on his left side"}, {"ball": 6.6, "isHighlight": false, "text": "Mishra to Agarwal,1 run,Mishra responds with the googly that Mayank stays back to and nudges off the pads towards square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Raghav: \"Ridiculous run out fame bowler gets the ridiculous run out fame batsman\""}, {"ball": 7.1, "isHighlight": false, "text": "Henriques to Agarwal,1 run,played to mid off for a single, the fielder was on the edge of the circle"}, {"ball": 7.2, "isHighlight": false, "text": "Henriques to Karthik,1 run,a risky run, Mayank had to dive to make his ground and had there been a direct hit he would not have made it. Karthik played it close towards point and ran"}, {"ball": 7.3, "isHighlight": false, "text": "Henriques to Agarwal,1 run,driven down to long on for a single"}, {"ball": 7.4, "isHighlight": false, "text": "Henriques to Karthik,1 run,tries to pull but ends up flat-batting it past the bowler, did not time it well"}, {"ball": 7.4, "isHighlight": false, "text": "Venkatesh Wadaw: \"@JimMuffet : Bowling has been always head ache for India during international matches.I don't mind if our batsmen lose form in IPL, hopefully they'll get into the form by the end of the tournament.But happy to see our bowlers bowling nicely\""}, {"ball": 7.5, "isHighlight": false, "text": "Henriques to Agarwal,2 runs,short of a length with width outside off, punched on the up through cover"}, {"ball": 7.6, "isHighlight": false, "text": "Henriques to Agarwal,1 run,Mayank steps out of his crease to a length ball angled at his body and swings it over midwicket, falls well short of the fielder at deep midwicket"}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to Agarwal, $$FOUR$$ ,Mayank leans forward to try and drive a flighted legbreak through cover, he is beaten in the flight and gets a thick outside edge past the catcher at first slip and to the third man boundary"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to Agarwal,no run,played off the back foot to cover"}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to Agarwal,1 run,tossed up outside off, a fuller ball, driven firmly to deep cover"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to Karthik,1 run,that's the googly, Karthik stayed in his crease and defended, the ball goes towards square leg off the inside edge"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Agarwal, $$OUT$$ ,he's holed out to deep midwicket! Mayank plonked his foot forward, got down on one knee, and tried to slog the legbreak for six. He only got as far as David Warner on the boundary"}, {"ball": 8.5, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Warner$$ $$b$$ $$Mishra$$ $$25$$ $$(29m$$ $$18b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$138.88$$"}, {"ball": 8.5, "isHighlight": false, "text": "Laxmi Shukla gets a promotion ahead of Jadhav and Duminy. Just bizarre."}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to LR Shukla,no run,a huge appeal for lbw after Shukla fails to read the googly and brings his bat own with a rush, he was caught in his crease. Mishra thinks it was pad first, the umpire does not. After seeing replays, it was pad first, and plumb lbw."}, {"ball": 9.1, "isHighlight": false, "text": "Sharma to Karthik,no run,driven back to the bowler"}, {"ball": 9.2, "isHighlight": false, "text": "Sharma to Karthik,1 run,dabbed close on the off side for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Sharma to LR Shukla,no run,steps out of the crease but is not to the pitch of the ball. Shukla defends awkwardly"}, {"ball": 9.4, "isHighlight": false, "text": "Sharma to LR Shukla,1 run,slog swept to Steyn on the deep square leg boundary"}, {"ball": 9.5, "isHighlight": false, "text": "Sharma to Karthik,no run,stays back to a leg break and dabs it close on the off side, Karthik begins to run but is sent back"}, {"ball": 9.6, "isHighlight": false, "text": "Sharma to Karthik,no run,cut off the back foot but straight to the man at point"}, {"ball": 9.6, "isHighlight": false, "text": "Arsh : \"as long as delhi keep jp duminy so low down the oreder,they are never going to win! seriously is the management considering Shukla better than him?\""}, {"ball": 9.6, "isHighlight": false, "text": "Raghav: \"Again! Come on! You have to send in Duminy when the spinners are on. And it's not even Jadhav. It is Shukla. \""}, {"ball": 9.6, "isHighlight": false, "text": "Abhishek: \"Shukla before Duminy!!! What sorcery is this???\""}, {"ball": 10.1, "isHighlight": false, "text": "Mishra to LR Shukla,1 run,played off the pads through square for a single"}, {"ball": 10.2, "isHighlight": false, "text": "Mishra to Karthik,no run,Karthik steps out of his crease but is not to the pitch of the ball, he drives straight and Mishra dives to his left to save runs"}, {"ball": 10.3, "isHighlight": false, "text": "Mishra to Karthik,1 run,played towards midwicket for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Mishra to LR Shukla,no run,Shukla slogs across the line and is completely beaten by the legbreak, Ojha takes off the bails and appeals for a stumping. Shukla's back foot is grounded"}, {"ball": 10.5, "isHighlight": false, "text": "Mishra to LR Shukla, $$SIX$$ ,Shukla finally makes great contact! He jumps out of his crease, gets to the pitch of the ball and lofts the googly with the turn over the wide long-on boundary"}, {"ball": 10.6, "isHighlight": false, "text": "Mishra to LR Shukla,1 run,swept through square leg for a single"}, {"ball": 10.6, "isHighlight": false, "text": "Irfan Pathan to bowl from over the wicket."}, {"ball": 11.1, "isHighlight": false, "text": "Pathan to LR Shukla,1 run,a full ball outside off, driven through cover for a single"}, {"ball": 11.2, "isHighlight": false, "text": "Pathan to Karthik,2 runs,a length ball outside off, Karthik stays back and cuts to deep point, Warner fires in an awesome throw after sprinting to his left"}, {"ball": 11.3, "isHighlight": false, "text": "Pathan to Karthik,1 run,can't really tell if that was a slower ball from Irfan, Karthik moved back and across to work the ball off the pads towards square leg"}, {"ball": 11.4, "isHighlight": false, "text": "Pathan to LR Shukla,1 run,low full toss, Shukla clips it through midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "Pathan to Karthik,1 run,Mishra mis-judges the catch at fine leg! Karthik swivelled and pulled the short of a length ball in the air, Mishra did not come in enough and in the end the ball fell short of him as he dived forward."}, {"ball": 11.6, "isHighlight": false, "text": "Pathan to LR Shukla,1 run,pulled to deep square leg for a single"}, {"ball": 11.6, "isHighlight": false, "text": "It has got overcast in Delhi very quickly."}, {"ball": 11.6, "isHighlight": false, "text": "Siddharth: \"Delhi (with Duminy), Mumbai (with Pollard) and Bangalore (with AB de Villiers) need to learn a lesson from Punjab. Punjab send in Maxwell, their batsman usually at no. 3 and no later than no. 4. Give your best batsman the maximum chance to inflict damage. Don't just pigeonhole them as \"finishers\" and waste them down the order!\""}, {"ball": 11.6, "isHighlight": false, "text": "Steyn's back ..."}, {"ball": 12.1, "isHighlight": false, "text": "Steyn to LR Shukla,1 leg bye,Shukla backs away outside leg and tries to slog over midwicket, Steyn follows him and cramps him for room, the ball goes on the off side off the pad"}, {"ball": 12.2, "isHighlight": false, "text": "Steyn to Karthik, $$SIX$$ ,shot! Karthik moves towards the off side, turns around in his crease, scooping the ball as he does so to clear the fine leg boundary. A page out of AB's book."}, {"ball": 12.3, "isHighlight": false, "text": "Steyn to Karthik,1 run,played behind point with an open face"}, {"ball": 12.4, "isHighlight": false, "text": "Steyn to LR Shukla,no run,Shukla backs away outside leg and plays a wild pull, Steyn bounced him and beat him easily. Karthik wanted to run a bye to the keeper but Shukla sent him back"}, {"ball": 12.5, "isHighlight": false, "text": "Steyn to LR Shukla,2 leg byes,Steyn follows Shukla as he moves outside leg stump and hits the pad to concede a leg bye towards fine leg"}, {"ball": 12.5, "isHighlight": false, "text": "Jazzy: \"Agree with @Siddharth completely. More importantly it puts the opposition captain in a dilemma to bring their best bowlers in middle overs or save them for the last onslaught. Here is where Maxi and Miller target the lesser known bowlers.\""}, {"ball": 12.6, "isHighlight": false, "text": "Steyn to LR Shukla,1 run,a full ball on middle, Shukla stays in his crease and plays the ball through midwicket"}, {"ball": 13.1, "isHighlight": false, "text": "Sharma to LR Shukla,1 run,Shukla goes back and works the googly from Karn Sharma towards long on"}, {"ball": 13.1, "isHighlight": false, "text": "$$6.05$$ $$pm$$  Players are warming up. Not too long now. Start around 6.15 pm possibly. No overs reduced. It's going to be a long night!"}, {"ball": 13.1, "isHighlight": false, "text": "$$5.50$$ $$pm$$  It's stopped raining at the Kotla. The umpires are expected to inspect the conditions shortly. Covers are off. You'll have news of the start time as soon as I do."}, {"ball": 13.1, "isHighlight": false, "text": "$$5.25$$ $$pm$$  Sam, it is now raining at the Kotla. Those barking dogs did bite. It began to rain about 20 minutes after the players were taken off. They could have got four-five overs in."}, {"ball": 13.1, "isHighlight": false, "text": "\"Money follows money.\" \"If It Don't Make Money Then It Don't Make Sense!\" \"Money Is Power!\" \"I Have A Stalker! Lol\" That's  $$Kemar$$ $$Roach$$ $$in$$ $$our$$ $$Twitter$$ $$round-up$$ ."}, {"ball": 13.1, "isHighlight": false, "text": "$$5.20pm$$  Here's a great way to spend the rain break. Try cracking  $$CricIQ$$ , our extremely engaging quiz. Crack it like no one else and you stand to win tickets to Lord's to watch India play England."}, {"ball": 13.1, "isHighlight": false, "text": "Sam: \"I hope the old adage of barking dogs not biting comes true and the thunder clouds just move on without pouring.\""}, {"ball": 13.1, "isHighlight": false, "text": "Dinesh: \"@Siddharth - Mumbai situation is justified. Pollard is extremely inconsistent. But the opposition captain saves the best bowlers for him, giving other batsmen the chance to score. Overall a win for Mumbai.\""}, {"ball": 13.1, "isHighlight": false, "text": "Cobra Jain: \"Totally ridiculous that Duminy being the form batsman of the tournament (after maxwell and miller) is not even sent when 2 down after 12 overs!!! What's up with franchises holding back their best until there's too much left for them to do?\" Way too conservative, most teams are."}, {"ball": 13.1, "isHighlight": false, "text": "$$5.15$$ $$pm$$  Serious lightning but no rain yet. Pregnant clouds. Players still off. Covers still on."}, {"ball": 13.1, "isHighlight": false, "text": "Ankit Arora: \"Not sure which decision is more bizarre, DD's not sending Duminy in, or umpires taking players out when it hasn't even started raining.\" Taking them off is warranted if the lightning is deemed a safety hazard."}, {"ball": 13.1, "isHighlight": false, "text": "$$5.05$$ $$pm$$  Rain seems imminent and the umpires are taking the players off the field. The groundstaff hurry on with the covers. It isn't raining just yet but it's really gloomy. We will start losing overs after a delay of an hour. Imagine if Delhi's innings ends without Duminy and Jadhav getting a decent chance to bat!"}, {"ball": 13.1, "isHighlight": false, "text": "thatWeatherRepo: \"I live 5 kms away from the stadium and it has started raining here.\""}, {"ball": 13.1, "isHighlight": false, "text": "The players are back on. Super sopping has happened. No overs reduced. Karn Sharma to continue ..."}, {"ball": 13.2, "isHighlight": false, "text": "Sharma to Karthik,no run,steps out of his crease and lunges to defend towards cover"}, {"ball": 13.3, "isHighlight": false, "text": "Sharma to Karthik,no run,flatter ball around off, Karthik stays back and cuts, can't beat point"}, {"ball": 13.4, "isHighlight": false, "text": "Sharma to Karthik, $$SIX$$ ,Karthik gets down on one knee and makes superb contact with the slog sweep, the ball soars over deep midwicket, into the stands"}, {"ball": 13.5, "isHighlight": false, "text": "Sharma to Karthik, $$FOUR$$ ,too short, even though the line is outside off, Karthik has enough time to rock back and pull it into the gap between long on and deep midwicket. Hit hard and along the ground"}, {"ball": 13.6, "isHighlight": false, "text": "Sharma to Karthik,2 runs,Karthik plays the reverse paddle sweep, placing it fine past the keeper, Irfan gives chase from short third man and pulls it in with the double-kneed slide"}, {"ball": 14.1, "isHighlight": false, "text": "Pathan to LR Shukla,1 run,steps out and drills the ball down to long on"}, {"ball": 14.2, "isHighlight": false, "text": "Pathan to Karthik,no run,defended from the crease"}, {"ball": 14.3, "isHighlight": false, "text": "Pathan to Karthik,1 run,a full ball on the pads, nearly in the blockhole, Karthik clips it to square leg where the fielder fumbles. Another ball Duminy doesn't play"}, {"ball": 14.4, "isHighlight": false, "text": "Pathan to LR Shukla,1 run,a full ball around off stump, driven to long off for another single, another ball Jadhav doesn't play"}, {"ball": 14.5, "isHighlight": false, "text": "Pathan to Karthik,2 runs,Karthik dives at the bowler's end to make his crease, Dhawan's throw from cover misses the stumps and concedes an overthrow. Karthik had punched the ball firmly from his crease"}, {"ball": 14.6, "isHighlight": false, "text": "Pathan to Karthik,1 run,a low full toss, Karthik slogs it towards deep midwicket, Warner runs in from the boundary and dives but can't reach the ball in time to take the catch. Sunrisers won't mind that. Five overs to go and still no Duminy."}, {"ball": 14.6, "isHighlight": false, "text": "Bhuvneshwar Kumar from over the wicket ..."}, {"ball": 15.1, "isHighlight": false, "text": "Kumar to Karthik,1 run,Karthik aims for the big slog but gets an inside edge past the keeper's left"}, {"ball": 15.2, "isHighlight": false, "text": "Kumar to LR Shukla,1 run,Shukla walks across his stumps and taps a full length ball towards square leg, can't beat Steyn"}, {"ball": 15.3, "isHighlight": false, "text": "Kumar to Karthik,2 runs,mis-times the slog towards long-on, the ball travelled slowly to the fielder so there was time to take two"}, {"ball": 15.4, "isHighlight": false, "text": "Kumar to Karthik,no run,nearly in the blockhole, Karthik mis-times the drive to cover"}, {"ball": 15.4, "isHighlight": false, "text": "Danish: \"I'll be laughing at all the critics if Duminy and/or Jadhav fall for single digits. Let them play guys.. Karthik is a very capable batsman.\" That might happen, but got to get the tactics right."}, {"ball": 15.5, "isHighlight": false, "text": "Kumar to Karthik,2 runs,Karthik chips the ball over the infield at cover and places it into the gap and comes back for two"}, {"ball": 15.6, "isHighlight": false, "text": "Kumar to Karthik,1 run,a full toss outside off stump, Karthik moves towards it in his crease and gets cramped for room, ends up mis-timing his pull on the leg side"}, {"ball": 15.6, "isHighlight": false, "text": "Khan: \"Its a no brainer the way Duminy and Jadhav finish either should have come before Shukla, Delhi got it wrong here.\""}, {"ball": 16.1, "isHighlight": false, "text": "Henriques to Karthik, $$OUT$$ ,Steyn's taken a blinder on the long-off boundary! Karthik sliced a high full toss down to long off, mis-timing it but hitting it well enough to clear the boundary had Steyn not been right on the edge. Steyn waited, positioned himself, jumped backward, arched his back and then landed back inside the boundary. The ball was in the airspace over the boundary when Steyn caught it"}, {"ball": 16.1, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Steyn$$ $$b$$ $$Henriques$$ $$39$$ $$(41m$$ $$30b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$130.00$$"}, {"ball": 16.2, "isHighlight": false, "text": "Henriques to LR Shukla, $$FOUR$$ ,a rubbish pull toss and Shukla slams it to the midwicket boundary with a powerful pull"}, {"ball": 16.3, "isHighlight": false, "text": "Henriques to LR Shukla,no run,slogs at a slower ball outside off and is beaten"}, {"ball": 16.4, "isHighlight": false, "text": "Henriques to LR Shukla,no run,drives the ball hard but can't beat cover"}, {"ball": 16.5, "isHighlight": false, "text": "Henriques to LR Shukla, $$OUT$$ ,Shukla's holed out for 21 off 22 balls. Henriques bowled a slower ball and Shukla slogged wildly, hitting it straight to Warner at deep midwicket. Both set batsmen have been dismissed and Duminy and Jadhav have to make the most of three overs without having faced a ball each."}, {"ball": 16.5, "isHighlight": false, "text": "$$LR$$ $$Shukla$$ $$c$$ $$Warner$$ $$b$$ $$Henriques$$ $$21$$ $$(35m$$ $$22b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$95.45$$"}, {"ball": 16.6, "isHighlight": false, "text": "Henriques to Jadhav,no run,hits it hard back towards the bowler"}, {"ball": 16.6, "isHighlight": false, "text": "Tejas: \"@Danish If Duminy or Jhadav come in now, they will have no time to get themselves in and will have to get on with things from the word go. So, there is a good chance that they might lose their wickets which wouldn't have been the case if they had come in earlier. And also I don't think you can laugh at the critics after seeing Shukla's SR(I might have triggered a jinx).\""}, {"ball": 17.1, "isHighlight": false, "text": "Pathan to Duminy,1 run,good length outside off, Duminy dabs his first ball towards point and runs"}, {"ball": 17.2, "isHighlight": false, "text": "Pathan to Jadhav,1 run,steps out to a low full toss an drives it through point"}, {"ball": 17.2, "isHighlight": false, "text": "aneesh: \"there you go, people! both the men you wanted are in. now lets see what magic they create down there\""}, {"ball": 17.3, "isHighlight": false, "text": "Pathan to Duminy,1 run,a slower ball around off stump, Duminy gets forward and pushes the ball towards mid-on and runs"}, {"ball": 17.4, "isHighlight": false, "text": "Pathan to Jadhav,no run,driven hard but back at the bowler, Irfan had bowled it nearly in the blockhole"}, {"ball": 17.5, "isHighlight": false, "text": "Pathan to Jadhav,1 run,Steyn dives to his right at square leg to cut off Jadhav's flick from outside off stump. Steyn seems to have landed hard on his right shoulder"}, {"ball": 17.6, "isHighlight": false, "text": "Pathan to Duminy,1 run,a slower ball outside off, Duminy drags it through midwicket with the pull, not timed well, he keeps strike"}, {"ball": 18.1, "isHighlight": false, "text": "Kumar to Duminy,1 run,nearly in the blockhole from round the wicket, Duminy is cramped and can only push the ball towards mid-on"}, {"ball": 18.2, "isHighlight": false, "text": "Kumar to Jadhav,no run,awesome from Bhuvi, smack in the blockhole, Jadhav did well to keep it out and play it back to the bowler"}, {"ball": 18.3, "isHighlight": false, "text": "Kumar to Jadhav,no run,a wide full toss this time, Jadhav had come out of his crease and was off balance as he swung at that, missed it"}, {"ball": 18.4, "isHighlight": false, "text": "Kumar to Jadhav,no run,terrific again, in the blockhole outside off stump, Jadhav is beaten once again, not much you can do with those without being set"}, {"ball": 18.5, "isHighlight": false, "text": "Kumar to Jadhav,1 run,a full toss outside off stump, Jadhav slogs it towards wide long off"}, {"ball": 18.6, "isHighlight": false, "text": "Kumar to Duminy, $$OUT$$ ,it's all going pear-shaped for Delhi. Duminy's lost his leg stump. He moved towards the off side to paddle a full ball homing in on leg stump from round the wicket. Duminy missed and leg stump was uprooted. Two run and a wicket in the over. Delhi have been winded."}, {"ball": 18.6, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$b$$ $$Kumar$$ $$4$$ $$(13m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 19.1, "isHighlight": false, "text": "Steyn to Jadhav,1 run,chipped towards long on for a single, Steyn bowled it full and straight"}, {"ball": 19.2, "isHighlight": false, "text": "Steyn to R Shukla,no run,a full ball swinging away from the right-hander outside off, Shukla was beaten easily"}, {"ball": 19.3, "isHighlight": false, "text": "Steyn to R Shukla,1 run,in the blockhole around off stump, pushed into the off side for a single"}, {"ball": 19.4, "isHighlight": false, "text": "Steyn to Jadhav,1 run,in the blockhole around off stump, Jadhav slogs across the line and forces it towards midwicket"}, {"ball": 19.5, "isHighlight": false, "text": "Steyn to R Shukla,1 run,right up there in the blockhole, Shukla slogs and slices the ball to point"}, {"ball": 19.6, "isHighlight": false, "text": "Steyn to Jadhav, $$OUT$$ ,a full toss outside off stump, Jadhav slogs at it and ends up slicing it over backward point, Irfan covers good ground, running back from the circle and catches the ball as it drops over his head. That's the first time Jadhav's been dismissed this IPL season, in his fifth innings."}, {"ball": 19.6, "isHighlight": false, "text": "$$KM$$ $$Jadhav$$ $$c$$ $$Pathan$$ $$b$$ $$Steyn$$ $$5$$ $$(14m$$ $$11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$45.45$$"}, {"ball": 19.6, "isHighlight": false, "text": "$$6.45$$ $$pm$$  A sensational finish from Sunrisers. They conceded only 22 runs in the last five overs, and took four wickets. Delhi have dug themselves into a deep, deep hole with some absurd tactics."}, {"ball": 19.6, "isHighlight": false, "text": "Maximus: \"Delhi might now be wishing their innings hadn't resumed after the rain stoppage! They had put up a good total in those 13.1 overs and with D/L method, the target would have been even higher for the Sunrisers. Maybe close to what Delhi might end up getting now and they would have had to score it in 13.1 if the innings hadn't resumed!!\""}, {"ball": 19.6, "isHighlight": false, "text": "hasan sk: \"\"No one to blame but the team management, never seen any team making same blunder again and again.Well played SRH!!!\"\""}, {"ball": 19.6, "isHighlight": false, "text": "Kapil: \"The mediocre stuff presented by SRH was taken for 1s and 2s by Karthik and LR Shukla and the likes of Duminy and Jadhav had to take apart B Kumar and Steyn for 50 in last 4? Delhi have got it all wrong again. They needed 180 to test SRH batting especially on this track/ground with their ordinary bowling attack\""}], "name": "Delhi Daredevils v Sunrisers Hyderabad", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733993.html?innings=1;view=commentary", "match_num": 32}