{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.10$$ $$pm$$  The covers are coming off. The chase has been reduced by five overs.  $$Sunrisers$$ $$will$$ $$need$$ $$to$$ $$chase$$ $$117$$ $$in$$ $$15$$ $$overs.$$ . Mohammed Shami has the ball in hand and has a slip in place"}, {"ball": 0, "isHighlight": false, "text": "News just coming in - IPL 2014 final to be held in Bangalore. Qualifier 1 - Eden Gardens. Eliminator - Brabourne. Qualifier 2 - Wankhede. And both CSK's league games have been moved from Chennai to Ranchi."}, {"ball": 0, "isHighlight": false, "text": "Rishi: \"The other thing DD is missing in this IPL is a little luck. They were in a good position before the rain arrived, and maybe that cost them the momentum. Similar to last game, where the rain arrived to ease out the pitch for batting when CSK were chasing and handling wet ball was difficulties for DD bowlers; this after DD posted a good total.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.05$$ $$pm$$  The drizzle seems to have stopped. The umpires are inspecting the conditions. The covers are still on."}, {"ball": 0, "isHighlight": false, "text": "Sai Kiran: \"With this unexpected rain in Delhi, will the track be effective for spinners ?? And DD dropped their fast bowler and got a spinner in !! This is called ill-fate. The only way they can win the game now is through a splendid performance by Shami(their only fast bowler now) and the support from other bowlers !! This could also boost DD bowlers as they didn't do much this season....\""}, {"ball": 0, "isHighlight": false, "text": "$$6.55$$ $$pm$$  Whoops, it's drizzling at the Kotla and the Whale Super Sopper is super sopping. The groundstaff have brought on the covers to protect the square. We'll start losing overs now."}, {"ball": 0.1, "isHighlight": false, "text": "Mohammed Shami to Finch,no run,expansive drive to start off but a little bit of nip away beats him. Back of a length delivery outside off"}, {"ball": 0.2, "isHighlight": false, "text": "Mohammed Shami to Finch,1 run,gets it off the bottom of the blade this time to the left of mid-off. Flat batted punch down the ground"}, {"ball": 0.2, "isHighlight": false, "text": "$$There$$ $$are$$ $$five$$ $$Powerplay$$ $$overs$$ $$and$$ $$five$$ $$bowlers$$ $$can$$ $$bowl$$ $$a$$ $$maximum$$ $$of$$ $$three$$ $$overs$$ $$each$$"}, {"ball": 0.3, "isHighlight": false, "text": "Mohammed Shami to Dhawan,4 byes,bouncer to greet the Sunrisers captain and he goes for the hook. Just a little too quick for him, but he had directed it down leg side and DK's leap can't pull it down"}, {"ball": 0.4, "isHighlight": false, "text": "Mohammed Shami to Dhawan, $$FOUR$$ ,this one doesn't rise and Dhawan pulls through the midwicket boundary. No real flourish as he concentrated on timing the ball"}, {"ball": 0.5, "isHighlight": false, "text": "Mohammed Shami to Dhawan,1 no ball,sways inside the line of this short ball pushed across him. Aha, and the umpire has called no-ball for height. KP's going up to the umpire to have a little chat."}, {"ball": 0.5, "isHighlight": false, "text": "Mohammed Shami to Dhawan,no run,he was caught on off stump and had to work around his front pad in trying to flick the short of a good length ball. Gets stuck on the top of his pad. Appeal turned down, rightly"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami to Dhawan,no run,ripper to end the over. After a diet of short balls and the one darting back in, he gets one to seam away off the pitch. Dhawan was squared up and left groping"}, {"ball": 0.6, "isHighlight": false, "text": "Siddharth Kaul from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Kaul to Finch,1 run,back of a length and just outside off, Finch covers the line to block but ends up getting an outside edge to third man"}, {"ball": 1.1, "isHighlight": false, "text": "$$7.40$$ $$pm$$  And just like that we're back. It's been reduced to  $$12$$ $$overs$$ $$and$$ $$SRH$$ $$need$$ $$97$$"}, {"ball": 1.1, "isHighlight": false, "text": "Krishna: \"Wats the DL par score for 5 overs \" It's 36 if no wickets fall."}, {"ball": 1.1, "isHighlight": false, "text": "$$7.25pm$$  Hello, hello... the groundstaff pull the covers back on as the heavens open up again. Delhi's hopes in this game are fading fast. The crowd is not amused as this on-off drizzle continues. The umpires are walking out onto the field, feeling for the droplets. It seems to have lessened slightly."}, {"ball": 1.1, "isHighlight": false, "text": "Karthik: \"Guys for those who are disappionted with the rain, this is the best thing that is happening for us in Delhi..... We need rain, it is damn hot these days\""}, {"ball": 1.2, "isHighlight": false, "text": "Kaul to Dhawan,no run,goes for the cut, but this short of a length ball scoots under the bat"}, {"ball": 1.3, "isHighlight": false, "text": "Kaul to Dhawan,2 leg byes,comes down the track, but Kaul goes shorter and the ball jags back into him. Cramped for room, Dhawan looks to nudge through midwicket but the ball skews away behind point"}, {"ball": 1.4, "isHighlight": false, "text": "Kaul to Dhawan, $$OUT$$ ,slapped it straight to one of the three men square on the off side! JP was at point, had to move a couple of steps to his left and holds on as Dhawan cuts one that didn't have as much room and didn't bother to keep it down."}, {"ball": 1.4, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Duminy$$ $$b$$ $$Kaul$$ $$4$$ $$(7m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 1.4, "isHighlight": false, "text": "David Warner returns to his No.3 slot"}, {"ball": 1.5, "isHighlight": false, "text": "Kaul to Warner,no run,straightens off the deck as Kaul goes around the wicket. The angled lured Warner to poke at it but after pitching it darts away and he's soundly beaten. Warner practices a more straight batted punch through the covers"}, {"ball": 1.6, "isHighlight": false, "text": "Kaul to Warner,1 wide,slides this fuller one down the leg side"}, {"ball": 1.6, "isHighlight": false, "text": "Kaul to Warner,1 wide,another one. He's trying to work Warner out with ones that angle in to keep that away swinger a surprise. Gets his direction off thoguh"}, {"ball": 1.6, "isHighlight": false, "text": "Kaul to Warner,2 runs,works this away through square leg. But oh dear, he has slipped in his efforts to get a couple. The fielder in the deep has a pretty good chance of getting him out Warner is desperate enough to try a full length dive and he has reached safety"}, {"ball": 1.6, "isHighlight": false, "text": "$$8.10$$ $$pm$$  We're hearing that the equation for Sunrisers is 26 to get off three overs. Target is 43 in five overs. It appears that an incredibly frustrating game is about to re-start for the nth time."}, {"ball": 1.6, "isHighlight": false, "text": "$$8.00$$ $$pm$$  We're hearing that the covers are being pulled off at the Kotla. A T20 game needs both sides to have completed five overs of play, except the odd one in the  $$Big$$ $$Bash$$ . Melbourne stars won over Perth Scorchers in 2012 after blazing 29 in 12 balls and beat the stipulated D/L par score after five overs."}, {"ball": 1.6, "isHighlight": false, "text": "Debarshi: \"what is the cut off time for the game to be called off?\" IPL doesn't bother with them. And I suspect the umpires will be doing all they can to get five overs in."}, {"ball": 1.6, "isHighlight": false, "text": "Bhawesh: \"So, if the match were to end now, Sunrisers would have won courtesy DD - they have thrown away 9 extras already in 2 overs whereas three batsmen have scored lesser! \""}, {"ball": 1.6, "isHighlight": false, "text": "$$7.48$$ $$pm$$  Do I even have to say it? Heavy rain sweeps the Kotla and the players have been taken off the field. Will this game ever be complete? The covers are being lugged back on the ground. What is this, the fifth interruption?  $$As$$ $$of$$ $$now$$ $$Sunrisers$$ $$are$$ $$ahead$$ $$by$$ $$three$$ $$runs.$$ $$They$$ $$should$$ $$get$$ $$to$$ $$36$$ $$by$$ $$the$$ $$end$$ $$of$$ $$the$$ $$fifth$$ $$over$$ $$to$$ $$be$$ $$on$$ $$par$$ $$with$$ $$the$$ $$D/L$$ $$equation$$ . In case you haven't heard, the IPL final has been  $$shifted$$  to Bangalore. Amol Karhadkar has more"}, {"ball": 1.6, "isHighlight": false, "text": "Tahir to resume with a wet ball ..."}, {"ball": 2.1, "isHighlight": false, "text": "Imran Tahir to Finch,1 run,played to midwicket for a single"}, {"ball": 2.2, "isHighlight": false, "text": "Imran Tahir to Warner,1 run,played down the ground for one more"}, {"ball": 2.3, "isHighlight": false, "text": "Imran Tahir to Finch,1 run,hits a full toss straight down the ground"}, {"ball": 2.4, "isHighlight": false, "text": "Imran Tahir to Warner,1 run,steers the ball to third man for a single"}, {"ball": 2.5, "isHighlight": false, "text": "Imran Tahir to Finch,2 wides,a wide down leg side this time, the batsmen run after the keeper can't collect cleanly"}, {"ball": 2.5, "isHighlight": false, "text": "Imran Tahir to Warner,1 run,knocks it through midwicket for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Imran Tahir to Finch,no run,defended on the leg side"}, {"ball": 2.6, "isHighlight": false, "text": "Rahul Shukla to bowl the penultimate over. Sunrisers need 19 off 12."}, {"ball": 3.1, "isHighlight": false, "text": "R Shukla to Warner,1 run,hit down the ground for another single, Sunrisers need a boundary this over to take the pressure off"}, {"ball": 3.2, "isHighlight": false, "text": "R Shukla to Finch, $$OUT$$ ,bowled him! Shukla delivers full and straight, Finch swings across the line and misses. Leg stump takes a beating. Delhi could pull off an unlikely win here! With Finch gone and Warner off strike, they have a new batsman to bowl to in a pressure situation."}, {"ball": 3.2, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$b$$ $$R$$ $$Shukla$$ $$4$$ $$(19m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$57.14$$"}, {"ball": 3.3, "isHighlight": false, "text": "R Shukla to Ojha,1 run,the new man Ojha plays the ball down the ground for a single"}, {"ball": 3.4, "isHighlight": false, "text": "R Shukla to Warner, $$FOUR$$ ,a full toss and Warner puts it away through cover, he didn't try and hit it too hard, just scooped it over the infield and placed it into the gap on the boundary"}, {"ball": 3.5, "isHighlight": false, "text": "R Shukla to Warner,1 run,driven through cover, just the single, 12 to get off 7 balls"}, {"ball": 3.6, "isHighlight": false, "text": "R Shukla to Ojha, $$SIX$$ ,massive strike! Slogs across the line and makes superb contect, the length ball lands in the stands at deep midwicket, that's the telling blow"}, {"ball": 4.1, "isHighlight": false, "text": "LR Shukla to Warner,1 run,played to midwicket for a single, they can do it with a run a ball"}, {"ball": 4.2, "isHighlight": false, "text": "LR Shukla to Ojha, $$SIX$$ ,that's the winning shot! Ojha dispatches a short of a length ball flat over square leg with a pull, and the moment he hit it, everyone knew ... it's taken Sunrisers into the top four in the points table"}, {"ball": 4.2, "isHighlight": false, "text": "Sunrisers have won a painfully frustrating game. There were so many rain interruptions but they will be feeling overwhelming relief at not having to share points in a game they were in control of. Those points have taken Sunrisers ahead of Kolkata to No. 4 in the points table."}, {"ball": 4.2, "isHighlight": false, "text": "For Delhi, it is their fourth consecutive defeat at home and their campaign - two wins in nine games - is all but done. Only a mathematical possibility of progress remains."}, {"ball": 4.2, "isHighlight": false, "text": "The Man of the Match is Dale Steyn for his incisive and economical bowling and a superb catch on the boundary."}, {"ball": 4.2, "isHighlight": false, "text": "There's another game going on right now so let's move on to that. The juggernaut rolls on. Thank you for all your emails today. Cheers."}], "name": "Delhi Daredevils v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733993.html?innings=2;view=commentary", "match_num": 32}