{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00pm$$  Here come the teams, then. CM Gautam and Lendl Simmons walk in to open for Mumbai, and it will be Simmons on strike to face Badree."}, {"ball": 0, "isHighlight": false, "text": "\"No one seems to be worried about Dhoni's form. He used to hit sixes at will in previous seasons. Teams have kept him calm this season. He should be back to his best for CSK's fortunes of winning this year's IPL.\""}, {"ball": 0, "isHighlight": false, "text": "He's been okay so far, Dinesh. He's been coming in fairly low down the order, but he averages 36.75, and has a strike rate of 145.54."}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm$$  A reminder for anyone who's just landed on this page. Chennai Super Kings have won the toss and chosen to bowl first at a mercifully rain-free Wankhede. Samuel Badree is in, for the first time this season, as are Praveen Kumar and Lendl Simmons for Mumbai Indians."}, {"ball": 0, "isHighlight": false, "text": "Senthil: \"So Dhoni finally succumbs to the massive fan pressure to play Sam Badree or is it a strategy to drop the Aussies against the WI to keep up in fairplay award too? But when Baba Aparajith is going to replace Mithun Manhas (Nothing against him) which will give Dhoni another option of spin bowling. \""}, {"ball": 0, "isHighlight": false, "text": "$$7.45pm$$  More links. First up, the  $$full$$ $$story$$  on the venue shift for the playoff matches. And then,  $$another$$ $$question$$  to ruminate upon before the match begins: Can Pollard do a Maxwell against Ashwin?"}, {"ball": 0, "isHighlight": false, "text": "Siddharth Dhuri: \"Both the matches at the same time. I wish I could split my TV screen in two !!!\""}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  Something for all you stats nerds to chew on, before the match begins. Anantha Narayanan  $$deconstructs$$ the Twenty20 over."}, {"ball": 0, "isHighlight": false, "text": "$$7.35pm$$  \"Considering that twenty matches of the ongoing Pepsi IPL season were played overseas, the GC took a decision to try and take the Playoffs to as many different stadia as possible,\" says the BCCI release explaining the change of venues for the playoff matches. We will have a full story up very soon, like I said."}, {"ball": 0, "isHighlight": false, "text": "\"correction csk have beat MI in wankhede to win 2010 ipl finals! \"not won in mumbai \" it seems ;)\" That was at the DY Patil Stadium, Shravan."}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  Toss time. It's tails, and MS Dhoni has won the toss. He's chosen to bowl first, and says the dew was a big factor in his decision. Rohit Sharma, meanwhile, says he would have chosen to bat. Mumbai batted first when they won their previous match here."}, {"ball": 0, "isHighlight": false, "text": "Good news for fans of Samuel Badree. He replaces Ben Hilfenhaus for Chennai. Mumbai, meanwhile, have made two changes. Lendl Simmons is in for Ben Dunk, and Praveen Kumar comes in for Pawan Suyal."}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$  There's a lot to look forward to in tonight's game. Chennai might be sitting pretty on the table, but they have never beaten Mumbai at the Wankhede. Praveen Kumar, meanwhile, is back in the IPL again, having replaced the injured Zaheer Khan in Mumbai's squad. Will he get to play? For more, read  $$this$$ $$preview$$ , by Rachna Shetty."}, {"ball": 0, "isHighlight": false, "text": "$$7.15pm$$  Hello and welcome to our ball-by-ball coverage of tonight's second match, between Mumbai Indians and Chennai Super Kings. There has been rain at the Feroz Shah Kotla, but the Wankhede looks bone-dry as the players warm up."}, {"ball": 0, "isHighlight": false, "text": "Before we get into the game, some news for you. There has been a change in the venues for the knockout games. The final will now be held in Bangalore. Qualifier 1 will be at Eden Gardens, the Eliminator at Brabourne Stadium, and Qualifier 2 at the Wankhede. We'll have a news story up very soon."}, {"ball": 0.1, "isHighlight": false, "text": "Badree to Simmons,1 wide,first ball this season, slips down the leg side. Dhoni can't quite gather it."}, {"ball": 0.1, "isHighlight": false, "text": "Badree to Simmons,no run,shortish, outside off, pushed to point."}, {"ball": 0.2, "isHighlight": false, "text": "Badree to Simmons,1 run,full, on the stumps, checked drive down to long-on."}, {"ball": 0.3, "isHighlight": false, "text": "Badree to Gautam,no run,back of a length on off, straightens. Defended back to the bowler."}, {"ball": 0.4, "isHighlight": false, "text": "Badree to Gautam,no run,length ball, straight. Defended off the front foot."}, {"ball": 0.5, "isHighlight": false, "text": "Badree to Gautam,1 run,shortish ball, not much turn. Gautam goes back to push it down the ground."}, {"ball": 0.6, "isHighlight": false, "text": "Badree to Simmons,1 run,angled into the pads, worked into the leg side."}, {"ball": 0.6, "isHighlight": false, "text": "Ishwar Pandey comes on."}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Simmons,no run,wide outside off, bit of outswing, Simmons lets it go."}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Simmons,no run,shorter this time, but movement again. Simmons withdraws his bat at the last moment."}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Simmons,no run,shortish, outside off, pushed to point."}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Simmons, $$FOUR$$ ,short, sits up, and Simmons pulls it with a little flick in his follow-through."}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Simmons,no run,outswing again, from a back of a length ball outside off. left alone."}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Simmons,no run,shortish again, outside off again, and Simmons opens his face but finds the point fielder."}, {"ball": 2.1, "isHighlight": false, "text": "Badree to Gautam, $$FOUR$$ ,not that short, and no turn, Gautam goes back to cut, gets a thick edge just wide of the keeper's gloves."}, {"ball": 2.2, "isHighlight": false, "text": "Badree to Gautam,no run,length ball, outside off. Tries to sweep but doesn't middle it. Fielded at midwicket."}, {"ball": 2.3, "isHighlight": false, "text": "Badree to Gautam, $$FOUR$$ ,Down the track, and it's only a little push, but it screams away for four just behind point."}, {"ball": 2.4, "isHighlight": false, "text": "Badree to Gautam,no run,legbreak, bit of turn from middle-and-leg, defended watchfully."}, {"ball": 2.5, "isHighlight": false, "text": "Badree to Gautam, $$OUT$$ ,and he's gone! It was too far outside off for him to control the sweep. Gautam goes for it anyway, and it loops up, off the outside edge, straight to McCullum at square leg."}, {"ball": 2.5, "isHighlight": false, "text": "$$CM$$ $$Gautam$$ $$c$$ $$McCullum$$ $$b$$ $$Badree$$ $$9$$ $$(8m$$ $$8b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 2.5, "isHighlight": false, "text": "Rayudu walks in at number three."}, {"ball": 2.6, "isHighlight": false, "text": "Badree to Rayudu,no run,skids on from just outside off, towards off-and-middle. Rayudu comes forward and defends with soft hands."}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Simmons,1 run,Another ball in that outside-off channel. Simmons steers it away to third man."}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Rayudu,1 wide,same channel, slightly fuller, bit of outswing again, and Rayudu lets it go. Called wide. Close."}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Rayudu,no run,Rayudu shoulders arms again. Pandey's not wavered much from that line."}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to Rayudu,no run,This one doesn't swing, and Rayudu waits before bunting it into the off side. Decides against taking a single."}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to Rayudu,no run,shorter, rises up to Rayudu's chest. He stays beside the line and tries to cut. Finds the point fielder."}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to Rayudu,no run,shortish, swing, bounces before it reaches Dhoni as Rayudu slashes and misses."}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to Rayudu,no run,away-swing again, and Rayudu is beaten as he pokes at it from the crease."}, {"ball": 4.1, "isHighlight": false, "text": "Badree to Simmons,no run,Slow, short, wide. Simmons gives himself even more room, and finds he isn't close enough to connect cleanly, hits straight to cover."}, {"ball": 4.2, "isHighlight": false, "text": "Badree to Simmons, $$SIX$$ ,tossed it up a bit, and Simmons swings through the line. Bounces right on top of the long-off rope."}, {"ball": 4.3, "isHighlight": false, "text": "Badree to Simmons,no run,quicker, flatter, pushed towards cover."}, {"ball": 4.4, "isHighlight": false, "text": "Badree to Simmons, $$SIX$$ ,down the track, and Simmons hits this cleanly, swinging freely through the line to send it soaring over long-on."}, {"ball": 4.5, "isHighlight": false, "text": "Badree to Simmons,1 run,slides towards the pads, worked away wide of long-on, where Faf du Plessis dives and throws in one motion."}, {"ball": 4.6, "isHighlight": false, "text": "Badree to Rayudu,1 run,pushed wide of mid-off, quick single."}, {"ball": 4.6, "isHighlight": false, "text": "\"So how many opening combinations have MI tried in their 8 games this IPL? T\" Five, Shravan."}, {"ball": 5.1, "isHighlight": false, "text": "Pandey to Rayudu, $$FOUR$$ ,sees Rayudu walking down the pitch, bowls it wide. Rayudu hits smoothly through the line and over mid-off."}, {"ball": 5.2, "isHighlight": false, "text": "Pandey to Rayudu,no run,shortish, outswing. Rayudu pokes and misses. He was trying to run it to third man."}, {"ball": 5.3, "isHighlight": false, "text": "Pandey to Rayudu, $$SIX$$ ,Dropped! Down the track again, and he's looking to go over cover, but the ball slices off the outside half thanks to the swing. and goes towards Badree at third man. It was a simple catch, but he let it bounce off his fingers as he jumped."}, {"ball": 5.4, "isHighlight": false, "text": "Pandey to Rayudu,no run"}, {"ball": 5.5, "isHighlight": false, "text": "Pandey to Rayudu,no run,sashays down the pitch, but he's in no position as the ball straightens, bounces and beats him all ends up."}, {"ball": 5.6, "isHighlight": false, "text": "Pandey to Rayudu,no run,bit of width, cut straight to point."}, {"ball": 5.6, "isHighlight": false, "text": "On comes Jadeja"}, {"ball": 6.1, "isHighlight": false, "text": "Jadeja to Simmons,no run,bit of turn outside off. Beaten as he tries to push it into the off side."}, {"ball": 6.2, "isHighlight": false, "text": "Jadeja to Simmons, $$FOUR$$ ,width, and Simmons punishes it, going deep in his crease to cut."}, {"ball": 6.3, "isHighlight": false, "text": "Jadeja to Simmons,no run,comes forward, looks to push into the off side and run, decides against it."}, {"ball": 6.4, "isHighlight": false, "text": "Jadeja to Simmons,no run,sliced towards short third man."}, {"ball": 6.5, "isHighlight": false, "text": "Jadeja to Simmons,no run,pushed into the off side."}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja to Simmons,no run,defended watchfully off the front foot, down the pitch."}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja is the worst bowler for a ball-by-ball commentator. Does anyone hurry through his overs as quick as him? Here's Mohit, who thankfully has an elaborate, skippy run-up."}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Rayudu,1 run,Shortish, slightly wide of off, cut away into the ground, bounces over the point fielder."}, {"ball": 7.1, "isHighlight": false, "text": "Mohit pulls up in his run-up. Simmons wasn't ready to face."}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Simmons,1 run,full and wide, driven to the left of the off-side sweeper."}, {"ball": 7.2, "isHighlight": false, "text": "Bharath: \"So,Samuel Badree has missed two catches in this IPL!! First one is Maxwell in the very first game of CSK and Now Rayudu!!\""}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Rayudu,1 run,comes forward and pushes it to point, where Jadeja pounces on the ball and throws hard at the bowler's end. Might have been close if he hit. Yup. Rayudu would have been out."}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Simmons,no run,fullish ball outside off, beats Simmons as he tries a forcing drive."}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Simmons,no run,slower ball, Simmons is down the track but isn't in position for an aggressive shot. Defensive push to cover."}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Simmons,no run,shortish, outside off, seams in a bit. Simmons is on the hop as he pushes it to point."}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Rayudu,1 run,bit of turn, checked drive with an open face to the off-side sweeper."}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Simmons,2 runs,down the track, doesn't time it as he tries to heave across the line. Deep midwicket picks it up on the boundary."}, {"ball": 8.2, "isHighlight": false, "text": "Nani: \"Too many dots for Mumbai, Simons playing same way WI plays bang bang and lots of dots to neutralize the good work\""}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Simmons,1 run,gives himself room, Jadeja follows him. Forced to nurdle it into the leg side."}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Rayudu,1 run,full, just outside off, driven down to long-off."}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Simmons,no run,down the track again, no turn, hurries on and hits Simmons on the front pad."}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Simmons,no run,gives himself room, tries to smack it through the off side. Can only hit it straight to cover."}, {"ball": 8.6, "isHighlight": false, "text": "Ravi: \"The is wonderful. Mumbai's best players are not at the crease and almost 50% of the overs are done. And as a Icing on the cake Batsmen are not taking risk. Well ..to an extent not surprised though...this has been always Mumbai's style of playing. Keep Pollard to play only 15 balls Maxx.\""}, {"ball": 8.6, "isHighlight": false, "text": "Sridhar: \"Simmons plays like Marlon Samuels....both score most of their runs in boundaries but consume a lot of dot balls. They have the confidence to make up later but do not understand the pressure on the non-striker\""}, {"ball": 8.6, "isHighlight": false, "text": "Simmons has 18 dot balls so far, out of 29 balls he's faced in total. They've taken the time-out."}, {"ball": 8.6, "isHighlight": false, "text": "Here's Ashwin. Right-arm.... over!"}, {"ball": 9.1, "isHighlight": false, "text": "Ashwin to Rayudu,no run,offbreak, outside off. Rayudu defends towards the leg side."}, {"ball": 9.2, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,big turn, from outside off. Rayudu is forced to change his mind and defend towards the off side instead of cut."}, {"ball": 9.3, "isHighlight": false, "text": "Ashwin to Simmons,1 run"}, {"ball": 9.4, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,shortish, pulled to deep midwicket."}, {"ball": 9.5, "isHighlight": false, "text": "Ashwin to Simmons,no run,turn again, and Simmons inside-edges it onto his pads as he tries to cut."}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin to Simmons,no run,Turn once more. Simmons gives himself room but he can only hit it straight back to Ashwin."}, {"ball": 10.1, "isHighlight": false, "text": "Jadeja to Rayudu,2 runs,dropped again! Manhas this time, at deep cover. Jadeja saw Rayudu come down the track, bowled it wider. He went through with the big shot anyway. Manhas ran forward, and had it in his grasp, but it popped out."}, {"ball": 10.2, "isHighlight": false, "text": "Jadeja to Rayudu, $$SIX$$ ,goes down on one knee, opens up his body, and slog-sweeps powerfully over deep midwicket."}, {"ball": 10.3, "isHighlight": false, "text": "Jadeja to Rayudu,1 run,down the track, chipped to long-off."}, {"ball": 10.4, "isHighlight": false, "text": "Jadeja to Simmons,1 run,slashed over cover, straight to the sweeper."}, {"ball": 10.5, "isHighlight": false, "text": "Jadeja to Rayudu,1 run,Extremely round-arm from Jadeja, slapped to deep cover."}, {"ball": 10.6, "isHighlight": false, "text": "Jadeja to Simmons,1 run,round-arm once more, and the batsman is back in his crease to defend into the off side."}, {"ball": 11.1, "isHighlight": false, "text": "Ashwin to Simmons, $$FOUR$$ ,Carrom ball. Gives himself width, gets a thick outside edge that runs away fine to the third man boundary, beats a despairing dive from Badree."}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Simmons,1 run,pushed down to long-on."}, {"ball": 11.3, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,not too much turn this time. Cut to the sweeper."}, {"ball": 11.3, "isHighlight": false, "text": "This is the best sort of pitch for Ashwin to bowl over the wicket on. Lots of turn, and bounce as well."}, {"ball": 11.4, "isHighlight": false, "text": "Ashwin to Simmons,2 runs,Tossed up. Down the pitch, driven hard down the ground. Faf ran to his left from long on and made a diving stop."}, {"ball": 11.5, "isHighlight": false, "text": "Ashwin to Simmons, $$OUT$$ ,he's gone. clears his front leg, swings hard, but can only hit it down long-on's throat."}, {"ball": 11.5, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Ashwin$$ $$38$$ $$(44m$$ $$38b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 11.5, "isHighlight": false, "text": "Swami: \"News Flash: All religious institutions have declared bowling over the wicket is not a sin. Thank you Ashwin!\""}, {"ball": 11.5, "isHighlight": false, "text": "In comes Rohit now."}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin to Sharma,1 run,Slow, on middle-and-leg, Rohit works a single behind square."}, {"ball": 11.6, "isHighlight": false, "text": "Badree's back."}, {"ball": 12.1, "isHighlight": false, "text": "Badree to Sharma,1 run,skids on towards the pads, worked away towards square leg."}, {"ball": 12.2, "isHighlight": false, "text": "Badree to Rayudu, $$FOUR$$ ,Shortish ball, tennis-forehanded and hit very hard past Badree, who doesn't really make an effort to stop the ball. Faf does, diving to his right after running hard from long-off, but he's hit the rope with his elbow as he pushed the ball back in."}, {"ball": 12.3, "isHighlight": false, "text": "Badree to Rayudu,1 run,flat, outside off, driven to deep extra cover."}, {"ball": 12.4, "isHighlight": false, "text": "Badree to Sharma,no run,quick, bit of bounce, hits Rohit high on the bat as he tries to defend."}, {"ball": 12.5, "isHighlight": false, "text": "Badree to Sharma,1 run,skids on, flicked to deep square leg."}, {"ball": 12.6, "isHighlight": false, "text": "Badree to Rayudu,1 run,pushed into the leg side for a walked single."}, {"ball": 12.6, "isHighlight": false, "text": "Another time-out. Haven't there been seven of those already?"}, {"ball": 12.6, "isHighlight": false, "text": "pavan: \"The Pitch is turning square which compelled even Ashwin to come over the wicket for the first time this IPL...still Mumbai kept Ojha out...strange decision. \""}, {"ball": 12.6, "isHighlight": false, "text": "\"I think MI loves the 'tiki taka' style of play a lot.\" And how would that translate to cricket, Muzzammil?"}, {"ball": 13.1, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,Rayudu is back in his crease to work this away towards midwicket."}, {"ball": 13.2, "isHighlight": false, "text": "Ashwin to Sharma,2 runs,turn and bounce again, Rohit takes his bottom hand off as he tries to cut. He's a little slow taking off, and Dwayne Smith throws hard from cover. Misses the stumps, and Suresh Raina has to make a diving stop on the leg-side boundary as they run overthrows."}, {"ball": 13.3, "isHighlight": false, "text": "Ashwin to Sharma,no run,played late, with a turn of the wrist, behind square leg. They decide against the single."}, {"ball": 13.3, "isHighlight": false, "text": "Ashwin stops in his run-up. Batsman wasn't ready to face."}, {"ball": 13.4, "isHighlight": false, "text": "Ashwin to Sharma,1 run,tossed up, outside off, driven to long-off."}, {"ball": 13.5, "isHighlight": false, "text": "Ashwin to Rayudu,2 runs,short, pulled, Raina runs to his right from deep midwicket to stop it with a dive."}, {"ball": 13.6, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,slogged away to deep midwicket from way outside off, Raina does the fielding again."}, {"ball": 13.6, "isHighlight": false, "text": "More football analogies, as Mohit returns to the attack."}, {"ball": 13.6, "isHighlight": false, "text": "Sam : \"If MI plays tiki taka, then Dhoni led csk plays mourinho style - getting results but boring style - waiting for opponents to make any mistakes rather than going for the kill. \" Who plays Total Cricket then?"}, {"ball": 14.1, "isHighlight": false, "text": "Sharma to Rayudu,1 run,gives himself room to steer it to the right of third man."}, {"ball": 14.2, "isHighlight": false, "text": "Sharma to Sharma,no run,slower ball, Rohit waits and twirls his wrists to find midwicket."}, {"ball": 14.3, "isHighlight": false, "text": "Sharma to Sharma, $$FOUR$$ ,shortish, just outside off. Rohit opens the face of his bat, and that's terrible fielding from Pandey on the boundary. Didn't bend down quick enough, and it scrapes his fingertips before sliding over the rope."}, {"ball": 14.4, "isHighlight": false, "text": "Sharma to Sharma,no run,short, on off stump. Rohit goes on his toes and punches it to cover."}, {"ball": 14.5, "isHighlight": false, "text": "Sharma to Sharma,1 run,slower ball, outside off. Rohit opens the face of his bat, lets it run down to third man."}, {"ball": 14.5, "isHighlight": false, "text": "Mohit has the towel out. Humidity rather than dew, I think."}, {"ball": 14.6, "isHighlight": false, "text": "Sharma to Rayudu,no run,Rayudu gives himself room, slashes, and misses."}, {"ball": 14.6, "isHighlight": false, "text": "Kuldeep: \"Sharma to Sharma, Mohit to Rohit. Not too often this will be seen in a cricket match.\""}, {"ball": 14.6, "isHighlight": false, "text": "Here's Jadeja again. He's raring to go, but Dhoni's saying something to a fielder."}, {"ball": 15.1, "isHighlight": false, "text": "Jadeja to Sharma,1 run,Bit of turn, and Rohit gets a thick edge to short third man as he tries to push it towards the on side."}, {"ball": 15.2, "isHighlight": false, "text": "Jadeja to Rayudu, $$SIX$$ ,big swing of those arms, and the ball disappears over long-on. He had used his feet well to that."}, {"ball": 15.3, "isHighlight": false, "text": "Jadeja to Rayudu,2 runs,down the track again, Jadeja pushes it through. Rayudu drives to deep cover."}, {"ball": 15.4, "isHighlight": false, "text": "Jadeja to Rayudu,1 run,down the pitch once more, driven wide of long-off."}, {"ball": 15.5, "isHighlight": false, "text": "Jadeja to Sharma,no run,round-arm from Jadeja, towards middle stump. Defended off the front foot."}, {"ball": 15.6, "isHighlight": false, "text": "Jadeja to Sharma,2 runs,shorter, Rohit slaps it away to deep cover."}, {"ball": 15.6, "isHighlight": false, "text": "Himanshu Gupta: \"Mumbai 100 from 15 overs , with Anderson & Pollard sitting on Bench ... Are they Planning to ask for an Extension of their Innings by another 5 Overs ?? :-D\""}, {"ball": 16.1, "isHighlight": false, "text": "Sharma to Rayudu,1 run,back of a length, Rayudu goes deep in his crease and muscles it wide of long on."}, {"ball": 16.2, "isHighlight": false, "text": "Sharma to Sharma,1 run,down the track, low full-toss outside off, hit straight to deep cover."}, {"ball": 16.2, "isHighlight": false, "text": "Aseem: \"Mumbai has been tactically wanting most of the times. I think they will do well to let go some of their think-tank dead weight.\""}, {"ball": 16.2, "isHighlight": false, "text": "Rayudu takes his helmet off. Maybe he doesn't want Mohit to bowl those slower balls."}, {"ball": 16.3, "isHighlight": false, "text": "Sharma to Rayudu,1 run,predictably, a short ball. Rayudu moves across, inside the line, and swats it away to long leg."}, {"ball": 16.4, "isHighlight": false, "text": "Sharma to Sharma,1 run,Rohit comes down the track, Mohit bowls it into the blockhole, and the batsman jams his bat down on it to steer it towards point."}, {"ball": 16.4, "isHighlight": false, "text": "Still no helmet for Rayudu."}, {"ball": 16.5, "isHighlight": false, "text": "Sharma to Rayudu,1 run,slower ball, tucked away behind square. Two looked on, but the batsmen decided against it as Jadeja swooped down over the ball."}, {"ball": 16.6, "isHighlight": false, "text": "Sharma to Sharma,2 runs,What a stop! full, outside off, launched to the left of long-on, and Faf leaps to his left, puts his hands together, and pushes it back into play even as he dives over the rope. That, for all you football fans swarming here, could have been Peter Schmeichel at his best."}, {"ball": 16.6, "isHighlight": false, "text": "Ashwin is back."}, {"ball": 17.1, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,down the track, full ball outside off, squeezed down to short third man."}, {"ball": 17.1, "isHighlight": false, "text": "Around the wicket now, the moment you've all been waiting for."}, {"ball": 17.2, "isHighlight": false, "text": "Ashwin to Sharma,1 run,Legbreak, it looked like. swept away behind square."}, {"ball": 17.3, "isHighlight": false, "text": "Ashwin to Rayudu,2 wides"}, {"ball": 17.3, "isHighlight": false, "text": "Ashwin to Sharma, $$OUT$$ ,gone! Raina takes a good catch running to his left as Rohit tries to slog the carrom ball. It was high over his shoulder, but Raina took it with both hands before going on a tumble with the momentum."}, {"ball": 17.3, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$Raina$$ $$b$$ $$Ashwin$$ $$19$$ $$(28m$$ $$19b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "In comes Pollard, but it's Rayudu on strike."}, {"ball": 17.4, "isHighlight": false, "text": "Ashwin to Rayudu, $$SIX$$ ,Down the pitch, clean swing of his arms and it goes soaring over long-on."}, {"ball": 17.5, "isHighlight": false, "text": "Ashwin to Rayudu,1 run,length ball, swept square."}, {"ball": 17.6, "isHighlight": false, "text": "Ashwin to Pollard, $$OUT$$ ,whatay catch! slow carrom ball, and Pollard's top hand comes off as he slogs at it. Connects fairly well, and Raina, running to his right, takes it the Australian way, hands pointing up, but it nearly pops out. He somehow keeps it in his grasp as he falls to the floor."}, {"ball": 17.6, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$c$$ $$Raina$$ $$b$$ $$Ashwin$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Two overs to go. In walks Corey. Mohit to bowl his last over."}, {"ball": 18.1, "isHighlight": false, "text": "Sharma to Rayudu, $$OUT$$ ,Slower ball, big step back and across, and out comes the slog. Doesn't time it at all and the ball drops into Jadeja's hands. He barely had to move at deep midwicket. The batsmen didn't even cross, which means Anderson won't be on strike next ball."}, {"ball": 18.1, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Jadeja$$ $$b$$ $$Sharma$$ $$59$$ $$(69m$$ $$43b$$ $$2x4$$ $$4x6)$$ $$SR:$$ $$137.20$$"}, {"ball": 18.1, "isHighlight": false, "text": "Praveen Kumar (I don't think it's their new teammate): \"Rayudu and Simmons, amazing knock ! Hope they get a test cap ! \""}, {"ball": 18.2, "isHighlight": false, "text": "Sharma to Tare, $$FOUR$$ ,short, not that wide, but Tare chops down on it and finds the gap to the right of third man."}, {"ball": 18.3, "isHighlight": false, "text": "Sharma to Tare,no run,Short, on off, just goes over off stump, in fact, as Tare tries to pull and misses."}, {"ball": 18.4, "isHighlight": false, "text": "Sharma to Tare, $$FOUR$$ ,short, wide, slapped. Deep cover runs to his left but has no chance of cutting it off."}, {"ball": 18.5, "isHighlight": false, "text": "Sharma to Tare,1 run,Slower ball, takes an age to get to Tare, who gives himself room, gets down on his knee, and cuts it to point."}, {"ball": 18.5, "isHighlight": false, "text": "Around the wicket to Corey."}, {"ball": 18.6, "isHighlight": false, "text": "Sharma to Anderson,1 run,Full, angling in towards off stump. Corey gives himself room, hits it down to long-off."}, {"ball": 18.6, "isHighlight": false, "text": "Ishwar, round the wicket."}, {"ball": 19.1, "isHighlight": false, "text": "Pandey to Anderson,2 runs,Hit hard down the ground by Corey, straight at the bowler. Pandey gets a hand to it and slows it down to deflect it towards long-on."}, {"ball": 19.2, "isHighlight": false, "text": "Pandey to Anderson,1 wide,oh dear. That's way outside the wide line outside off. Almost hits the return crease."}, {"ball": 19.2, "isHighlight": false, "text": "Corey went really deep in his crease to that one. Pandey swtiches to over the wicket now."}, {"ball": 19.2, "isHighlight": false, "text": "Pandey to Anderson, $$SIX$$ ,Angled across Corey, who hits it over cover's head, but a wide long-off is there to cut it off. Dhoni had moved that fielder there just before this ball."}, {"ball": 19.3, "isHighlight": false, "text": "Pandey to Anderson,2 runs"}, {"ball": 19.4, "isHighlight": false, "text": "Pandey to Anderson, $$SIX$$ ,full toss, waist-high, swatted over the leg side. Jadeja sprints to his left, catches it, but it seems to stick in his hands as he runs over the ropes. He tried to throw it back but didn't manage to, and signals six even before the umpire does."}, {"ball": 19.5, "isHighlight": false, "text": "Pandey to Anderson,1 run,short, wide, slapped down the ground, and it hit Tare in the midriff at the non-striker's end. He somehow completed the run, before collapsing in a heap at the batting crease."}, {"ball": 19.5, "isHighlight": false, "text": "Shashi: \"Tare zameen par...... !!!\""}, {"ball": 19.5, "isHighlight": false, "text": "He's back on his feet now."}, {"ball": 19.6, "isHighlight": false, "text": "Pandey to Tare, $$OUT$$ ,Full-toss, and Tare hits it over the leg side. He seems to hit that well, but Faf pops up out of nowhere to take what was in the end a pretty simple catch."}, {"ball": 19.6, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Pandey$$ $$9$$ $$(12m$$ $$5b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$180.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "Raina, Rahane and Jadeja also getting lots of support."}, {"ball": 19.6, "isHighlight": false, "text": "\"Well i think younis khan is a good candidate he had picked up some brilliant catches\" Good shout there, Abdul Berr. Always thought Younis was pretty good. But best in the world?"}, {"ball": 19.6, "isHighlight": false, "text": "Tijo Jose: \"Candidates for best fielder? Steve Smith?\""}, {"ball": 19.6, "isHighlight": false, "text": "Lots of names being thrown into the debate - Chris Lynn, Chris Jordan, Jonty Rhodes, who must still be pretty good in his 40s, Ashish Nehra (yes, him), Pollard..."}, {"ball": 19.6, "isHighlight": false, "text": "Namit: \"Kane Williamson has pulled off some outrageous catches in the slips.\""}, {"ball": 19.6, "isHighlight": false, "text": "Kush: \"Anyone else think that Faf is the best fielder in the world? Most people I speak to say AB is, but I genuinely believe Faf is better!\" Interesting debate, that would make. Any other candidates, anyone?"}, {"ball": 19.6, "isHighlight": false, "text": "$$9.30pm$$  Mumbai never really launched off, but 157 isn't a bad score. There's some help for the spinners (they might miss Ojha), and bounce for everyone. It could make for a pretty interesting chase."}, {"ball": 19.6, "isHighlight": false, "text": "Ashwin says there's definitely some help if you bowl with some over-spin, but backs Chennai's batsmen to chase it down. He would say that, of course."}], "name": "Mumbai Indians v Chennai Super Kings", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733995.html?innings=1;view=commentary", "match_num": 33}