{"commentary": [{"ball": 0, "isHighlight": false, "text": "The Chennai Super Kings openers walk out. And the comeback man Praveen Kumar has the ball."}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Smith,no run,starts with a length ball that moves away, right on off stump, defended to the off side"}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Smith,2 runs,short of length ball outside off, a seriously ugly swipe from Smith, good contact and the ball races towards deep midwicket"}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,Praveen getting the ball to curl away, but that doesn't deter Smith, who steps forward and launches that over extra cover for four"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Smith,2 runs,superb cricket this time, Praveen starts it off with an off stump delivery that is a carved away towards deep point, seemed to be headed to the boundary, but a sprinting Pollard gets his boot in the way to prevent the ball from reaching the rope"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Smith,no run,pushed to the off side this time, no run"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,moving away outside off, guided towards third man for four more, Praveen getting good shape here, but he's being taken for runs as well"}, {"ball": 0.6, "isHighlight": false, "text": "Here's Lasith Malinga"}, {"ball": 1.1, "isHighlight": false, "text": "Malinga to McCullum,no run,starts with a slow delivery, 113.4 kph, on the pads, tucked towards midwicket"}, {"ball": 1.2, "isHighlight": false, "text": "Malinga to McCullum,no run,full ball outside off, swinging away, lashed towards cover where Anderson makes a diving stop"}, {"ball": 1.3, "isHighlight": false, "text": "Malinga to McCullum,1 run,short of length ball on legstump, clipped towards square leg"}, {"ball": 1.4, "isHighlight": false, "text": "Malinga to Smith,no run,beaten outside off, full swinging delivery once more, Smith looking to drive through the off and can't get bat on it as the ball curves away"}, {"ball": 1.5, "isHighlight": false, "text": "Malinga to Smith,no run,slower one, 116.4kph, short of length and on  off, defended towards midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Malinga to Smith,1 run,full and swung away late towards off stump, batsman gets his bat down in time, jams the ball away towards mid-on for a single"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Smith,no run,Bit of away swing outside off, swipes across the line, misses."}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Smith,no run,Shortish ball, comes back in off the pitch. Tries to cut, misses."}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Smith,no run,huuuuge inswing there. This is PK at his best. The ball goes over off stump as he pulls and misses."}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to Smith,no run,Another inswinger, another swipe, another miss."}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Smith,1 run,shuffles across this time, and plays it with the swing, into the leg side."}, {"ball": 2.5, "isHighlight": false, "text": "They've brought third man into the circle. Two men out on the leg side."}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to McCullum,1 run,Inswinging yorker, McCullum gets his front foot out of the way and drives wristily to long on."}, {"ball": 2.6, "isHighlight": false, "text": "Bumrah comes in."}, {"ball": 3.1, "isHighlight": false, "text": "Bumrah to McCullum,1 leg bye,Angled down the leg side, McCullum is hit on the front pad as he tries to flick."}, {"ball": 3.2, "isHighlight": false, "text": "Bumrah to Smith,no run,Big angle in from wide of the crease. Smith is cramped for room, drops it into the leg side."}, {"ball": 3.3, "isHighlight": false, "text": "Bumrah to Smith,1 leg bye,Hit on the pad once more as he tries to whip it away to the leg side. More leg byes. Bumrah will never get an lbw with that angle."}, {"ball": 3.4, "isHighlight": false, "text": "Bumrah to McCullum, $$SIX$$ ,Two steps down the pitch and a big swing of his arms. Goes high over the long-on boundary."}, {"ball": 3.5, "isHighlight": false, "text": "Bumrah to McCullum, $$FOUR$$ ,Width, and McCullum's punished that, carving it past point off the back foot."}, {"ball": 3.5, "isHighlight": false, "text": "Sunjay: \"And THAT my kids was THE BEST over in IPL history.\" I assume he's referring to Praveen's over. Still, sliiight hyperbole, no?"}, {"ball": 3.6, "isHighlight": false, "text": "Bumrah to McCullum,1 run,Tries to drive it through the off side, but it goes off the inside half of his bat down towards mid-on."}, {"ball": 3.6, "isHighlight": false, "text": "Ayush: \"Does Bumrah's action remind anyone else of Ntini?\" The angle certainly does. Here's PK again."}, {"ball": 4.1, "isHighlight": false, "text": "Kumar to McCullum,no run,Inswing. McCullum gives himself room, but can't make enough to get anything behind the cut."}, {"ball": 4.2, "isHighlight": false, "text": "Kumar to McCullum,no run,Tries another cut. Hits it to wide mid-off."}, {"ball": 4.2, "isHighlight": false, "text": "PK seems to have shortened is run-up."}, {"ball": 4.3, "isHighlight": false, "text": "Kumar to McCullum, $$OUT$$ ,Given! McCullum is hit on the front pad as he tries to pull. That definitely looked like it was going down the leg side. You could see both middle and off stump on the replay, from straight-on."}, {"ball": 4.3, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$lbw$$ $$b$$ $$Kumar$$ $$13$$ $$(20m$$ $$11b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$118.18$$"}, {"ball": 4.3, "isHighlight": false, "text": "Raina now. UP versus UP."}, {"ball": 4.4, "isHighlight": false, "text": "Kumar to Raina,no run,Angled across towards off stump. Raina defends watchfully."}, {"ball": 4.5, "isHighlight": false, "text": "Kumar to Raina, $$FOUR$$ ,Swings, but starts from way outside leg stump, and Raina puts it away with a flick of his wrists."}, {"ball": 4.6, "isHighlight": false, "text": "Kumar to Raina,1 run,Angled across Raina again, and he pushes it down to mid-off."}, {"ball": 4.6, "isHighlight": false, "text": "Aniket: \"Only thing worse than Yuvraj's form this IPL has been the atrocious umpiring standards. That was not out and looked almost as if Umpire caved under the pressure of prolonged appeal!\""}, {"ball": 5.1, "isHighlight": false, "text": "Bumrah to Raina,1 run,put down! Short, angled across Raina, and he top-edges his pull. It hangs in the air long enough for Apoorv Wankhede to dive forward, get both hands under the ball... and drop it."}, {"ball": 5.2, "isHighlight": false, "text": "Bumrah to Smith,no run,Hits Smith on the thigh as he looks to work it into the leg side."}, {"ball": 5.3, "isHighlight": false, "text": "Bumrah to Smith,no run,Speared into the blockhole with that angle. Smith does well to jam his bat down on it."}, {"ball": 5.4, "isHighlight": false, "text": "Bumrah to Smith,1 run,shortish ball, and it's whipped away, with his front leg coming off the ground, towards deep square leg."}, {"ball": 5.5, "isHighlight": false, "text": "Bumrah to Raina,no run,yorker again, angled across Raina, and he plonks his bat down to hit it towards mid-on."}, {"ball": 5.6, "isHighlight": false, "text": "Bumrah to Raina,2 runs,Another short ball, and Raina isn't fully in control with his pull. Gets more bat on it this time, though, and Wankhede runs across to his right and stops it at the boundary."}, {"ball": 5.6, "isHighlight": false, "text": "Here's Harbhajan."}, {"ball": 6.1, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,Reverse sweep towards point."}, {"ball": 6.2, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,tossed up, bit of bounce, hits him on the midriff as he tries to sweep."}, {"ball": 6.2, "isHighlight": false, "text": "Rohan: \"Apoorva Wankhede. First cricketer with a stadium's name in his name?\""}, {"ball": 6.3, "isHighlight": false, "text": "Harbhajan Singh to Smith,1 run,Inside-edges the sweep onto the front pad this time, goes down towards short fine leg."}, {"ball": 6.3, "isHighlight": false, "text": "Around the wicket to Raina."}, {"ball": 6.4, "isHighlight": false, "text": "Harbhajan Singh to Raina,1 run,Short, lots of turn. Raina has to reach for it and cut it down to the sweeper."}, {"ball": 6.5, "isHighlight": false, "text": "Harbhajan Singh to Smith,1 run,Goes with the angle, Smith goes back and bunts it into the leg side."}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to Raina,1 run,turn again, and Raina opens his face and pushes it towards deep point."}, {"ball": 6.6, "isHighlight": false, "text": "Pollard now."}, {"ball": 7.1, "isHighlight": false, "text": "Pollard to Raina,1 wide,Wide, way down the leg side. Raina swings and misses."}, {"ball": 7.1, "isHighlight": false, "text": "Pollard to Raina, $$FOUR$$ ,superb placement. Waits on the shortish ball, opens his bat face, and hits it to the left of short third man."}, {"ball": 7.2, "isHighlight": false, "text": "Pollard to Raina,1 run,Slower-ish ball outside off, chopped towards point."}, {"ball": 7.3, "isHighlight": false, "text": "Pollard to Smith,2 runs,Shortish, widish, slowish, and Smith swats across the line to deep midwicket."}, {"ball": 7.3, "isHighlight": false, "text": "Around the wicket now."}, {"ball": 7.4, "isHighlight": false, "text": "Pollard to Smith,1 run,Swipe across the line to deep midwicket off a length ball."}, {"ball": 7.5, "isHighlight": false, "text": "Pollard to Raina, $$FOUR$$ ,Down the pitch, doesn't get anywhere near the pitch, but how does that matter when you connect so well? Hit cleanly over cover, and rolls away over the unoccupied boundary."}, {"ball": 7.6, "isHighlight": false, "text": "Pollard to Raina,1 wide,  $$OUT$$ ,he's gone, is he? Fires it down the leg side as he sees Raina stepping down the pitch. Gautam collects brilliantly down the leg side and has the bails off in a flash. Raina turned around just as quick, though, and he's got his bat in, is it? Or is it in the air when the bails come off? It's hard to tell for sure, but the third umpire seems to think there is. OUT, flashes the big screen. Brave decision, that."}, {"ball": 7.6, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$st$$ $$†Gautam$$ $$b$$ $$Pollard$$ $$19$$ $$(17m$$ $$11b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$172.72$$"}, {"ball": 7.6, "isHighlight": false, "text": "back over the wicket, as Faf walks in."}, {"ball": 7.6, "isHighlight": false, "text": "Pollard to du Plessis,no run,Wide outside off stump, but just inside the tramlines, as Faf lets it go."}, {"ball": 7.6, "isHighlight": false, "text": "Big decision that, and it leaves Chennai in a slightly difficult situation. They still have the batting to take them through, though."}, {"ball": 8.1, "isHighlight": false, "text": "Harbhajan Singh to Smith,1 run,hit on the pad as he tries to sweep, loops over the keeper's head."}, {"ball": 8.2, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,1 run,wide outside off, tossed, up, Faf goes across, and scoops it over his own head."}, {"ball": 8.3, "isHighlight": false, "text": "Harbhajan Singh to Smith,1 run,swept, misfield at short fine leg from Bumrah."}, {"ball": 8.4, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,no run,back of a length, stopped on Faf, and pops up but just short of Pollard at midwicket."}, {"ball": 8.5, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,1 run,goes back and works it away behind square leg."}, {"ball": 8.6, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,comes forward, defends carefully."}, {"ball": 9.1, "isHighlight": false, "text": "Pollard to du Plessis,no run,leg-cutter, on off, comes forward and pushes it to point."}, {"ball": 9.2, "isHighlight": false, "text": "Pollard to du Plessis,1 run,angled in, worked towards midwicket."}, {"ball": 9.2, "isHighlight": false, "text": "Pollard around the wicket now."}, {"ball": 9.3, "isHighlight": false, "text": "Pollard to Smith, $$FOUR$$ ,width, and a lot of angle to work with. Smith comes forward to this half-volley and drives it confidently in front of cover."}, {"ball": 9.4, "isHighlight": false, "text": "Pollard to Smith,no run,Ashwin-style legcutter outside leg stump. Smith swipes and misses. Ball misses leg stump, not called wide."}, {"ball": 9.5, "isHighlight": false, "text": "Pollard to Smith, $$FOUR$$ ,swats it behind square on the leg side. Ball turned in his hands a little bit, but it still went away in a hurry."}, {"ball": 9.6, "isHighlight": false, "text": "Pollard to Smith, $$SIX$$ ,in his slot, and Smith takes a step forward and launches it over the bowler's head and way back beyond the straight boundary. Poor ball from Pollard, gave the batsman a lot of room to swing his arms."}, {"ball": 9.6, "isHighlight": false, "text": "The Wankhede Stadium, for all you people wondering about Apoorv Wankhede, was named after SK Wankhede, a politician and former BCCI president. There's an awesome chapter about the feud between the Bombay (now Mumbai) Cricket Association and the Cricket Club of India that led to the stadium's construction, and to the Brabourne falling out of regular use, in this book called 'Sightlines - A Stadium Odyssey', by Simon Inglis."}, {"ball": 10.1, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,1 run,back of a length, flat, defended."}, {"ball": 10.2, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,tries to sweep, gets hit high on the pad."}, {"ball": 10.3, "isHighlight": false, "text": "Harbhajan Singh to Smith,1 run,swept high in the air, but drops short of deep square leg."}, {"ball": 10.4, "isHighlight": false, "text": "Harbhajan Singh to du Plessis, $$FOUR$$ ,short, and Faf gives himself some room and slaps it in front of point."}, {"ball": 10.5, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,1 run,worked away in front of the backward square leg fielder"}, {"ball": 10.6, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,tossed up, not too much turn. Smith goes deep in his crease to defend."}, {"ball": 10.6, "isHighlight": false, "text": "Malinga is back now."}, {"ball": 11.1, "isHighlight": false, "text": "Malinga to du Plessis,1 run,shortish slower ball outside off, cut away to deep point."}, {"ball": 11.2, "isHighlight": false, "text": "Malinga to Smith,no run,full, almost a yorker, tailed in a bit, and Smith falls away a touch as he flicks to midwicket."}, {"ball": 11.2, "isHighlight": false, "text": "Kuldeep: \"Pollard's bowling has been abysmal this IPL. He has bowled 15.3 overs so far across the 8 games including this one and given away 163 runs at 10.51 having taken only 1 wicket, that of Raina today, which was a close call anyways!!!\""}, {"ball": 11.3, "isHighlight": false, "text": "Malinga to Smith,1 run,Slower ball, tucked into the leg side off the back foot."}, {"ball": 11.4, "isHighlight": false, "text": "Malinga to du Plessis,no run,searches for the yorker, and it's a low full-toss that he flicks to midwicket."}, {"ball": 11.5, "isHighlight": false, "text": "Malinga to du Plessis,1 run,full, in the blockhole, pushed down to long-on."}, {"ball": 11.6, "isHighlight": false, "text": "Malinga to Smith,no run,wide, full, driven hard and fielded well by Harbhajan at cover."}, {"ball": 11.6, "isHighlight": false, "text": "SK Wankhede, as some commenters are reminding me, was also a speaker in the Maharashtra assembly."}, {"ball": 12.1, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,no run,tossed up, bit of bounce as Faf comes down the track, is hit on the gloves and it drops down in front of him."}, {"ball": 12.2, "isHighlight": false, "text": "Harbhajan Singh to du Plessis,1 run,back in his crease to tuck it behind square on the leg side."}, {"ball": 12.3, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,turn, bounce, and it hits Smith on his thigh as he tries to pull."}, {"ball": 12.4, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,tries to sweep from outside off, misses, is hit on the midriff."}, {"ball": 12.4, "isHighlight": false, "text": "Harbhajan slowing it down well to exploit the bounce."}, {"ball": 12.5, "isHighlight": false, "text": "Harbhajan Singh to Smith,no run,he tries to reverse-sweep this time, and misses again. The ball hits him on the flap of the pad."}, {"ball": 12.6, "isHighlight": false, "text": "Harbhajan Singh to Smith, $$SIX$$ ,he only had to connect once for this to become a decent over, and he does. Slog swept way over deep midwicket."}, {"ball": 12.6, "isHighlight": false, "text": "Corey Anderson comes on."}, {"ball": 13.1, "isHighlight": false, "text": "Anderson to du Plessis,2 runs,full, wide, driven to the off-side sweeper."}, {"ball": 13.2, "isHighlight": false, "text": "Anderson to du Plessis,1 run,short, wide, hit over the off side and bounces to deep cover."}, {"ball": 13.3, "isHighlight": false, "text": "Anderson to Smith,no run,was that a slower ball? Maybe. Just misses off stump as Smith swings and misses."}, {"ball": 13.4, "isHighlight": false, "text": "Anderson to Smith,1 bye,this was definitely a slower ball, and Smith swings and misses once more. Rolls down to Gautam, whose fumble allows them to sneak a bye."}, {"ball": 13.5, "isHighlight": false, "text": "Anderson to du Plessis, $$SIX$$ ,fuller this time, and Faf launches it high and straight. Drops just beyond the sightscreen."}, {"ball": 13.5, "isHighlight": false, "text": "Gautam comes up to the stumps now"}, {"ball": 13.6, "isHighlight": false, "text": "Anderson to du Plessis,2 runs,straight, back of a length, tucked into the leg side."}, {"ball": 13.6, "isHighlight": false, "text": "Time-out now. Six overs to go, 54 to get from 36. You'd have to say Chennai are favourites. Malinga's two remaining overs, to state the obvious, will be crucial. Back comes Bumrah now."}, {"ball": 13.6, "isHighlight": false, "text": "Aniket: \"Mumbai lacks a proper bowling all rounder.. the main problem for MI is the lack of proper fifth bowler.. every time the remaining four bowlers bowl well, the combination of part time bowlers as the fifth one take game away from them.. they need to sort it out!\""}, {"ball": 14.1, "isHighlight": false, "text": "Bumrah to Smith,1 run,Slower ball, and Smith doesn't quite hit it cleanly, which is a good thing since it drops well short of long-on."}, {"ball": 14.2, "isHighlight": false, "text": "Bumrah to du Plessis,1 run,Shortish, angled in, no room to do anything but pull it down to long-on."}, {"ball": 14.2, "isHighlight": false, "text": "ukri: \"Dhoni's decision in the last match is getting proved right again. After a freak bowling incident which costed them 230 runs against KXIP, he decided to not to chase it down, instead gave FAF some batting practice. An in-form FAF is better for CSK rather than a hard go at an improbable win in that match.\""}, {"ball": 14.3, "isHighlight": false, "text": "Bumrah to Smith,no run,Slower ball, shortish, Smith goes hard at it but can only hit it straight to cover."}, {"ball": 14.4, "isHighlight": false, "text": "Bumrah to Smith,2 runs,slower ball again, and Smith goes across his stumps and beats short fine leg with a leg glance. Deep square leg comes around to make a diving stop."}, {"ball": 14.5, "isHighlight": false, "text": "Bumrah to Smith,no run,full toss, hammered down the ground,  Bumrah does well to reverse the momentum of his follow-through and stop that."}, {"ball": 14.6, "isHighlight": false, "text": "Bumrah to Smith, $$FOUR$$ ,length ball, well outside off, and Smith somehow swats it across, with a lot of bottom hand, to find the gap to the left of deep square leg. Top shot."}, {"ball": 14.6, "isHighlight": false, "text": "Here's PK. This is his final over."}, {"ball": 15.1, "isHighlight": false, "text": "Kumar to du Plessis,1 run,Full, outside off. Faf walks across and flicks it to deep backward square leg."}, {"ball": 15.2, "isHighlight": false, "text": "Kumar to Smith, $$SIX$$ ,Length ball, and Smith moves back and across to allow the big swing across the line. Harbhajan at deep midwicket leaps high in the air, but can't get more than a fingertip on it as it swings away from him."}, {"ball": 15.3, "isHighlight": false, "text": "Kumar to Smith, $$OUT$$ ,same shot, different result. Doesn't get as much behind it this time, and it drops to Simmons, who juggles it and takes it on the third attempt."}, {"ball": 15.3, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Simmons$$ $$b$$ $$Kumar$$ $$57$$ $$(73m$$ $$51b$$ $$5x4$$ $$3x6)$$ $$SR:$$ $$111.76$$"}, {"ball": 15.3, "isHighlight": false, "text": "In comes Dhoni now. It's Faf on strike, though."}, {"ball": 15.4, "isHighlight": false, "text": "Kumar to du Plessis, $$FOUR$$ ,full toss, with a bit of late away-swing, and Faf gets a thick edge past the keeper as he slashes hard at it."}, {"ball": 15.5, "isHighlight": false, "text": "Kumar to du Plessis,1 run,slower ball, Faf waits an age before pulling it to deep square leg."}, {"ball": 15.6, "isHighlight": false, "text": "Kumar to Dhoni,1 leg bye,Angled down the leg side, hits Dhoni on the pad as he misses the flick."}, {"ball": 15.6, "isHighlight": false, "text": "Malinga now."}, {"ball": 15.6, "isHighlight": false, "text": "Cheeky from Hari: \"So finally CSK losing their first wicket\""}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Dhoni,1 wide,starts off with a short ball that slides down the leg side"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Dhoni,1 run,short, angled in towards off stump. Dhoni cuts it to deep point."}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to du Plessis,1 run,slower ball, forced in front of point off the back foot."}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Dhoni,1 run,full and wide, Dhoni plays a checked drive in front of cover."}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to du Plessis, $$OUT$$ ,what a ball! slower ball, right up in the blockhole. It hits the base of the stumps, in fact, after dipping under Faf's flailing bat. It seemed to hang in the air before dipping at the last moment."}, {"ball": 16.4, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$b$$ $$Malinga$$ $$31$$ $$(41m$$ $$24b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$129.16$$"}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Jadeja,2 leg byes,whoa, there. slower ball, drops on a full length, turns like an offcutter and hits Jadeja low on the pad. Big appeal, not given. Runs away down to third man, where Praveen fumbles. That looked to be hitting the stumps."}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Jadeja,no run,short ball, defended towards square leg, direct hit at the keeper's end, but no overthrows."}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Dhoni,1 run,angled in, and Dhoni knocks it down to long-on."}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to Jadeja, $$FOUR$$ ,Short, sits up, pulled past midwicket."}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to Jadeja,1 run,Short ball, dropped down towards midwicket."}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Dhoni,2 runs,slower ball, short, chopped down to long-off."}, {"ball": 17.4, "isHighlight": false, "text": "Vignesh: \"I m a CSK fan, and would still say that's plum out. The only chance that can't be out is a touch of bat, but the umpire proved his \"brilliiance\" by signalling leg-bye. \""}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Dhoni,1 wide,short, big angle from wide of the crease, and Dhoni smartly walks across and gets a wide down the leg side."}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Dhoni,1 run,low full toss outside off, steered towards deep point."}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Jadeja,no run,tries to come forward and play the square drive, hits it straight to backward point."}, {"ball": 17.6, "isHighlight": false, "text": "17 from 12. CSK still favourites. It might have been much more difficult had the umpire given Jadeja out, though. Here's Malinga again."}, {"ball": 18.1, "isHighlight": false, "text": "Malinga to Dhoni,1 run,low full-toss, poked down to long-on."}, {"ball": 18.2, "isHighlight": false, "text": "Malinga to Jadeja,1 run,Low full-toss, outside off, and Jadeja pushes it to deep point."}, {"ball": 18.3, "isHighlight": false, "text": "Malinga to Dhoni,2 runs,slower ball, full, outside off. Steered away to deep cover."}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Dhoni,1 run,Full and straight, Dhoni uses his wrists to hit it straight back but Malinga gets his right boot across to make a good stop."}, {"ball": 18.5, "isHighlight": false, "text": "Malinga to Jadeja, $$OUT$$ ,got him! widish yorker, and Jadeja inside-edges it onto his stumps as he tries to chop down on it and take a single into the off side."}, {"ball": 18.5, "isHighlight": false, "text": "$$RA$$ $$Jadeja$$ $$b$$ $$Malinga$$ $$6$$ $$(13m$$ $$7b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$85.71$$"}, {"ball": 18.5, "isHighlight": false, "text": "12 off 7. Mithun Manhas comes in. This won't be easy."}, {"ball": 18.6, "isHighlight": false, "text": "Malinga to Manhas,1 run,  $$OUT$$ ,he's gone! inswinging yorker, inside-edged to fine leg. They take on PK's arm, and it isn't the best throw, on the bounce to Gautam, but he still manages to get the bails off before Manhas can slide in. It's in the air, moreover, as it crosses the crease. Third umpire takes a long time, but finally gives it out."}, {"ball": 18.6, "isHighlight": false, "text": "$$M$$ $$Manhas$$ $$run$$ $$out$$ $$1$$ $$(3m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "Chennai have lost another, but Dhoni's on strike for the start of this over. It's Pollard to defend 11 from the last over. Ashwin's come in, by the way."}, {"ball": 19.1, "isHighlight": false, "text": "Pollard to Dhoni,1 wide,baaaad ball to start with. Tries to aim for the tramlines, and gets it horribly wrong. It's short and waaay outside off."}, {"ball": 19.1, "isHighlight": false, "text": "Pollard to Dhoni,2 runs,wide again, Dhoni cuts it, Anderson runs to his right from deep point, has to run around it to throw with his left arm. Dhoni makes his ground as he sprints back for the second."}, {"ball": 19.1, "isHighlight": false, "text": "Dhoni was running right down the middle of the pitch there, but what would YOU do under the circumstances?"}, {"ball": 19.2, "isHighlight": false, "text": "Pollard to Dhoni, $$SIX$$ ,slower ball, length ball, outside off. Dhoni swings hard across the line, and it goes flat but still clears deep midwicket comfortably."}, {"ball": 19.3, "isHighlight": false, "text": "Pollard to Dhoni, $$FOUR$$ ,short, wide, slapped away in typical Dhoni fashion. The off-side fielders had come into the circle with just two needed, and this went just wide of Harbhajan at extra cover. Rohit Sharma kicks out in frustration."}, {"ball": 19.3, "isHighlight": false, "text": "$$11.50pm$$  That's all from us today. Many thanks for staying tuned and sending in your comments. Make sure you read the  $$Plays$$ $$of$$ $$the$$ $$Day$$  from a highly eventful match, and also the full report, once it's up."}, {"ball": 19.3, "isHighlight": false, "text": "$$11.45pm$$  Presentation time. Here's Dhoni: It's a fantastic pitch to bat on, he says, but the ball stopped a bit early on and became easier for CSK with the dew. Praises Smith for batting more patiently, recognising his strong areas, and capitalising on them. Says Mumbai \"misread the wicket\" in playing only one spinner."}, {"ball": 19.3, "isHighlight": false, "text": "Dwayne Smith: \"I'm just trying to stay as consistent as I can. I thought they bowled very well up front, especially Harbhajan, just had to stay out there and get as much as I could.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$11.40pm$$  Lots of people saying Rohit should have kept Malinga for the last over. But Chennai had 11 to get from that last over, with two fewer wickets in hand, only because Malinga bowled such a good 19th over."}, {"ball": 19.3, "isHighlight": false, "text": "This, incidentally, is Chennai Super Kings' first win at the Wankhede against Mumbai."}, {"ball": 19.3, "isHighlight": false, "text": "Chennai kept Mumbai down to 157, but it wasn't a bad score on a pitch with some turn and bounce in it. They lost a couple of wickets to questionable decisions, but Dwayne Smith and Faf du Plessis kept them on track right through before Lasith Malinga did what he does best to drag Mumbai back into the match. Chennai, though, still had Dhoni, and that in the end was enough for them, as it has so often been. It might have been a lot closer had Mumbai's fifth bowler done a better job for them. Stay tuned for the presentation."}], "name": "Mumbai Indians v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733995.html?innings=2;view=commentary", "match_num": 33}