{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.00pm$$  Alright then. Nigel Llong and CK Nandan walk into the middle, followed by the Kolkata players, who immediately get into a huddle. It's going to be Virender Sehwag on strike for Kings XI, and Jacques Kallis to take the new ball. Mandeep Singh is at the non-striker's end."}, {"ball": 0, "isHighlight": false, "text": "Joker: \"Drop a player with the best strike rate and second best average with the bat and best economy rate with the ball this season in your team. KKR has done what the doctor will never order.\""}, {"ball": 0, "isHighlight": false, "text": "\"Does anybody have any idea about weather?\" Everyone's saying it's extremely hot in Cuttack, Teja."}, {"ball": 0, "isHighlight": false, "text": "$$3.45pm$$  Team news, finally. Punjab have left out Shivam Sharma and L Balaji for Awana and Rishi Dhawan."}, {"ball": 0, "isHighlight": false, "text": "\"Why on earth would they drop Shakib after 4-0-13-4? Bewildered at strategies of IPL teams? \" It was 4-0-13-1, Neeraj."}, {"ball": 0, "isHighlight": false, "text": "Dave: \"Maxwell has been uncomfortable with quick short balls at the start of his innings. Would not be surprised to see Morkel bowl at him. If he gets through that, his and Miller's battle with Narine will be crucial to this match. \""}, {"ball": 0, "isHighlight": false, "text": "$$3.35pm$$  It's heads, and that means Kolkata Knight Riders have won the toss. They've chosen to field first. Kolkata have made two changes, bringing in Morne Morkel for Shakib Al Hasan and Piyush Chawla for Vinay Kumar."}, {"ball": 0, "isHighlight": false, "text": "Parvinder Awana and Rishi Dhawan return for Kings XI Punjab, George Bailey says, but he doesn't mention who they replace. Watch this space."}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm$$  While you wait for the toss, why not read this feature on the Kings XI offspinner  $$Shivam$$ $$Sharma$$ , who came out of nowhere and bowled so impressively on his debut against Bangalore? Apparently, he bats as well as he bowls."}, {"ball": 0, "isHighlight": false, "text": "$$3.25pm$$  Hello and welcome to the ball-by-ball coverage of this Sunday afternoon game from Cuttack. Kolkata Knight Riders won their last game against Delhi Daredevils after a run of four straight defeats, but they now run into a red-hot Kings XI Punjab line-up that will cast a greedy eye at the Barabati Stadium's short boundaries. How will Glenn Maxwell go against Sunil Narine? For more, read this  $$preview$$ by Devashish Fuloria."}, {"ball": 0.1, "isHighlight": false, "text": "Kallis to Sehwag, $$FOUR$$ ,Full and wide, and Sehwag comes forward and flays it through the covers. Poor ball to start with."}, {"ball": 0.2, "isHighlight": false, "text": "Kallis to Sehwag,no run,Wide again, but he's pulled his length back a touch, and Sehwag is beaten playing the same shot."}, {"ball": 0.3, "isHighlight": false, "text": "Kallis to Sehwag,1 wide,bangs it in short, angles it in, and Sehwag lets it pass outside leg."}, {"ball": 0.3, "isHighlight": false, "text": "Kallis to Sehwag, $$FOUR$$ ,drifts onto the pads again. It's full, not that quick, and Sehwag flicks it away easily past square leg."}, {"ball": 0.4, "isHighlight": false, "text": "Kallis to Sehwag,no run,better line, better length. In the corridor, and Sehwag goes back to defend."}, {"ball": 0.5, "isHighlight": false, "text": "Kallis to Sehwag, $$FOUR$$ ,Could have been another wide, but Sehwag walks across and half-pulls, half-helps it away behind square for another four. Poor start from Kallis."}, {"ball": 0.6, "isHighlight": false, "text": "Kallis to Sehwag, $$FOUR$$ ,drifts onto leg again, and Sehwag's glance easily beats short fine leg."}, {"ball": 0.6, "isHighlight": false, "text": "That was the second-most expensive first over this season. Most expensive was Maxwell bowling to Gayle in Dubai. That over went for 20. Here's Morkel."}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Mandeep Singh,no run,Full, angled in, flicked towards midwicket."}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Mandeep Singh,no run,Angled in onto a good length outside off. Mandeep stretches forward to defend."}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Mandeep Singh, $$OUT$$ ,he's gone. Slightly shorter than the previous ball, straightened a touch perhaps, Mandeep tries to square-cut off the front foot, and gets a thick edge to the keeper."}, {"ball": 1.3, "isHighlight": false, "text": "$$Mandeep$$ $$Singh$$ $$c$$ $$†Uthappa$$ $$b$$ $$Morkel$$ $$0$$ $$(6m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 1.3, "isHighlight": false, "text": "In comes Saha now. Maxwell fans will have to wait."}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Saha,no run,Full, almost in the blockhole, on off stump. Saha defends with a straight bat."}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Saha,no run,beauty. Saha pokes at this, playing the inward angle, and it straightens off the pitch and beats him. Extra bounce as well."}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Saha, $$FOUR$$ ,short, wide, crashed away to the point boundary."}, {"ball": 1.6, "isHighlight": false, "text": "Umesh Yadav replaces Kallis."}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to Sehwag,2 runs,drifts onto middle and leg, and Sehwag flicks it past midwicket, but doesn't hit it all that well."}, {"ball": 2.2, "isHighlight": false, "text": "UT Yadav to Sehwag, $$FOUR$$ ,full, and way down the leg side. How can you bowl like that with fine leg in the circle? Sehwag sends it screaming away with a flick of his wrists."}, {"ball": 2.3, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,Full, on off stump. Sehwag opens his face and tries to place it past point, but finds the fielder instead."}, {"ball": 2.3, "isHighlight": false, "text": "Umesh ran in too early. Sehwag wasn't ready, and the umpire stops the bowler."}, {"ball": 2.4, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,leg-stump yorker, flicked to midwicket."}, {"ball": 2.5, "isHighlight": false, "text": "UT Yadav to Saha,1 run,short ball, Saha saw the width but had to change his stroke hurriedly as it came back in off the pitch. Opens the face and runs it to third man."}, {"ball": 2.6, "isHighlight": false, "text": "UT Yadav to Sehwag,1 leg bye,drifts down the leg side again, and Sehwag might have missed out there. Hits him low on the front pad."}, {"ball": 2.6, "isHighlight": false, "text": "KKRFan: \"Seems like KKR bowlers think that the stumps are 6 inches towards the leg side.\""}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Sehwag,no run,good length, just outside off, Sehwag lets it go."}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Sehwag, $$FOUR$$ ,Uthappa drops it! Sehwag pushed lazily forward and poked at this outside off. It left him and took a thick edge. Uthappa dives and gets the edge of his glove to it, but he seemed to move a little late."}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Sehwag,no run,good ball again. Full, but not on a driving length, outside off, and it beats Sehwag with bounce as he throws his bat at it."}, {"ball": 3.3, "isHighlight": false, "text": "Morkel's bowling a lovely length here. Slightly fuller than his natural length."}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Sehwag,no run,back of a length, outside off. Sehwag lets it go."}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Sehwag,no run,Angled in this time, and Sehwag has to bring his bat down quickly. It hits his front pad just outside off, just before hitting his bat. Muted appeal from Morkel."}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Sehwag,1 run,full, on middle and leg, flicked to midwicket."}, {"ball": 3.6, "isHighlight": false, "text": "Amogh: \"See! I had told you. His glasses work only on the leg side\""}, {"ball": 4.1, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,Full, wide, Saha doesn't get across, gets it away off the toe-end to third man."}, {"ball": 4.2, "isHighlight": false, "text": "UT Yadav to Saha,1 run,short, on off, Saha swivels to pull, and the ball goes miles in the air before dropping between the keeper and short fine leg. Uthappa chased it, but it was probably closer to Sunil Narine at short fine."}, {"ball": 4.3, "isHighlight": false, "text": "UT Yadav to Sehwag,1 wide,slower ball, down the leg side again. What is this, Umesh?"}, {"ball": 4.3, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,Angled in to middle-and-off on a good length, pushed towards mid on."}, {"ball": 4.4, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,short, angling down the leg side, Saha crouches a bit and pulls it away to the left of Narine, who makes little effort to dive or chase."}, {"ball": 4.5, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,full, wide, slapped over cover, and it bounces away towards the vacant boundary."}, {"ball": 4.6, "isHighlight": false, "text": "UT Yadav to Saha,1 run,full, on off stump, angling in, Saha comes forward and knocks it wristily to mid-on."}, {"ball": 4.6, "isHighlight": false, "text": "Lots of people sending in comments about Sehwag entering the \"nervous 30s\" He's been out in the 30s five times this season, and was out for exactly 30 in his last two innings."}, {"ball": 5.1, "isHighlight": false, "text": "Morkel to Saha, $$OUT$$ ,Got him! back of a length, angling in. Saha tries to chop it into the off side, but only gets an inside-edge onto the stumps."}, {"ball": 5.1, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$b$$ $$Morkel$$ $$15$$ $$(19m$$ $$9b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$166.66$$"}, {"ball": 5.1, "isHighlight": false, "text": "They've called for the time-out. Saha was just beginning to look good, but Morkel was also threatening to get someone out. There was a bit of inward movement off the pitch as well, and Saha poked at it without really moving across."}, {"ball": 5.1, "isHighlight": false, "text": "Maxwell time, people."}, {"ball": 5.2, "isHighlight": false, "text": "Morkel to Maxwell,no run,back of a length outside off, Maxwell wafts at it and is beaten."}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Maxwell,1 run,flicked to deep square leg, from outside off, with an extravagant follow-through."}, {"ball": 5.4, "isHighlight": false, "text": "Morkel to Sehwag,no run,back of a length, outside off, goes past Sehwag's bat as he opens his face and tries to run it square."}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Sehwag,no run,drifts onto Sehwag's pads, and Ten Doeschate saves what could have been a boundary, diving to his left at midwicket."}, {"ball": 5.6, "isHighlight": false, "text": "Morkel to Sehwag,no run,angles in towards middle. Sehwag stays next to the line and pushes it to mid-off."}, {"ball": 5.6, "isHighlight": false, "text": "Maxwell versus Narine is about to happen now."}, {"ball": 6.1, "isHighlight": false, "text": "Narine to Maxwell,1 run,turns in from outside off, flicked to deep square leg."}, {"ball": 6.2, "isHighlight": false, "text": "Narine to Sehwag,1 run,another offbreak, straighter this time, worked behind square."}, {"ball": 6.3, "isHighlight": false, "text": "Narine to Maxwell,1 run,straightens outside off, and Maxwell cuts it to deep point."}, {"ball": 6.4, "isHighlight": false, "text": "Narine to Sehwag,1 run,full, on middle stump, Sehwag pushes it to long on."}, {"ball": 6.5, "isHighlight": false, "text": "Narine to Maxwell,no run,carrom ball outside off, Maxwell slogs and misses."}, {"ball": 6.6, "isHighlight": false, "text": "Narine to Maxwell,no run,even more turn this time, away from the batsman again. Maxwell comes forward, pushes at it, misses by a long way."}, {"ball": 7.1, "isHighlight": false, "text": "Kallis to Sehwag,no run,slower ball outside off. Sehwag tries the cute dab to third man, misses."}, {"ball": 7.2, "isHighlight": false, "text": "Kallis to Sehwag,1 run,another slower ball, Sehwag lofts it high and straight. Ten Doeschate runs to his right from mid-off, makes a sprawling dive, but it falls just out of reach."}, {"ball": 7.3, "isHighlight": false, "text": "Kallis to Maxwell,1 run,short, pulled to deep square leg."}, {"ball": 7.4, "isHighlight": false, "text": "Kallis to Sehwag,no run,ball moves away after pitching, from well outside off. Sehwag slashes without moving his feet, doesn't connect."}, {"ball": 7.5, "isHighlight": false, "text": "Kallis to Sehwag, $$SIX$$ ,slower ball, just outside off, Viru picks it up early and launches it over the long-off boundary."}, {"ball": 7.6, "isHighlight": false, "text": "Kallis to Sehwag,1 run,length ball, outside off, Sehwag waits on it and dabs it to third man."}, {"ball": 7.6, "isHighlight": false, "text": "Aditya Mandalem, who's clearly a Douglas Adams fan: \"So, Narine and 42 are the answers to biggest questions ever. Well, one of those questions is not so big. The other is - Who can keep Maxwell at the crease but still keep him calm?\""}, {"ball": 8.1, "isHighlight": false, "text": "Narine to Sehwag, $$FOUR$$ ,bit of bounce here, and Sehwag gets a thick outside edge as he pushes uncertainly at it. Runs away for four to the third man region."}, {"ball": 8.2, "isHighlight": false, "text": "Narine to Sehwag,2 runs,length ball, angling towards leg, flicked in front of square, and Sehwag does well to run two."}, {"ball": 8.3, "isHighlight": false, "text": "Narine to Sehwag,1 run,full, angled in, worked away with a bit of wrist to long-on."}, {"ball": 8.4, "isHighlight": false, "text": "Narine to Maxwell,1 run,shortish ball, goes straight on with the angle after pitching, Maxwell wrists it down to long-on."}, {"ball": 8.5, "isHighlight": false, "text": "Narine to Sehwag,1 run,length ball outside off, opens his face and pushes it to deep point."}, {"ball": 8.6, "isHighlight": false, "text": "Narine to Maxwell,2 runs,straightens, Maxwell's bottom hand comes off as he chips it over cover. May have been looking to hit it straighter."}, {"ball": 9.1, "isHighlight": false, "text": "Kallis to Sehwag,1 run,Kallis gets another ball to straighten. Sehwag was looking to flick off the back foot. It loops to the bowler's left off his leading edge."}, {"ball": 9.2, "isHighlight": false, "text": "Kallis to Maxwell, $$FOUR$$ ,risky, gets away with it. length ball outside off, and he slogs it hard and flat, bounces just short of Yusuf at long on and goes over the rope."}, {"ball": 9.3, "isHighlight": false, "text": "Kallis to Maxwell,1 run,full, wide outside off, Maxwell slogs it to long-on."}, {"ball": 9.3, "isHighlight": false, "text": "Amogh: \"An innings that would have been termed as a \"Normal Sehwag Innings\" is now being looked at with awe and admiration. Such is the weight of past failures on Viru's reputation.\""}, {"ball": 9.4, "isHighlight": false, "text": "Kallis to Sehwag,1 run,length ball, just outside off, Sehwag flicks on the jump, to deep midwicket, in that typically Sehwag-ish manner and walks the single that gets him his half-century."}, {"ball": 9.5, "isHighlight": false, "text": "Kallis to Maxwell,1 run,full toss, punched away to the left of long-off."}, {"ball": 9.5, "isHighlight": false, "text": "Kumar: \"@Aditya Mandalem : We will know that the ultimate answer is still 42, when Narine goes for 42 runs in his 4 overs today. \""}, {"ball": 9.6, "isHighlight": false, "text": "Kallis to Sehwag, $$FOUR$$ ,slower ball, outside off, and it looked like Sehwag was only looking for the single to third man, but that open-faced slice is timed so well it races to the boundary well in front of the fielder."}, {"ball": 9.6, "isHighlight": false, "text": "Danish: \"Kallis has to make up with the bat tonight. He's playing in place of the in-form Shakib who has done much better than him in all departments. I thought KKR made a wrong decision then, and I still do. But I sincerely hope that Kallis will prove me wrong.\""}, {"ball": 9.6, "isHighlight": false, "text": "Chawla now."}, {"ball": 10.1, "isHighlight": false, "text": "Chawla to Maxwell,1 run,flighted onto middle stump, Maxwell flicks it to deep midwicket."}, {"ball": 10.2, "isHighlight": false, "text": "Chawla to Sehwag,1 run,flighted legbreak outside off, bit of turn, and Sehwag swats it wide of long-on."}, {"ball": 10.3, "isHighlight": false, "text": "Chawla to Maxwell, $$OUT$$ ,and he's gone. This won't be Maxwell's day. slog-sweeps uppishly, straight to Morne Morkel on the deep square leg boundary."}, {"ball": 10.3, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Morkel$$ $$b$$ $$Chawla$$ $$14$$ $$(24m$$ $$14b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 10.3, "isHighlight": false, "text": "David Miller comes in."}, {"ball": 10.4, "isHighlight": false, "text": "Chawla to Miller,1 run,another loopy delivery, on middle-and-off, worked away towards midwicket."}, {"ball": 10.5, "isHighlight": false, "text": "Chawla to Sehwag,1 run,that wasn't too short, but Sehwag tries to pull anyway, and top-edges it loopily over the bowler's head."}, {"ball": 10.5, "isHighlight": false, "text": "Chawla goes around the wicket."}, {"ball": 10.6, "isHighlight": false, "text": "Chawla to Miller,1 run,Outside off, a touch short, but deep point is in place to cut off the cut."}, {"ball": 10.6, "isHighlight": false, "text": "Ten Doeschate comes on now."}, {"ball": 11.1, "isHighlight": false, "text": "ten Doeschate to Miller,no run,gentle offcutter, and Miller is looking for the cut but is so early on it that he hits it on his follow-through, down to the bowler"}, {"ball": 11.2, "isHighlight": false, "text": "ten Doeschate to Miller,1 run,short, wide, chopped away to the sweeper on the off side."}, {"ball": 11.3, "isHighlight": false, "text": "ten Doeschate to Sehwag, $$FOUR$$ ,length ball, outside off, Sehwag clears his front leg slightly and tees off over the bowler's head."}, {"ball": 11.4, "isHighlight": false, "text": "ten Doeschate to Sehwag,no run,tries to pull, comes in off the pitch and keeps a bit low, hits him on the pad. Going down."}, {"ball": 11.5, "isHighlight": false, "text": "ten Doeschate to Sehwag,no run,gives himself room to slash through the off side, is beaten."}, {"ball": 11.6, "isHighlight": false, "text": "ten Doeschate to Sehwag,1 run,back of a length outside off, heaved to long-on."}, {"ball": 11.6, "isHighlight": false, "text": "Rajat B: \"KKR the solution to SUPER-MAX - 29 runs in 28 balls in two matches. Morkel playing his bit as well - first bowled him and now catches him\""}, {"ball": 12.1, "isHighlight": false, "text": "Chawla to Sehwag,1 run,short, outside leg, pulled to the left of deep square leg."}, {"ball": 12.1, "isHighlight": false, "text": "around the wicket to Miller"}, {"ball": 12.2, "isHighlight": false, "text": "Chawla to Miller,no run,turns in from outside off, tries to flick it hard to long-on, but Chawla dives to his left and cuts it off."}, {"ball": 12.3, "isHighlight": false, "text": "Chawla to Miller,2 runs,swept hard, but well stopped by Kallis on the slide after running to his right from fine leg."}, {"ball": 12.4, "isHighlight": false, "text": "Chawla to Miller,1 run,short, but no width, chopped to deep point."}, {"ball": 12.5, "isHighlight": false, "text": "Chawla to Sehwag,1 run,slow, loopy, on off stump, checked drive into the covers."}, {"ball": 12.5, "isHighlight": false, "text": "back over the wicket now."}, {"ball": 12.6, "isHighlight": false, "text": "Chawla to Miller,1 run,cuts again, but is cramped for room, goes rolling down to deep point."}, {"ball": 12.6, "isHighlight": false, "text": "The time-out comes to an end, and Morkel has the ball for his final over."}, {"ball": 13.1, "isHighlight": false, "text": "Morkel to Miller,no run,In the blockhole, on off stump, steered to point."}, {"ball": 13.2, "isHighlight": false, "text": "Morkel to Miller,1 run,Miller steps down the pitch, and is squared up by the angle, edges this ball behind point."}, {"ball": 13.3, "isHighlight": false, "text": "Morkel to Sehwag, $$FOUR$$ ,full, drifting onto leg stump, and Sehwag tickles it fine."}, {"ball": 13.4, "isHighlight": false, "text": "Morkel to Sehwag, $$FOUR$$ ,length ball, outside off. Sehwag was possibly trying to steer it towards point, gets a thick edge that flies away fine."}, {"ball": 13.5, "isHighlight": false, "text": "Morkel to Sehwag,1 run,short ball outside off, Sehwag jumps and drops it down towards the off side."}, {"ball": 13.6, "isHighlight": false, "text": "Morkel to Miller,no run,full, no room for Miller, punches it off the front foot to cover."}, {"ball": 14.1, "isHighlight": false, "text": "Chawla to Sehwag,no run,flighted, outside off. Sehwag makes room, but gets an inside edge that rolls past leg stump."}, {"ball": 14.2, "isHighlight": false, "text": "Chawla to Sehwag,no run,tries to make room again, but hits it straight to point."}, {"ball": 14.3, "isHighlight": false, "text": "Chawla to Sehwag, $$OUT$$ ,whoops. Sehwag comes down the track this time, slogs, and inside edges onto off stump."}, {"ball": 14.3, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$b$$ $$Chawla$$ $$72$$ $$(71m$$ $$50b$$ $$11x4$$ $$1x6)$$ $$SR:$$ $$144.00$$"}, {"ball": 14.3, "isHighlight": false, "text": "Bailey walks in."}, {"ball": 14.4, "isHighlight": false, "text": "Chawla to Bailey,1 run,tossed up towards middle, Bailey works it down to long-on."}, {"ball": 14.5, "isHighlight": false, "text": "Chawla to Miller,1 run,pushed to long-off with a straight bat. Full ball just outside off."}, {"ball": 14.6, "isHighlight": false, "text": "Chawla to Bailey,2 runs,tossed up again, outside off, and Bailey walks across his crease to flick it into the square leg area."}, {"ball": 14.6, "isHighlight": false, "text": "Umesh now."}, {"ball": 15.1, "isHighlight": false, "text": "UT Yadav to Miller, $$FOUR$$ ,angled across, bit of width, and Miller slaps it hard through cover point."}, {"ball": 15.2, "isHighlight": false, "text": "UT Yadav to Miller, $$OUT$$ ,got him! that was an offcutter, and it sneaked between bat and pad as Miller played across it. Crashed into middle stump."}, {"ball": 15.2, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$b$$ $$UT$$ $$Yadav$$ $$13$$ $$(24m$$ $$14b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$92.85$$"}, {"ball": 15.2, "isHighlight": false, "text": "In comes Rishi Dhawan."}, {"ball": 15.3, "isHighlight": false, "text": "UT Yadav to Dhawan,1 run,full, outside off, slashed off the front foot behind square."}, {"ball": 15.4, "isHighlight": false, "text": "UT Yadav to Bailey,1 run,full ball, angled in from outside off, pushed to wide mid-off."}, {"ball": 15.5, "isHighlight": false, "text": "UT Yadav to Dhawan,no run,length ball, angled towards the stumps. Dhawan goes back to defend."}, {"ball": 15.6, "isHighlight": false, "text": "UT Yadav to Dhawan,1 run,length ball, aimed for top of off, made room to dab it behind point."}, {"ball": 16.1, "isHighlight": false, "text": "Chawla to Dhawan,1 run,tossed up, nice and slow, comes forward to push it in front of cover."}, {"ball": 16.2, "isHighlight": false, "text": "Chawla to Bailey,no run,tossed up, Bailey went back to cut, it skidded on, hits it straight to short third man."}, {"ball": 16.3, "isHighlight": false, "text": "Chawla to Bailey,1 run,skids on again, no room at all, and Bailey bunts it towards cover."}, {"ball": 16.4, "isHighlight": false, "text": "Chawla to Dhawan,1 run,another skidder, Dhawan opens his face and hits it to the right of Kallis at short third man."}, {"ball": 16.5, "isHighlight": false, "text": "Chawla to Bailey,1 run,slog-sweep, from outside off. Didn't get any elevation on it, and it goes rolling to deep midwicket."}, {"ball": 16.6, "isHighlight": false, "text": "Chawla to Dhawan, $$OUT$$ ,bowled him! skids on again, hits off stump as Dhawan tries to sweep it square."}, {"ball": 16.6, "isHighlight": false, "text": "$$R$$ $$Dhawan$$ $$b$$ $$Chawla$$ $$4$$ $$(6m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 16.6, "isHighlight": false, "text": "Mitch comes in, but it will be Bailey to face Narine."}, {"ball": 17.1, "isHighlight": false, "text": "Narine to Bailey,2 runs,midwicket was on the boundary, and Bailey walked across and flicked it towards him, but not too hard."}, {"ball": 17.2, "isHighlight": false, "text": "Narine to Bailey,no run,gives himself room, tries to cut, finds short third man again."}, {"ball": 17.3, "isHighlight": false, "text": "Narine to Bailey,1 run,goes across, works this offbreak to deep square leg."}, {"ball": 17.4, "isHighlight": false, "text": "Narine to Johnson,no run,big offbreak. Mitch was frozen in a forward defensive and it spins sharply past his bat."}, {"ball": 17.5, "isHighlight": false, "text": "Narine to Johnson,no run,Another offbreak. Mitch comes further forward, but still can't put bat on ball."}, {"ball": 17.6, "isHighlight": false, "text": "Narine to Johnson,1 run,leg stump, slightly shorter, and Johnson clips it square off his pads."}, {"ball": 17.6, "isHighlight": false, "text": "Hitesh: \"Wonder what the highest proportion of bowled dismissals in an innings is...4 out of 6 here! \""}, {"ball": 18.1, "isHighlight": false, "text": "UT Yadav to Johnson,2 runs,length ball, on leg, Narine fumbles that clip at short fine leg."}, {"ball": 18.2, "isHighlight": false, "text": "UT Yadav to Johnson,no run,full toss goes screaming across Johnson, wide of off. Throws his bat at it and misses."}, {"ball": 18.3, "isHighlight": false, "text": "UT Yadav to Johnson,1 run,length ball, slower ball maybe, just outside off. Toe-ends it to point."}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Bailey,1 run,slower ball, cramps Bailey for room, and he pokes it down to long-on."}, {"ball": 18.5, "isHighlight": false, "text": "UT Yadav to Johnson,1 bye,bouncer, Johnson sways out of the way, sees Bailey running, and sets off himself. Uthappa misses the stumps at the keeper's end."}, {"ball": 18.6, "isHighlight": false, "text": "UT Yadav to Bailey,2 runs,Bailey had taken guard outside leg. Umesh bowled it outside off, and the batsman has to reach for it to slap it down to long-off."}, {"ball": 19.1, "isHighlight": false, "text": "Narine to Johnson,no run,tries to reverse-sweep, beaten by the offbreak."}, {"ball": 19.2, "isHighlight": false, "text": "Narine to Johnson,no run,slow, loopy offbreak this time, turns past Johsnon's bat as he tries to slog."}, {"ball": 19.3, "isHighlight": false, "text": "Narine to Johnson, $$FOUR$$ ,flicked off his toes, and he hit it well. Morne Morkel had come in from deep midwicket, and was in no position as it sails over him and bounces over the rope."}, {"ball": 19.4, "isHighlight": false, "text": "Narine to Johnson, $$SIX$$ ,slog-sweep, didn't connect as well as he'd have hoped, but it goes for six anyway. Lands right on top of the rope."}, {"ball": 19.5, "isHighlight": false, "text": "Narine to Johnson, $$OUT$$ ,down the pitch, and Narine's offbreak spins past his swishing blade. Uthappa stumps him easily."}, {"ball": 19.5, "isHighlight": false, "text": "$$MG$$ $$Johnson$$ $$st$$ $$†Uthappa$$ $$b$$ $$Narine$$ $$14$$ $$(10m$$ $$12b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 19.5, "isHighlight": false, "text": "Akshar Patel is in now."}, {"ball": 19.6, "isHighlight": false, "text": "Narine to Patel,1 run,  $$OUT$$ ,chipped to long-on. They try to run two, but Akshar is way out of his crease and the fielder did well to throw to the batsman's end."}, {"ball": 19.6, "isHighlight": false, "text": "$$AR$$ $$Patel$$ $$run$$ $$out$$ $$1$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "IndianCricketer: \"I still doubt KKR can chase 140s with Sandeep Sharma at his best\""}, {"ball": 19.6, "isHighlight": false, "text": "Varun Muralidha: \"I told ya! Bailey takes 12 after Maxwel, Miller taking 14 and 13 respectively\" Saha scored 15, so it was 15,14, 13 and 12."}, {"ball": 19.6, "isHighlight": false, "text": "Morne Morkel bowled a superb opening spell, but Sehwag started in rollicking fashion to have Punjab 85 for 2 after 10, with Maxwell at the other end. But Kolkata did well to pull things back after that, and only conceded 64 in the last 10. The inclusion of Piyush Chawla raised some eyebrows, but he bowled extremely well to finish with figures of 3 for 19. Kolkata still have to chase 150, but it looked at one stage like the target could be a lot bigger. Stay tuned for the chase."}], "name": "Kings XI Punjab v Kolkata Knight Riders", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733997.html?innings=1;view=commentary", "match_num": 34}