{"commentary": [{"ball": 0, "isHighlight": false, "text": "We are ready to go in Bangalore. Rod Tucker and S Ravi are the two umpires. Chris Gayle and Virat Kohli to open. That is a big move. Positive move, I say. Let your best batsmen play most number of balls. Kane Richardson to bowl"}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm$$  \"We've seen a lot of praise go to Warne, Dravid and now Watson for giving unknown names a chance, but RR owners must actually be given a lot of credit too. When the other celebrity-owned teams have splashed money on big names, RR's owners have actually shown a lot of guts in buying these players in the first place and also faith in their captain and coach's decisions.\" Yes, Manu, they have indeed gambled well"}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  So Yuvraj Singh has got another chance to get out of an ordinary patch"}, {"ball": 0, "isHighlight": false, "text": "$$Time$$ $$for$$ $$the$$ $$toss$$  Virat Kohli has won the toss, and RCB will bat first. Shane Watson says they would have bowled first anyway. And Ravi Shastri has a pot in his hand, which he hands over to the captains. That's a smokin' idea"}, {"ball": 0, "isHighlight": false, "text": "Vijay Zol and Ashok Dinda have come in for RCB, replacing Haryanvis Sachin Rana and Harshal Patel. Rahul Tewatia has come in for RR in place of Dhawal Kulkarni"}, {"ball": 0, "isHighlight": false, "text": "$$7.20pm$$  This is between the team built by Bangalore's favourite son, Rahul Dravid, and Bangalore's own team, Royal Challengers. RCB need to win to remain near that cluster around the third and fourth position. Royals will want to win and steer clear of that cluster. Rain has stayed away after a wet night last night so it is all set for Sunday-night entertainment. This is Sidharth Monga welcoming you to the coverage of the 35th match of the seventh IPL"}, {"ball": 0.1, "isHighlight": false, "text": "Richardson to Kohli,no run,on a length, shaping in, towards off, defended to mid-on"}, {"ball": 0.2, "isHighlight": false, "text": "Richardson to Kohli,no run,full, swinging in, Kohli gets behind it, drives it to mid-off"}, {"ball": 0.2, "isHighlight": false, "text": "Wide slip in place"}, {"ball": 0.3, "isHighlight": false, "text": "Richardson to Kohli,no run,this one holds its line after two inswingers. Kolhi plays for the inward movement again. Beaten"}, {"ball": 0.3, "isHighlight": false, "text": "Ravi: \"Good move by Virat to open.. Also, they should have Yuvraj step up 1 down as he is failing to perform under pressure..\""}, {"ball": 0.4, "isHighlight": false, "text": "Richardson to Kohli, $$FOUR$$ ,Kohli hits out of that three-ball barren patch. This is another inswinger, and he goes hard at it. The bat face closes, takes it square, past square leg, and for four"}, {"ball": 0.5, "isHighlight": false, "text": "Richardson to Kohli,no run,outswinger this time, and Kohli is beaten as he charges down and tries to go over mid-off"}, {"ball": 0.6, "isHighlight": false, "text": "Richardson to Kohli,no run,extra bounce. Kicks off from just short of a length. Holds its line too. Kohli is beaten again. Solid first over from Richardson"}, {"ball": 0.6, "isHighlight": false, "text": "Shane Watson to bowl now. An Aussie to a West Indies. They didn't send each other Christmas cards last year"}, {"ball": 1.1, "isHighlight": false, "text": "Watson to Gayle,no run,full outswinger, Gayle's inside edge is beaten. Half an appeal for an lbw, but this is swinging down leg"}, {"ball": 1.2, "isHighlight": false, "text": "Watson to Gayle,no run,perfect outswinger. Just short of being a half-volley, moving in towards off, defended to mid-off"}, {"ball": 1.3, "isHighlight": false, "text": "Watson to Gayle,no run,on a length, just outside off, no swing, goes with the angle. Left alone"}, {"ball": 1.4, "isHighlight": false, "text": "Watson to Gayle,1 run,more swing. Just short of a length, gets a thick inside edge onto the pad. Concedes a single"}, {"ball": 1.5, "isHighlight": false, "text": "Watson to Kohli,no run,another outswinger. Not a half-volley, but you have to play forward to this. Kohli ends up playing in front of the body, uppishly towards cover"}, {"ball": 1.6, "isHighlight": false, "text": "Watson to Kohli,no run,on a length, pitches on off, swings away, defended from the crease"}, {"ball": 2.1, "isHighlight": false, "text": "Richardson to Gayle,no run,Gayle looks to charge, but this is at 141ks, on a length, and with no room. He has to defend"}, {"ball": 2.2, "isHighlight": false, "text": "Richardson to Gayle,1 run,full, middle and leg, pushed to leg for one"}, {"ball": 2.3, "isHighlight": false, "text": "Richardson to Kohli, $$OUT$$ ,superb start for the Royals so far, and it has just got better. There have been quite a few dots, and few singles, so Kohli throws his bat at this wide delivery. The ball moves away a touch to take a thick edge that flies all the way to third man"}, {"ball": 2.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Bhatia$$ $$b$$ $$Richardson$$ $$4$$ $$(11m$$ $$9b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$44.44$$"}, {"ball": 2.3, "isHighlight": false, "text": "In comes Vijay Zol. Under-19 captain for India"}, {"ball": 2.4, "isHighlight": false, "text": "Richardson to Zol,no run,on a length, middle and leg, angling towards off, defended to cover"}, {"ball": 2.5, "isHighlight": false, "text": "Richardson to Zol,no run,bouncer, middle and leg, Zol gets under it"}, {"ball": 2.5, "isHighlight": false, "text": "\"Isn't Kane Richardson and Aussie too? :)\" Haych, Watson was the first man to bowl to Gayle today"}, {"ball": 2.6, "isHighlight": false, "text": "Richardson to Zol,no run,on a length, middle and leg, angled towards off, defended again. Another strong over from Rochardson"}, {"ball": 3.1, "isHighlight": false, "text": "Watson to Gayle,no run,on a length, just outside off, no swing, allowed to angle through"}, {"ball": 3.2, "isHighlight": false, "text": "Watson to Gayle,no run,short of a length, some shape back in towards top of off. Gayle stands in the crease, and defends"}, {"ball": 3.2, "isHighlight": false, "text": "Home crowd chants, \"We want six.\""}, {"ball": 3.3, "isHighlight": false, "text": "Watson to Gayle, $$FOUR$$ ,Gayle gives them four. Just shimmies down the track early, Watson drops it short, and he pulls it through midwicket for four. He has been bowling without a midwicket - neither in the circle nor in the deep - so not the smartest ball to bowl"}, {"ball": 3.3, "isHighlight": false, "text": "Deep square moves towards deep midwicket"}, {"ball": 3.4, "isHighlight": false, "text": "Watson to Gayle,no run,on a length, outside off, Gayle wants to stay back and force it through covers, but gets a bottom edge towards the keeper"}, {"ball": 3.5, "isHighlight": false, "text": "Watson to Gayle,1 run,another short ball, but this time he gets it high towards the head, and Gayle forehands it down to long-on for one"}, {"ball": 3.6, "isHighlight": false, "text": "Watson to Zol, $$FOUR$$ ,Zol drives on the up, and from away from the body, but places it square, to the right of the diving cover-point"}, {"ball": 3.6, "isHighlight": false, "text": "And here is Faulkner to Gayle. Remember the Gayle dance in Bangladesh after Sammy dismantled Faulkner?"}, {"ball": 4.1, "isHighlight": false, "text": "Faulkner to Gayle,1 run,short of a length, angled in, worked to leg for one"}, {"ball": 4.2, "isHighlight": false, "text": "Faulkner to Zol,1 run,similar delivery, and helped into the leg side for another single"}, {"ball": 4.3, "isHighlight": false, "text": "Faulkner to Gayle,1 run,Gayle charges down the wicket and muscles this down the ground, but they have a long-on in place"}, {"ball": 4.3, "isHighlight": false, "text": "Still a slip in place"}, {"ball": 4.4, "isHighlight": false, "text": "Faulkner to Zol, $$FOUR$$ ,that is an incredible shot. Faulkner digs this in short, gets it high too, but he goes back and pulls this wide of mid-off - yes a pull wide of mid-off. In the air, but in the gap"}, {"ball": 4.5, "isHighlight": false, "text": "Faulkner to Zol,no run,slower ball, and this one beats him. Zol has not seen this from the hand"}, {"ball": 4.6, "isHighlight": false, "text": "Faulkner to Zol,no run,once again Zol is forced to play the pull down the ground. The ball is hurrying onto him. This one doesn't carry to mid-on, though"}, {"ball": 4.6, "isHighlight": false, "text": "Pravin Tambe to bowl legspin now. Interesting time. Big gamble for RR. He might end up in Gayle's swinging arc"}, {"ball": 5.1, "isHighlight": false, "text": "Tambe to Gayle,no run,full, middle and leg, swept away, but can't beat square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Tambe to Gayle, $$FOUR$$ ,wrong'un, but he compensates for it by pitching it outside leg, and Gayle sweeps it past square leg, and immediately clutches on to his hamstring"}, {"ball": 5.3, "isHighlight": false, "text": "Tambe to Gayle,no run,this is shorter, but Gayle fancies a sweep, and is beaten"}, {"ball": 5.4, "isHighlight": false, "text": "Tambe to Gayle, $$FOUR$$ ,gives him the charge this time, is not to the pitch of the ball, but the inside half is enough to put this shot wide of long-on"}, {"ball": 5.5, "isHighlight": false, "text": "Tambe to Gayle,1 run,swept away to deep midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Tambe to Zol,no run,legbreak, a little short, cut away, but can't beat point"}, {"ball": 5.6, "isHighlight": false, "text": "This is Tambe's challenge. RCB are predominantly left-hand batsmen. And with AB, you never know which hand is he going to bat"}, {"ball": 5.6, "isHighlight": false, "text": "Tewatia, another legspinner, on"}, {"ball": 6.1, "isHighlight": false, "text": "Tewatia to Gayle,no run,lovely wrong'un first ball. Slow in the air, not a half-volley, beats Gayle"}, {"ball": 6.2, "isHighlight": false, "text": "Tewatia to Gayle,1 run,another googly, too short, crashed to long-on for one"}, {"ball": 6.3, "isHighlight": false, "text": "Tewatia to Zol,1 run,anther wrong'un, a little short and a little wide, cut wide of point for one"}, {"ball": 6.4, "isHighlight": false, "text": "Tewatia to Gayle,no run,Gayle shuffles across, Tewatia bowls a googly that pitches outside leg, and Gayle defends it back"}, {"ball": 6.5, "isHighlight": false, "text": "Tewatia to Gayle,no run,five wrong'uns in a row. Slow, loopy, Gayle is not reading them, he goes for the big sweep, and is beaten"}, {"ball": 6.6, "isHighlight": false, "text": "Tewatia to Gayle,no run,strong start for Tewatia. He sees Gayle move across, and pitches another wrong'un outside leg, and beats the swing of that heavy bat to hit the pad"}, {"ball": 6.6, "isHighlight": false, "text": "Tambe continues"}, {"ball": 7.1, "isHighlight": false, "text": "Tambe to Zol, $$FOUR$$ ,full, just outside off, Zol sweeps, in front of square, and finds the gap between long-on and deep midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Tambe to Zol,1 run,swept away, but this time for a single to deep square"}, {"ball": 7.3, "isHighlight": false, "text": "Tambe to Gayle,no run,another wrong'un, a slow wrong'un, and it is a shooter too. Gayle is not reading them from the hand. Is beaten, but makes it back to the crease in time"}, {"ball": 7.4, "isHighlight": false, "text": "Tambe to Gayle, $$OUT$$ ,Gayle is not reading this wrong'uns, but he is a fair man as this ball shows. Goes to cut, edges the googly, Samson takes a sharp catch, and Gayle walks. Turns out Tucker has his arms raised to call it a wide, but Gayle has walked away. Well played, Chris. Another example of ordinary umpiring this IPL"}, {"ball": 7.4, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$c$$ $$†Samson$$ $$b$$ $$Tambe$$ $$19$$ $$(33m$$ $$25b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$76.00$$"}, {"ball": 7.4, "isHighlight": false, "text": "Here is AB"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to de Villiers,1 run,gets a short ball that he punches down to long-on to get off the mark"}, {"ball": 7.6, "isHighlight": false, "text": "Tambe to Zol,1 run,legbreak, full outside off, pushed to long-on for one"}, {"ball": 8.1, "isHighlight": false, "text": "Tewatia to Zol, $$OUT$$ ,Turns out watching the legspinner's hand is out of fashion. Even Zol is not picking the wrong'un even though Tewatia has bowled seven googlies out of seven. Zol reads this off the pitch, which is too late, and he gives slip catching practice as this is pitched short of a length, and turns away to take the edge of a nothing poke"}, {"ball": 8.1, "isHighlight": false, "text": "$$VH$$ $$Zol$$ $$c$$ $$Watson$$ $$b$$ $$Tewatia$$ $$16$$ $$(25m$$ $$14b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$114.28$$"}, {"ball": 8.1, "isHighlight": false, "text": "In comes Yuvraj Singh now"}, {"ball": 8.2, "isHighlight": false, "text": "Tewatia to Yuvraj Singh,no run,another wrong'un, full, defended back to him"}, {"ball": 8.3, "isHighlight": false, "text": "Tewatia to Yuvraj Singh,no run,oh uncertain Yuvraj. Down the wicket, nowhere near the pitch of the ball, and kicks this away"}, {"ball": 8.4, "isHighlight": false, "text": "Tewatia to Yuvraj Singh, $$FOUR$$ ,this is too full, outside leg, and he loves this. Sweeps it behind square for four"}, {"ball": 8.5, "isHighlight": false, "text": "Tewatia to Yuvraj Singh,1 run,tossed up, just outside off, driven to long-off for one"}, {"ball": 8.6, "isHighlight": false, "text": "Tewatia to de Villiers,1 run,legbreak, but doesn't turn much. Punched to deep cover for one"}, {"ball": 8.6, "isHighlight": false, "text": "A slip still in place"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to de Villiers,1 run,tossed up outside off, driven to deep cover for one"}, {"ball": 9.2, "isHighlight": false, "text": "Tambe to Yuvraj Singh,no run,on a length, just outside off, turning back in slightly, takes a thick edge, hits Samson's pad. This is not even a half chance. It is a thick edge"}, {"ball": 9.3, "isHighlight": false, "text": "Tambe to Yuvraj Singh, $$FOUR$$ ,another wrong'un too full, and Yuvraj sweeps it through the vacant long leg region for four"}, {"ball": 9.4, "isHighlight": false, "text": "Tambe to Yuvraj Singh,1 run,down the wicket, close to the pitch of the ball, gets a single to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Tambe to de Villiers,1 run,driven to deep cover for one. AB yet to face a dot, I think"}, {"ball": 9.6, "isHighlight": false, "text": "Tambe to Yuvraj Singh, $$FOUR$$ ,vertical sweep. That's almost like Dhoni. Too full, outside leg, and Yuvraj moves well inside the line to place this sweep fine. Almost an upright sweep"}, {"ball": 10.1, "isHighlight": false, "text": "Tewatia to de Villiers,no run,first dot for AB. Nice legbreak, on a length, middle and off, defended to cover"}, {"ball": 10.2, "isHighlight": false, "text": "Tewatia to de Villiers,1 run,gives him the charge, is beaten in the flight, but gets enough bat on it to drive it to long-on for one"}, {"ball": 10.2, "isHighlight": false, "text": "Abhi: \"It's great to see a 20 year old legspinner and a 42 year old legspinner bowling in unison. Only RR can bring this out.\""}, {"ball": 10.3, "isHighlight": false, "text": "Tewatia to Yuvraj Singh,no run,another wrong'un, Yuvraj is looking to charge down, but is pushed back as this dips too. Defended back to him"}, {"ball": 10.4, "isHighlight": false, "text": "Tewatia to Yuvraj Singh,1 run,wrong'un again, swept away to deep square for one"}, {"ball": 10.5, "isHighlight": false, "text": "Tewatia to de Villiers,1 run,wrong'un to the right-hand batsman too. AB, too, picks it off the surface, and gets a single to leg as he adjust late"}, {"ball": 10.6, "isHighlight": false, "text": "Tewatia to Yuvraj Singh, $$SIX$$ ,Yuvraj of the yore. Googly again, full, just outside leg, and he effortlessly sends it sailing over deep midwicket for a six"}, {"ball": 10.6, "isHighlight": false, "text": "Faulkner is back"}, {"ball": 11.1, "isHighlight": false, "text": "Faulkner to de Villiers,no run,short of a length, on off, he is hurried into the cut, can't place it past cover"}, {"ball": 11.2, "isHighlight": false, "text": "Faulkner to de Villiers,1 run,pulled to leg for one"}, {"ball": 11.3, "isHighlight": false, "text": "Faulkner to Yuvraj Singh,2 runs,full, outside off, driven wide of deep cover for two"}, {"ball": 11.3, "isHighlight": false, "text": "Mid-off is up"}, {"ball": 11.4, "isHighlight": false, "text": "Faulkner to Yuvraj Singh,1 run,bouncer, headed towards the head, pulled away for one"}, {"ball": 11.5, "isHighlight": false, "text": "Faulkner to de Villiers,no run,moving across. Some premeditation there. Faulkner bowls slow, at 117ks, and beats his attempt to go leg side"}, {"ball": 11.6, "isHighlight": false, "text": "Faulkner to de Villiers,no run,another slower ball, full outside off, AB slogs, but can't beat midwicket. When AB starts slogging, you know there is scoreboard pressure around. Not yet six an over for RCB"}, {"ball": 11.6, "isHighlight": false, "text": "Rajat Bhatia to bowl now. He is also a proxy legspinner. Just keeps bowling those slow legrollers"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Yuvraj Singh, $$SIX$$ ,and he goes for seam-up first ball. And it is short too. And at his pace, Yuvraj will love him every day of the week. Pulled over deep midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Yuvraj Singh, $$FOUR$$ ,and Yuvraj is expecting the slower ball and goes down on a knee to sweep it over short fine leg. This was the offcutter"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Yuvraj Singh,1 leg bye,full and straight, that's in the zone too, but Yuvraj misses out and takes just a leg-bye"}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to de Villiers,1 run,now comes the slower legbreak for the right-hand batsman, who drives to long-off for one"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Yuvraj Singh,1 run,slower offcutter, swept away again, but straight to deep square leg this time"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to de Villiers,1 run,slower legcutter, AB sweeps, to the left of short fine, but Tambe puts in a dive to keep them to one"}, {"ball": 12.6, "isHighlight": false, "text": "Watson back to bowl"}, {"ball": 13.1, "isHighlight": false, "text": "Watson to de Villiers,2 runs,quick and straight, on a length, gets an inside edge onto the pad, but AB is superb in calling for the second as he sees the ball has gone softly towards deep square"}, {"ball": 13.1, "isHighlight": false, "text": "Third man comes up, midwicket goes back"}, {"ball": 13.2, "isHighlight": false, "text": "Watson to de Villiers,1 run,full toss outside off, but AB is looking leg side, and ends up hitting it to mid-off for one"}, {"ball": 13.3, "isHighlight": false, "text": "Watson to Yuvraj Singh, $$FOUR$$ ,length ball, outside off, and this is not what you ball at the death. There is a long-on in place, but he has driven this straight of that man and beaten him. The small boundaries have helped too"}, {"ball": 13.4, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 run,gets away with this one. Short, angling outside off, Yuvraj lines up for the pull, but gets a bottom edge for one"}, {"ball": 13.5, "isHighlight": false, "text": "Watson to de Villiers,1 run,slower ball, full, gets an inside edge to square leg, and Yuvraj is struggling to make it. Karun Nair's throw misses, but is met with great backing up from Rahane at point"}, {"ball": 13.6, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 run,short ball again, and Yuvraj is not timing them well. This one, though, reaches the advancing deep midwicket, Richardson, at a half-volley"}, {"ball": 13.6, "isHighlight": false, "text": "Tambe to bowl out now"}, {"ball": 14.1, "isHighlight": false, "text": "Tambe to Yuvraj Singh, $$SIX$$ ,the good old Yuvraj again. Down the wicket, reaches the pitch of the ball, and effortlessly lofts him over long-on for a huge six. That's smooth as"}, {"ball": 14.2, "isHighlight": false, "text": "Tambe to Yuvraj Singh,1 leg bye,googly this time, Yuvraj is caught on the back foot to a length ball, is beaten and hit on the pad, but this is missing off"}, {"ball": 14.3, "isHighlight": false, "text": "Tambe to de Villiers,no run,full legbreak, driven hard, but back at him"}, {"ball": 14.4, "isHighlight": false, "text": "Tambe to de Villiers,1 run,shorter, punched away to deep cover for one"}, {"ball": 14.4, "isHighlight": false, "text": "Ashok: \"First Sehwag, then Gambhir and now Yuvraj... feels like I am back to my college days...\""}, {"ball": 14.5, "isHighlight": false, "text": "Tambe to Yuvraj Singh,1 wide,another wrong'un, but this too far outside leg. Was he trying a stumping down leg anticipating a charge at him?"}, {"ball": 14.5, "isHighlight": false, "text": "Tambe to Yuvraj Singh,1 run, $$dropped$$  but this is a tough tough chance as Tambe pushes one quick ball through. Takes the toe end of Yuvraj's bat, and it doesn't stick in Samson's gloves"}, {"ball": 14.6, "isHighlight": false, "text": "Tambe to de Villiers,2 runs,powered away but straight to long-on for one"}, {"ball": 14.6, "isHighlight": false, "text": "Richardson is back"}, {"ball": 15.1, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$SIX$$ ,fifty off 24 balls. That's golf-like striking. We've been expecting you, Mr Singh. On a length, gentle pace, and the vintage Yuvraj used to put them in stands to kill time. He is doing the same today"}, {"ball": 15.2, "isHighlight": false, "text": "Richardson to Yuvraj Singh,1 run,short, quick, Yuvraj is late into the pull, gets a single to deep midwicket"}, {"ball": 15.3, "isHighlight": false, "text": "Richardson to de Villiers, $$SIX$$ ,slower short ball, AB picks it, and once he picks them and sits back, they go flying into the orbit. This one goes over deep midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Richardson to de Villiers,1 run,full toss, AB wants to reverse this past short third, but finds the man. A single taken"}, {"ball": 15.5, "isHighlight": false, "text": "Richardson to Yuvraj Singh,1 run,full and straight, Yuvraj goes deep to try to get under it, but has to be satisfied with a single to deep midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Richardson to de Villiers,2 runs,looks to go leg to a full ball, gets a thick edge over point for two runs"}, {"ball": 15.6, "isHighlight": false, "text": "Timeout now"}, {"ball": 15.6, "isHighlight": false, "text": "This has been some comeback from RCB. Can they close it out with 40-50 more runs here? Watson to bowl out now. Fine leg is up"}, {"ball": 16.1, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 wide,goes full and wide, but too wide, and is called for it"}, {"ball": 16.1, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 wide,Yuvraj standing off, Watson goes wide, but too wide again. Watson doesn't like the call because Yuvraj is standing almost outside off"}, {"ball": 16.1, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 run,Watson stays wide outside off, draws a thick edge from the drive, but it doesn't carry to third man"}, {"ball": 16.2, "isHighlight": false, "text": "Watson to de Villiers,1 run,lovely bouncer. At the head, no room at all, and gets a massive top edge, which doesn't carry to long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Yuvraj standing outside off again"}, {"ball": 16.3, "isHighlight": false, "text": "Watson to Yuvraj Singh,1 wide,Watson goes full and wide, and has been called again. Watson doesn't like the call, but this one seemed too wide even after making consideration for Yuvraj's stance"}, {"ball": 16.3, "isHighlight": false, "text": "Watson to Yuvraj Singh,no run,this time he is not wided. The cat-and-mouse continues. Weatson full and wide, just outside that guide white line outside off, but this time Yuvraj's stance makes sure it is not called a wide. And this time Yuvraj is not happy"}, {"ball": 16.4, "isHighlight": false, "text": "Watson to Yuvraj Singh,no run,Watson gets one back with a short ball on the stumps. Surprises him, and gets a dot"}, {"ball": 16.5, "isHighlight": false, "text": "Watson to Yuvraj Singh, $$SIX$$ ,Yuvraj's comeback. He stays back, deep in the crease, gets under a full ball, and sends him crashing over long-off for another six"}, {"ball": 16.6, "isHighlight": false, "text": "Watson to Yuvraj Singh, $$FOUR$$ ,Watson goes full and wide again, and he plays it with an open face, and places it over point. Yuvraj is on fire here"}, {"ball": 17.1, "isHighlight": false, "text": "Faulkner to de Villiers, $$SIX$$ ,almost into the Cubbon Park. Length ball from Faulkner, AB goes deep into the crease, down on a knee, and hits the roof of the stands behind midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner to de Villiers, $$SIX$$ ,AB is sitting back again, pulls a short ball, gets a thick top edge, but it carries over the short boundaries of the Chinnaswamy Stadium"}, {"ball": 17.2, "isHighlight": false, "text": "It is taking an age to set the field now"}, {"ball": 17.3, "isHighlight": false, "text": "Faulkner to de Villiers,1 run,full, outside off, driven to deep cover for one"}, {"ball": 17.4, "isHighlight": false, "text": "Faulkner to Yuvraj Singh,no run,wide length ball, outside that guide line, but gets away with it because Yuvraj is standing outside off"}, {"ball": 17.5, "isHighlight": false, "text": "Faulkner to Yuvraj Singh,no run,full and wide, a yorker. Well done. Beats Yuvraj's attempt to steer it past point"}, {"ball": 17.6, "isHighlight": false, "text": "Faulkner to Yuvraj Singh,no run,and full and wide again, outside that guide line again, but not by much, and hasn't been called because of Yuvraj's initial stance outside off"}, {"ball": 18.1, "isHighlight": false, "text": "Richardson to de Villiers, $$FOUR$$ ,Richardson goes for the yorker outside off, bowls a low full toss, draws a half mis-hit from AB, but this has gone wide enough of deep cover to go for another four"}, {"ball": 18.2, "isHighlight": false, "text": "Richardson to de Villiers,1 run,yorker, AB inside-edges to short fine leg for one"}, {"ball": 18.2, "isHighlight": false, "text": "Akhter: \"At 17.1 after AB hit the ball For six he himself couldn't believe it and said oh wow.\""}, {"ball": 18.2, "isHighlight": false, "text": "Highest fourth-wicket partnership of this tournament. Yuvraj is standing with his back foot outside off again"}, {"ball": 18.3, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$SIX$$ ,and Richardson feeds him. RR are rattled. Bowling length on the pads. Yuvraj loves this pick-up shots. Effortless six over square leg again"}, {"ball": 18.3, "isHighlight": false, "text": "Richardson goes round the wicket. Yuvraj moves further outside off"}, {"ball": 18.4, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$FOUR$$ ,yorker gone wrong. Fullie on off, but Yuvraj's stance means he can go leg side, and sends it crashing past square leg for four"}, {"ball": 18.5, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$SIX$$ ,he has played the helicopter. Binny has dropped this too, but who can blame him? This is growing in pace as it goes towards long-off. This is full, in the block hole, and like Aggassi used to do off his toes, he has whipped this straight and flat. Binny at long-off can't get a hand to it. Chinnaswamy has gone crazy"}, {"ball": 18.6, "isHighlight": false, "text": "Richardson to Yuvraj Singh, $$OUT$$ ,moves across again to open up the leg side but is beaten. Given out leg-before, but I am not sure it wasn't going down with the angle. Yuvraj walks off to a huge applause from the home crowd. What hitting"}, {"ball": 18.6, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$lbw$$ $$b$$ $$Richardson$$ $$83$$ $$(52m$$ $$38b$$ $$7x4$$ $$7x6)$$ $$SR:$$ $$218.42$$"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to bowl the last over"}, {"ball": 19.1, "isHighlight": false, "text": "Faulkner to de Villiers,2 runs,driven down the ground, comes back for two"}, {"ball": 19.2, "isHighlight": false, "text": "Faulkner to de Villiers, $$SIX$$ ,fifty for AB, too, and for once he he has been inconspicuous. Full outside off, and he drives with an open face, over cover, and for a six"}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner to de Villiers, $$SIX$$ ,Faulkner looks to go full and straight, and gives him a low full toss on the pads. AB flicks it over square leg for a six. Complete meltdown for RR bowlers"}, {"ball": 19.3, "isHighlight": false, "text": "After the 12th over, no over has gone for fewer than 10"}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner goes round the wicket. Third man goes back, long-off comes in. Fine leg coming in. Are we looking at a bouncer? Eighty off the last 27"}, {"ball": 19.4, "isHighlight": false, "text": "Faulkner to de Villiers, $$OUT$$ ,full and wide, takes it outside AB's reach, who is looking to stay back and hit, and consequently doesn't get all of this one, and holes out to deep cover"}, {"ball": 19.4, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$c$$ $$Rahane$$ $$b$$ $$Faulkner$$ $$58$$ $$(61m$$ $$32b$$ $$1x4$$ $$5x6)$$ $$SR:$$ $$181.25$$"}, {"ball": 19.4, "isHighlight": false, "text": "If they score eight runs off the remaining two balls, RCB will have had the best last five overs of all IPL matches. Albie Morkel on strike"}, {"ball": 19.5, "isHighlight": false, "text": "Faulkner to Morkel,1 run,full, outside off, drilled to long-off for one"}, {"ball": 19.5, "isHighlight": false, "text": "Reg: \"Will be interesting to see what Watson does here. He has been batting himself, Smith and Faulkner down the order all the time, there is a real need to send out the big guns straight away if they are to chase down this total.\""}, {"ball": 19.6, "isHighlight": false, "text": "Faulkner to Patel,1 wide,full and wide from round the stumps, called too as this angles across"}, {"ball": 19.6, "isHighlight": false, "text": "Parthiv Patel to face the last ball. He did the previous wide too"}, {"ball": 19.6, "isHighlight": false, "text": "Faulkner to Patel,2 runs,looks to go across to open up the leg side, is hit on the pad, the ball goes nowhere, they take a leg-bye, but Faulkner turns it into two with an ill-advised throw at the non-striker's end. Concedes an overthrow. Sorry, PP managed an inside edge onto the pad"}, {"ball": 19.6, "isHighlight": false, "text": "What a comeback for Yuvraj Singh. 120 runs for RCB off the last eight overs. AB de Villiers smooth as usual. Rajasthan Royals have been derailed. Can they come back. We will soon find out"}], "name": "Royal Challengers Bangalore v Rajasthan Royals", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/733999.html?innings=1;view=commentary", "match_num": 35}