{"commentary": [{"ball": 0, "isHighlight": false, "text": "All set to go. Mumbai Indians in a tight huddle and Rohit imparts a 20 second speech.. Finch and Dhawan are here too. Not really a housefull in Uppal but we'll see if more turn up.. Kumar Dharamsena and Vineet Kulkarni are the umpires.  $$Corey$$ $$Anderson$$  is going to open the bowling."}, {"ball": 0, "isHighlight": false, "text": "$$7.50$$ $$pm$$  \"I am actually quite curious about the role of Irfan Pathan in the SRH line up....technically he is an allrounder....but he does not seem to get enough overs to bowl or not much to do with the bat...hoping atleast he will be used better at home....he is one player if in form can be a handful for any opponent....World Cup is coming....come on guys give players like Irfan a good bowl and allow him to get into rythm,\" says Vamsi, one of many permanent Irfan fans."}, {"ball": 0, "isHighlight": false, "text": "$$7.40$$ $$pm$$  \"With 7/8 matches last season were less than 150 last season and Dhawan saying that it's a good turf for batting is just a ploy to mislead MI but on the other hand if that was the plan why did he choose to bat first. #ScratchingMyHead\" ---- Amith, there is no simple equation to understand it. Meanwhile, still 20 mins away, enough time for this  $$equation$$ .."}, {"ball": 0, "isHighlight": false, "text": "$$Toss.$$ $$Sunrisers$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$are$$ $$going$$ $$to$$ $$bat.$$  Dhawan thinks it is a 160-170 wicket. Sunrisers are going with the same team as the last game. Rohit wanted to chase anyway. Mumbai Indians make one change to their XI, bringing in Pragyan Ojha for an impressive Praveen Kumar."}, {"ball": 0, "isHighlight": false, "text": "Ahaan: \"When I saw the toss, I was happy that I'll be seeing PK bowl early on in the match. But now, Rohit has made the silliest decision to drop him, that too for an out-of-form Ojha. That is why they are not doing well.\""}, {"ball": 0, "isHighlight": false, "text": "Danish: \"Is Rohit playing his own Fantasy team tonight with a budget limit? Why drop PK and play Bumrah? SRH batsman gonna pounce on MI now...\""}, {"ball": 0, "isHighlight": false, "text": "Shikhar Dhawan thinks the pitch in Uppal is going to be a high-scoring one.. so not the usual 130-odd game according to him then."}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  Sunrisers have come home. This is the first of four straight games they will play at their happy hunting ground in Uppal, a promising news as they are in a decent place to make a leap for a top-four finish. Same can't be said about the defending champions who are lingering near the bottom of the table. Welcome to our coverage. This is Devashish Fuloria, your commentator for today."}, {"ball": 0, "isHighlight": false, "text": "Anwy: \"Hoping fireworks from the birthday boy Pollard today.\""}, {"ball": 0, "isHighlight": false, "text": "James: \"One feature of IPL 2014 is the number of Aussies doing well. Maxwell has been outstanding, Smith and Faulkner yesterday, Johnson. Finch and Warner today maybe?\""}, {"ball": 0, "isHighlight": false, "text": "Manthan Varanga: \"Can somebody please tell me about Chris Gayle 's IPL 2014 Fate???\" --- We are yet to hear any confirmation but if i were you, i would take him out of my fantasy team. He injured his shoulder yesterday."}, {"ball": 0, "isHighlight": false, "text": "ODI cricket doesn't have more than 3 Powerplays, but  $$CricIQ$$  does. Powerplay 4 is underway - topping the daily leaderboard could win you Flipkart vouchers, fame and recognition.  $$Play$$ $$now$$ ."}, {"ball": 0.1, "isHighlight": false, "text": "Anderson to Finch,no run,superb start! he swings this one into the batsman who misses the ball. Somehow it misses the offstump too"}, {"ball": 0.2, "isHighlight": false, "text": "Anderson to Finch,no run,full and swinging, a bit too full this time and Finch blasts it straight down to mid-on"}, {"ball": 0.3, "isHighlight": false, "text": "Anderson to Finch,no run,another full delivery but this one is swinging down the leg side. Finch looks to flick but gets hit on the pads"}, {"ball": 0.4, "isHighlight": false, "text": "Anderson to Finch,no run,pushes it wide of off, the batsman goes after it already and is beaten by the angle. Good bounce too, the keeper takes it near his face"}, {"ball": 0.5, "isHighlight": false, "text": "Anderson to Finch, $$FOUR$$ ,full, swining, punched beautifully down the ground with the straightest of bats. Neat shot that one"}, {"ball": 0.5, "isHighlight": false, "text": "prakash: \"I am wondering the role of Parvez Rasool in the dug out. Though this is a biggest opportunity for him personally and representing his state is like a dream come true but i feel he should be given a chance taking out Karn Sharma. Technically i feel Parvez is a much better player than karn also brendan taylor should have included in the team skipping out moises when SRH has batting first plan cause Brendan is huge hitter and a better player than Moises by utilizing Irfan as a full length 5th bowler.\""}, {"ball": 0.6, "isHighlight": false, "text": "Anderson to Finch,no run,another one full and swinging in, this time Finch drives it firmly to mid-off"}, {"ball": 0.6, "isHighlight": false, "text": "Bumrah starts from the other end"}, {"ball": 0.6, "isHighlight": false, "text": "\"I believe last years IPL was much closely contested with a very high number of matches ending in last over and a high percentage of them going to wire. Most of the matches in this season have been one sided. Hopefully.. today we get to see a close contest.\" --- Prasoon, last night the match didn't go to the last over, but by no means it was not a thriller"}, {"ball": 1.1, "isHighlight": false, "text": "Bumrah to Dhawan,no run,looks to cut the length ball but gets a thick outside edge that drops just short of second slip"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to Dhawan,1 run,length delivery on the pads, Dhawan drops it nears his boots and sets off for a quick single, makes it easily"}, {"ball": 1.3, "isHighlight": false, "text": "Bumrah to Finch,no run,short of length and comes in to the right hander from wide of crease, the batsman hops on his toes and defends it to off"}, {"ball": 1.4, "isHighlight": false, "text": "Bumrah to Finch,no run,another one which cramps him for room, the batsman pushes it back to the bowler"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to Finch,no run,gets on top of the bounce and chops it firmly to the off side, but that's hit straight to Pollard at point"}, {"ball": 1.6, "isHighlight": false, "text": "Bumrah to Finch,no run,some room this time, but the batsman hits it straight to point"}, {"ball": 1.6, "isHighlight": false, "text": "\"Did PK get a ban again for behaving badly which has not been made public?\" ---- Priyank, that would be strange... Especially after how Pollard got away by behaving badly in public"}, {"ball": 2.1, "isHighlight": false, "text": "Anderson to Dhawan,2 wides,full and down the leg side, I though i heard an edge there as Dhawan went for a flick.. The keeper dives full length to his right and gets a hand to it.. The umpire stretches his arms though"}, {"ball": 2.1, "isHighlight": false, "text": "Anderson to Finch, $$FOUR$$ ,this is the repeat of his boundary in the first over! Full and on the middle stump, Finch covers the swing and drives it beautifully past the stumps"}, {"ball": 2.2, "isHighlight": false, "text": "Anderson to Finch,1 run,short and wide, he has missed out on this one, chops it to extra cover without any timing"}, {"ball": 2.2, "isHighlight": false, "text": "Paul-E: \"@Prasoon: To appease you, I guess every team should have a MS Dhoni in their ranks atleast when chasing, who will bat slowly in the 16-19 overs and take the game to the last over, in which he will play some glory shots to make it look like a close game.\""}, {"ball": 2.3, "isHighlight": false, "text": "Anderson to Dhawan,no run,bowls on the leg stump line but Dhawan misses out on the flick again, gets hit on the pads"}, {"ball": 2.4, "isHighlight": false, "text": "Anderson to Dhawan,no run,he is struggling with this leg-side deliveries! It's full and on the pads, misses out on the flick again.. Any other batsman would have smacked that to the boundary"}, {"ball": 2.5, "isHighlight": false, "text": "Anderson to Dhawan,1 wide,he targets the leg stump again, but goes too far down"}, {"ball": 2.5, "isHighlight": false, "text": "Toronto Tiger: \"@prasoon: Last year a lot of matches went down to the wire and we have fixing allegation and banned players.. what do u prefer? take a pick..\""}, {"ball": 2.5, "isHighlight": false, "text": "Anderson to Dhawan,1 run,on the pads again, this time he makes contact, flicks it straight to Simmons at deep backward square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Anderson to Finch, $$FOUR$$ ,he will do it all day if you bowl him full, gets under the half-volley and lofts it over extra cover with ease. Finch is looking good here"}, {"ball": 2.6, "isHighlight": false, "text": "A change here.. Bhajji comes in early"}, {"ball": 3.1, "isHighlight": false, "text": "Harbhajan Singh to Dhawan,no run,it comes in with the arm from round the wicket, the batsman gets cramped for room and defends it down the pitch"}, {"ball": 3.2, "isHighlight": false, "text": "Harbhajan Singh to Dhawan, $$FOUR$$ ,comes down the pitch, realises he is not to the pitch of the delivery, but goes through the lofted shot anyway, dragging it a bit to the leg side to the cow corner boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Harbhajan Singh to Dhawan,1 run,no room from Bhajji, Dhawan rocks back and pushes it to long off for an easy single"}, {"ball": 3.3, "isHighlight": false, "text": "Bhajji goes over the wicket to Finch"}, {"ball": 3.4, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,tossed up and slower, Finch presses forward and defends"}, {"ball": 3.5, "isHighlight": false, "text": "Harbhajan Singh to Finch,1 run,comes forward to defend, but opens the face at the last moment to steer it to short third man for a quick single"}, {"ball": 3.6, "isHighlight": false, "text": "Harbhajan Singh to Dhawan,no run,moves to the leg side very early and slaps the quicker delivery straight to point. A meter to the right and that was a four"}, {"ball": 3.6, "isHighlight": false, "text": "Still a slip in place.. Malinga comes in"}, {"ball": 4.1, "isHighlight": false, "text": "Malinga to Finch,no run,starts off with a length delivery, the batsman defends it to cover point"}, {"ball": 4.2, "isHighlight": false, "text": "Malinga to Finch,2 runs,back of length on the stumps, Finch smartly whips it in the gap at midwicket for a quick couple of runs"}, {"ball": 4.3, "isHighlight": false, "text": "Malinga to Finch,no run,length delivery on the off stump line, 137 kph, the batsman defends it to mid-off"}, {"ball": 4.3, "isHighlight": false, "text": "Karthik: \"Paul is spot on with Dhoni. Most of the times, Dhoni makes the easy match to difficult situation and then go for finish. Is there any match Dhoni won for his team from terribly bad situation like 70 runs needed from 5 overs like that? Just curious to know...\" --- Not many from that stage. He is more of a 15 balls, 30 runs man.."}, {"ball": 4.4, "isHighlight": false, "text": "Malinga to Finch,1 run,slower delivery on off, Finch looks to crash it through off but only manages an underedge to point"}, {"ball": 4.4, "isHighlight": false, "text": "Sean: \"Yet another tepid start for Sunrisers. 15 dot balls in the first 4 overs. Both batsmen looking good and playing great shots but getting no real returns as evidenced by the sub-100 strike rates.\""}, {"ball": 4.5, "isHighlight": false, "text": "Malinga to Dhawan, $$FOUR$$ ,fires in a yorker that tails into the batsman and Dhawan was not sure of it at all, he manages to get his bat down in time though and gets a thick inside edge to the fine-leg boundary"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga to Dhawan, $$OUT$$ ,middle stump is out! Dhawan wasn't looking very comfortable and now he has been cleaned up. It's not quite a yorker - some would say it's a half-volley - but this one came in to Dhawan, who went for a loose drive and played outside the line"}, {"ball": 4.6, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$b$$ $$Malinga$$ $$11$$ $$(29m$$ $$11b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 4.6, "isHighlight": false, "text": "KL Rahul in the new man.. Finch will face Ojha for now though"}, {"ball": 5.1, "isHighlight": false, "text": "Ojha to Finch,1 run,fires this one in to the pads, the batsman goes deep in the crease and pushes it to deep midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Ojha to Rahul,1 run,he stretches forward and drives the flighted delivery to long off"}, {"ball": 5.3, "isHighlight": false, "text": "Ojha to Finch,no run,moves about the crease before the ball is bowled, then looks for the big sweep, but misses"}, {"ball": 5.4, "isHighlight": false, "text": "Ojha to Finch, $$SIX$$ ,high and handsome! Finch moves to the leg side and whacks the flatter delivery over extra cover with a neat inside out drive, it sails all the way"}, {"ball": 5.4, "isHighlight": false, "text": "Ojha goes over the wicket"}, {"ball": 5.5, "isHighlight": false, "text": "Ojha to Finch,no run,he moves to the leg side again but Ojha follows him there, he has to defend"}, {"ball": 5.6, "isHighlight": false, "text": "Ojha to Finch, $$FOUR$$ ,superb hit through the infield! Ojha tried the other trick, bowled it full and wide of off as Finch was moving to the leg, but the batsman stretches forward to play a wonderfully timed shot"}, {"ball": 6.1, "isHighlight": false, "text": "Harbhajan Singh to Rahul,1 run,tossed up and slower on off, the batsman dabs it to the leg side and calls for a quick one"}, {"ball": 6.2, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,flatter this time, the batsman comes forward and defends it to the off"}, {"ball": 6.3, "isHighlight": false, "text": "Harbhajan Singh to Finch, $$FOUR$$ ,it was slow but this is short enough for Finch to play a cute little late cut past the keeper, runs away to the third-man boundary"}, {"ball": 6.4, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,on the stumps this time, the batsman defends it to off"}, {"ball": 6.5, "isHighlight": false, "text": "Harbhajan Singh to Finch,1 run,he does it again, plays that late cut nicely, but this time Ojha at short third-man cuts it off"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to Rahul,no run,full and flighted, the batsman drives it back to Harbhajan"}, {"ball": 7.1, "isHighlight": false, "text": "Ojha to Finch, $$FOUR$$ ,Oh Bumrah! he does so well to run across from deep cover, gets down in time, but parries it away to the boundary.. away from Anderson who was running from long-off. It was a beautifully timed drive off a fuller delivery"}, {"ball": 7.2, "isHighlight": false, "text": "Ojha to Finch,no run,loud appeal as Finch plays outside the line of this arm-ball, might have just missed leg, just"}, {"ball": 7.3, "isHighlight": false, "text": "Ojha to Finch, $$SIX$$ ,this is a massive hit! Doesn't go very long but goes really really high.. Tossed up delivery, inside out drive.. there is a ring to it"}, {"ball": 7.4, "isHighlight": false, "text": "Ojha to Finch,no run,slower this time from Ojha, Finch defends it to cover point"}, {"ball": 7.5, "isHighlight": false, "text": "Ojha to Finch,1 run,he pushes it softly to cover to call for a quick single"}, {"ball": 7.6, "isHighlight": false, "text": "Ojha to Rahul,no run,takes a step out of the crease but realising he is not to the pitch of the ball, defends it to off"}, {"ball": 7.6, "isHighlight": false, "text": "Bumrah comes back"}, {"ball": 8.1, "isHighlight": false, "text": "Bumrah to Finch,1 run,bowls a fuller length on off, Finch steers it down to third-man"}, {"ball": 8.2, "isHighlight": false, "text": "Bumrah to Rahul, $$FOUR$$ ,now Rahul takes the lofted route! Plants his front-foot out and lofts the length delivery over mid-off very very easily. Very correct too"}, {"ball": 8.3, "isHighlight": false, "text": "Bumrah to Rahul,no run,he comes forward and punches the length delivery back to the bowler"}, {"ball": 8.3, "isHighlight": false, "text": "Anurag: \"Hopefully by now Rohit would have realized the mistake he made by picking Ojha in place of PK. But I guess its too late already.\""}, {"ball": 8.4, "isHighlight": false, "text": "Bumrah to Rahul,no run,digs this one short and beats the batsman as he looks to play an upper cut"}, {"ball": 8.5, "isHighlight": false, "text": "Bumrah to Rahul,2 runs,back of length outside off, easily guided to deep backward point for a couple of runs"}, {"ball": 8.5, "isHighlight": false, "text": "Manasseh Anand: \"@karthik- How did you forget famous CSK vs KXIP 2010 match? We were in must-win situation to qualify. Dhoni was 16 runs from 11 balls when the eqn was 70 runs reqd from 6 overs. Finished with 54 runs from 29 balls. Those two glorious sixes off I Pathan. Still etched in my eyes :) He has done more often than not :)\" --- Did you say 2010?"}, {"ball": 8.6, "isHighlight": false, "text": "Bumrah to Rahul,1 run,bowls a slower one outside off, but it's full enough for Rahul to cream that to deep cover"}, {"ball": 8.6, "isHighlight": false, "text": "The next two minutes could be the most important of your day. INR 10,000 up for grabs for the daily winner at CricIQ.  $$Play$$ $$now$$ $$and$$ $$stake$$ $$your$$ $$claim.$$"}, {"ball": 8.6, "isHighlight": false, "text": "Ojha continues.."}, {"ball": 9.1, "isHighlight": false, "text": "Ojha to Rahul,no run,tossed up delivery on off, the batsman drives it down the pitch"}, {"ball": 9.2, "isHighlight": false, "text": "Ojha to Rahul,no run,flighted and slower, the batsman drives it to off but can't beat cover"}, {"ball": 9.2, "isHighlight": false, "text": "Sai Kiran: \"Rohit would have kept Bumrah out instead of PK for Ojha. We know how well Bumrah fields :P He left a catch in the earlier match and now left a boundary...The value of that misfield is only known in the end...\""}, {"ball": 9.3, "isHighlight": false, "text": "Ojha to Rahul,1 run,flatter and straighter, the batsman goes back and punches it to long-on"}, {"ball": 9.4, "isHighlight": false, "text": "Ojha to Finch,1 run,flatter delivery again, easily punched to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Ojha to Rahul, $$OUT$$ ,trouble! trouble! This is suicidal. Rahul pushes it straight to cover and charges out of the crease only to realise that it was a terrible call a bit too late. He was half-way down the pitch, makes a frantic return but was always going to be short"}, {"ball": 9.5, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$run$$ $$out$$ $$10$$ $$(20m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$76.92$$"}, {"ball": 9.5, "isHighlight": false, "text": "Warner is the next man in"}, {"ball": 9.5, "isHighlight": false, "text": "Sam: \"I dont know why people are surprised at PK being dropped. Mumbai likes their benches warmer than the field. \""}, {"ball": 9.6, "isHighlight": false, "text": "Ojha to Warner,no run,tossed up on the pads, Warner pushes it straight to midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "Pollard comes into the attack"}, {"ball": 10.1, "isHighlight": false, "text": "Pollard to Finch,1 run,Tare makes a valiant effort at deep extra cover.. He comes charging in and dives forward but is not able to hold on.. Very very difficult chance. .Finch continues to play those inside out drives"}, {"ball": 10.2, "isHighlight": false, "text": "Pollard to Warner,1 run,back of length on the pads, Warner tucks it behind square for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Pollard to Finch,no run,slower and straighter, Finch waits for it and defends it down the pitch"}, {"ball": 10.4, "isHighlight": false, "text": "Pollard to Finch,1 run,direct hit from short third man, from Malinga.. But it looks safe to me. Finch taps it to short third man for a quick one.. Warner is comfortably in here"}, {"ball": 10.5, "isHighlight": false, "text": "Pollard to Warner,no run,back of length and cuts away a touch, Warner pushes it straight to point"}, {"ball": 10.6, "isHighlight": false, "text": "Pollard to Warner,no run,length delivery on the stumps, the batsman pushes it straight to cover"}, {"ball": 10.6, "isHighlight": false, "text": "Ojha to bowl his fourth"}, {"ball": 11.1, "isHighlight": false, "text": "Ojha to Finch,1 run,fires it flat on stumps, the batsman punches it to long off for a single"}, {"ball": 11.2, "isHighlight": false, "text": "Ojha to Warner,no run,looks to come down the crease but is kept back by a quicker than usual delivery, he defends"}, {"ball": 11.3, "isHighlight": false, "text": "Ojha to Warner, $$FOUR$$ ,bowls him short and he will whack you all day.. it was a long hop and Warner obliges by hitting it over midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Over the wicket he comes now"}, {"ball": 11.4, "isHighlight": false, "text": "Ojha to Warner,1 run,charges down the pitch and drives the tossed up delivery to long off"}, {"ball": 11.5, "isHighlight": false, "text": "Ojha to Finch,no run,flatter and quicker on the stumps, the batsman pushes it to the bowler"}, {"ball": 11.6, "isHighlight": false, "text": "Ojha to Finch,1 run,he stays in the crease and punches it on the up to long-off for a single that brings up his fifty"}, {"ball": 11.6, "isHighlight": false, "text": "Smart knock this from Finch. He hasn't be ultra aggressive, but has been regularly finding the boundary"}, {"ball": 11.6, "isHighlight": false, "text": "Bhajji comes in"}, {"ball": 12.1, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,that's a poor shot! Looks to slog sweep it, but is beaten in flight. It bounces over the middle stump"}, {"ball": 12.2, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,stays upright and punches it back to the bowler"}, {"ball": 12.3, "isHighlight": false, "text": "Harbhajan Singh to Finch,1 run,he is lucky here again! Finch charges down the pitch but Bhajji fires a full toss at increased pace, the batsman gets an inside edge to short fine leg"}, {"ball": 12.4, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,now Warner looks to thwack it out of the ground, but Bhajji scores this point, as Warner gets an inside edge to his pads"}, {"ball": 12.4, "isHighlight": false, "text": "Manprabh: \"Bhaji may no longer be a wicket taker, but his economy rates against big players is purely amazing. Pure experience! \""}, {"ball": 12.5, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,shapes to reverse sweep, but then cuts it straight to point"}, {"ball": 12.6, "isHighlight": false, "text": "Harbhajan Singh to Warner,2 runs,shorter delivery, allows Warner to slap it to deep midwicket for a couple"}, {"ball": 12.6, "isHighlight": false, "text": "Sagar: \"The chances of making the 160-170 score mentioned by Dhawan is looking bleak... Can you tell us anything about the pitch? Is it like 2013 or behaving differently?\" --- Looks similar.. But I think 160 is on if these two carry on"}, {"ball": 12.6, "isHighlight": false, "text": "Malinga comes back"}, {"ball": 13.1, "isHighlight": false, "text": "Malinga to Finch,no run,Indecision! The batsman looks for a single to cover but is sent back in time"}, {"ball": 13.2, "isHighlight": false, "text": "Malinga to Finch,1 run,back of length outside off, Finch stays in the crease and punches it to deep cover"}, {"ball": 13.3, "isHighlight": false, "text": "Malinga to Warner, $$FOUR$$ ,this is a high full-toss that Warner slices through to the point boundary.. Warner looks towards the umpire. It was over the waist, but is not called"}, {"ball": 13.4, "isHighlight": false, "text": "Malinga to Warner,1 run,half-volley on off and Warner misses out, inside edging his heave on to his pads"}, {"ball": 13.5, "isHighlight": false, "text": "Malinga to Finch,1 run,full and outside off, Finch punches it firmly to long-off for a single"}, {"ball": 13.6, "isHighlight": false, "text": "Malinga to Warner,1 run,fires it full on the off stump, Warner digs it out to long-off for a single"}, {"ball": 13.6, "isHighlight": false, "text": "Time for time out"}, {"ball": 13.6, "isHighlight": false, "text": "rssampat: \"The SRH should be looking to explode from here, but think an implosion will take place here because there is no SAMMY to come in and give the innings the late flourish that it need's\""}, {"ball": 14.1, "isHighlight": false, "text": "Harbhajan Singh to Warner,2 runs,makes room and punches the flatter delivery to deep extra cover for a couple"}, {"ball": 14.2, "isHighlight": false, "text": "Harbhajan Singh to Warner, $$FOUR$$ ,this has been slapped past the umpire, who was ducking for cover! Short and filthy outside off, Warner plays a down the line winner"}, {"ball": 14.3, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 wide,that last shot has scared him a bit, as he fires this one wide outside off"}, {"ball": 14.3, "isHighlight": false, "text": "Harbhajan Singh to Warner,no run,good ball from Bhajji, doesn't turn and is headed for off, the batsman chops it to point"}, {"ball": 14.4, "isHighlight": false, "text": "Harbhajan Singh to Warner,1 run,slower and tossed up, dips and turns, Warner watches it carefully and punches it to deep cover"}, {"ball": 14.4, "isHighlight": false, "text": "Abdul Aleey: \"Aussies are cashing this IPL in a great manner first Maxwell than Faulkner, Smith and now Finch and Warner...\""}, {"ball": 14.5, "isHighlight": false, "text": "Harbhajan Singh to Finch, $$FOUR$$ ,short and wide, Bhajji is giving away some easy ones here. That has been smashed through cover off the back foot"}, {"ball": 14.6, "isHighlight": false, "text": "Harbhajan Singh to Finch,no run,misses out on this one as he cuts this flatter delivery straight to short third man"}, {"ball": 14.6, "isHighlight": false, "text": "Bumrah comes back"}, {"ball": 15.1, "isHighlight": false, "text": "Bumrah to Warner, $$FOUR$$ ,poor delivery! this is an attempted slower one but this is down the leg side, Warner swings his arms and manages to get it fine on the leg side"}, {"ball": 15.2, "isHighlight": false, "text": "Bumrah to Warner,1 run,length ball, Warner wanted to blast it down the ground but gets hurried by pace, only manages to drop it down the pitch, calls for a quick single"}, {"ball": 15.3, "isHighlight": false, "text": "Bumrah to Finch,2 runs,comes forward and calmly pushes this to cover for an easy single, the fielder hits the stumps an gives away an extra.. It was a close call had the umpire's checked or had the fielder appealed"}, {"ball": 15.4, "isHighlight": false, "text": "Bumrah to Finch,no run,fires this one in from wide of the crease, the batsman punches it back to the bowler"}, {"ball": 15.5, "isHighlight": false, "text": "Bumrah to Finch,no run,good delivery, fired in on the off stump, Finch punches it straight to cover"}, {"ball": 15.6, "isHighlight": false, "text": "Bumrah to Finch,2 runs,slower delivery, it's slow enough for the batsman to get under it and smack it over cover for a couple of runs"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Warner,1 run,looks for the yorker, but it turns out to be a high full toss, Warner misses out too, punching it straight to long on"}, {"ball": 16.1, "isHighlight": false, "text": "Shantanu N Agra: \"That was a run out ! why did no one appeal ?? Just checked it on slow mo on my laptop ! The batsman was about 3 inches short!\""}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to Finch,1 run,another yorker gone wrong, a low full toss this time and Finch thumps it over the bowler's head for just a single this time"}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Warner,1 run,another low full toss, tailing in a touch into Warner, who drives it down the ground to long on"}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to Finch,2 runs,slower delivery, attempted yorker, another full toss, Finch squeezes it out to deep backward square leg"}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Finch,no run,this one is a half-volley on off and Finch times his cover drive, but finds Bhajji at extra cover"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Finch,1 run,good delivery on off, another one in the blockhole, dug out behind point"}, {"ball": 16.6, "isHighlight": false, "text": "Don: \"@Abdul - Its very interesting how its the Aussies who're lighting up the IPL this year when the last couple of years it was the WI Players. However, this year no WI player has been performing that well except the ever amazing Sunil Narine. Its almost as if the sucess of the national team is reflected in players performance in the IPL, 2011 and 2012 WI players where the biggest stand outs, and during that time the WI team had a lot of success and even won a world cup. Now the Australian team is rank 1 in both test and ODIs and its the Aussie players who're standing out this IPL. With how well the SL team has been peforming recently maybe in next years IPL it'll be Sri Lankan players time to shine. Either way all these plays playing well is definitely a boost to the IPL.\""}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Finch,1 run,fuller delivery from wide of the crease, the batsman swings his bat but only gets it to long on off the inside half of the bat"}, {"ball": 17.1, "isHighlight": false, "text": "Sashi: \"The umpiring standards have been sub-par this season. First KP and now this...\""}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to Warner,1 run,this is a low full toss but Warner finds long-on with his hit"}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to Finch,1 run,bowls it almost in the blockhole, no room to get under, Finch digs it out to extra cover"}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Warner,1 run,good delivery from Bumrah again, right in the middle stump line, Warner can only block it out to long off"}, {"ball": 17.4, "isHighlight": false, "text": "Lucas: \"It's nice to see a large number of the Aussies playing consistently well so far during this IPL, though it does make me wonder why they performed so poorly in the World Cup.\""}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Finch,1 run,he is struggling to get them off the middle! This was a half-volley and Finch mistimes it to long-off, lets out a cry of disappointment"}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Warner,1 run,still not release, Warner punches the low full toss straight to long off"}, {"ball": 17.6, "isHighlight": false, "text": "Excellent last few over for Mumbai. Sunrisers look like they are going to fall way short of that 160-170 target. Unless.."}, {"ball": 18.1, "isHighlight": false, "text": "Malinga to Warner,1 run,another yorker, this time Warner glides it down to third man"}, {"ball": 18.2, "isHighlight": false, "text": "Malinga to Finch,1 leg bye,superb yorker on the leg stump, Finch still can't get it away, gets hit on the pads"}, {"ball": 18.3, "isHighlight": false, "text": "Malinga to Warner, $$SIX$$ ,he gets under this fine! This is almost to the second tier. Warner moves to the leg side, gets a length delivery and he whacks it with ease over wide long-on"}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Warner,1 run,comes down the pitch and almost yorks himself, digs it out to point eventually"}, {"ball": 18.5, "isHighlight": false, "text": "Malinga to Finch, $$OUT$$ ,caught at long-off! It was the ideal delivery to hit out - length and at a slower pace - but Finch hasn't been timing his shots lately and scoops it straight down the ground. Pollard from long-off moves to his right to take this comfortably"}, {"ball": 18.5, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$Pollard$$ $$b$$ $$Malinga$$ $$68$$ $$(84m$$ $$62b$$ $$7x4$$ $$2x6)$$ $$SR:$$ $$109.67$$"}, {"ball": 18.6, "isHighlight": false, "text": "Malinga to Warner, $$SIX$$ ,Warner has no such problems! This is a half-volley on leg stump but Warner had already made some room.. he smashes it a long way over long on, deep into the stands"}, {"ball": 18.6, "isHighlight": false, "text": "Pollard comes to bowl the last one"}, {"ball": 19.1, "isHighlight": false, "text": "Pollard to Ojha,no run,slower delivery wide outside off, Ojha chops it to the keeper"}, {"ball": 19.1, "isHighlight": false, "text": "Venkat: \"It is harsh to criticize a batsman who scored a fifty, but someone who opens and stays till the end and cannot accelerate at any stage is not helping the team, unless it is a bowler friendly pitch..specially when he is supposed to be an impact player..\""}, {"ball": 19.2, "isHighlight": false, "text": "Pollard to Ojha,1 wide,short and wide, this is stretching the limits, comfortable wide"}, {"ball": 19.2, "isHighlight": false, "text": "Pollard to Ojha, $$SIX$$ ,this has sailed over long-on! How? It looked like it hit the splice of the bat as Ojha went ahead with the lofted shot, but this just beats the fielder"}, {"ball": 19.3, "isHighlight": false, "text": "Pollard to Ojha,1 run,similar shot, the result is more along expected lines, just clears the infield towards long off"}, {"ball": 19.4, "isHighlight": false, "text": "Pollard to Warner,2 runs,length delivery, Warner goes for an expansive pull and gets a thick top edge that goes behind square on the leg side. .Short fine leg has to run backwards to fetch that"}, {"ball": 19.5, "isHighlight": false, "text": "Pollard to Warner, $$FOUR$$ ,this is poor fielding! Tare has just allowed this to run.. This was a top-edged pull, bounces well short of Tare, but spins over his head.. What was he thinking! Rohit lets out a roar"}, {"ball": 19.6, "isHighlight": false, "text": "Pollard to Warner, $$FOUR$$ ,The extra ball costs them some more, as Warner flays this slower delivery through extra cover"}, {"ball": 19.6, "isHighlight": false, "text": "Not quite 160, but this is good enough. The pitch is not the batting beauty Dhawan made it out to be during the toss. Finch steered the innings with a measured fifty and was dismissed as he lost his timing later in the innings, but Warner does it again for them, scoring another half-century. Back in ten for the chase."}, {"ball": 19.6, "isHighlight": false, "text": "vijay: \"Good to see warner adapts quickly to his new role... If Delhi have done same to JP they would have been in different position in points table\""}, {"ball": 19.6, "isHighlight": false, "text": "James: \"Decent score in the end, and SRH have a good bowling attack. But it could have been more if the innings had not lost its way a couple of times.\""}, {"ball": 19.6, "isHighlight": false, "text": "Deepak kalia: \"I dont understand MI'S strategy behind bowling Pollard ahead of Corey. Corey is any day better than Pollard as a bowler. MI have been doing this match after match, under bowling Corey. Pollard is a nothing bowler and should be used just to make up 1 or 2 overs. If corey can open the bowling why not bowl the last over.\""}], "name": "Sunrisers Hyderabad v Mumbai Indians", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734001.html?innings=1;view=commentary", "match_num": 36}