{"commentary": [{"ball": 0, "isHighlight": false, "text": "It's game time. Ian Bishop says Royals were out warming up an hour an 15 minutes before the start. CSK began their drills 30 minutes before."}, {"ball": 0, "isHighlight": false, "text": "Rajasthan Royals are opening with Shane Watson today. Ankit Sharma is his partner. Two googlies first up from Royals."}, {"ball": 0, "isHighlight": false, "text": "CSK are opening the bowling with legspinner Samuel Badree."}, {"ball": 0, "isHighlight": false, "text": "$$3.50$$ $$pm$$  Ganesh Ramachan: \"Why Vijay Shankar? Manhas never got a chance actually. Anyways, it doesn't matter cos top four either wins or loses the match for CSK. This slot is just to fill in 11. Badrinath would've played the whole season without scoring had he had his base price lower than 1 Crore.\""}, {"ball": 0, "isHighlight": false, "text": "Mridul Shandily: \"So Rajasthan Royals are playing 4 spinners on the slow Ranchi track. Ankit, Tambe, Bhatia and Kevon Cooper. \""}, {"ball": 0, "isHighlight": false, "text": "AshDubai: \"Why there is so much hue and cry about dropping Samson? As we know RR, they like to give chance to more players and have the ideal combo towards the \"business end\". With the current position, they can afford to do so too.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$3.30$$ $$pm$$  CSK are playing a home game in Ranchi. Well at least it's home to their captain MS Dhoni. He's lost the toss, though, and  $$Rajasthan$$ $$Royals$$ $$are$$ $$batting$$ $$first.$$"}, {"ball": 0, "isHighlight": false, "text": "CSK have made one change, giving an IPL debut to batsman  $$Vijay$$ $$Shankar$$  and dropping Mithun Manhas, who has failed to have an impact so far."}, {"ball": 0, "isHighlight": false, "text": "Ananya: \"Poor Manhas..... he sacrificed his wicket in the last match because Dhoni wanted the strike in the last over.....\""}, {"ball": 0, "isHighlight": false, "text": "Royals have made three changes. They dropped Sanju Samson, Kane Richardson and Rahul Tewatia, and brought in wicketkeeper Dishant Yagnik, Trinidad & Tobago allrounder Kevon Cooper and Ankit Sharma."}, {"ball": 0, "isHighlight": false, "text": "Ganesh: \"Who is the commentator for this match? Very slow.\" It's George Binoy."}, {"ball": 0, "isHighlight": false, "text": "Farhan: \"Why on earth is Sanju Samson dropped from the Playing XI?\" His scores in his last five matches have been - 13, 16, 37, 34 and 20. Not bad numbers but not awesome either."}, {"ball": 0, "isHighlight": false, "text": "abhi: \"RR surprising again , what reason for dropping sanju ? he has not scored big big but he had given decent support to middle order. Now this makes watson to come at 3 . Not sure about that.\""}, {"ball": 0, "isHighlight": false, "text": "Harish: \"What a great news for TN fans, Vijay Shankar has got a match.!!\""}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  Good afternoon and welcome to ESPNcricinfo's ball-by-ball coverage of the first of two games on Tuesday. No. 2 (Chennai Super Kings) take on No. 3 (Rajasthan Royals) in Ranchi. It's a three-way battle for the top two spots, between these sides and Kings XI Punjab. The teams that finish first and second in the league will have two cracks at making the final.  $$Here's$$ $$the$$ $$points$$ $$table$$ ."}, {"ball": 0, "isHighlight": false, "text": "In his preview of the game, Abhishek Purohit calls this  $$a$$ $$clash$$ $$of$$ $$contrasting$$ $$campaigns$$ . CSK have got to No. 2 by smashing everyone but Kings XI. Royals have reached No. 3 with three scarcely believable heists - games they had no business winning."}, {"ball": 0, "isHighlight": false, "text": "Late last night, news broke that  $$CSK$$ $$have$$ $$a$$ $$Hussey$$ $$in$$ $$their$$ $$ranks$$ . David, not Michael. He was brought in as a replacement for the injured Dwayne Bravo."}, {"ball": 0, "isHighlight": false, "text": "And if you have missed most of the IPL action over the last week (and why on earth would you?) here's  $$a$$ $$quick$$ $$refresher$$ $$-$$ $$in$$ $$pictures$$ ."}, {"ball": 0, "isHighlight": false, "text": "Vithu: \"I wish Matt Henry is given a look in today. Badree didn't impress that much the other day, and no harm experimenting with Henry in place of the bowling foreign player. Remember he can strike the ball hard too.. \""}, {"ball": 0, "isHighlight": false, "text": "Ash: \"Hate to break it but.. Raina and Dhoni haven't fired at all this season. Both of them are short on runs. Smith and Brendon have been covering them up. Hope they raise their game today.\""}, {"ball": 0, "isHighlight": false, "text": "***"}, {"ball": 0, "isHighlight": false, "text": "Three more video rounds to go... Three chances everyday to make sure you participate in them. INR 10,000 for daily winners, bigger prizes for making it to the next stages, and a fully-paid trip to Lord's for winning.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ . Play now."}, {"ball": 0.1, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,pitches on leg stump and skids on, Sharma goes back and defends"}, {"ball": 0.2, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,Sharma goes back to pull but is beaten by a skiddy ball and is hit on the pad, an appeal for lbw from Dhoni but it pitched outside leg"}, {"ball": 0.3, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,defended back to the bowler"}, {"ball": 0.4, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,another quick skiddy ball outside off stump, Sharma goes back to cut but is beaten"}, {"ball": 0.5, "isHighlight": false, "text": "Badree to Ankit Sharma,1 run,nudged off the front foot through midwicket for a single"}, {"ball": 0.5, "isHighlight": false, "text": "Tushar: \"I guess the decision to leave out Sanju has got more to do with the absence of left handers in the line up against Ashwin (he almost bowls more Carrom than normal) and Badree.\""}, {"ball": 0.5, "isHighlight": false, "text": "Spidercam: \"Excellent strategy from RR. They are giving opportunities to all players and at the same time hinting that no one's position can be taken for granted.\""}, {"ball": 0.6, "isHighlight": false, "text": "Badree to Watson,1 run,driven on the front foot to long-on, there's a fielder in the deep"}, {"ball": 0.6, "isHighlight": false, "text": "Dhoni stands up to the stumps for Ishrwar Pandey ..."}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Watson,no run,cut really hard off the front foot, Jadeja dives to his right at point and saves a boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Watson,no run,the extra bounce from short of a length outside off surprises Watson, who begins to push at the ball and then pulls out of the shot"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Watson,no run,good length outside off stump, cut off the front foot to point"}, {"ball": 1.3, "isHighlight": false, "text": "Sharang Dhaimad: \"Are Royals under the impression that they have qualified for the play offs? Dropping Samson & Richardson to bring in Yagnik & Cooper. Suprises didnt end there when Watson and IPL-7 Debutant Ankit Sharma opened the innings in place of Rahane & Nair. I hope they know that finishing 1st gives them an advantage in the play offs? \""}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Watson,no run,defended from the crease with a straight bat"}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Watson,no run,Watson tries to cudgel a good length ball through midwicket but mis-times it towards mid-off"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Watson, $$SIX$$ ,Watson has spoiled an outstanding opening over from Pandey by pulling the length ball over the wide long-on boundary, it just cleared the rope"}, {"ball": 2.1, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,pulled off the back foot to square leg, a mis-timed shot"}, {"ball": 2.2, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,Sharma aims a slog sweep over deep midwicket but misses, the ball goes to slip off the pad"}, {"ball": 2.3, "isHighlight": false, "text": "Badree to Ankit Sharma,1 run,a wristy drive to wide long-on off the front foot"}, {"ball": 2.4, "isHighlight": false, "text": "Badree to Watson,5 wides,that's a poor ball, bowled full and quick down leg side, Watson misses the glance and Dhoni can't collect it either"}, {"ball": 2.4, "isHighlight": false, "text": "Badree to Watson,1 run,worked off the pads on the back foot through midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,bowled flat and fast outside off stump, angling across the left-hander, Sharma is beaten on the cut"}, {"ball": 2.6, "isHighlight": false, "text": "Badree to Ankit Sharma,1 run,nudged off the pads in front of square for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Tushar: \"@Sharang Dhaimad: Surely Watson facing most balls in the innings should not be a bad thing...shows a sign of his leadership skills. And Ankit might have been sent to relieve some pressure from the other end, though he is doing the opposite.\""}, {"ball": 2.6, "isHighlight": false, "text": "Rohit: \"I like the changes made by Rajasthan Royals. They have ensured that nobody gets complacent about their place in the team while coming up with good replacements. Richardson wasn't doing much and Cooper is a good replacement. Yagnik has always delivered when given a chance. I remember him taking on Steyn and Malinga and coming out on top.\""}, {"ball": 3.1, "isHighlight": false, "text": "Sharma to Ankit Sharma,no run,good length around off stump, Sharma stays in his crease and plays a tame push to cover"}, {"ball": 3.1, "isHighlight": false, "text": "Karthick: \"I guess Watson may understand what mistake he have done!!! No one can replace Rahane!!\""}, {"ball": 3.2, "isHighlight": false, "text": "Sharma to Ankit Sharma,no run,Sharma tries to drive a fuller ball down the ground but his timing is completely off, Watson sets off for a single but Sharma sends him back, it went straight to the fielder at mid-on"}, {"ball": 3.3, "isHighlight": false, "text": "Sharma to Ankit Sharma, $$FOUR$$ ,that's a length ball with width outside off, Sharma stands in his crease and slams it flat over the outstretched arm of the leaping fielder at mid-off, it was du Plessis in that position"}, {"ball": 3.3, "isHighlight": false, "text": "Mohit goes round the wicket ..."}, {"ball": 3.4, "isHighlight": false, "text": "Sharma to Ankit Sharma, $$FOUR$$ ,shot! Ankit Sharma stays on the back foot and punches a good length ball angling into him with a straight bat, he finds the gap between extra cover and mid-off and the timing is good enough to beat du Plessis' pursuit"}, {"ball": 3.5, "isHighlight": false, "text": "Sharma to Ankit Sharma,no run,defended from the crease towards the bowler"}, {"ball": 3.6, "isHighlight": false, "text": "Sharma to Ankit Sharma,no run,a good length ball outside off, Ankit aims for a huge slog across the line but is beaten, the ball thuds off Dhoni's pads and goes towards short fine leg"}, {"ball": 3.6, "isHighlight": false, "text": "Nikhil: \"As far as Playing XI is concerned... I am happy with the changes made by Royals.... But its the batting order which surprises me... Why would you not open with Nair.. He has been performing really well and was the one who held the innings in their last match. Does Ankit Sharma has something special we don't know anything about??\""}, {"ball": 4.1, "isHighlight": false, "text": "Badree to Watson,no run,defended on the front foot on the off side"}, {"ball": 4.2, "isHighlight": false, "text": "Badree to Watson,no run,bowled flat and fast on a good length around off stump, Watson stays back and plays to point"}, {"ball": 4.3, "isHighlight": false, "text": "Badree to Watson,no run,a fuller ball on middle, Watson plants his foot forward and drives hard, but can't beat midwicket"}, {"ball": 4.4, "isHighlight": false, "text": "Badree to Watson,1 run,that's been chipped in the air but it is wide of the man at midwicket"}, {"ball": 4.5, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,Ankit gets on to the front foot and dabs on the off side"}, {"ball": 4.6, "isHighlight": false, "text": "Badree to Ankit Sharma,no run,Ankit cuts a shorter ball hard off the back foot but does not beat point"}, {"ball": 4.6, "isHighlight": false, "text": "rssampat: \"16 dot ball's from 24 ball's so far with 24 runs coming from basically 8 ball's. Too many dot ball's and not rotating the strike with 1's or 2's makes the difference between a good total and a great total\""}, {"ball": 4.6, "isHighlight": false, "text": "Sid: \"@All: I just think RR are experimenting with their side to find out alternatives which would ensure that more players are prepared if someone has to miss a game or two.. Think its a very good strategy and comes at the right time because there are very close to a play-off berth.\""}, {"ball": 4.6, "isHighlight": false, "text": "R Ashwin from round the wicket ..."}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Watson,1 leg bye,pitches outside leg from round the wicket, the ball skids on to hit Watson's pad"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Ankit Sharma,2 runs,Ankit moves back and pulls the ball to deep midwicket, Watson has to hurry back for the second, the outfield is fast and the ball got to the fielder quickly"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Ankit Sharma, $$FOUR$$ ,Ankit slogs the ball angling into him from round the wicket, he mis-timed it but hit it well enough to clear mid-on and reach the boundary"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Ankit Sharma, $$FOUR$$ ,Ashwin fires the ball down leg side, Ankit glances it between the keeper and short fine leg for another boundary"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Ankit Sharma,no run,defended on the front foot towards point"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Ankit Sharma, $$SIX$$ ,that's a huge hit! The left-hander is countering Ashwin's line from round the wicket. Ankit waits for the ball angling into him and then slog sweeps into the stands beyond midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Hitesh: \"Think I've figured out why they didn't open with Rahane and Nair. They're their best players of spin and want them in the middle to contend with 8 overs from Ashwin and Jadeja?\""}, {"ball": 5.6, "isHighlight": false, "text": "Dhoni standing up for Pandey."}, {"ball": 6.1, "isHighlight": false, "text": "Pandey to Watson,no run,good length around off, Watson cuts but can't beat point"}, {"ball": 6.2, "isHighlight": false, "text": "Pandey to Watson, $$FOUR$$ ,this time he does beat point, drilling a full and wide ball in front of point with a powerful square drive"}, {"ball": 6.2, "isHighlight": false, "text": "Idrees Kanchwal: \"@rssampnt - that over from ashwin will help RR to carry on with the proceedings. couple more like that and RR will be on course for a great total.\""}, {"ball": 6.3, "isHighlight": false, "text": "Pandey to Watson,no run,Watson mis-times a pull to the man in the circle at midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Nishant: \"Ashwin never seems to have a plan B. Already fed up with his outside the leg stump line. He was picked up by Maxwell and will surely be hit today also by Watson. \""}, {"ball": 6.4, "isHighlight": false, "text": "Pandey to Watson,1 run,Watson blasts the ball flat and hard back at the bowler, Pandey gets fingertips on it and saves a  boundary, the ball still goes down towards long on"}, {"ball": 6.5, "isHighlight": false, "text": "Pandey to Ankit Sharma,1 run,Ankit mis-times a pull towards square leg, the length was not short enough"}, {"ball": 6.6, "isHighlight": false, "text": "Pandey to Watson,2 runs,Watson drives the ball with power along the ground this time, giving Mohit Sharma a challenging save to make at long off, he runs to his right and picks up quite cleanly"}, {"ball": 6.6, "isHighlight": false, "text": "The next two minutes could earn you tickets to Lord's to watch India play England.  $$Play$$ $$CricIQ$$ $$and$$ $$stake$$ $$your$$ $$claim.$$"}, {"ball": 6.6, "isHighlight": false, "text": "Piyush: \"Ankit Sharma opening! And tackling Ashwin well and well. Another masterstroke already from Royals? #dravid-is-mentor-at-royals.\""}, {"ball": 6.6, "isHighlight": false, "text": "Prasoon: \"Ishwar Pandey's bowling action is very smooth. I think he bowls mid to late 130's. He can swing the ball and has height to use the deck to too. He's proven performer in domestic circuit too. SHould be given a chance when India travel to England. \""}, {"ball": 7.1, "isHighlight": false, "text": "Ashwin to Ankit Sharma,1 run,slows it up outside off stump from round the wicket, Ankit stays back and pushes the ball in front of point"}, {"ball": 7.2, "isHighlight": false, "text": "Ashwin to Watson,1 run,Watson steps out to take the ball on the full and drives to long on"}, {"ball": 7.3, "isHighlight": false, "text": "Ashwin to Ankit Sharma,1 run,a fuller length around off, Ankit hits the ball hard, he was aiming leg side but it went towards long off"}, {"ball": 7.4, "isHighlight": false, "text": "Ashwin to Watson,1 wide,that's a huge wide outside leg stump, Watson tried to sweep but missed"}, {"ball": 7.4, "isHighlight": false, "text": "Ashwin to Watson, $$FOUR$$ ,another huge wide outside leg stump, Watson connects with the sweep this time, hitting it wide of the fielder at short fine leg"}, {"ball": 7.5, "isHighlight": false, "text": "Ashwin to Watson,2 wides,another tremendous wide down leg, Watson tries to sweep for a third time but the ball is too far away, the ball thuds off Dhoni's pads ..."}, {"ball": 7.5, "isHighlight": false, "text": "Ashwin to Ankit Sharma, $$OUT$$ ,caught at long-on! Ankit slogged an offbreak from outside off stump and for the awkward way he made contact he hit it pretty far, Dwayne Smith was right on the edge of the boundary when he took the catch"}, {"ball": 7.5, "isHighlight": false, "text": "$$Ankit$$ $$Sharma$$ $$c$$ $$Smith$$ $$b$$ $$Ashwin$$ $$30$$ $$(33m$$ $$27b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$111.11$$"}, {"ball": 7.6, "isHighlight": false, "text": "Ashwin to Watson,1 run,played off the pads towards square leg"}, {"ball": 7.6, "isHighlight": false, "text": "Ravindra Jadeja to bowl, left-arm spin from round the wicket ..."}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Watson,1 run,cut off the back foot to deep point"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Rahane,1 run,nudged off the front foot towards mid-on, Jadeja chases it all the way to the edge of the circle"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Watson,1 run,bowled flat and quick outside off, Watson goes back and cuts to short third man"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Rahane,no run,slowed it up, on off and middle, Rahane plays it back to the bowler"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Rahane,1 run,moves forward and outside off to drive through cover"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Watson,no run,punched off the back foot towards long-on, the fielder from midwicket - McCullum I think - dives across to cut it off"}, {"ball": 8.6, "isHighlight": false, "text": "The IPL debutant Vijay Shankar to bowl, medium pace from over the wicket. Dhoni is standing up to the stumps."}, {"ball": 9.1, "isHighlight": false, "text": "Shankar to Rahane,no run,Rahane gets beaten while trying to whip a good length ball on the leg side"}, {"ball": 9.2, "isHighlight": false, "text": "Shankar to Rahane,1 run,driven off the back foot through cover for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Shankar to Watson, $$FOUR$$ ,a low full toss outside off but Watson has width to use, he drives it hard off the front foot and once it beats the man in the circle at cover it's a four"}, {"ball": 9.4, "isHighlight": false, "text": "Shankar to Watson,2 runs,more width outside off stump, Watson drives to deep cover for two more"}, {"ball": 9.5, "isHighlight": false, "text": "Shankar to Watson, $$SIX$$ ,that's a half-volley on middle and leg, Watson gets on the front foot, gets under it and plays the lofted drive far over the long-on boundary"}, {"ball": 9.6, "isHighlight": false, "text": "Shankar to Watson, $$SIX$$ ,Watson wants a drink after sending the ball into the stands at deep midwicket, a length delivery from the debutant and Watson dispatches it with his trademark slogsweep"}, {"ball": 10.1, "isHighlight": false, "text": "Jadeja to Rahane,1 run,Rahane goes back and nudges a wicket-to-wicket delivery off his pads behind square"}, {"ball": 10.2, "isHighlight": false, "text": "Jadeja to Watson,no run,Watson tries to cut but gets a bottom edge into the ground and on to his pad, the ball was flat and straight from Jadeja, giving the batsman no room"}, {"ball": 10.3, "isHighlight": false, "text": "Jadeja to Watson,1 run,a flat and short delivery, Watson slaps it towards long off for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Jadeja to Rahane, $$OUT$$ ,Rahane's been run out! He pushed it off the front foot towards cover and ran. There was no single there but Watson had taken a few steps out of his crease and was late in sending Rahane back. By the time he had turned, Rahane had no chance. McCullum had swooped on the ball and under-armed it back to Dhoni"}, {"ball": 10.4, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$run$$ $$out$$ $$4$$ $$(11m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$57.14$$"}, {"ball": 10.5, "isHighlight": false, "text": "Jadeja to Nair,no run,Jadeja turns the ball past the outside edge of Nair's front-foot prod and Dhoni takes off the bails and appeals. The umpire goes to the third umpire but Nair's back foot was grounded"}, {"ball": 10.6, "isHighlight": false, "text": "Jadeja to Nair,no run,pushed off the front foot to cover"}, {"ball": 11.1, "isHighlight": false, "text": "Ashwin to Watson,1 run,Ashwin bowls a straighter line from round the wicket, Watson turns it off his front pad through square leg"}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Nair, $$FOUR$$ ,the umpire's signalled that runs! Nair began to play the reverse paddle but then seeing Ashwin was firing it down leg he played the normal paddle, not sure he got any bat on it but the ball beat Dhoni and went to the fine leg boundary"}, {"ball": 11.3, "isHighlight": false, "text": "Ashwin to Nair,1 run,played to deep square leg for a single"}, {"ball": 11.4, "isHighlight": false, "text": "Ashwin to Watson,1 run,Watson cuts the ball to short fine leg for a quick single"}, {"ball": 11.5, "isHighlight": false, "text": "Ashwin to Nair,no run,pushed off the front foot for a single"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin to Nair,no run,defended on the back foot towards the bowler"}, {"ball": 11.6, "isHighlight": false, "text": "Ramesh: \"Good thrown on the bounce to MSD from Baz on that run-out. Only a keeper can know how to throw it to another keeper without causing any discomfort :)\""}, {"ball": 12.1, "isHighlight": false, "text": "Sharma to Watson,no run,Mohit beats Watson comprehensively outside off stump with a slower one, Watson was through his drive before the ball arrived"}, {"ball": 12.2, "isHighlight": false, "text": "Sharma to Watson,no run,another slower ball outside off stump, Watson mows across the line and is beaten, by a big way"}, {"ball": 12.3, "isHighlight": false, "text": "Sharma to Watson, $$SIX$$ ,Mohit follows two awesome slower balls with a rubbish full toss on leg stump, Watson pulls it easily over the backward square leg boundary. That's Watson's fifty and his best score this season"}, {"ball": 12.4, "isHighlight": false, "text": "Sharma to Watson, $$OUT$$ ,middle stump has taken a beating! Mohit bowled it full and straight, Watson aimed the slog at the midwicket boundary and missed, that's that. The ball kept a bit low"}, {"ball": 12.4, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$b$$ $$Sharma$$ $$51$$ $$(55m$$ $$36b$$ $$3x4$$ $$4x6)$$ $$SR:$$ $$141.66$$"}, {"ball": 12.4, "isHighlight": false, "text": "Maddy: \"\"Mohit follows two awesome slower balls with a rubbish full toss on leg stump\". That was a setup to get the wkt next ball :)\""}, {"ball": 12.4, "isHighlight": false, "text": "A time-out is happening. Stuart Binny is the new batsman ..."}, {"ball": 12.5, "isHighlight": false, "text": "Sharma to Binny,no run,good length and angling into the right-hander around off stump, Binny gets an inside edge on to the pad"}, {"ball": 12.6, "isHighlight": false, "text": "Sharma to Binny,3 runs,Binny tries to play some sort of a dab and gets an edge that misses the stumps and Dhoni, the fielder from fine leg prevents the boundary"}, {"ball": 13.1, "isHighlight": false, "text": "Pandey to Binny,1 run,Binny stays in his crease and opens the face to play the ball to point"}, {"ball": 13.1, "isHighlight": false, "text": "sriniwas: \"Wth a lean IPL7 for Binny, he should have been rested\""}, {"ball": 13.2, "isHighlight": false, "text": "Pandey to Nair,1 run,steered off the back foot to third man"}, {"ball": 13.2, "isHighlight": false, "text": "NH: \"Rajasthan are using Steve Smith completely wrong, he is the BEST batsmen in their unit, and leaving him until no.5 or 6 is such a waste ! Surely must bat top four, especially if Watto continues to open !!\""}, {"ball": 13.2, "isHighlight": false, "text": "Noel: \"Badree bowls three overs for 11 runs, and not a positive comment. The only comment was a negative one which came from the 1 ball that went for 5 wides. Excellent bowling by Badree. There.\""}, {"ball": 13.3, "isHighlight": false, "text": "Pandey to Binny,no run,cut hard off the front foot but can't beat backward point ... where are those jailbreakers Faulkner and Smith? In the dug-out, that's where"}, {"ball": 13.4, "isHighlight": false, "text": "Pandey to Binny,1 run,good length on off and middle, played from the crease towards cover"}, {"ball": 13.5, "isHighlight": false, "text": "Pandey to Nair,1 run,in the blockhole around off stump, Nair mis-times it towards midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Pandey to Binny,no run,another mid-timed shot, a bottom-edged cut into the ground and towards backward point"}, {"ball": 13.6, "isHighlight": false, "text": "Badree to bowl his final over ..."}, {"ball": 14.1, "isHighlight": false, "text": "Badree to Nair,1 run,punched off the back foot and it beats the diving fielder in the circle"}, {"ball": 14.2, "isHighlight": false, "text": "Badree to Binny,no run,a loud appeal for lbw after the ball skidded on to Binny and hit the pad as he tried to defend, missing leg"}, {"ball": 14.3, "isHighlight": false, "text": "Badree to Binny, $$SIX$$ ,Binny steps out, Badree drops it shorter and Binny slogs it over the midwicket boundary"}, {"ball": 14.4, "isHighlight": false, "text": "Badree to Binny,1 run,an overthrow after the batsman plays it close on the off side"}, {"ball": 14.5, "isHighlight": false, "text": "Badree to Nair,no run,slog sweeps but does not make proper contact"}, {"ball": 14.6, "isHighlight": false, "text": "Badree to Nair, $$OUT$$ ,bowled him! Badree ends his spell with a wicket but Rajasthan won't mind that at all. Nair went back to cut one that was a bit too full and got a bottom edge onto off stump. That will bring in Smith, Faulkner and the rest ..."}, {"ball": 14.6, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$b$$ $$Badree$$ $$8$$ $$(21m$$ $$11b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$72.72$$"}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin is bowling from over the wicket!!!!"}, {"ball": 15.1, "isHighlight": false, "text": "Ashwin to Binny,no run,steps out of his crease and defends on the off side"}, {"ball": 15.2, "isHighlight": false, "text": "Ashwin to Binny,1 run,nudged off the pads towards short fine leg for one more"}, {"ball": 15.3, "isHighlight": false, "text": "Ashwin to Smith,2 runs,steps out of his crease but is not to the pitch of the ball, he nudges it into the gap at deep midwicket and times it slow enough to come back for the second"}, {"ball": 15.4, "isHighlight": false, "text": "Ashwin to Smith,1 run,reverse swept to short third man for a single"}, {"ball": 15.5, "isHighlight": false, "text": "Ashwin to Binny,1 leg bye,Binny tries to reverse sweep this time but is beaten, the ball hits Dhoni and goes on the off side, they steal a run"}, {"ball": 15.6, "isHighlight": false, "text": "Ashwin to Smith,1 run,swept to long leg for one more, that was Ashwin's best over today and he bowled it from over the wicket"}, {"ball": 15.6, "isHighlight": false, "text": "James: \"Baffled by RR's strategy here. Nair does well as an opener, so bats 4. Out of form Binny comes in ahead of in form Smith, leaving Faulkner and Cooper still warming the bench. Bonkers.\""}, {"ball": 16.1, "isHighlight": false, "text": "Jadeja to Smith,1 run,Smith steps out but is beaten in the flight, it turns away from him but manages to tap it towards long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Jadeja to Binny,1 run,driven through cover for a single"}, {"ball": 16.3, "isHighlight": false, "text": "Jadeja to Smith,no run,Smith aims for a huge reverse slog but is beaten and hit on the pad"}, {"ball": 16.4, "isHighlight": false, "text": "Jadeja to Smith,1 leg bye,Smith goes back to hit on the leg side but misses, the ball goes off the pad on the off side"}, {"ball": 16.5, "isHighlight": false, "text": "Jadeja to Binny, $$SIX$$ ,shot! Binny steps out of his crease and has room to free his arms, he plays a flowing lofted drive, hitting the ball with the spin over the extra cover boundary"}, {"ball": 16.6, "isHighlight": false, "text": "Jadeja to Binny,no run,there's an appeal for a run out after an eventful delivery! Binny survived an lbw appeal and the ball went on the off side, Binny tried to steal a leg bye but was sent back, he made it just in time"}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Smith, $$FOUR$$ ,shot! Smith steps out of his crease, waits for the slower one and lofts it inside out over extra cover, one-bounce four"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Smith, $$OUT$$ ,what a crazy shot. Smith began to play the scoop, but then saw that the ball was full and straight, and then tried to play some sort of a ramp. He ended up playing nothing and losing leg stump"}, {"ball": 17.2, "isHighlight": false, "text": "$$SPD$$ $$Smith$$ $$b$$ $$Sharma$$ $$9$$ $$(7m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner is the new batsman ..."}, {"ball": 17.2, "isHighlight": false, "text": "Sokhi Uppal: \"I'm not a RR fan but why so many negative criticism. They are winning most of their games and if they win this they will go 2nd so who are we to judge what order their players come in.\""}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to Faulkner,no run,good length and straight, Faulkner defends on the front foot and Mohit dives to his left to cut it off"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Faulkner,no run,good length and straight once again, Faulkner plays it back to the bowler once again"}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to Faulkner,1 run,the length is a bit shorter outside off and Faulkner slaps it down to long off"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Binny,2 runs,a slower one, Binny clears his front foot and slugs it towards wide long-on, not timed well"}, {"ball": 18.1, "isHighlight": false, "text": "Jadeja to Faulkner, $$OUT$$ ,bowled him! Faulkner's been done by the quicker, skiddy ball that goes straight on. Faulkner tries to work the ball through square leg but misses, the ball goes off the pad and knocks back leg stump"}, {"ball": 18.1, "isHighlight": false, "text": "$$JP$$ $$Faulkner$$ $$b$$ $$Jadeja$$ $$1$$ $$(5m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$25.00$$"}, {"ball": 18.1, "isHighlight": false, "text": "This is a lame finish from the Royals after such a promising set-up."}, {"ball": 18.2, "isHighlight": false, "text": "Jadeja to Yagnik,1 run,Yagnik jumps back and dabs the ball towards point"}, {"ball": 18.2, "isHighlight": false, "text": "Max: \"What a waste this innings has been.People called it strategy.Removing both openers do you call that a strategy.Why so many changes when you are playing against one of the best teams.Now see they will not get to 150.Very sad for RR fans like me.\""}, {"ball": 18.3, "isHighlight": false, "text": "Jadeja to Binny, $$OUT$$ ,caught at long-on, the Royal slump continues. Binny simply hit it straight to du Plessis with the bottom of his bat. All very average from Rajasthan"}, {"ball": 18.3, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Jadeja$$ $$22$$ $$(27m$$ $$17b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$129.41$$"}, {"ball": 18.4, "isHighlight": false, "text": "Jadeja to Yagnik,1 run,a top-edged pull but the ball falls short of deep backward square leg"}, {"ball": 18.5, "isHighlight": false, "text": "Jadeja to Bhatia,1 run,nudged off the front foot through midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Jadeja to Yagnik,1 run,a slog sweep to deep square leg, Jadeja ends a superb spell, 2-17"}, {"ball": 18.6, "isHighlight": false, "text": "Can Royals can up to 150? They will be sorely disappointed with anything less."}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Yagnik,1 bye,a slog outside off stump, the batsman is beaten and Dhoni does not bend low enough to collect, the ball hits his pad and he concedes a bye"}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to Bhatia, $$FOUR$$ ,a full ball on the pads, Bhatia flicks and places the ball through the gap between square leg and short fine leg, Shankar chases and dives on the boundary but doesn't save it"}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Bhatia,2 runs,Faf shows how it's done! He sprints to his left from long on and dives to field the ball in the nick of time, Bhatia had hammered the ball dead straight"}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Bhatia, $$OUT$$ ,caught at long off! Bhatia is done by the slower one, he throws his bat at a wider ball outside off and slices it high in the air, Smith runs in from the deep and catches it"}, {"ball": 19.4, "isHighlight": false, "text": "$$R$$ $$Bhatia$$ $$c$$ $$Smith$$ $$b$$ $$Sharma$$ $$7$$ $$(5m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$175.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to Yagnik,no run,another slower ball and the batsman is beaten as he tries to slog across the line"}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Yagnik,1 run,a full ball outside off, Yagnik hits it towards long off and Faf keeps them to one ... Royals settle for 148 and they will feel they should have got 160"}, {"ball": 19.6, "isHighlight": false, "text": "$$5.35$$ $$pm$$  The Royals attack are up against a powerful and performing CSK top order. They were 84 for 1 after ten and then they slumped. Mohit Sharma's three wickets have made him the top wicket-taker in the tournament."}, {"ball": 19.6, "isHighlight": false, "text": "zia: \"such a great waste of the start, i was expecting the RR to go beyond 180, CSK will sleep walk with this target.\" There is turn on this pitch though."}, {"ball": 19.6, "isHighlight": false, "text": "Milind: \"A below average performance from RR considering the kind of start they had. Only 3 players managing to get into double figures. Hopefully, they do much better in the bowling department ! And Hoping Dhoni promotes himself up the order and give home crowd some entertainment!\""}, {"ball": 19.6, "isHighlight": false, "text": "Pradeep: \"this pitch seems to become much slower as it goes on, may be thats the reason RR opened with Watson.. to get some quick runs when its easier to bat..CSK top order needs to smack up as much as possible in the powerplay, else they're gonna have a tough time against thambe n co.!\""}], "name": "Chennai Super Kings v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734003.html?innings=1;view=commentary", "match_num": 37}