{"commentary": [{"ball": 0, "isHighlight": false, "text": "Sajan: \"Tambe's best chance to show the India captain that he could be better than the India spinners Ashwin and Jadeja.\""}, {"ball": 0, "isHighlight": false, "text": "Dwayne Smith and Brendon McCullum walk in to do business. Ankit Sharma, who opened the batting for Royals, is also opening the bowling with left-arm spin from round the wicket."}, {"ball": 0.1, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,pitches on a good length and turns away from the right-hander, Smith defends on the front foot"}, {"ball": 0.2, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,a straighter line on the pads, Smith goes back to play on the leg side but misses and is hit on the pad"}, {"ball": 0.3, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,a skiddy ball that hits Smith on the back foot deep in his crease, that was missing leg"}, {"ball": 0.4, "isHighlight": false, "text": "Ankit Sharma to Smith,1 run,nudged to midwicket for a single"}, {"ball": 0.4, "isHighlight": false, "text": "Badshah Saha: \"Wow. Ankit gets to bowl and bat first. Lucky kid.\""}, {"ball": 0.5, "isHighlight": false, "text": "Ankit Sharma to McCullum,no run,bowled flat on middle stump, McCullum stays back and closes the face to play to square leg, he wants one, Smith does not"}, {"ball": 0.6, "isHighlight": false, "text": "Ankit Sharma to McCullum, $$SIX$$ ,McCullum ruins Anikt's over by charging down the pitch and lofting cleanly through the line to hit the ball over the long-on boundary"}, {"ball": 0.6, "isHighlight": false, "text": "Arpit: \"Good going Ankit Sharma. In our gully cricket only way a player can open both bowling and batting if he owns both bat and the ball.\""}, {"ball": 0.6, "isHighlight": false, "text": "James Faulkner from over the wicket  ..."}, {"ball": 1.1, "isHighlight": false, "text": "Faulkner to Smith,1 wide,that's a wide outside off, slanting across the right-hander, Smith slashes and misses"}, {"ball": 1.1, "isHighlight": false, "text": "Faulkner to Smith, $$SIX$$ ,shot! That's too full and a bit straight, Smith gets on the front foot and plays a checked, short-arm, lofted straight drive clean over the boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Faulkner to Smith,no run,defended into the off side"}, {"ball": 1.3, "isHighlight": false, "text": "Faulkner to Smith, $$SIX$$ ,Smith wants to make light work of this target! He's on the front foot as he lofts a length ball through the line and over long-off this time"}, {"ball": 1.4, "isHighlight": false, "text": "Faulkner to Smith,no run,a slower ball wide outside off stump, Smith mis-times it on the off side"}, {"ball": 1.5, "isHighlight": false, "text": "Faulkner to Smith,no run,Smith mows across the line at a slower ball wide outside off stump, he doesn't make contact"}, {"ball": 1.6, "isHighlight": false, "text": "Faulkner to Smith,no run,a bit too close to cut, Smith tries to and gets a bottom edge into the ground towards the keeper"}, {"ball": 2.1, "isHighlight": false, "text": "Ankit Sharma to McCullum, $$OUT$$ ,a superb catch! McCullum hit that slog sweep hard, sending the ball flat and fast towards square leg where Karun Nair caught it at head height. The ball went straight to him but it was travelling"}, {"ball": 2.1, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Nair$$ $$b$$ $$Ankit$$ $$Sharma$$ $$6$$ $$(8m$$ $$3b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 2.1, "isHighlight": false, "text": "Suresh Raina is CSK's No. 3."}, {"ball": 2.2, "isHighlight": false, "text": "Ankit Sharma to Raina,1 run,nudged off the front foot towards long on for a single"}, {"ball": 2.3, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,a flat ball on the pads, Smith dabs it towards square leg and wants one, Raina sends him back"}, {"ball": 2.4, "isHighlight": false, "text": "Ankit Sharma to Smith, $$FOUR$$ ,that's a long hop, too easy for Smith who nonchalantly pulls to deep midwicket for a one-bounce four"}, {"ball": 2.5, "isHighlight": false, "text": "Ankit Sharma to Smith,2 runs,strays on to the pads and Smith goes back and works it behind square, Tambe gives chase on a fast outfield and dives to save the boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Ankit Sharma to Smith,1 run,played off the back foot towards midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "rssampat: \"S.Smith should look at the way D.Smith is playing with a straight bat and proper cricket shot's. What did S.Smith do in the 8 ball's?? Tried 3 reverse sweep's, 1 reverse flick, 1 scoop, tried all fancy shot's and did not even play a single straight batted cricket shot while his own game the other night which won an impossible game was full of shots in front of the wicket and not a single \"cute\" shot was attempted and a impossible victory was secured.\" Rant over."}, {"ball": 2.6, "isHighlight": false, "text": "Tambe from over the wicket ..."}, {"ball": 3.1, "isHighlight": false, "text": "Tambe to Smith, $$FOUR$$ ,too short and there's width outside off, Smith goes back in his crease and plays a correct back-foot drive that beats mid-off"}, {"ball": 3.2, "isHighlight": false, "text": "Tambe to Smith, $$FOUR$$ ,mid-off is in the circle so Smith simply gets on to the front foot and lofts the ball with a straight bat over that fielder, one-bounce four to long off"}, {"ball": 3.2, "isHighlight": false, "text": "Mid-off goes back to chase the bolting horse."}, {"ball": 3.3, "isHighlight": false, "text": "Tambe to Smith,1 run,Smith hits it to long-off again, but along the ground this time because the fielder is in the deep"}, {"ball": 3.3, "isHighlight": false, "text": "Mudassir Hashmi: \"Dwayne Smith has been a more a dependable batsman than Maxwell. Most of Smith's runs have come in stressful chases, Maxwell exploded mostly in the first innings.\""}, {"ball": 3.4, "isHighlight": false, "text": "Tambe to Raina,1 run,Raina moves back and across and punches the ball to long-on"}, {"ball": 3.5, "isHighlight": false, "text": "Tambe to Smith,no run,played on the back foot on the off side"}, {"ball": 3.6, "isHighlight": false, "text": "Tambe to Smith,1 wide,Yagnik thinks he has caught Smith down the leg side as he tried to swat the ball but the umpire calls it wide"}, {"ball": 3.6, "isHighlight": false, "text": "Tambe to Smith,1 run,driven to long-on for a single"}, {"ball": 4.1, "isHighlight": false, "text": "Ankit Sharma to Smith,1 run,pushed off the back foot towards midwicket for a single, Ankit's pushing them through flat and straight"}, {"ball": 4.2, "isHighlight": false, "text": "Ankit Sharma to Raina, $$OUT$$ ,that's a poor ball but Raina's swept it straight to short fine leg! Ankit pitched on leg from round the wicket and it was an ordinary delivery. Raina moved across his stumps, got down on one knee and swept. He didn't hit it high enough but a couple of feet either side of the fielder at short fine and it would have been four. However, the ball went straight to Bhatia, who took a low catch"}, {"ball": 4.2, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Bhatia$$ $$b$$ $$Ankit$$ $$Sharma$$ $$2$$ $$(8m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 4.3, "isHighlight": false, "text": "Ankit Sharma to du Plessis,no run,a strong appeal for lbw after Faf tries to defend on the front foot but the umpire says there was an inside edge on to pad. He was right"}, {"ball": 4.4, "isHighlight": false, "text": "Ankit Sharma to du Plessis,no run,played back to the bowler after coming out of the crease"}, {"ball": 4.5, "isHighlight": false, "text": "Ankit Sharma to du Plessis,1 run,played to deep midwicket for a single"}, {"ball": 4.6, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,Smith works the ball off his pads to square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Kevon Cooper is playing his first game of the season and he is going to bowl from over the wicket ..."}, {"ball": 5.1, "isHighlight": false, "text": "Cooper to du Plessis,no run,he's bowled him! Cooper begins to celebrate but then realises the ball hasn't dislodged a bail. Faf defended a length ball but it hit the bottom of his bat and bounced on the pitch and rolled on to the stumps, the impact was too soft"}, {"ball": 5.2, "isHighlight": false, "text": "Cooper to du Plessis, $$FOUR$$ ,tremendous response! Du Plessis steps out of his crease and drives a full ball with a wonderfully straight bat right past the bowler"}, {"ball": 5.3, "isHighlight": false, "text": "Cooper to du Plessis,no run,Du Plesiss moves forward and across to glance to fine leg but misses, that was close to leg stump"}, {"ball": 5.4, "isHighlight": false, "text": "Cooper to du Plessis,1 run,glanced to short fine leg for a single"}, {"ball": 5.5, "isHighlight": false, "text": "Cooper to Smith,no run,nearly in the blockhole, Smith plays it out towards square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Cooper to Smith,1 run,a slower one on middle stump, Smith stays back and nudges in front of square for a single"}, {"ball": 6.1, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,pitches on middle and turns across Smith, who goes back and dabs towards the bowler"}, {"ball": 6.2, "isHighlight": false, "text": "Ankit Sharma to Smith,1 run,played off the back foot towards long on for a single"}, {"ball": 6.3, "isHighlight": false, "text": "Ankit Sharma to du Plessis,1 run,Faf goes right back and taps the ball through midwicket for a single"}, {"ball": 6.4, "isHighlight": false, "text": "Ankit Sharma to Smith,1 leg bye,fired down leg side, Smith tries to paddle the ball but misses and is hit on the leg"}, {"ball": 6.5, "isHighlight": false, "text": "Ankit Sharma to du Plessis,1 run,Faf stands outside leg to make room and then hits a flat one through cover"}, {"ball": 6.6, "isHighlight": false, "text": "Ankit Sharma to Smith,no run,defended back to the bowler on the front foot, Ankit finishes four overs on the trot - 2 for 20. Top spell"}, {"ball": 6.6, "isHighlight": false, "text": "Bhatia from over the wicket, right-arm canny variations."}, {"ball": 7.1, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,a full ball on off stump, played on to the leg side for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Bhatia to Smith,1 wide,the slower one drifts down leg side, Yagnik lunges to collect and then lunges back to break the stumps, nicely done"}, {"ball": 7.2, "isHighlight": false, "text": "Bhatia to Smith, $$FOUR$$ ,another slower ball but it's short and outside off, Smith goes back and uses his brawn to mow the ball wide of the fielder at long-on"}, {"ball": 7.3, "isHighlight": false, "text": "Bhatia to Smith,1 run,played through midwicket for a single"}, {"ball": 7.4, "isHighlight": false, "text": "Bhatia to du Plessis,no run,defended from the crease towards Watson at cover"}, {"ball": 7.5, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,full length outside off, driven on the front foot along the ground for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Bhatia to Smith, $$FOUR$$ ,that's a bottom edge and the ball has scooted between the keeper's legs for a boundary. That is not a chance. Smith slogged across the line and got a bottom edge from wide outside off stump"}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to du Plessis,1 run,bowled full and straight, Faf moves forward and clips it through midwicket"}, {"ball": 8.2, "isHighlight": false, "text": "Tambe to Smith,1 run,tossed up on middle, Smith drives firmly to long on"}, {"ball": 8.3, "isHighlight": false, "text": "Tambe to du Plessis,2 runs,Faf jumps out of his crease, Tambe tries to beat him down leg side but Faf manages to flick it through midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Tambe to du Plessis,2 runs,Faf plays a cheeky little scoop over the keeper, didn't time it well at all"}, {"ball": 8.5, "isHighlight": false, "text": "Tambe to du Plessis,no run,steps out of his crease but is beaten in the length and hit on the pads, Tambe appeals for lbw but the batsman was too far down the pitch"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to du Plessis, $$FOUR$$ ,short third man dives over the ball after Faf makes good contact with a ramp that goes between the keeper and the fielder, the ball rolls on to the rope before fine leg can get to it"}, {"ball": 8.6, "isHighlight": false, "text": "Juzer: \"Strange decisions in this match. One of which - Watto hasn't bowled yet\""}, {"ball": 9.1, "isHighlight": false, "text": "Cooper to Smith,no run,Smith slogs across the line at a slower ball outside off and is beaten"}, {"ball": 9.2, "isHighlight": false, "text": "Cooper to Smith,1 run,in the blockhole but Smith digs it out on the off side and runs"}, {"ball": 9.3, "isHighlight": false, "text": "Cooper to du Plessis,no run,good length just outside off, Faf defends on the off side and Cooper runs across towards short cover to field and prevent the single"}, {"ball": 9.4, "isHighlight": false, "text": "Cooper to du Plessis,1 run,short ball wide outside off, Faf drags it with the pull and hits it in front of square"}, {"ball": 9.5, "isHighlight": false, "text": "Cooper to Smith,no run,Smith flays his bat at a length ball outside off and is beaten"}, {"ball": 9.6, "isHighlight": false, "text": "Cooper to Smith, $$OUT$$ ,caught behind! Cooper strikes with the slower ball that was pitched short of a length! Smith was on the pull way too early and the top edge lobbed tamely to the keeper. Yagnik ran forward to take it"}, {"ball": 9.6, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$†Yagnik$$ $$b$$ $$Cooper$$ $$44$$ $$(43m$$ $$35b$$ $$5x4$$ $$2x6)$$ $$SR:$$ $$125.71$$"}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin has come out to bat! Ahead of Dhoni and Jadeja. Royals were 84 for 1 at this stage."}, {"ball": 10.1, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,a length ball outside off, punched from the crease to long off"}, {"ball": 10.1, "isHighlight": false, "text": "Krishna: \"What on Earth is happening? Ashwin ahead of Dhoni?\""}, {"ball": 10.2, "isHighlight": false, "text": "Bhatia to Ashwin,1 run,full and straight, Ashwin gets off the mark by pushing the ball to long on"}, {"ball": 10.3, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,a very slow ball on middle and off, Faf bunts it through midwicket for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Bhatia to Ashwin,no run,good length around off with a slow ball, Ashwin defends on the front foot to cover"}, {"ball": 10.5, "isHighlight": false, "text": "Bhatia to Ashwin,no run,Ashwin moves across his crease and tries to play the ball square by closing the face, the leading edge nearly carried to Bhatia"}, {"ball": 10.6, "isHighlight": false, "text": "Bhatia to Ashwin,1 run,moves across and plays the ball to long on for a single"}, {"ball": 10.6, "isHighlight": false, "text": "Sinbad: \"One possible reason for promoting Ashwin is his ability to play with straight bat on a slow pitch? Baffling otherwise.\""}, {"ball": 10.6, "isHighlight": false, "text": "Karan: \"Ashwin has come ahead of Dhoni as Dhoni is a master of 16-20 overs and if Dhoni gets out cheaply then CSK would have been in a huge trouble.\""}, {"ball": 11.1, "isHighlight": false, "text": "Tambe to Ashwin,1 run,steps out of his crease and drives calmly to long-off"}, {"ball": 11.2, "isHighlight": false, "text": "Tambe to du Plessis,1 run,driven to long on for a single"}, {"ball": 11.3, "isHighlight": false, "text": "Tambe to Ashwin,2 runs,Ashwin steps out to take the ball on the full and drives it wide of long-on, placing it well enough to come back for two even though the fielder is Steven Smith"}, {"ball": 11.4, "isHighlight": false, "text": "Tambe to Ashwin,1 run,bowled flat and fast and straight, Ashwin stays back and dabs the ball towards cover"}, {"ball": 11.5, "isHighlight": false, "text": "Tambe to du Plessis,1 run,Faf comes out and drops the ball close on the leg side for a single"}, {"ball": 11.6, "isHighlight": false, "text": "Tambe to Ashwin,1 leg bye,Ashwin steps out and nudges the ball very close on the leg side, the bowler should have cut that off"}, {"ball": 11.6, "isHighlight": false, "text": "Mindreader: \"Dhoni likes to escape from responsibilities, he likes to come only when he sees the situation is in their favour, comes in for couple of big hits and takes credit...\" That's stretching it a bit, Mindreader."}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Ashwin,no run,Ashwin tries to drive through cover but mis-times it because it's a slower variation of a slower ball"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Ashwin,no run,in the blockhole and Ashwin plays it to midwicket, Faf had come a long way out of his crease and had to hurry back"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Ashwin, $$FOUR$$ ,superb placement! Ashwin gets down on one knee and slog sweeps the ball into the gap on the cow corner boundary"}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Ashwin,1 run,Ashwin moves across his crease and taps the ball softly into the leg side for a single towards midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Barath: \"Promoting Ashwin is a great move considering the slowness of the pitch. Ashwin is a cheeky player or a player who likes to nudge the ball and keep the score board ticking.We have MSD and SIR to take care of the run rate at the back end.RR should counter this move by bowling watson.Both Ash and Faf have the tendency of chasing the ball well outside off at the start of their innings\""}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to du Plessis,2 runs,worked off the pads through midwicket and Faf has hit it gently enough to run two, though Ashwin has to dive at the bowler's end to make it"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,taken on the full and driven to deep cover, productive over for CSK"}, {"ball": 12.6, "isHighlight": false, "text": "Sahiba: \"I disagree with you mindreader, Dhoni gives everyone else a chance to play and comes in when everything is out of control. And those big hits are not so easy as you make them sound. He has turned so many innings around by his batting. World cup, rings a bell?\""}, {"ball": 12.6, "isHighlight": false, "text": "Faulkner's back ..."}, {"ball": 13.1, "isHighlight": false, "text": "Faulkner to du Plessis,no run,a slower ball outside off, from the back of the hand, played from the crease to cover"}, {"ball": 13.2, "isHighlight": false, "text": "Faulkner to du Plessis,1 run,nudged off the pads from the crease to square leg"}, {"ball": 13.3, "isHighlight": false, "text": "Faulkner to Ashwin,1 run,Ashwin lofts it down to long on but mis-times it, the ball falls short of Smith in the deep"}, {"ball": 13.4, "isHighlight": false, "text": "Faulkner to du Plessis,1 run,Faf moves back and across and flicks the length ball through square leg"}, {"ball": 13.4, "isHighlight": false, "text": "Sriram: \"Ashwin had a terrible day with the ball and maybe Dhoni is asking him to go ahead and have a bat and regain his confidence. This strengthens the lower middle order as well now.\""}, {"ball": 13.5, "isHighlight": false, "text": "Faulkner to Ashwin,1 run,backs away outside leg to make room, Faulkner follows him with a slower ball, the batsman dabs but can't beat short third man"}, {"ball": 13.5, "isHighlight": false, "text": "Faf du Plesiss seems to have an issue with his leg."}, {"ball": 13.6, "isHighlight": false, "text": "Faulkner to du Plessis,1 run,driven to long off for a single, and the game will break for important strategies to be discussed during the time out"}, {"ball": 13.6, "isHighlight": false, "text": "Yashwanth: \"I am a great fan of Dhoni but some times I get baffled by his decisions!! Jus few days nack when CSK needed to get 230+ why did he not come @3 or 4 and try those big hits???!! He has come after Faf and Jadeja!! Is this not escaping from things??? I am very disappointed with this and I hope he doesn't do this when he plays for India :-)\""}, {"ball": 13.6, "isHighlight": false, "text": "Subham: \"I disagree with you Sahiba. Can you tell me any other innings of Dhoni where he has come early and chased the target? World Cup, only! I think he is there for only the last over finishes. Yes, it's tough to hit a six or two in the last over but MS has the capability of taking a lot more responsibility!\""}, {"ball": 13.6, "isHighlight": false, "text": "Faf du Plessis is getting his left leg looked at. Seemed to have damaged it while turning for a run."}, {"ball": 14.1, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,a length, slower ball outside off, Faf stays back and drives to long off"}, {"ball": 14.2, "isHighlight": false, "text": "Bhatia to Ashwin,1 run,Ashwin stays in his crease and mis-times the ball towards cover where Watson fails to prevent the single"}, {"ball": 14.3, "isHighlight": false, "text": "Bhatia to du Plessis,2 runs,steps out of his crease and slaps a length ball through cover, Ashwin sprints back for the second, Faf hobbles, it's roughly the same speed for both"}, {"ball": 14.4, "isHighlight": false, "text": "Bhatia to du Plessis,1 run,played to long on for a single"}, {"ball": 14.5, "isHighlight": false, "text": "Bhatia to Ashwin, $$OUT$$ ,bowled him with an uber slow ball, Ashwin made room outside leg and slogged across the line, he was through the shot too early and leg stump took a hit"}, {"ball": 14.5, "isHighlight": false, "text": "$$R$$ $$Ashwin$$ $$b$$ $$Bhatia$$ $$14$$ $$(24m$$ $$16b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$87.50$$"}, {"ball": 14.5, "isHighlight": false, "text": "MS Dhoni has come out to try and see this chase through. Ranchi gives him a rousing welcome."}, {"ball": 14.6, "isHighlight": false, "text": "Bhatia to Dhoni,1 run,Dhoni nudges the ball close on the leg side and runs, Faf has an injured leg but he responds, the keeper fields and throws at the bowler's end but misses, Dhoni turns around for the overthrow but spares Faf the strain"}, {"ball": 15.1, "isHighlight": false, "text": "Tambe to Dhoni,no run,Dhoni was on the back foot and squared up by a legbreak that pitched middle and spun past off"}, {"ball": 15.2, "isHighlight": false, "text": "Tambe to Dhoni,1 run,that's too short and it kept low, Dhoni stayed back and nudged off his pads behind square"}, {"ball": 15.3, "isHighlight": false, "text": "Tambe to du Plessis,1 run,Faf steps out and hits the ball to long off for a single"}, {"ball": 15.4, "isHighlight": false, "text": "Tambe to Dhoni,no run,Dhoni stays back and mis-times a shot into the covers, Tambe bowled it flat and straight"}, {"ball": 15.5, "isHighlight": false, "text": "Tambe to Dhoni,no run,tossed up on a fuller length, played back to the bowler"}, {"ball": 15.6, "isHighlight": false, "text": "Tambe to Dhoni, $$FOUR$$ ,a terrible finish from Tambe, he had bowled so beautifully by not trying too much but now he fires a ball fast down leg side, Dhoni paddles and gets some bat on it to beat the keeper"}, {"ball": 15.6, "isHighlight": false, "text": "Watson's gone to Cooper ..."}, {"ball": 16.1, "isHighlight": false, "text": "Cooper to du Plessis,1 run,Faf stays back, taps the ball towards point and takes the single, he's hobbling but he isn't hesitating"}, {"ball": 16.2, "isHighlight": false, "text": "Cooper to Dhoni,1 run,well done Watto, cuts off a firm drive from Dhoni at cover, good stop"}, {"ball": 16.3, "isHighlight": false, "text": "Cooper to du Plessis,no run,a slower ball short of a length, Faf pulls too early and is beaten"}, {"ball": 16.3, "isHighlight": false, "text": "Manu: \"Tight over with RRR nearly 10. Two runs from five balls. New batsman in. Commentator goes \"It's getting tight now, the pressure is on, worried looks around the ground\". Camera pans to Dhoni. A calm, poker-face, probably wondering \"I wonder what dinner it would be tonight\"\""}, {"ball": 16.4, "isHighlight": false, "text": "Cooper to du Plessis,1 leg bye,Cooper spears in a yorker and smacks Faf on the base of the pad, that was missing leg, Cooper can't believe he doesn't have an lbw"}, {"ball": 16.5, "isHighlight": false, "text": "Cooper to Dhoni,1 run,a poor ball, full and down leg, Cooper is lucky to escape with that, Dhoni glances it to short fine leg"}, {"ball": 16.6, "isHighlight": false, "text": "Cooper to du Plessis,1 run,worked off the back foot in front of square leg ..."}, {"ball": 16.6, "isHighlight": false, "text": "The stage is set for Dhoni - 32 to get in three overs. This is his bread and butter. Faulkner to bowl."}, {"ball": 17.1, "isHighlight": false, "text": "Faulkner to du Plessis,1 run,Faf steps out of his crease and mis-times the loft towards long-on, Smith runs in and fields"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner to Dhoni,1 wide,Faulkner sprays the ball wide outside off from over the wicket, that's a wide"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner to Dhoni,1 run,a length ball and Dhoni swipes it down the ground to Steven Smith at long on, Faf turns to come back for the second but Dhoni doesn't want it, Faf goes scrambling back on a bad leg and dives to make his crease at the striker's end"}, {"ball": 17.2, "isHighlight": false, "text": "Rohit: \"To all the Dhoni bashers: it's time to acknowledge the genius of this man. While other teams may be shuffling their batting order just to grab a win, Dhoni is doing it not just for the win today but for the big day; the final. May be early days to predict but Dhoni and his men are all but through to the playoffs. Time to get even more serious and ensure that the whole batting lineup is clicking. Just 5 games in all to do so. Super MSD! (By the way, I am a Kings XI fan).\""}, {"ball": 17.3, "isHighlight": false, "text": "Faulkner to du Plessis,1 wide,Faulkner sprays a second wide far outside off, he's trying to get Faf to lunge for it on a bad leg"}, {"ball": 17.3, "isHighlight": false, "text": "Faulkner to du Plessis, $$OUT$$ ,in the blockhole, bowled him! Full and straight, and fast too. Faf was outside leg, making room to hit through the off side. He missed and the ball crashed into the base of middle sump"}, {"ball": 17.3, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$b$$ $$Faulkner$$ $$38$$ $$(64m$$ $$39b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$97.43$$"}, {"ball": 17.3, "isHighlight": false, "text": "Ratheesh Naraya: \"Can you guys tell me one finisher who can win games consistently like Dhoni.. No matter what he does.. But what matters is a win on that day..\""}, {"ball": 17.3, "isHighlight": false, "text": "Jadeja is the new batsman. Fast legs at the wicket."}, {"ball": 17.4, "isHighlight": false, "text": "Faulkner to Jadeja,1 run,Jadeja moves forward and across to turn a full ball in front of square leg"}, {"ball": 17.5, "isHighlight": false, "text": "Faulkner to Dhoni,1 run,a slower ball on a good length outside off, Dhoni was on the back foot, perhaps waiting to wind up, but he ended up dabbing it towards point"}, {"ball": 17.5, "isHighlight": false, "text": "Jadeja backs out so late, Faulkner was well into his delivery stride and so he delivered the ball. Not like Starc did though."}, {"ball": 17.6, "isHighlight": false, "text": "Faulkner to Jadeja,1 run,Jadeja dabs the length ball to short third man to keep strike"}, {"ball": 17.6, "isHighlight": false, "text": "Cooper's got the tough job, to bowl the penultimate over. Watson has not bowled today."}, {"ball": 17.6, "isHighlight": false, "text": "Manu: \"Blessing in disguise for CSK. Faf wasn't going anywhere and he couldn't run either. Now Jadeja and Dhoni will run those 2s and 3s and explode in the end.\""}, {"ball": 18.1, "isHighlight": false, "text": "Cooper to Jadeja,1 run,a slower ball on a good length, Jadeja checks his shot and chips the ball through cover"}, {"ball": 18.2, "isHighlight": false, "text": "Cooper to Dhoni,1 run,has Jadeja been run out? Tambe hits the stumps direct from short fine leg but Jadeja is super quick and safe. Cooper had delivered the yorker and Dhoni dug it out via an inside edge to short fine leg"}, {"ball": 18.3, "isHighlight": false, "text": "Cooper to Jadeja, $$SIX$$ ,wham! Jadeja's sent the ball flying over long off, that has been a long time coming for CSK. He jumps down the track to get to the pitch of the ball and swings hard, making superb contact"}, {"ball": 18.4, "isHighlight": false, "text": "Cooper to Jadeja,1 run,Jadeja tries to work the ball on the leg side but gets an bottom edge past the stumps to the keeper, Dhoni sprints through for the single"}, {"ball": 18.5, "isHighlight": false, "text": "Cooper to Dhoni,2 runs,Has Dhoni been run out this time? Dhoni thundered back for the second after inside-edging a slog to deep square leg, the throw hit direct but Dhoni's stretch took him home. It was a close call!"}, {"ball": 18.5, "isHighlight": false, "text": "Manasseh Anand: \"Even with a direct hit and no dive from batsman, MSD is in. Shows the speed of the man between the wickets :)\""}, {"ball": 18.6, "isHighlight": false, "text": "Cooper to Dhoni,2 runs,a sensational yorker from Cooper but Dhoni manages to dig it out towards midwicket, the fielder is in the deep so there's no danger in taking two this time"}, {"ball": 18.6, "isHighlight": false, "text": "12 needed off the final over ... Watson is talking to Faulkner, who has the responsibility bowl bowling the 20th over. He did it with the bat in Bangalore ..."}, {"ball": 19.1, "isHighlight": false, "text": "Faulkner to Jadeja,1 run,a length ball outside off, Jadeja cuts but can't beat point, Ankit Sharma fields"}, {"ball": 19.1, "isHighlight": false, "text": "Rummy: \"Dhoni and Jaddu running like mad, and I'm panting watching it from the comfort of my couch.\""}, {"ball": 19.2, "isHighlight": false, "text": "Faulkner to Dhoni, $$SIX$$ ,Dhoni's smashed it! He's dragged the full ball from outside off stump and whacked it flat over the wide long-on boundary, there you go"}, {"ball": 19.2, "isHighlight": false, "text": "Just the five needed now ..."}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner to Dhoni,2 runs,a wide full toss outside off stump, Dhoni reaches out and hits it to Cooper at deep cover, there's some serious running going on, two more ... CSK so close now"}, {"ball": 19.4, "isHighlight": false, "text": "Faulkner to Dhoni,3 runs,CSK have done it! Royals fall to pieces off that delivery. Dhoni pushed the ball through cover again and Cooper was slow in coming off the boundary, they were going to complete the second to level the scores. Cooper threw to Faulkner who was sloppy in collecting the throw ... they conceded the overthrow ... CSK go to the top of the league with two balls to spare."}, {"ball": 19.4, "isHighlight": false, "text": "$$7.35$$ $$pm$$  Time for the presentation ceremony."}, {"ball": 19.4, "isHighlight": false, "text": "Dhoni: \"What we wanted to do was take it to the end but they bowled well and made us stretch a bit, the big shot from Jadeja really helped a lot ... on a wicket like this you shouldn't really go for more than 10 or 12 runs, it was difficult to score ... we had a few overs like that while bowling. We wanted to use him, given Ashwin more responsibility ,he has batting ability ... to go after the spinners. To some extent it paid off, you have to give them chances can't expect them to perform all of a sudden ...\""}, {"ball": 19.4, "isHighlight": false, "text": "The Man of the Match is Ravindra Jadeja: \"I like to play on this ground, I do something special for my team here. It's a good wicket to bowl on but batting you need to play a few balls early on and then accelerate later.\""}, {"ball": 19.4, "isHighlight": false, "text": "Right, there's another game beginning in Bangalore shortly. Hop over to that scorecard. Thank you for all your emails this evening. Cheers."}, {"ball": 19.4, "isHighlight": false, "text": "$$7.25$$ $$pm$$  There's been a debate about Dhoni's tactics in the game but he was there at the finish and the win's on the board for CSK. Can't argue too much with that."}, {"ball": 19.4, "isHighlight": false, "text": "Chandar: \"He does it with the running, when the big hitting is not possible. This is also a wonderful finish\""}, {"ball": 19.4, "isHighlight": false, "text": "Sachinfan: \"Somedays you are the bug, somedays you are the windshield...This is the quote James Faulkner's biography should start with :)\""}, {"ball": 19.4, "isHighlight": false, "text": "Abhishek Tiwari: \"I think opposition teams should forfeit matches without bowling last 2-3 overs if Dhoni is there at the crease chasing a target. It's a waste of time for everyone as result is a foregone conclusion.\""}, {"ball": 19.4, "isHighlight": false, "text": "Sree: \"It was smart of Dhoni to send Ashwin when he did, because there was no way we were getting the 2s and 3s we did with Ashwin at the wicket at this time.\""}], "name": "Chennai Super Kings v Rajasthan Royals", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734003.html?innings=2;view=commentary", "match_num": 37}