{"commentary": [{"ball": 0, "isHighlight": false, "text": "Gayle takes guard. Just a reminder. It's a 20 over game as usual"}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$8.50pm$$ : DD have won the toss and they are  $$bowling$$ $$first$$ . One change for DD - Vijay is in for Laxmi Shukla."}, {"ball": 0, "isHighlight": false, "text": "Three changes for RCB. Muralitharan comes in for Albie, Sachin Rana in for Aaron and Abu Nechim for Ashok Dinda. So the suspense over Gayle is over. He is playing"}, {"ball": 0, "isHighlight": false, "text": "RCB: Gayle, Parthiv, Virat, Yuvi, AB, Sachin Rana, Vijay Zol, Abu Nechim, Murali, Starc, Chahal"}, {"ball": 0, "isHighlight": false, "text": "Afroze: \"Finally this right deserving players getting games - Abu Nechim, Zol and the one and only Murali! Hope this combo fires for RCB and they repeat what happened in 2009. (after down and out, 6 straight wins to make it to the finals)\""}, {"ball": 0, "isHighlight": false, "text": "$$8.40pm$$ : We have some good news... for now. The covers are coming off. Permanently, we hope."}, {"ball": 0, "isHighlight": false, "text": "The toss will happen at  $$8.50pm$$ . Play will begin at  $$9.10$$ , 20 overs a side. No reduction in overs."}, {"ball": 0, "isHighlight": false, "text": "Was waiting for a comment like this..."}, {"ball": 0, "isHighlight": false, "text": "Rohit: \"As a Bangalorean, the first thought that comes to mind on hearing that the match will probably go on past Midnight... Auto drivers are going to make a killing!\""}, {"ball": 0, "isHighlight": false, "text": "There's a song for this though, by the Bangalore-based jazz band Thermal and a Quarter. It's called \"Meter mele one and a half\". Check it out on Youtube"}, {"ball": 0, "isHighlight": false, "text": "$$8.35pm$$ : ...and the covers are back on! The steady drizzle returns."}, {"ball": 0, "isHighlight": false, "text": "Nadish: \"RCB fans must surely follow either Liverpool or Spurs. Every year, you think it's your time. Every year, you're wrong.\""}, {"ball": 0, "isHighlight": false, "text": "$$8.25pm$$ : Word going around in Twitterland is that the covers are coming off."}, {"ball": 0, "isHighlight": false, "text": "Our very own Nitin Sundar tweets: \"It's bone dry at Richmond Circle, around a km away from the Chinnaswamy as the crow flies!\""}, {"ball": 0, "isHighlight": false, "text": "Pulkit: \"I think Shadab Jakati should be given a chance instead of HV Patel. He was a key figure in Chennai's winning campaign in 2011, taking 13 wickets.\""}, {"ball": 0, "isHighlight": false, "text": "$$8.05pm$$ : So we definitely have another delay. But from the looks of it, it's not heavy rain."}, {"ball": 0, "isHighlight": false, "text": "Getting a few queries regarding the Fantasy teams. The cut-off is 8pm, so no extensions for delays, unfortunately."}, {"ball": 0, "isHighlight": false, "text": "And no idea yet if Gayle is playing or not. We just have to wait and watch. One of those days... Sorry guys"}, {"ball": 0, "isHighlight": false, "text": "Shahid: \"I stay 5 kms away from the stadium and it isnt raining here. Play should resume soon..\""}, {"ball": 0, "isHighlight": false, "text": "Aneesh: \"Match should be played on Shahid's rooftop.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.58pm$$ : Okay this is frustrating. Minutes before the (already delayed) toss, the drizzle returns!"}, {"ball": 0, "isHighlight": false, "text": "Harish Varanasi: \"Nice ring to it when we hear people from different walks of life tweet or refer about another profession. Yohan Blake on RCB, Virat on Germany's football chances, Jeffery Archer on cricket in his books and in real life.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.51$$ : An update"}, {"ball": 0, "isHighlight": false, "text": "Shirin Sadikot tweets: \"The rain has stopped, they're taking the covers off. Toss at 8pm, match to start at 8:30. 20-overs each.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.45pm$$ : Just saw a tweet saying the covers are coming off."}, {"ball": 0, "isHighlight": false, "text": "Shreyas Sharma: \"Yes I'm at the ground. Screens now saying toss at 8pm\""}, {"ball": 0, "isHighlight": false, "text": "Yohan Blake (the Jamaican sprinter) tweets: \"So I am on my way to run in England /Manchester trying to get signal in the air to watch @RCBTweets can't miss a game all the best my team\""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "arpit: \"RCB should drop Dinda for the rest of the season. Abu Nechim is a far better bowler than Dinda. 9 out of 10 times Dinda goes above 10 an over. The bigger his jump, the longer the six.\""}, {"ball": 0, "isHighlight": false, "text": "Spaceman Spiff: \"The best part about the awesome weather in Bengloor right now is that it will end up completely wiping off all chances for RCB in this IPL.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.35$$ : Just saw a picture of the covers on at the Chinnaswamy. Bad news. Not sure yet about the toss."}, {"ball": 0, "isHighlight": false, "text": "Shreyas Sharma: \"It is a light drizzle but the covers are on. Delayed start.\" I'm guessing you are at the ground?"}, {"ball": 0, "isHighlight": false, "text": "X: \"With three of the four playoff finals already decided , it looks like it will come down to just 2 matches! Srh and KKR will be playing each other twice, and the winner of both these is most likely to advance. These should be the crucial encounters of the season\""}, {"ball": 0, "isHighlight": false, "text": "Just seeing some comments about the rain threat in Bangalore. Will confirm that soon."}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$ : It's RCB v DD but until we get on that we wait on the result of the thriller in Ranchi. And as I write CSK have just snatched victory from the jaws of defeat. It's  $$that$$  man Dhoni again. The toss in Bangalore will be underway soon."}, {"ball": 0, "isHighlight": false, "text": "So we have two underachieving teams competing tonight. This must be particularly painful for RCB considering that unlike some franchises, they get to play all their home games in Bangalore. They must be desperate to give their loyal fans something to shout about. Will it be tonight? Read the  $$preview$$  before we carry on."}, {"ball": 0, "isHighlight": false, "text": "Simran: \"Delhi Daredevils should play Murali Vijay instead of Mayank Agarwal... This time Duminy should come after 2 wickets are down and Jadhav after 3 Wickets have gone down...And Pietersen should open with Murali Vijay...That would be great....And Unadkat should open with the bowling..\""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "Three more video rounds to go... Three chances everyday to make sure you participate in them. INR 10,000 for daily winners, bigger prizes for making it to the next stages, and a fully-paid trip to Lord's for winning.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ . Play now."}, {"ball": 0.1, "isHighlight": false, "text": "Duminy to Gayle,no run,one slip in place, Gayle stays back and defends"}, {"ball": 0.2, "isHighlight": false, "text": "Duminy to Gayle,no run,bowls it flatter and he stays back and punches down the track"}, {"ball": 0.3, "isHighlight": false, "text": "Duminy to Gayle,no run,this was quicker and Gayle is happy to come forward and defend"}, {"ball": 0.4, "isHighlight": false, "text": "Duminy to Gayle,1 run,full on the pads and clipped towards midwicket"}, {"ball": 0.5, "isHighlight": false, "text": "Duminy to Patel,no run,gives it more air to Parthiv and he gets turn too, outside edge to the off side"}, {"ball": 0.6, "isHighlight": false, "text": "Duminy to Patel,no run,tossed up and fuller and he pushes it towards cover"}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Gayle,no run,Shami keeps it tight, no room for Gayle as he stabs it to the off side"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Gayle,no run,one of those strange Gayle shots, this one kicked up off a length and Gayle was nearly sliced in half, wanted to punch it straight but withdrew"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Gayle,no run,this was on a good length and he punches it down the track"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Gayle,1 run,Gayle comes down the track and he looks to pull but the ball hits his body and rolls away"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Patel,1 run,a bit too straight and he nudges it down to short fine leg, Parthiv misses out on a boundary"}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Gayle, $$SIX$$ ,crowd comes alive! This was fired on a length and Gayle was down the track and he whipped that flat over deep midwicket"}, {"ball": 2.1, "isHighlight": false, "text": "Duminy to Patel,1 run,down the pitch and he drives down the ground and long-off picks up"}, {"ball": 2.2, "isHighlight": false, "text": "Duminy to Gayle,no run,flatter one and he pushes it back to the bowler"}, {"ball": 2.3, "isHighlight": false, "text": "Duminy to Gayle, $$SIX$$ ,into the second tier! Tossed up on middle and Gayle was a few paces down the track and lofted this over the sight screen"}, {"ball": 2.4, "isHighlight": false, "text": "Duminy to Gayle, $$FOUR$$ ,not fully in control but good enough, he was down the pitch and played across the line, inside edge but it beats midwicket and the long-on fielder"}, {"ball": 2.5, "isHighlight": false, "text": "Duminy to Gayle,no run,missed out there, over the wicket this time and bowled outside leg, looked to slog and is struck on the pad"}, {"ball": 2.6, "isHighlight": false, "text": "Duminy to Gayle,2 runs,rocks back and punches it wide of cover and Vijay gives chase"}, {"ball": 2.6, "isHighlight": false, "text": "Sai Kiran: \"The problem with Shami is he bowls 5 beauties in an over and one loose ball that goes for a boundary(normally) releases off the pressure on the batsman built by those 5 balls and pressure comes back on the fielding side again...\""}, {"ball": 3.1, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,Parthiv looks to drop it on the pitch and pinch a single but he is hesitant"}, {"ball": 3.2, "isHighlight": false, "text": "Mohammed Shami to Patel,1 run,flicks it softly towards midwicket for a single"}, {"ball": 3.3, "isHighlight": false, "text": "Mohammed Shami to Gayle,no run,that's a very good yorker from Shami to the big man, he manages to dig it out"}, {"ball": 3.4, "isHighlight": false, "text": "Mohammed Shami to Gayle,1 run,fullish on the pads and he works it away towards midwicket"}, {"ball": 3.5, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,swing and a miss, looked like Shami took some pace off the ball"}, {"ball": 3.5, "isHighlight": false, "text": "Ridhuvarshan: \"Bangalore's runs per over in fibonacci series '1',1,2,3,5,'8','13'\""}, {"ball": 3.6, "isHighlight": false, "text": "Mohammed Shami to Patel, $$FOUR$$ ,cracked that past cover, this was a half volley outside off waiting to be spanked, driven along the ground"}, {"ball": 4.1, "isHighlight": false, "text": "Kaul to Gayle,no run,good start by Kaul, cramped him up and he punched it to the off side"}, {"ball": 4.2, "isHighlight": false, "text": "Kaul to Gayle,no run,straight again and he stays back and punches it to the off side"}, {"ball": 4.3, "isHighlight": false, "text": "Kaul to Gayle,no run,this was fired full outside off and wider on seeing Gayle make room, Gayle opted out of the shot"}, {"ball": 4.3, "isHighlight": false, "text": "Raj: \"@Sai Kiran - The six that Gayle hit was not off a bad ball. Gayle generated a shot and only few can hit such sixes. Shami had a superb over, including the last ball.\""}, {"ball": 4.4, "isHighlight": false, "text": "Kaul to Gayle,1 run,high full toss but within the permissible limit, the yorker didn't come out, he punches it to the on side"}, {"ball": 4.5, "isHighlight": false, "text": "Kaul to Patel,no run,pushes it to the off side but mistimes it"}, {"ball": 4.6, "isHighlight": false, "text": "Kaul to Patel, $$FOUR$$ ,that was quite stylish by Parthiv! A low full toss and Parthiv looked to play this to the on side and used his wrists really well to pick the gap at deep midwicket bisecting two men, fetched that from outside off too"}, {"ball": 4.6, "isHighlight": false, "text": "Chierag Panchal: \"KP should have gone for Duminy for one more over. I know he might have gone for a six or two but could well have got Gayle. And getting gayle early is so crucial..\""}, {"ball": 5.1, "isHighlight": false, "text": "Shukla to Gayle,no run,gets away with a half volley, outside off and driven hard to cover"}, {"ball": 5.2, "isHighlight": false, "text": "Shukla to Gayle,no run,comes round the wicket and he turns it to square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Mayur: \"For a team full of studs (though they have struggled through this tournament) Parthiv has done a great job being the 3rd highest run getter for this team. He keeps well and quite handy with the bat up the order. With Gayle, Kohli, ABD and Yuvi in the lineup, Parthiv seems to have stolen the show a bit.\""}, {"ball": 5.3, "isHighlight": false, "text": "Shukla to Gayle, $$OUT$$ ,leg stump's outta here! Shukla comes round the wicket to Gayle, he comes down the track looking to swing across the line but gets a thick inside edge that sends the leg stump for a short spin, lands a few yards back"}, {"ball": 5.3, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$b$$ $$Shukla$$ $$22$$ $$(23m$$ $$23b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$95.65$$"}, {"ball": 5.3, "isHighlight": false, "text": "Kohli walks in"}, {"ball": 5.4, "isHighlight": false, "text": "Shukla to Kohli,no run,this was a touch wide outside off and he's happy to leave it alone"}, {"ball": 5.4, "isHighlight": false, "text": "One slip in place"}, {"ball": 5.5, "isHighlight": false, "text": "Shukla to Kohli,no run,he stays back and punches it to the off side"}, {"ball": 5.6, "isHighlight": false, "text": "Shukla to Kohli,1 run,a little short of a length and he calmly guides it down to third man"}, {"ball": 5.6, "isHighlight": false, "text": "Mayur: \"For a team full of studs (though they have struggled through this tournament) Parthiv has done a great job being the 3rd highest run getter for this team. He keeps well and quite handy with the bat up the order. With Gayle, Kohli, ABD and Yuvi in the lineup, Parthiv seems to have stolen the show a bit.\""}, {"ball": 6.1, "isHighlight": false, "text": "Duminy to Kohli,1 run,tossed up and he drives this down to long-on"}, {"ball": 6.2, "isHighlight": false, "text": "Duminy to Patel,no run,going for the big drive and he gets an outside edge that goes one bounce to short third man"}, {"ball": 6.3, "isHighlight": false, "text": "Duminy to Patel,1 run,gets on his knee and sweeps square"}, {"ball": 6.4, "isHighlight": false, "text": "Duminy to Kohli,no run"}, {"ball": 6.5, "isHighlight": false, "text": "Duminy to Kohli,1 run,down the track and he gets a leading edge to the off side"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Patel,no run,swept firmly but straight to Pietersen at short fine leg"}, {"ball": 6.6, "isHighlight": false, "text": "Nishant Joshi: \"Chris Gayle with 22 off 23. RCB need to swallow their pride and drop him for Rilee Rossouw.\""}, {"ball": 7.1, "isHighlight": false, "text": "Shukla to Kohli,1 run,stays beside the line and dabs it down to third man"}, {"ball": 7.2, "isHighlight": false, "text": "Shukla to Patel,no run,that's a good slower ball, landed on a yorker length and Parthiv played all around it"}, {"ball": 7.2, "isHighlight": false, "text": "Frank: \"DD really miss Coulter-Nile, He is a quality bowler, could also do with De Kock getting a big score today. I really don't think they are that bad on paper, just their bowling needing strengthening.\""}, {"ball": 7.3, "isHighlight": false, "text": "Shukla to Patel,1 leg bye,full and nudged off the pads to the leg side"}, {"ball": 7.4, "isHighlight": false, "text": "Shukla to Kohli,2 runs,full on middle and off and he works it away down to deep midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Shukla to Kohli,2 runs,this was full outside off and he drives him down to deep cover"}, {"ball": 7.6, "isHighlight": false, "text": "Shukla to Kohli,1 run,slower ball and pushed softly down to point and sets off"}, {"ball": 7.6, "isHighlight": false, "text": "Navneet Mundhra: \"GayleStorm or Rajat Bhatia's slower-ball ? Which one of them has chugged 'slower' this IPL ? Tough competition\""}, {"ball": 8.1, "isHighlight": false, "text": "Imran Tahir to Kohli,1 run,  $$OUT$$ ,there's an appeal for a run out and it's close! Kohli's in trouble. Kohli was down the track and got an inside edge that trickled past the stumps, he's very keen on the second run but Rahul Shukla's arm gets the better off him, fires the throw flat and fast from fine leg to the keeper de Kock who breaks the bails, the bat is just short"}, {"ball": 8.1, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$run$$ $$out$$ $$10$$ $$(13m$$ $$11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$90.90$$"}, {"ball": 8.1, "isHighlight": false, "text": "That's the Time Out"}, {"ball": 8.2, "isHighlight": false, "text": "Imran Tahir to de Villiers,1 run,running a bit haywire here, nudged to the on side and Parthiv takes a circuitous route to the other end, tries to get out of the way of the bowler"}, {"ball": 8.3, "isHighlight": false, "text": "Imran Tahir to Patel,2 runs,plays the late cut down to third man"}, {"ball": 8.4, "isHighlight": false, "text": "Imran Tahir to Patel,1 leg bye,spins the googly from outside leg and strikes the pad , loud appeal but you have to see where it pitched"}, {"ball": 8.5, "isHighlight": false, "text": "Imran Tahir to de Villiers,1 run"}, {"ball": 8.6, "isHighlight": false, "text": "Imran Tahir to Patel,no run,stays back and punches it wide of cover"}, {"ball": 9.1, "isHighlight": false, "text": "Duminy to de Villiers,2 runs,he comes round the wicket and works it away down to midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Duminy to de Villiers,1 run,flatter one and he works it away towards square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Duminy to Patel,1 leg bye,he fires it on the pads, down the track and worked to the on side"}, {"ball": 9.4, "isHighlight": false, "text": "Duminy to de Villiers,1 run,looked to slap that square of the wicket and he gets an outside edge to third man"}, {"ball": 9.5, "isHighlight": false, "text": "Duminy to Patel,1 leg bye,down the pitch and the ball rolls off his pads"}, {"ball": 9.5, "isHighlight": false, "text": "Sridhar: \"Looks like teams are in favor of leg spinners these days. Chahal, Badree, Tambe, Mishra, Ashwin (considering he only bowls doosras mostly) \""}, {"ball": 9.6, "isHighlight": false, "text": "Duminy to de Villiers, $$FOUR$$ ,power behind that, dropped short outside off and he rocked back and slapped it wide of point and the sweeper couldn't cut it off"}, {"ball": 10.1, "isHighlight": false, "text": "Imran Tahir to Patel,1 run,full and wide and drilled towards long-off"}, {"ball": 10.2, "isHighlight": false, "text": "Imran Tahir to de Villiers,2 runs,gets turn but it's too wide outside off and he bashes it towards wide long-off"}, {"ball": 10.3, "isHighlight": false, "text": "Imran Tahir to de Villiers,1 run,it's a low full toss which he forces down to long-on"}, {"ball": 10.4, "isHighlight": false, "text": "Imran Tahir to Patel, $$FOUR$$ ,he really biffed that down the ground, Parthiv went forward to a half volley and really tested Kaul at long-off who dived in vain"}, {"ball": 10.5, "isHighlight": false, "text": "Imran Tahir to Patel,2 runs,drills this one down the ground and still work for Kaul"}, {"ball": 10.6, "isHighlight": false, "text": "Imran Tahir to Patel, $$FOUR$$ ,punishes Tahir's length, this was dropped short, went back quickly and pulled and found the gap at deep square leg, beats the sweeper"}, {"ball": 11.1, "isHighlight": false, "text": "Kaul to de Villiers,1 run,he mistimes the punch to the off side"}, {"ball": 11.2, "isHighlight": false, "text": "Kaul to Patel,2 runs,swings him across the line and Shukla slips at long-on after gathering the ball and manages to stay in control of the throw"}, {"ball": 11.3, "isHighlight": false, "text": "Kaul to Patel,1 run,drops it down towards point and sets off"}, {"ball": 11.4, "isHighlight": false, "text": "Kaul to de Villiers, $$FOUR$$ ,Vijay makes a mess of it in the deep! This was a low full toss outside off and he drives it firmly towards deep cover and Vijay over runs it and cannot get a hand to it, didn't time the dive well"}, {"ball": 11.5, "isHighlight": false, "text": "Kaul to de Villiers, $$SIX$$ ,picks the slower ball early, this was dragged a bit too short and AB picked this from the off stump and clubs it flat over deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Kaul to de Villiers, $$FOUR$$ ,the fielding's coming apart in this over! This was a full one outside and AB bashes this on the front foot flat towards long-off, Shukla was in a awkward position, unsure whether to go for the catch or stay back and save the four, bounces one and sails past him to the boundary"}, {"ball": 12.1, "isHighlight": false, "text": "Mohammed Shami to Patel,1 run,lofts him down the ground and falls safely in front of long-on"}, {"ball": 12.2, "isHighlight": false, "text": "Mohammed Shami to de Villiers,1 run,good yorker outside off and drilled away"}, {"ball": 12.3, "isHighlight": false, "text": "Mohammed Shami to Patel, $$OUT$$ ,soft dismissal, this was the slower ball and bowled short, Parthiv didn't really pick it, hopped at the crease and looked to slice it over backward point, neither here nor there, half heartedly slices it to Karthik who leaps in that position"}, {"ball": 12.3, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$c$$ $$Karthik$$ $$b$$ $$Mohammed$$ $$Shami$$ $$29$$ $$(57m$$ $$28b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$103.57$$"}, {"ball": 12.4, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 run,flicks a low full toss on the pads to deep square leg"}, {"ball": 12.4, "isHighlight": false, "text": "nandeesh: \"Here's a big QUESTION MARK on both the Indian team managment and Virat Kohli, Can VK handle the Indian Team Captaincy? I would say he gives his best when playing under a captain but not himself as a captain, and when his team falters he keeps his pungent face all over the match which might end up in lowering the confidence of others in the team\""}, {"ball": 12.5, "isHighlight": false, "text": "Mohammed Shami to de Villiers,no run,good yorker outside off and he looks to dig it out but misses"}, {"ball": 12.6, "isHighlight": false, "text": "Mohammed Shami to de Villiers,no run,doesn't give him room and he punches it back to the bowler"}, {"ball": 12.6, "isHighlight": false, "text": "Time Out"}, {"ball": 12.6, "isHighlight": false, "text": "The next two minutes could be the most important of your day.  $$Play$$ $$CricIQ$$  and you could be on the flight to London to watch India play England at Lord's. Go"}, {"ball": 13.1, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,no run,full outside off and driven to cover"}, {"ball": 13.2, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh, $$FOUR$$ ,bit streaky, tossed up and he didn't quite read the googly, gets an outside edge that just about clears backward point and rolls to third man"}, {"ball": 13.3, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,no run,rolls to the on side"}, {"ball": 13.4, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,no run,goes for the big drive but can't beat cover"}, {"ball": 13.5, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,2 runs,It's a direct hit and it goes upstairs, turned to deep midwicket and he goes for the second run, it's a flat throw at the stumps and Yuvraj is home"}, {"ball": 13.6, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,2 runs,stays back and punches the googly down to deep cover for a couple"}, {"ball": 13.6, "isHighlight": false, "text": "Aakash Chopra tweets: \"The selfish Indian in me is secretly happy that Kohli's poor form has coincided with the IPL...it had to happen at some stage!\""}, {"ball": 14.1, "isHighlight": false, "text": "Kaul to de Villiers, $$FOUR$$ ,suspect fielding again! This was full and wide and hammered by AB off the front foot, extra cover doesn't time his dive right and it races away"}, {"ball": 14.2, "isHighlight": false, "text": "Kaul to de Villiers, $$OUT$$ ,knocks back the off stump, after being spanked for a boundary the previous ball AB tries to hoick him across the line, comes back in off the pitch and shaves the off stump, the stumps are erect"}, {"ball": 14.2, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Kaul$$ $$33$$ $$(29m$$ $$17b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$194.11$$"}, {"ball": 14.3, "isHighlight": false, "text": "Kaul to Rana,no run,full outside off and driven to cover"}, {"ball": 14.4, "isHighlight": false, "text": "Kaul to Rana,no run,drops it on the pitch and he decides against the single"}, {"ball": 14.5, "isHighlight": false, "text": "Kaul to Rana,no run,gives him width and he looks to cut but misses"}, {"ball": 14.6, "isHighlight": false, "text": "Kaul to Rana,1 run,just picks the gap at backward point and the sweeper mops up"}, {"ball": 14.6, "isHighlight": false, "text": "Down to Yuvi for the fireworks"}, {"ball": 15.1, "isHighlight": false, "text": "Shukla to Rana,1 run,makes room and he fires it full outside leg and he drills it to long-off"}, {"ball": 15.2, "isHighlight": false, "text": "Shukla to Yuvraj Singh,1 no ball,he oversteps and fires it down the leg side"}, {"ball": 15.2, "isHighlight": false, "text": "Shukla to Yuvraj Singh,no run,Yuvraj misses out on the  $$Free$$ $$Hit$$ , good slower ball wide outside off and he swings and misses, bat nowhere near the ball"}, {"ball": 15.3, "isHighlight": false, "text": "Shukla to Yuvraj Singh,1 run,swings across the line and gets an inside edge to the leg side"}, {"ball": 15.3, "isHighlight": false, "text": "Bharath: \"@nandesh, He needs Blue jersey man. Simple. He did well as captain during the Asia cup. We all want him perform high for his country than for his club.... \""}, {"ball": 15.4, "isHighlight": false, "text": "Shukla to Rana,2 runs,clips a low full toss down to deep midwicket"}, {"ball": 15.5, "isHighlight": false, "text": "Shukla to Rana,2 runs,very good fielding by Jadhav at deep midwicket, Rana clips a low full toss to the deep, Jadhav dives and pushes it away, gathers himself and prevents it from rolling back to the rope"}, {"ball": 15.6, "isHighlight": false, "text": "Shukla to Rana,no run,stifled appeal as the bowler thought it was pad first and the bat"}, {"ball": 16.1, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,no run,fires that flat and quick and Yuvraj is solid in defense"}, {"ball": 16.2, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh, $$SIX$$ ,heads up! That was a Yuvi special, Tahir bowls length and flat and Yuvraj read the length early, on his knee and slogged several rows over deep square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh, $$SIX$$ ,two in two! Tahir tosses it up too wide outside off and Yuvraj scoops it high and over deep cover"}, {"ball": 16.4, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh, $$SIX$$ ,a hat-trick of sixes! This was the googly tossed up outside off and he lofts him down town, nearly into the second tier over the sight screen"}, {"ball": 16.5, "isHighlight": false, "text": "Imran Tahir to Yuvraj Singh,1 run,drills it hard down to long-off"}, {"ball": 16.6, "isHighlight": false, "text": "Imran Tahir to Rana,2 runs,slogged along the ground towards deep square leg, the fielder dives and parries the ball to another"}, {"ball": 17.1, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 wide,bowls it too wide outside off and he doesn't play at it"}, {"ball": 17.1, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 run,he risks dropping it short and Yuvraj pulls and finds deep midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Mohammed Shami to Rana,1 run,full on the off stump and he mistimes the drive to the off side"}, {"ball": 17.3, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh, $$SIX$$ ,a few rows over the second tier! Nobody can nod off, Shami bowls down the leg side and it's a pick up shot played with such ease over fine leg"}, {"ball": 17.4, "isHighlight": false, "text": "Mohammed Shami to Yuvraj Singh,1 run,drills it down to long-on"}, {"ball": 17.5, "isHighlight": false, "text": "Mohammed Shami to Rana,no run"}, {"ball": 17.6, "isHighlight": false, "text": "Mohammed Shami to Rana, $$FOUR$$ ,hooks the short ball but not fully in control, the top edge just clears short fine leg, Kaul charges after it and puts in the dive but the ball wins"}, {"ball": 17.6, "isHighlight": false, "text": "Anil: \"Kohli's leadership quality shows up in his persistence with Yuvraj--even after repeated failures. And see how a little confidence booster helps Yuvraj transform himself!\""}, {"ball": 18.1, "isHighlight": false, "text": "Kaul to Yuvraj Singh,1 wide"}, {"ball": 18.1, "isHighlight": false, "text": "Kaul to Yuvraj Singh,1 run,full outside the off stump and drilled firmly down to long-off"}, {"ball": 18.2, "isHighlight": false, "text": "Kaul to Rana,1 run,tries to slap it straight but ends up swatting it to point, Yuvraj was through quickly but Rana had to hurry"}, {"ball": 18.3, "isHighlight": false, "text": "Kaul to Yuvraj Singh,no run,low full toss wide outside off and mistimed to cover"}, {"ball": 18.4, "isHighlight": false, "text": "Kaul to Yuvraj Singh,no run,that was a yorker wide outside off and close to being called wide, Yuvraj was standing wide outside leg"}, {"ball": 18.5, "isHighlight": false, "text": "Kaul to Yuvraj Singh, $$SIX$$ ,just over deep midwicket! This was a low full toss and he swings this away and it's high and just evades a brave attempt by Karthik at the edge of the rope"}, {"ball": 18.6, "isHighlight": false, "text": "Kaul to Yuvraj Singh,no run,keeps him quiet with a yorker outside off"}, {"ball": 19.1, "isHighlight": false, "text": "Shukla to Rana,1 run,down the leg side and swings and the keeper gets a glove to it, rolls to fine leg"}, {"ball": 19.2, "isHighlight": false, "text": "Shukla to Yuvraj Singh,1 wide,Yuvraj takes an off stump guard and moves further to his left as Shukla delivers, but he sprays it too wide outside off"}, {"ball": 19.2, "isHighlight": false, "text": "Shukla to Yuvraj Singh, $$SIX$$ ,50 for Yuvi! This was a half volley outside off and he gets underneath the bounce and scoops it high over extra cover"}, {"ball": 19.3, "isHighlight": false, "text": "Shukla to Yuvraj Singh, $$SIX$$ ,another half volley is punished! Outside off and he gets under the bounce and lofts downtown, several rows over wide long-off"}, {"ball": 19.3, "isHighlight": false, "text": "A rattled KP's vigorously changing his field"}, {"ball": 19.4, "isHighlight": false, "text": "Shukla to Yuvraj Singh, $$SIX$$ ,another hat-trick of sixes! Will he give us a break? No he won't! This was dragged short, Shukla trying to vary his length but the result is the same, pulled and it just clears deep midwicket"}, {"ball": 19.5, "isHighlight": false, "text": "Shukla to Yuvraj Singh,1 no ball,what does Shukla do? He lets go of a high full toss that;s too high and it even beats de Kock, Rana charges off and is sent back"}, {"ball": 19.5, "isHighlight": false, "text": "Shukla to Yuvraj Singh, $$SIX$$ ,his ninth six! He bowls length and he gets forward and he pulls and it just clears the rope at long leg"}, {"ball": 19.6, "isHighlight": false, "text": "Shukla to Yuvraj Singh,no run,some relief for Shukla as he bowls a slower ball outside off and Yuvraj swings and for a change doesn't connect"}, {"ball": 19.6, "isHighlight": false, "text": "A bizarre end to the innings there! Shukla went back to his mark thinking there was one final delivery left and there was no indication from the umpires. For a few seconds there was a pause and the umpires finally realised they got the math wrong and the umpire then took the bails off. We've seen some umpiring bloopers already in IPL 2014. Here's another."}, {"ball": 19.6, "isHighlight": false, "text": "Yuvraj's blistering half century has taken RCB to a very competitive total, could be a winning one against struggling DD. Doesn't mean that RCB can have it easy. The ball might be wet so the bowlers and fielders will have to be careful. Join us shortly for the chase."}, {"ball": 19.6, "isHighlight": false, "text": "Take a look at last week's IPL action in  $$pictures$$ ."}, {"ball": 19.6, "isHighlight": false, "text": "Sam: \"Can't blame the umpire for wanting to watch more of Yuvi. And then he realized he was officiating and not in the stands!! What a treat!\""}, {"ball": 19.6, "isHighlight": false, "text": "Shashank: \"You know how eagerly the entire nation has been waiting to see Yuvi return to form when you see Indian players in the opposite team come up to congratulate him. Almost everyone from the DD camp went to shake hands with Yuvi even Rahul Sharma who is on the bench tonight.This has been an absolute treat from Yuvi.\""}], "name": "Royal Challengers Bangalore v Delhi Daredevils", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734005.html?innings=1;view=commentary", "match_num": 38}