{"commentary": [{"ball": 0, "isHighlight": false, "text": "Quick turnover. RCB are back and they are in a huddle.. Dan Vettori serves them the sermon. Murali Vijay and Quinton de Kock to open..No Aaron or Dinda or Morkel today..Another  $$Murali$$  to open .. It's time for spin from No. 800, he comes round the wicket"}, {"ball": 0.1, "isHighlight": false, "text": "Muralitharan to Vijay,no run,tossed up on off stump, Vijay comes forward and defends"}, {"ball": 0.2, "isHighlight": false, "text": "Muralitharan to Vijay,1 run,he pushes it to Yuvraj at mid-off and calls for a quick single.. Yuvraj comes in like a fireball, picks it up and has a shy at stumps, misses by a whisker.. Vijay was gone had he hit"}, {"ball": 0.3, "isHighlight": false, "text": "Muralitharan to de Kock,1 run,is that a run-out! Murali is not able to collect the ball at non-striker's! de Kock was miles out of the crease! He got an inside edge towards the short fine leg fielder and Vijay called for a run.. QdK was slow to respond and would have been heading back had Murali taken that cleanly"}, {"ball": 0.4, "isHighlight": false, "text": "Muralitharan to Vijay, $$OUT$$ ,there comes the wicket! Murali takes out Murali Vijay! the batsman looks to sweep across the line and misses a straighter one.. It was hitting middle stump"}, {"ball": 0.4, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$lbw$$ $$b$$ $$Muralitharan$$ $$1$$ $$(2m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 0.4, "isHighlight": false, "text": "Mayank Agarwal is the new man"}, {"ball": 0.5, "isHighlight": false, "text": "Muralitharan to Agarwal,1 run,tossed up on off, the batsman defends it to point and looks for a single before turning back, an overthrow allows an extra run"}, {"ball": 0.5, "isHighlight": false, "text": "Two slips now"}, {"ball": 0.6, "isHighlight": false, "text": "Muralitharan to de Kock, $$FOUR$$ ,and there is an edge now! Past the second slip fielder, runs away to the boundary"}, {"ball": 0.6, "isHighlight": false, "text": "Karthik: \"Not to take anything away from Yuvi but the bowling was just terrible. Most of those 6s were right in his swinging arc and a couple of others very short of full-tosses - all at same pace! Bouncers, yorkers, slower ones anyone?! Credit to Yuvi for standing wide and deep in the crease to convert some of those deliveries into 'in the arc, out of the park' ones, but shouldn't bowlers adjust? Just terrible bowling.\""}, {"ball": 0.6, "isHighlight": false, "text": "Krithikou: \"Not trying to play Devil's advocate, but I hope the selectors don't bring in Yuvi based on these performances against trundlers and run-of-the-mill spinners, at pint sized grounds.\""}, {"ball": 0.6, "isHighlight": false, "text": "Starch now"}, {"ball": 1.1, "isHighlight": false, "text": "Starc to Agarwal,1 run,bowls a full and swinging delivery outside off, nicely timed to cover point and it;s Yuvraj again, at point, diving to his right and saving some runs.. What confidence!"}, {"ball": 1.2, "isHighlight": false, "text": "Starc to de Kock,no run,length delivery outside off, QdK comes forward and defends to  off"}, {"ball": 1.3, "isHighlight": false, "text": "Starc to de Kock,1 run,back of length delivery on off, the batsman drops it to the leg side and calls for a quick single"}, {"ball": 1.4, "isHighlight": false, "text": "Starc to Agarwal,1 run,looks for the inswinging yorker but serves up a low full toss on off, the batsman pushes it to cover for a single"}, {"ball": 1.5, "isHighlight": false, "text": "Starc to de Kock,no run,fuller delivery outside off, the batsman drives it straight to cover"}, {"ball": 1.6, "isHighlight": false, "text": "Starc to de Kock, $$OUT$$ ,the leg stump is uprooted! RCB are red, red with energy! This one is smartly bowled from Starc, the cross-seamed delivery.. It doesn't swing and QdK, who was looking to play it on the up through off, gets a thick inside edge on to his stumps"}, {"ball": 1.6, "isHighlight": false, "text": "$$Q$$ $$de$$ $$Kock$$ $$b$$ $$Starc$$ $$6$$ $$(9m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 2.1, "isHighlight": false, "text": "Muralitharan to Agarwal,no run,waits on the back foot and defends the pushed through delivery to off"}, {"ball": 2.2, "isHighlight": false, "text": "Muralitharan to Agarwal,1 run,tossed up on the middle stump line, the batsman nudges it behind square on the leg side for a single"}, {"ball": 2.3, "isHighlight": false, "text": "Muralitharan to Pietersen,1 leg bye,he charges out and almost pays the price as this starts spinning down the leg side, KP is lucky to get some pad on it"}, {"ball": 2.3, "isHighlight": false, "text": "Siddharth: \"@Krithikou : they could actually give him a chance in the upcoming Bangladesh series and do you realize that he coming back to form on the international arena is a huge asset for India when it defends the World Cup next year in tough conditions.\""}, {"ball": 2.4, "isHighlight": false, "text": "Muralitharan to Agarwal, $$SIX$$ ,Super hit! He takes a forward stride and just lifts it straight over Murali's head.. All the way over long on"}, {"ball": 2.5, "isHighlight": false, "text": "Muralitharan to Agarwal,no run,how did that miss! It was not short enough to cut.. The batsman misses and it misses the stumps"}, {"ball": 2.6, "isHighlight": false, "text": "Muralitharan to Agarwal,no run,flatter delivery, dabbed straight to cover"}, {"ball": 3.1, "isHighlight": false, "text": "Starc to Pietersen,no run,KP goes for the big drive through the off side but the ball goes underneath the bat"}, {"ball": 3.2, "isHighlight": false, "text": "Starc to Pietersen,1 wide,he strays wide down the leg side and wide called"}, {"ball": 3.2, "isHighlight": false, "text": "Starc to Pietersen,no run,fires that full and wide outside off and he drills it to point"}, {"ball": 3.3, "isHighlight": false, "text": "Starc to Pietersen,1 run, $$Dropped$$  at cover by Kohli but it was a tough one, leans forward and spoons the drive over the off side, Kohli leaps and the ball brushes his fingers"}, {"ball": 3.4, "isHighlight": false, "text": "Starc to Agarwal, $$FOUR$$ ,streaky again but safe, this was sliced squarer on the off side and cleared backward point"}, {"ball": 3.5, "isHighlight": false, "text": "Starc to Agarwal,1 run,tucks it to the on side"}, {"ball": 3.6, "isHighlight": false, "text": "Starc to Pietersen,1 run,mistimes the pull to deep square leg"}, {"ball": 4.1, "isHighlight": false, "text": "Ahmed to Pietersen,4 byes,that sliced everyone in half! It came back in and cut KP in half and just cleared the stumps and Parthiv didn't see that either, KP was all over the place after the ball passed him"}, {"ball": 4.2, "isHighlight": false, "text": "Ahmed to Pietersen,1 wide,this was too wide outside off and KP chased it"}, {"ball": 4.2, "isHighlight": false, "text": "Ahmed to Pietersen,1 run,knocks it towards midwicket"}, {"ball": 4.3, "isHighlight": false, "text": "Ahmed to Agarwal,1 run,mistimed the pull, it was up in the air and dropped just wide of midwicket, Chahal and Rana went after it"}, {"ball": 4.4, "isHighlight": false, "text": "Ahmed to Pietersen,1 run,gets an inside edge to the pad and the ball rolls to point"}, {"ball": 4.5, "isHighlight": false, "text": "Ahmed to Agarwal,1 run,he opens the face and guides this to third man"}, {"ball": 4.6, "isHighlight": false, "text": "Ahmed to Pietersen,1 run,another inside edge, KP looking scratchy"}, {"ball": 4.6, "isHighlight": false, "text": "Sidhu: \"@karthik: lets give him credit when its due. He smashed slower ones, shorter ones and all other kinds all over the park against RR. He is IN FORM now! When someone plays a great knock, good bowling looks average and average, plain bad.\""}, {"ball": 4.6, "isHighlight": false, "text": "Ajeet: \"@Krithikou - Frankly speaking, IPL performances whould never be yardstick for bringing anyone in the national team. I can think of so many players who promised a lot in IPL but were awful in the national side. \""}, {"ball": 5.1, "isHighlight": false, "text": "Chahal to Pietersen, $$FOUR$$ ,nothing scratchy about that, dropped it short and he rocked back and punched it hard down to deep cover"}, {"ball": 5.2, "isHighlight": false, "text": "Chahal to Pietersen,1 run,goes back and mistimes the drive"}, {"ball": 5.3, "isHighlight": false, "text": "Chahal to Agarwal,no run, $$Dropped$$  by Gayle at slip, sharp turn and he made room to cut and it went quickly to Gayle who grabbed and fumbled"}, {"ball": 5.4, "isHighlight": false, "text": "Chahal to Agarwal,no run,sharp spin again and he cuts to the off side"}, {"ball": 5.5, "isHighlight": false, "text": "Chahal to Agarwal, $$FOUR$$ ,drops it too short, Agarwal waits for the turn before cutting it hard down to deep point"}, {"ball": 5.6, "isHighlight": false, "text": "Chahal to Agarwal,1 run,gets forward and drives to long-off"}, {"ball": 6.1, "isHighlight": false, "text": "Yuvraj Singh to Agarwal,no run,gets forward and drives towards point"}, {"ball": 6.2, "isHighlight": false, "text": "Yuvraj Singh to Agarwal,1 run,goes for the drive and gets an outside edge to short third man"}, {"ball": 6.3, "isHighlight": false, "text": "Yuvraj Singh to Pietersen,no run,he gets an inside edge to the boot"}, {"ball": 6.4, "isHighlight": false, "text": "Yuvraj Singh to Pietersen, $$SIX$$ ,KP wins the opening round v Yuvi - he drops it too short and KP rocks back and pulls over deep midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Yuvraj Singh to Pietersen,1 run,it's a low full toss which he drills down to AB at long-off"}, {"ball": 6.6, "isHighlight": false, "text": "Yuvraj Singh to Agarwal,no run,dabs it late down to short third man"}, {"ball": 6.6, "isHighlight": false, "text": "$$Time$$ $$Out$$"}, {"ball": 6.6, "isHighlight": false, "text": "Faisal: \"But everyone seems to forget that most of the players who made a transition from the IPL to the national side didn't have prior international experience. If you look at how Watson, Johnson etc... they all have become permanent fixtures in their teams thanks to the IPL boost they got. The same can happen for Yuvraj\""}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Pietersen,no run,beats the drive! The turn foxing him, very close to the off stump"}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Pietersen,2 runs,fetches that from outside off and sweeps, it's in the air and picked up at fine leg"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Pietersen,2 runs,streaky there as KP gets a leading edge that just clears cover who leaps"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Pietersen,1 run,gets forward and drives him to midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Agarwal, $$SIX$$ ,that's a lovely straight hit by Agarwal, tossed up by Chahal and he was down the track and lofted it dead straight over the sightscreen"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Agarwal,no run,mistimed it to the off side"}, {"ball": 8.1, "isHighlight": false, "text": "Yuvraj Singh to Pietersen,1 run,punches it down to extra cover"}, {"ball": 8.2, "isHighlight": false, "text": "Yuvraj Singh to Agarwal,1 run,comes down the track and mistimes it to the leg side"}, {"ball": 8.3, "isHighlight": false, "text": "Yuvraj Singh to Pietersen, $$FOUR$$ ,Yuvraj tossed it up a bit more and a bit slower, KP clears the left leg and lofts with ease over the covers, easily done"}, {"ball": 8.4, "isHighlight": false, "text": "Yuvraj Singh to Pietersen,1 run,bashed hard to Star who times the dive very well at deep midwicket and fires the throw to keep it to just a single"}, {"ball": 8.5, "isHighlight": false, "text": "Yuvraj Singh to Agarwal,1 run,makes room and punches it to sweeper cover"}, {"ball": 8.6, "isHighlight": false, "text": "Yuvraj Singh to Pietersen,no run,looked to cut and missed, looked very ungainly"}, {"ball": 8.6, "isHighlight": false, "text": "Ravi: \"This is the part of the match each time where RCB is not using the right strategy.. They need to get their best bowlers to get early wickets rather than keeping them aside till the end which hasn't worked for RCB at all...\""}, {"ball": 9.1, "isHighlight": false, "text": "Ahmed to Agarwal,no run,gets it high on the bat and cuts him down to point"}, {"ball": 9.2, "isHighlight": false, "text": "Ahmed to Agarwal, $$OUT$$ ,this was a length ball on the stumps and Agarwal was looking to send it over long-on but he didn't go through with the shot fully, went flat to Rana"}, {"ball": 9.2, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Rana$$ $$b$$ $$Ahmed$$ $$31$$ $$(37m$$ $$25b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$124.00$$"}, {"ball": 9.2, "isHighlight": false, "text": "Delhi's best batsman of the season has arrived"}, {"ball": 9.3, "isHighlight": false, "text": "Ahmed to Pietersen,1 run,punched firmly down to long-on"}, {"ball": 9.4, "isHighlight": false, "text": "Ahmed to Duminy,no run,he goes back at the crease and pushes it to the off side"}, {"ball": 9.4, "isHighlight": false, "text": "Abhishek Shah: \"Hold the press! Duminy is in before 10 overs!!\""}, {"ball": 9.5, "isHighlight": false, "text": "Ahmed to Duminy,1 run,gets off the mark with a quick single down to midwicket, beats the throw"}, {"ball": 9.6, "isHighlight": false, "text": "Ahmed to Pietersen,1 run,fires that full and wide outside off and he drives to sweeper cover"}, {"ball": 10.1, "isHighlight": false, "text": "Muralitharan to Pietersen,1 run,comes round the wicket, sharp spin and he makes room and punches it to long-off"}, {"ball": 10.2, "isHighlight": false, "text": "Muralitharan to Duminy,2 runs,makes room and cuts him against the turn and Chahal does well to slide at deep point"}, {"ball": 10.3, "isHighlight": false, "text": "Muralitharan to Duminy,1 run,goes back at the crease and punches it down the track"}, {"ball": 10.4, "isHighlight": false, "text": "Muralitharan to Pietersen,1 run,he comes down the track, checks his shot and plays it to long-on"}, {"ball": 10.5, "isHighlight": false, "text": "Muralitharan to Duminy,1 run,goes back and punches against the turn to the on side"}, {"ball": 10.6, "isHighlight": false, "text": "Muralitharan to Pietersen,no run,he looks to play the reverse sweep and it doesn't come off, hits the pads and rolls away, Maxwell's shaking his head somewhere"}, {"ball": 11.1, "isHighlight": false, "text": "Chahal to Duminy, $$SIX$$ ,there's the biggie from Duminy, this was the googly tossed up, Duminy went down on his knee, picked it and slogged it several rows over long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Chahal to Duminy,1 run,he rocks back and punches it hard to deep point"}, {"ball": 11.3, "isHighlight": false, "text": "Chahal to Pietersen,1 run,rocks back and thumps it really hard and the fielder at deep cover had to hurry and he did well"}, {"ball": 11.4, "isHighlight": false, "text": "Chahal to Duminy, $$SIX$$ ,he drops it too short and gets punished, Duminy was waiting for it, he stays back and pulls high over deep midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "Chahal to Duminy,1 run"}, {"ball": 11.6, "isHighlight": false, "text": "Chahal to Pietersen, $$OUT$$ ,foxed him for turn! And that was some sharp legspin, he saw KP advance down the track, bowled it flatter and shorter, the spin did the rest and an easy stumping for Parthiv, KP throws his head back"}, {"ball": 11.6, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$st$$ $$†Patel$$ $$b$$ $$Chahal$$ $$33$$ $$(40m$$ $$29b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$113.79$$"}, {"ball": 12.1, "isHighlight": false, "text": "Muralitharan to Duminy,no run,almost bowled him! Tossed up by Murali from round the wicket, he went down to sweep and he missed it"}, {"ball": 12.2, "isHighlight": false, "text": "Muralitharan to Duminy,1 run,stays back and works it down to midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Muralitharan to Karthik,1 run,gets forward and drives him down to mid-off"}, {"ball": 12.4, "isHighlight": false, "text": "Muralitharan to Duminy,2 runs,good running, he turned it down to midwicket and takes the first one hard"}, {"ball": 12.5, "isHighlight": false, "text": "Muralitharan to Duminy,1 run,he rocks back and punches it down to deep point"}, {"ball": 12.5, "isHighlight": false, "text": "Raghav: \"Was not at all called for! After those 2 sixes why would someone do that? Poor cricket from Pietersen! This is exacty where Delhi has lost the plot. Whenever a partnership is on someone does something silly\""}, {"ball": 12.6, "isHighlight": false, "text": "Muralitharan to Karthik, $$OUT$$ ,the run rate pressure getting to Karthik, it was in the slot for Karthik to pull as it was dropped a bit short, swiveled and pulled flat to Chahal at deep midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Chahal$$ $$b$$ $$Muralitharan$$ $$1$$ $$(4m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 13.1, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,on the pads and he tucks it away to deep midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Yuvraj Singh to Jadhav,1 run,full outside off and driven down to long-off"}, {"ball": 13.3, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,fires that full outside off and driven down to deep cover"}, {"ball": 13.4, "isHighlight": false, "text": "Yuvraj Singh to Jadhav,1 run,down the track and he works it down to deep midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Yuvraj Singh to Duminy, $$FOUR$$ ,misfield by Chahal at backward point, Duminy stays back at the crease and waits for it, it was pushed quicker and he used the pace to cut firmly"}, {"ball": 13.6, "isHighlight": false, "text": "Yuvraj Singh to Duminy,no run,driven back to the bowler"}, {"ball": 14.1, "isHighlight": false, "text": "Chahal to Jadhav,no run,big turn again, Jadhav can only push it back to the bowler"}, {"ball": 14.2, "isHighlight": false, "text": "Chahal to Jadhav,1 run,works it against the turn to fine leg"}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to Duminy,1 run,fetches that from outside off and slogs him down to deep midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Chahal to Jadhav,1 run,bit too close to cut and he ends up chopping it to short third man"}, {"ball": 14.5, "isHighlight": false, "text": "Chahal to Duminy,no run,stays back to punch the googly and it's in the air and it drops short of cover"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Duminy, $$SIX$$ ,Chahal gives DD an opening by bowling a half tracker, Duminy was almost expecting it, back at the crease and bludgeoned high over deep midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "KTM, USA: \"@Raghav: The problem is always with execution. Nobody ever says that when Yuvi tries to hit every ball for six and succeeds. Or when Maxwell is able to produce 20+ runs overs. KP has not been able to execute well. The intention isn't really wrong. If they need to win, they shouldn't ideally leave the equation to 60 off last 4 overs.\""}, {"ball": 15.1, "isHighlight": false, "text": "Yuvraj Singh to Jadhav,no run,takes a few paces down and pushes it back to the bowler"}, {"ball": 15.2, "isHighlight": false, "text": "Yuvraj Singh to Jadhav,1 run,works it down to deep midwicket"}, {"ball": 15.3, "isHighlight": false, "text": "Yuvraj Singh to Duminy,no run,pushed through quicker and it was an inside edge that sneaks past the stumps, brushes Parthiv's pad and rolls to short fine leg"}, {"ball": 15.4, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,he goes back and punches it to the off side"}, {"ball": 15.5, "isHighlight": false, "text": "Yuvraj Singh to Jadhav,1 run,comes down the track and punches it to sweeper cover"}, {"ball": 15.6, "isHighlight": false, "text": "Yuvraj Singh to Duminy,1 run,drops it fractionally short and mistimes the pull"}, {"ball": 15.6, "isHighlight": false, "text": "It's the Time Out TS(USA): \"If RCB loses this match too after Yuvi's onslaught, Yuvi might think \"I'd be better off with 11(21)\".\""}, {"ball": 15.6, "isHighlight": false, "text": "Vijay: \"64 needed from 4 overs..RR were in the same equation last time against RCB.. Can Duminy do a Faulkner here?\""}, {"ball": 16.1, "isHighlight": false, "text": "Ahmed to Duminy, $$FOUR$$ ,that's not a bad start to the over at all, this was a full ball and he got under the bounce and lofted it, falls inches short of the straight boundary"}, {"ball": 16.2, "isHighlight": false, "text": "Ahmed to Duminy,no run,good comeback, fires that full outside off and he tries to dig it out"}, {"ball": 16.3, "isHighlight": false, "text": "Ahmed to Duminy,1 leg bye,JP tries to paddle that to fine leg from outside off, the ball hits his pads"}, {"ball": 16.4, "isHighlight": false, "text": "Ahmed to Jadhav, $$SIX$$ ,that was flat! Ahmed bowls it too wide and it was a half volley, free swing and it went really quickly and cleared deep extra cover"}, {"ball": 16.5, "isHighlight": false, "text": "Ahmed to Jadhav, $$FOUR$$ ,turning out to be an expensive over already, this was a length ball outside off which he pulls along the ground and beats midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Ahmed to Jadhav,(no ball) 1 run,penalised for a waist high full toss, was a bit hard on the bowler, this was worked to deep square leg and Chahal nearly over-ran it near the rope"}, {"ball": 16.6, "isHighlight": false, "text": "Ahmed to Duminy,1 run, $$Dropped$$  by Gayle at point! Duminy looked to slice this over the off side and the big man leaps and gets a hand to it, tries to take it in the second attempt with the other and it still pops out, tries for the third time, he nearly does the split as he falls to the ground"}, {"ball": 17.1, "isHighlight": false, "text": "Starc to Duminy,1 run,he works it down to deep midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Starc to Jadhav,1 run,bowls length outside off and he drives it down to AB at long-off"}, {"ball": 17.3, "isHighlight": false, "text": "Starc to Duminy, $$FOUR$$ ,nearly carried all the way! He used the pace on the ball, made room and sliced it over backward point and the ball was going quickly, dipped just before reaching the rope"}, {"ball": 17.4, "isHighlight": false, "text": "Starc to Duminy, $$OUT$$ ,the middle stump's knocked back! It was a length ball bowled straight at the stumps, came back in slightly, Duminy swung across the line at thin air and his stump was pushed back"}, {"ball": 17.4, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$b$$ $$Starc$$ $$48$$ $$(37m$$ $$30b$$ $$3x4$$ $$3x6)$$ $$SR:$$ $$160.00$$"}, {"ball": 17.5, "isHighlight": false, "text": "Starc to Shukla,no run,length ball and he makes room to swing but misses"}, {"ball": 17.6, "isHighlight": false, "text": "Starc to Shukla,no run,a bit too quick for him, he made room to swing but missed"}, {"ball": 18.1, "isHighlight": false, "text": "Ahmed to Jadhav, $$FOUR$$ ,they're going to throw their bats at everything, this was short and Jadhav pulled and the outside edge comfortably cleared the keeper"}, {"ball": 18.2, "isHighlight": false, "text": "Ahmed to Jadhav, $$FOUR$$ ,that was very cleverly played! He knew third man was up, he moved right across his stumps, cleared the right leg and was looking to hoick it over the leg side, adjusted late and deftly guided it to third man instead, turned the bat perfectly"}, {"ball": 18.3, "isHighlight": false, "text": "Ahmed to Jadhav,no run,follows it up with a swing and  a miss"}, {"ball": 18.4, "isHighlight": false, "text": "Ahmed to Jadhav,(no ball) 2 runs,it's a front foot no-ball, bonus for DD, clips it to deep midwicket"}, {"ball": 18.4, "isHighlight": false, "text": "Ahmed to Jadhav,1 run, $$Free$$ $$Hit$$ : It's a slower ball which he slogs to deep midwickewt and only a single"}, {"ball": 18.5, "isHighlight": false, "text": "Ahmed to Shukla,1 run,Shukla makes room and he swings it down to deep square leg"}, {"ball": 18.6, "isHighlight": false, "text": "Ahmed to Jadhav,1 run,full on middle and leg and he drills it down to long-on"}, {"ball": 18.6, "isHighlight": false, "text": "srinivas hoysal: \"Its certainly not a good position for jadhav to bat at no.6 delhi as they have lost hopes to reach the playoffs should give chance to these kind of players to get some experience in the upper order\""}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Jadhav, $$SIX$$ ,will that set the tone for the rest of the over? This was a slower ball but a half volley, he got under it and sent it miles over wide long-off"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Jadhav,1 run,this was fuller and he can only drill it down to deep cover"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to Shukla,no run,Shukla makes room and goes for the big swing and misses"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Shukla, $$OUT$$ ,appeal for a run out and Jadhav's in trouble. Shukla swings and misses, they try to steal a bye, Parthiv aims at the stumps and Jadhav's just short"}, {"ball": 19.4, "isHighlight": false, "text": "$$KM$$ $$Jadhav$$ $$run$$ $$out$$ $$37$$ $$(34m$$ $$20b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$185.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Starc to Mohammed Shami,1 run,punches it down to mid-off and Kohli takes aim at the bowler's end and misses"}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Shukla,1 run,fires that on the stumps and he spoons it towards mid-off and RCB celebrate a 16-run win in front of their home fans well past midnight"}, {"ball": 19.6, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.6, "isHighlight": false, "text": "Pietersen: \"I can tell you something for free. That man over there batted like an absolute superstar. He has proven a lot of people wrong. We have to build for next season, there's an unrealistic chance of making the playoff. Yuvraj was just unbelievable. I'm always smiling.\""}, {"ball": 19.6, "isHighlight": false, "text": "Kohli: \"Feels amazing, really wanted that win. In the field we made a few lapses but overall a good performance. It's important not to panic and this time I told Chahal to back himself and I backed my bowlers too. It's been very pleasing to see Yuvi bat like that, all those who doubted him should put those doubts to rest. We have to take it one game at a time and the results will follow.\""}, {"ball": 19.6, "isHighlight": false, "text": "Yuvraj is the Man of the Match: \"It was important we finished really well. I've started really well and just kept believing in myself and the seniors believed in me. I wanted to come to a place where I can be myself and play my game and thanks to Vijay Mallya for bringing me over here.\""}, {"ball": 19.6, "isHighlight": false, "text": "That's it for now. It's been a really long night, an extended night. Thanks for staying up. The action continues tomorrow. Till then, this is Kanishkaa signing off. Good night!"}, {"ball": 19.6, "isHighlight": false, "text": "$$End$$ $$of$$ $$match$$ : That's eight defeats for DD. Meanwhile, RCB live to fight another day. They need to keep this momentum going. They are now at No.6 with MI below them, followed by DD"}], "name": "Royal Challengers Bangalore v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734005.html?innings=2;view=commentary", "match_num": 38}