{"commentary": [{"ball": 0, "isHighlight": false, "text": "The umpires are finally walking out. Dhawal Kulkarni will begin"}, {"ball": 0, "isHighlight": false, "text": "It's 6.35pm and play hasn't yet  started. The toss itself was delayed."}, {"ball": 0, "isHighlight": false, "text": "Aj: \"Humm.. No Ricky Bui in playing eleven... I thought that boy has talent.. his numbers are strong for T20 games.. hope he gets chance.."}, {"ball": 0, "isHighlight": false, "text": "SRH XI: A Finch, S Dhawan, D Warner, V Rao, L Rahul, D Sammy, K Sharma, A Mishra, D Steyn, B Kumar, I Sharma"}, {"ball": 0, "isHighlight": false, "text": "RR XI: A Rahane, S Watson, S Samson, S Binny, B Hodge, A Nayar, J Faulkner, R Bhatia, K Richardson, D Kulkarni, P Tambe"}, {"ball": 0, "isHighlight": false, "text": "And finally, the teams above."}, {"ball": 0, "isHighlight": false, "text": "Mazhar Mohammad: \"I dont think this is going to be a high scoring affair. Remember how Pak Vs Aus high scoring thriller was followed up by WI Vs IND low scoring match in World T20 on the same ground. I think the wicket must have slowed down after the first match.\""}, {"ball": 0, "isHighlight": false, "text": "Bala Kamat: \"From Bloomington, IL: It will be interesting to see Dhawan-Watson faceoff again.. Lets see who be limping at the end !!\""}, {"ball": 0, "isHighlight": false, "text": "Aatif Ali Khan: \"I can't believe why there is no Cutting or Smith.\""}, {"ball": 0, "isHighlight": false, "text": "Urwik: \"Its time for Sammy v Faulkner again!! Interesting to see how it would go this time around.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$ : Rajasthan have won the toss and they will  $$bowl$$ $$first$$ . \"Anything under 200 will be nice to chase\" says Watson. Four debutants for Rajasthan. Nayar, Richardson, Bhatia and Dhawal Kulkarni are playing."}, {"ball": 0, "isHighlight": false, "text": "Hyderabad are going with three fast bowlers. Aaron Finch, David Warner, Steyn and Darren Sammy are their overseas players."}, {"ball": 0, "isHighlight": false, "text": "The final XIs will be updated shortly."}, {"ball": 0, "isHighlight": false, "text": "The broadcasters (you know who they are) believe in showing the XIs five minutes before the start. It will be updated above shortly."}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$5.55pm$$ : Punjab have just completed a massive chase with ridiculous ease against Chennai. We thought it would eat into the toss for the second game of the evening but remarkably, we still have eight minutes. Welcome everyone to the coverage of game 2 today, between Hyderabad and Rajasthan at Zayed Cricket Stadium."}, {"ball": 0, "isHighlight": false, "text": "The interviews from the Punjab game are on. Till we get to the toss, read the  $$preview$$  of this game. The presentation is not done yet so the toss will be slightly delayed."}, {"ball": 0, "isHighlight": false, "text": "Still not figuring at the top end of the  $$CricIQ$$  leaderboard? Fret not - the best thing about CricIQ is that you get to wipe the slate clean every day and start afresh. And all it takes is one good attempt. The Greatest Test ever rolls on.. Pad up.  $$Play!$$"}, {"ball": 0, "isHighlight": false, "text": "Having witnessed a 206 chase at this ground, will the captain winning the toss opt to chase under lights? We'll find out."}, {"ball": 0, "isHighlight": false, "text": "RANADHEER: \"\"Amit Mishra\" is in both teams squad !!\" It just so happens that there are two players with the same name. We know the legspinner. His namesake is a medium-pacer from UP."}, {"ball": 0, "isHighlight": false, "text": "Naren: \"RR team looks like a Clearance Sale stall where almost everything is useless and somewhere you will find a little worth.\""}, {"ball": 0, "isHighlight": false, "text": "The problem with double-headers at the same venue is that the second game's toss is invariably delayed."}, {"ball": 0, "isHighlight": false, "text": "Ayesha Ahmad: \"If this game is even half as enthralling as the previous one today, we are in for a run feast...hope to see more fireworks from Hyd n Jaipur....Sammy, watson key..\""}, {"ball": 0.1, "isHighlight": false, "text": "Kulkarni to Finch,no run,on target straightaway, shapes away slightly and Finch solidly defends"}, {"ball": 0.2, "isHighlight": false, "text": "Kulkarni to Finch,no run,makes him play yet again and he defends this to the off side"}, {"ball": 0.3, "isHighlight": false, "text": "Kulkarni to Finch,2 runs,he strays on the pads and he flicks it away wide of midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "Kulkarni to Finch,no run,this is a good few balls by Kulkarni, bowls it straight and he stands back and defends"}, {"ball": 0.4, "isHighlight": false, "text": "Mir Anwar: \"The Sunrisers' colours are similar to that of the Kochi Tuskers Kerela. I hope their performances on and off the field aren't as poor as them.\""}, {"ball": 0.5, "isHighlight": false, "text": "Kulkarni to Finch, $$OUT$$ ,that's a soft dismissal! But that wasn't a terribly good delivery either, this was short and wide outside off, the invitation was there for the cut but Finch could only hit it straight to Richardson at cover, didn't time it well and an easy catch in the end"}, {"ball": 0.5, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$Richardson$$ $$b$$ $$Kulkarni$$ $$2$$ $$(5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$40.00$$"}, {"ball": 0.6, "isHighlight": false, "text": "Kulkarni to Warner,no run,this was still a bit short and he went back and chopped it to extra cover"}, {"ball": 1.1, "isHighlight": false, "text": "Richardson to Dhawan,no run"}, {"ball": 1.2, "isHighlight": false, "text": "Richardson to Dhawan,1 wide,he strays wide down the leg side"}, {"ball": 1.2, "isHighlight": false, "text": "Richardson to Dhawan,no run,He gets a lovely shape across the left hander and Dhawan was in a fix, fished at it outside off"}, {"ball": 1.3, "isHighlight": false, "text": "Richardson to Dhawan,no run,good length outside off and he punched it to the off side"}, {"ball": 1.4, "isHighlight": false, "text": "Richardson to Dhawan,1 run,that's a good yorker and Dhawan really had to dig that out to the leg side, nearly lost his balance"}, {"ball": 1.5, "isHighlight": false, "text": "Richardson to Warner,no run,this was angled wider across the left-hander and he flashed at it, Richardson working up good pace"}, {"ball": 1.6, "isHighlight": false, "text": "Richardson to Warner,no run,angled across him again and he reaches out and chops it to the off side"}, {"ball": 1.6, "isHighlight": false, "text": "Idrees Kanchwal: \"@Ravi - That is why i prefer watching \"The Huddle\" or matchpoint here at Cricinfo. Precise and to the point expert comments. AWESOME LOVE IT!! keep up the great work Cricinfo :)\""}, {"ball": 2.1, "isHighlight": false, "text": "Faulkner to Dhawan,1 run,Faulkner fires this one full outside off and he digs it out to cover"}, {"ball": 2.2, "isHighlight": false, "text": "Faulkner to Warner,2 runs,he gives him a bit of width this time and he chops it just wide of cover"}, {"ball": 2.3, "isHighlight": false, "text": "Faulkner to Warner,1 run,this time he strays on the pads and he clips it away to the leg side"}, {"ball": 2.4, "isHighlight": false, "text": "Faulkner to Dhawan,5 wides,oh dear he lost control of that! This was far too wide down the leg side and the wicketkeeper could do nothing"}, {"ball": 2.4, "isHighlight": false, "text": "Faulkner to Dhawan,1 run,he bowls it full on the stumps, pushes it just in front of mid-on and sets off"}, {"ball": 2.5, "isHighlight": false, "text": "Faulkner to Warner,1 run,fullish on the pads and clipped just wide of mid-on"}, {"ball": 2.6, "isHighlight": false, "text": "Faulkner to Dhawan,2 runs,gives width outside off and he cuts wide of point, it looks like going all the way to the rope but Binny does well to slide and cut it off"}, {"ball": 3.1, "isHighlight": false, "text": "Kulkarni to Warner,1 run,punched towards mid-off and there's a misfield and that allows a single"}, {"ball": 3.2, "isHighlight": false, "text": "Kulkarni to Dhawan,no run,tucked him up for room there, he went back to defend and the ball nearly rolled over to the stumps"}, {"ball": 3.3, "isHighlight": false, "text": "Kulkarni to Dhawan,1 leg bye,short of a length on the leg stump and he mistimes the flick to the on side"}, {"ball": 3.4, "isHighlight": false, "text": "Kulkarni to Warner,1 run,just a short arm flick towards midwicket and they complete a single"}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Dhawan,no run,this was full on the off stump and he pushes it wide of mid-off"}, {"ball": 3.6, "isHighlight": false, "text": "Kulkarni to Dhawan, $$FOUR$$ ,you gotta love this one for the placement! Third man was up and Dhawan knew that, the ball was angled across and he had enough width to deftly steer that wide of short third man and backward point"}, {"ball": 4.1, "isHighlight": false, "text": "Richardson to Warner, $$FOUR$$ ,after hardly any boundaries in the first four overs we have two in a row, full outside off and he lofts him over mid-off"}, {"ball": 4.2, "isHighlight": false, "text": "Richardson to Warner,1 run,he goes back at the crease and clips it to the on side"}, {"ball": 4.3, "isHighlight": false, "text": "Richardson to Dhawan,1 wide,he strays too wide down the leg side and wide called"}, {"ball": 4.3, "isHighlight": false, "text": "Richardson to Dhawan,no run,kept him quiet there by bowling it dead straight, on middle and skidded through, he defends"}, {"ball": 4.4, "isHighlight": false, "text": "Richardson to Dhawan,1 run,good running, he merely pushed it with soft hands towards cover and sets off quickly, Warner is quick to respond"}, {"ball": 4.5, "isHighlight": false, "text": "Richardson to Warner,1 run,fetches that from the off stump and clips it to the leg side, good use of wrists"}, {"ball": 4.6, "isHighlight": false, "text": "Richardson to Dhawan,1 run,shuffles across early and he mistimes the flick to the leg side"}, {"ball": 4.6, "isHighlight": false, "text": "Santhosh: \"Is it the same pitch in which 2 teams scored 200+? SRH batting as if there are demons in it.\""}, {"ball": 5.1, "isHighlight": false, "text": "Faulkner to Dhawan,no run, $$Dropped$$ ! This was coming straight at his face, slower ball and Dhawan was looking to drive straight and it was chipped back at Faulkner, he cupped his hands in front of his face, slipped and couldn't hang on"}, {"ball": 5.2, "isHighlight": false, "text": "Faulkner to Dhawan,1 run,good length outside off and punched to the off side"}, {"ball": 5.3, "isHighlight": false, "text": "Faulkner to Warner,1 run,on the pads and flicked to the on side"}, {"ball": 5.4, "isHighlight": false, "text": "Faulkner to Dhawan, $$FOUR$$ ,that's a lovely cover drive! Half volley outside off, he leans forward and drives crisply wide of cover, races away"}, {"ball": 5.5, "isHighlight": false, "text": "Faulkner to Dhawan,1 run,he tucks it away behind square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Faulkner to Warner,1 run,he stays back and punches it wide of the bowler, sets off and Faulkner charges to his right and tries to cut off the single"}, {"ball": 6.1, "isHighlight": false, "text": "Tambe to Warner,1 run,he bowls a flatter one, he stays back and punches it wide of mid-on"}, {"ball": 6.2, "isHighlight": false, "text": "Tambe to Dhawan,no run,tossed up and he pushes it towards point"}, {"ball": 6.3, "isHighlight": false, "text": "Tambe to Dhawan,1 run,flatter delivery and he gets forward and across and drives him towards long-off"}, {"ball": 6.4, "isHighlight": false, "text": "Tambe to Warner,no run,flatter one and he works it to the leg side"}, {"ball": 6.5, "isHighlight": false, "text": "Tambe to Warner,no run,flatter one and he stays back and knocks it back to the bowler"}, {"ball": 6.6, "isHighlight": false, "text": "Tambe to Warner,1 run,flat and he stays back and clips it wide of the bowler"}, {"ball": 6.6, "isHighlight": false, "text": "Sagar: \"After all the excitement with so called \"more firepower in batting\", the XI looks ordinary and the batting so far today reminds me of last season... \""}, {"ball": 7.1, "isHighlight": false, "text": "Bhatia to Warner,no run,skids on the pads and he looks to work it to the leg side but the ball rolls to the off side"}, {"ball": 7.2, "isHighlight": false, "text": "Bhatia to Warner,2 runs,the off cutter, he flicks it to the leg side and sets off quickly"}, {"ball": 7.3, "isHighlight": false, "text": "Bhatia to Warner,1 run,full outside the off stump and driven to long-off"}, {"ball": 7.4, "isHighlight": false, "text": "Bhatia to Dhawan,1 run,full and wide outside off and driven to sweeper cover"}, {"ball": 7.5, "isHighlight": false, "text": "Bhatia to Warner,1 run,a bit wide outside the off stump, slower ball and he gets an outside edge but Faulkner dives and saves it at short third man"}, {"ball": 7.6, "isHighlight": false, "text": "Bhatia to Dhawan,1 run,another slower one and he mistimes the flick to the leg side"}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to Dhawan,1 run,this was really short and wide and the batsman really had to reach out, chopped to the off side"}, {"ball": 8.2, "isHighlight": false, "text": "Tambe to Warner,1 run,chips down the track and he clips it to the on side"}, {"ball": 8.3, "isHighlight": false, "text": "Tambe to Dhawan, $$SIX$$ ,the big hit took a while coming! Tossed up on middle and leg, Dhawan was on his knee and slogged it high over deep midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Tambe to Dhawan,2 runs,gives him width and he chops it to the off side"}, {"ball": 8.5, "isHighlight": false, "text": "Tambe to Dhawan,1 run,picks the googly just in time and pushes it to the off side"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to Warner,1 run,down the track and he mistimes the drive wide of cover"}, {"ball": 8.6, "isHighlight": false, "text": "That will be the  $$strategic$$ $$timeout$$ ."}, {"ball": 8.6, "isHighlight": false, "text": "Aditya: Shane Watson going the Stuart broad way ? Under bowling himself ? He is a very effective IPL bowler. Should bowl 4 overs every game.\""}, {"ball": 8.6, "isHighlight": false, "text": "Varun: \"I still think Dhawan & Warner are doing a decent job. They have firepower in the middle order to crazy after 13 overs. The T20 generation needs to learn patience \""}, {"ball": 8.6, "isHighlight": false, "text": "Jason: \"Boring game so far...What an anti climax after the first match..well now I can do my chores since i could not peel myself away during the first match..\""}, {"ball": 8.6, "isHighlight": false, "text": "Binny to bowl"}, {"ball": 9.1, "isHighlight": false, "text": "Binny to Warner,1 run,slower ball outside the off stump, he punches it down to sweeper cover, the fielder strikes the stumps at the bowler's end"}, {"ball": 9.2, "isHighlight": false, "text": "Binny to Dhawan,no run,drives square on the front foot and backward point does well to stop it"}, {"ball": 9.3, "isHighlight": false, "text": "Binny to Dhawan,1 run,full on the off stump and he drives to mid-off"}, {"ball": 9.4, "isHighlight": false, "text": "Binny to Warner,1 run,looks to drive straighter and he gets an inside edge to the leg side"}, {"ball": 9.4, "isHighlight": false, "text": "Pranav Kamalaka: \"@Varun... But that isn't true at all... SRH doesn't have any fire power left at all which is why the two in the middle have to be careful about what they do, it's only Sammy left who can do any damage\""}, {"ball": 9.5, "isHighlight": false, "text": "Binny to Dhawan, $$FOUR$$ ,good placement again by Dhawan, third man was up, he had the width outside off to steer it wide of point"}, {"ball": 9.6, "isHighlight": false, "text": "Binny to Dhawan,no run,full on the stumps and he drives straight back to Binny"}, {"ball": 9.6, "isHighlight": false, "text": "Pushpam: \"Clever batting & a well thought strategy for every1 to learn. Saving wickets, rotating strike A LOT with singles and doubles, hitting the loose balls for boundaries. In the last 5-6 overs this will help Hyd get a very very smart & challenging total.\""}, {"ball": 10.1, "isHighlight": false, "text": "Kulkarni to Warner,no run,big swing and a miss by Warner, the frustration getting to him? Outside off and he misses it completely"}, {"ball": 10.2, "isHighlight": false, "text": "Kulkarni to Warner,1 run,width outside the off stump and he angles it down to third man"}, {"ball": 10.3, "isHighlight": false, "text": "Kulkarni to Dhawan,1 run,bowls it full and wide outside off and he bends and opens the face and steers it to third man"}, {"ball": 10.4, "isHighlight": false, "text": "Kulkarni to Warner,1 run,gives him width and he bashes it down the ground to long-off"}, {"ball": 10.5, "isHighlight": false, "text": "Kulkarni to Dhawan,1 run,slower ball outside off and he steers it down to third man"}, {"ball": 10.6, "isHighlight": false, "text": "Kulkarni to Warner,2 runs,keeps it nice and straight and warner gets on the backfoot and works it wide of midwicket, does well to run two"}, {"ball": 10.6, "isHighlight": false, "text": "Idrees Kanchwal: \"Sunrisers adopting the West Indies strategy with Sammy yet to come to explode in the last 5-7 overs but this could backfire with the likes of faulkner. RR keeping things tight for now\""}, {"ball": 11.1, "isHighlight": false, "text": "Bhatia to Dhawan,1 run,this was the slower leg cutter, he mistimes it to the bowler"}, {"ball": 11.2, "isHighlight": false, "text": "Bhatia to Warner,1 run,another slower one and he mistimes the slog"}, {"ball": 11.3, "isHighlight": false, "text": "Bhatia to Dhawan, $$OUT$$ ,found the fielder with precision, it was the off cutter from Bhatia, Dhawan was down on his knee to slog, played it flat and found Richardson at deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Richardson$$ $$b$$ $$Bhatia$$ $$38$$ $$(34b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$111.76$$"}, {"ball": 11.3, "isHighlight": false, "text": "Wave: \"Venugopal Rao/ Irfan are key for SRH through out the tournament to get anywhere near playoffs. Having said that top 3 are match winners on their own especially with the kind of bowling line up they have.\""}, {"ball": 11.4, "isHighlight": false, "text": "Bhatia to Rahul,no run,Rahul plays his first ball back to the bowler"}, {"ball": 11.5, "isHighlight": false, "text": "Bhatia to Rahul,1 run,on the pads and he works it towards mid-on"}, {"ball": 11.5, "isHighlight": false, "text": "Amogh: \"The DJ is really trying hard , or should I say reeking of desperation, to get the crowd going. Maybe a few boundaries from the batsmen might make his job a bit easier.\""}, {"ball": 11.6, "isHighlight": false, "text": "Bhatia to Warner,1 run,slower ball and he goes back at the crease and works it down to long-on"}, {"ball": 12.1, "isHighlight": false, "text": "Tambe to Warner,1 run,he comes down the track and drills it to mid-off"}, {"ball": 12.2, "isHighlight": false, "text": "Tambe to Rahul,1 run,flatter one and he works it to the leg side"}, {"ball": 12.3, "isHighlight": false, "text": "Tambe to Warner,1 run, $$Dropped$$  by Faulkner, Tambe gives it more air and temps Warner to go for the slog, it was hit flat and dipped towards Faulkner at long-on, dived forward and couldn't catch it, not the easiest take"}, {"ball": 12.4, "isHighlight": false, "text": "Tambe to Rahul,no run,he looks to cut but misses"}, {"ball": 12.5, "isHighlight": false, "text": "Tambe to Rahul,no run"}, {"ball": 12.6, "isHighlight": false, "text": "Tambe to Rahul,no run,close shout for an lbw, across the line and may have missed the stumps"}, {"ball": 13.1, "isHighlight": false, "text": "Bhatia to Warner,no run,bowls that full on the stumps and he digs it out back to the bowler"}, {"ball": 13.2, "isHighlight": false, "text": "Bhatia to Warner, $$OUT$$ ,like Dhawan even Warner finds the man in the deep on the on side, this was a slower ball and bowled a bit short, Warner rocks back and pulls in front of square but finds Richardson at deep midwicket, went straight to him,  Richardson has all three catches"}, {"ball": 13.2, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$c$$ $$Richardson$$ $$b$$ $$Bhatia$$ $$32$$ $$(35b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$91.42$$"}, {"ball": 13.2, "isHighlight": false, "text": "It's the  $$strategic$$ $$time$$ $$out$$ ."}, {"ball": 13.2, "isHighlight": false, "text": "The team names are changed because of restrictions imposed by the IPL. Don't ask! Some needless legal wibble."}, {"ball": 13.3, "isHighlight": false, "text": "Bhatia to Sammy,1 run,slower ball and he punches it to the off side"}, {"ball": 13.4, "isHighlight": false, "text": "Bhatia to Rahul,1 run,full outside off and Rahul drives to long-off"}, {"ball": 13.5, "isHighlight": false, "text": "Bhatia to Sammy,no run,goes back and punches it hard to cover"}, {"ball": 13.6, "isHighlight": false, "text": "Bhatia to Sammy,1 run,he makes room and looks to cut but gets an outside edge, short third man cuts it off"}, {"ball": 13.6, "isHighlight": false, "text": "Veer: \"I think selectors should give chance to Bhatia atleast in t20, he is a tidy bowler better than recent Indian quicks and he can bat which is very handy.\""}, {"ball": 13.6, "isHighlight": false, "text": "Gaurav Sethi: \"Rajat Bhatia takes Warner down with his stock slow ball, reminded me of Ramesh Krishnan's demolition of Wilander in the Aus Open.\""}, {"ball": 14.1, "isHighlight": false, "text": "Tambe to Sammy,1 wide,feeds it too wide down the leg side, pulls out of the stroke"}, {"ball": 14.1, "isHighlight": false, "text": "Tambe to Sammy,no run,drifts down the leg side and he clips it towards short fine leg"}, {"ball": 14.2, "isHighlight": false, "text": "Tambe to Sammy,no run"}, {"ball": 14.3, "isHighlight": false, "text": "Tambe to Sammy,1 run,he rocks back and thumps it down to mid-off"}, {"ball": 14.4, "isHighlight": false, "text": "Tambe to Rahul,1 run,comes down the track and he drives him to long-on"}, {"ball": 14.5, "isHighlight": false, "text": "Tambe to Sammy,1 run,flatter one and he mistimes it to the leg side"}, {"ball": 14.6, "isHighlight": false, "text": "Tambe to Rahul,1 run,bowls it flat and restricts Sammy from going for the big hit, goes back and cuts hard to point"}, {"ball": 14.6, "isHighlight": false, "text": "Nitin: \"SRH's jersey is heavily inspired by Perth Scorchers rather than Kochi Tuskers\""}, {"ball": 15.1, "isHighlight": false, "text": "Bhatia to Rahul,2 runs,Rahul gets on his knee and fetches it from the off stump and looks to slog and it is in the air and drops short of long-on"}, {"ball": 15.2, "isHighlight": false, "text": "Bhatia to Rahul,1 run,he stays back and works it wide of mid-on"}, {"ball": 15.3, "isHighlight": false, "text": "Bhatia to Sammy,no run,Sammy stays back and chops it to point, not yet in his hitting length"}, {"ball": 15.4, "isHighlight": false, "text": "Bhatia to Sammy,1 run,this one is fuller and he drives him hard to cover"}, {"ball": 15.5, "isHighlight": false, "text": "Bhatia to Rahul, $$FOUR$$ ,looked a bit ungainly but effective, he shuffled across his stumps, exposed all of them and slogged him just wide of short fine leg"}, {"ball": 15.6, "isHighlight": false, "text": "Bhatia to Rahul,1 run,drills a low full toss down to long-on, end of an excellent spell by canny Bhatia"}, {"ball": 16.1, "isHighlight": false, "text": "Kulkarni to Rahul,1 run,slower ball and he drives him to cover, the DJ announces the 100 and there's hardly a ripple"}, {"ball": 16.2, "isHighlight": false, "text": "Kulkarni to Sammy,1 run,Sammy looked to pull that with more force but he held back and softly places it to square leg"}, {"ball": 16.3, "isHighlight": false, "text": "Kulkarni to Rahul,no run,looked like the slower bouncer, Rahul backed away and looked to upper cut but missed it"}, {"ball": 16.4, "isHighlight": false, "text": "Kulkarni to Rahul, $$SIX$$ ,that gets the crowd going! This was banged in a on a good length, Rahul was back at the crease and pulled it in front of square over deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Kulkarni to Rahul,1 wide,Kulkarni comes round the wicket, full toss down the leg side"}, {"ball": 16.5, "isHighlight": false, "text": "Kulkarni to Rahul,no run,follows it up with a full ball on the stumps and he drills it to cover"}, {"ball": 16.6, "isHighlight": false, "text": "Kulkarni to Rahul, $$OUT$$ ,finds the fielder in the deep on the leg side but for a change it's not Richardson, but Rahane, this was a friendly full toss and Rahul whipped it straight to deep midwicket, the extra ball (die to the wide) producing a wicket"}, {"ball": 16.6, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$c$$ $$Rahane$$ $$b$$ $$Kulkarni$$ $$20$$ $$(18b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$111.11$$"}, {"ball": 17.1, "isHighlight": false, "text": "Richardson to Venugopal Rao,2 runs,he opens the face and steers it to the off side"}, {"ball": 17.2, "isHighlight": false, "text": "Richardson to Venugopal Rao,1 leg bye"}, {"ball": 17.3, "isHighlight": false, "text": "Richardson to Sammy, $$OUT$$ ,Richardson removes the dangerous Sammy! This was a length ball and Sammy made room to smash this over the off side, top edge and Samson gets under the skier"}, {"ball": 17.3, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$†Samson$$ $$b$$ $$Richardson$$ $$6$$ $$(11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$54.54$$"}, {"ball": 17.4, "isHighlight": false, "text": "Richardson to Venugopal Rao,2 runs,this was banged in short and he hooks it to fine leg"}, {"ball": 17.5, "isHighlight": false, "text": "Richardson to Venugopal Rao,2 runs,hammered down the ground and he nearly claimed the non striker, long-off does well to cut it off"}, {"ball": 17.6, "isHighlight": false, "text": "Richardson to Venugopal Rao,1 run,full in length outside off and he drives him down to deep cover"}, {"ball": 18.1, "isHighlight": false, "text": "Faulkner to Venugopal Rao,no run,that's a good ball, really full and difficult to get it away, Faulkner picks up"}, {"ball": 18.2, "isHighlight": false, "text": "Faulkner to Venugopal Rao, $$FOUR$$ ,welcome boundary there, Faulkner errs by bowling it too wide outside off and short, he makes room and slaps it down to deep point"}, {"ball": 18.3, "isHighlight": false, "text": "Faulkner to Venugopal Rao,1 run,slower ball outside off and he makes room and carves it to deep cover"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to KV Sharma,1 leg bye,this was short and he swiveled to pull but mistimed it to short fine leg"}, {"ball": 18.4, "isHighlight": false, "text": "Pavan Emani: \"SRH have heaviliy invested yet again on bowlers this season. They don't have players who can up the anti at the depth. This could backfire against them on batting friendly wickets!\""}, {"ball": 18.5, "isHighlight": false, "text": "Faulkner to Venugopal Rao,1 run,low full toss and he makes room and drives him down to deep cover"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to KV Sharma,2 leg byes,should have put that away, full toss on the pads and clipped off the pads to fine leg"}, {"ball": 19.1, "isHighlight": false, "text": "Richardson to Venugopal Rao,1 run,Richardson round the wicket and fires it on the stumps and he drills it down to long-on"}, {"ball": 19.1, "isHighlight": false, "text": "How many more boundaries can they get?"}, {"ball": 19.2, "isHighlight": false, "text": "Richardson to KV Sharma,2 runs,fielding blooper there from Watson, Watson was at cover and the ball was driven to him but he was very slow to react, he moved to his right while the ball was to his left, realised a bit too late, the captain has goofed up, they can only smile"}, {"ball": 19.3, "isHighlight": false, "text": "Richardson to KV Sharma,2 runs,makes room and he slogs and the ball drops in front of deep midwicket"}, {"ball": 19.4, "isHighlight": false, "text": "Richardson to KV Sharma, $$OUT$$ ,finds the fielder at long-on, makes room and it's mistimed and Hodge gets under it at long-on"}, {"ball": 19.4, "isHighlight": false, "text": "$$KV$$ $$Sharma$$ $$c$$ $$Hodge$$ $$b$$ $$Richardson$$ $$4$$ $$(5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Richardson to Venugopal Rao,2 runs,pushes it down to long-on and they manage a couple"}, {"ball": 19.6, "isHighlight": false, "text": "Richardson to Venugopal Rao,1 bye,fires that full and wide outside off, he fails to dig it out and the non striker charged off"}, {"ball": 19.6, "isHighlight": false, "text": "Good showing by Rajasthan to keep a top heavy Hyderabad to just 133. The slower balls by Bhatia made it difficult to get him away and the support cast was effective too. This pitch does appear as if it has gotten slower. Even Sammy could do little and Warner wasn't at his best."}, {"ball": 19.6, "isHighlight": false, "text": "Hyderabad have been down this road before, defending sub 140 totals. Can they do it again? Join us shortly."}], "name": "Sunrisers Hyderabad v Rajasthan Royals", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729285.html?innings=1;view=commentary", "match_num": 4}