{"commentary": [{"ball": 0, "isHighlight": false, "text": "Rajasthan spring a surprise by sending in Abhishek Nayar as opener. No Shane Watson for now."}, {"ball": 0.1, "isHighlight": false, "text": "Steyn to Nayar, $$FOUR$$ ,overpitched ball outside off, 142.4kph, eases that through cover for four, doesn't try to power that one, gets the placement right"}, {"ball": 0.2, "isHighlight": false, "text": "Steyn to Nayar,no run,on the pads, Nayar looks to clip that behind square, no contact, was going to miss leg stump"}, {"ball": 0.3, "isHighlight": false, "text": "Steyn to Nayar, $$OUT$$ ,Steyn needs only balls to strike, he has Nayar lbw, it was a delayed appeal for lbw, that was a back of length ball around off stump, Nayar tries to whip that away, pad first, a bit of doubt over whether that would have hit off, the umpire is convinced though"}, {"ball": 0.3, "isHighlight": false, "text": "$$AM$$ $$Nayar$$ $$lbw$$ $$b$$ $$Steyn$$ $$4$$ $$(3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 0.4, "isHighlight": false, "text": "Steyn to Samson,no run,swinging away outside off at 145kph, Samson doesn't get bat on it"}, {"ball": 0.5, "isHighlight": false, "text": "Steyn to Samson,no run,defends this one back down the pitch"}, {"ball": 0.6, "isHighlight": false, "text": "Steyn to Samson,no run,lovely delivery from Steyn to end the over, he's on song straight away, hitting short of a length and nibbling away past the outside edge"}, {"ball": 0.6, "isHighlight": false, "text": "Here's Bhuvneshwar."}, {"ball": 1.1, "isHighlight": false, "text": "Kumar to Rahane,no run,pitched up and on middle and leg, the ball swings away, pitches on middle and leg, defended"}, {"ball": 1.2, "isHighlight": false, "text": "Kumar to Rahane, $$FOUR$$ ,overpitched and on the pads, clipped through midwicket for four, once again no attempt to hit that hard, more about getting it wide of a diving square leg"}, {"ball": 1.3, "isHighlight": false, "text": "Kumar to Rahane,no run,pitching back of a length and seams away a long way"}, {"ball": 1.4, "isHighlight": false, "text": "Kumar to Rahane,no run,this one doesn't move away, slapped towards point, reaches the fielder on the bounce"}, {"ball": 1.5, "isHighlight": false, "text": "Kumar to Rahane,no run,beauty from Bhuvneshwar Kumar, jagging away after pitching on off stump, back of a length ball, Rahane is beaten, terrific stuff"}, {"ball": 1.6, "isHighlight": false, "text": "Kumar to Rahane,2 runs,taps this one towards square leg for a couple"}, {"ball": 2.1, "isHighlight": false, "text": "Steyn to Samson,no run,Steyn gets a lovely angle across again and he pokes at it and misses, gets him forward"}, {"ball": 2.2, "isHighlight": false, "text": "Steyn to Samson,1 run,outside edge and over second slip, that was swinging away, closes the face and it is picked up by third man"}, {"ball": 2.3, "isHighlight": false, "text": "Steyn to Rahane,no run,this was full and driven to cover point and they decide against the single, direct hit at the bowler's end and he's home"}, {"ball": 2.4, "isHighlight": false, "text": "Steyn to Rahane,1 run,full and fast and another outside edge, wide of second slip and down to third man"}, {"ball": 2.5, "isHighlight": false, "text": "Steyn to Samson,no run,gets across his stumps and pushes it down the track back to the bowler"}, {"ball": 2.6, "isHighlight": false, "text": "Steyn to Samson,1 run,he stays beside the line and pushes it towards backward point"}, {"ball": 2.6, "isHighlight": false, "text": "Balu: \"Steyn, Bhuvaneswar, Ishant , Amit.. 4 world class bowlers and Karan is more than handy!! SRH has strongest Bowling attack.. All they need is couple of early wickets...\""}, {"ball": 3.1, "isHighlight": false, "text": "Kumar to Samson,1 run,another edge to third man, but just a single slip"}, {"ball": 3.1, "isHighlight": false, "text": "Balu: \"Steyn, Bhuvaneswar, Ishant , Amit.. 4 world class bowlers and Karan is more than handy!! SRH has strongest Bowling attack.. All they need is couple of early wickets...\""}, {"ball": 3.2, "isHighlight": false, "text": "Kumar to Rahane,1 run,gets more solid bat behind it this time, he stays back and punches it wide of cover"}, {"ball": 3.3, "isHighlight": false, "text": "Kumar to Samson, $$OUT$$ ,that was a soft dismissal! This was  a length ball outside off and Samson looked to clear mid-off but it went off the bottom half of the bat and as a result it went rather tamely to mid-off"}, {"ball": 3.3, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$Dhawan$$ $$b$$ $$Kumar$$ $$3$$ $$(9b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 3.3, "isHighlight": false, "text": "Harsh Mainkar: \"Lol Ishant world class bowler?! Our standards just keep stooping haha\""}, {"ball": 3.3, "isHighlight": false, "text": "Watto's in"}, {"ball": 3.4, "isHighlight": false, "text": "Kumar to Watson,1 run,he stays back and gets an inside edge to the leg side"}, {"ball": 3.5, "isHighlight": false, "text": "Kumar to Rahane,2 leg byes"}, {"ball": 3.6, "isHighlight": false, "text": "Kumar to Rahane,1 run, $$Dropped$$  by Finch at first slip! This was a lovely delivery that shaped in rather late, Rahane was forward and the outside edge just evaded the keeper and Finch was a bit late to dive to his left at first slip"}, {"ball": 4.1, "isHighlight": false, "text": "I Sharma to Rahane,no run,he stays back and punches it to the off side"}, {"ball": 4.2, "isHighlight": false, "text": "I Sharma to Rahane,no run,another big swing and a miss, this was outside off and kicking up and he nearly edges it"}, {"ball": 4.3, "isHighlight": false, "text": "I Sharma to Rahane,2 runs,he comes down the track and he plays across the line, clips it down to fine leg"}, {"ball": 4.4, "isHighlight": false, "text": "I Sharma to Rahane, $$FOUR$$ ,clears the infield, this was a length ball, Ranahe stays at the crease and lofts through the line and clears mid-on"}, {"ball": 4.5, "isHighlight": false, "text": "I Sharma to Rahane,1 wide,this was drifting down the leg side and he tries to clip it away"}, {"ball": 4.5, "isHighlight": false, "text": "I Sharma to Rahane,1 run,down the track to a shorter delivery and he mistimes it to the leg side, scampers the single"}, {"ball": 4.6, "isHighlight": false, "text": "I Sharma to Watson,1 run,he gets an inside edge to the pads and the ball rolls to the off side and they set off quickly"}, {"ball": 5.1, "isHighlight": false, "text": "Kumar to Watson,no run,that was a peach of a delivery! Squared him up completely by one that shaped in and then moved away, bounced too, how did that not take the edge?"}, {"ball": 5.2, "isHighlight": false, "text": "Kumar to Watson,no run,and again! Quality stuff from Bhuvi! This was a touch fuller and shaping away, Watson was coming forward and he nearly edged it"}, {"ball": 5.3, "isHighlight": false, "text": "Kumar to Watson,1 run,Watto's still looking wobbly! This was fuller and on the stumps, forced him to come forward and play and there's a leading edge that beats gully"}, {"ball": 5.4, "isHighlight": false, "text": "Kumar to Rahane,no run,now this one swerves back in and beats Rahane! Quality swing bowling here, sliced him in half and the keeper fumbles"}, {"ball": 5.5, "isHighlight": false, "text": "Kumar to Rahane,1 run,he punches it just wide of mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "Kumar to Watson,no run,defended to point and that ends a superb over of swing from Bhuvi"}, {"ball": 6.1, "isHighlight": false, "text": "I Sharma to Rahane,1 run,gets forward and gets an inside edge to the boot and they set off"}, {"ball": 6.2, "isHighlight": false, "text": "I Sharma to Watson, $$OUT$$ ,Ishant's got Watson and as if he can't believe what he's done, he turns back to Billy Bowden and waits for the crooked finger, this was pitched up on the off stump, just the right length, Watson comes forward and there's a thick outside edge to the keeper, it was very obvious, Ishant waits and waits and Bowden does the needful"}, {"ball": 6.2, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$†Rahul$$ $$b$$ $$I$$ $$Sharma$$ $$3$$ $$(7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$42.85$$"}, {"ball": 6.2, "isHighlight": false, "text": "That testing over from Bhuvi fed several doubts in Watto's mind. Set it up for Ishant"}, {"ball": 6.3, "isHighlight": false, "text": "I Sharma to Binny,1 run,he stays back and works it to the on side"}, {"ball": 6.4, "isHighlight": false, "text": "I Sharma to Rahane,no run,this was quite wide outside off and not called though"}, {"ball": 6.5, "isHighlight": false, "text": "I Sharma to Rahane,no run,tests him out with a bouncer that has Rahane weaving backwards to evade it, Ishant breathing fire"}, {"ball": 6.6, "isHighlight": false, "text": "I Sharma to Rahane, $$FOUR$$ ,poor ball to end the over though, short and wide outside off and Rahane wasn't missing out, slapped to deep point"}, {"ball": 6.6, "isHighlight": false, "text": "Faras: \"Raising his finger late is becoming very normal for Billy Bowden. I think he knows the person is out, and he knows that batsman knows he is out. He just gives time to batsman to walk off on his own or I will throw you out.\""}, {"ball": 7.1, "isHighlight": false, "text": "Sammy to Binny,1 run,goes back and punches it towards cover"}, {"ball": 7.2, "isHighlight": false, "text": "Sammy to Rahane,1 run,he opens the face of the bat and runs it down to third man"}, {"ball": 7.3, "isHighlight": false, "text": "Sammy to Binny,1 run,full on middle and leg and he pushes it down to long-on"}, {"ball": 7.4, "isHighlight": false, "text": "Sammy to Rahane,2 runs,stays beside the line and he angles it down to third man and Binny runs the first quickly, allows the second"}, {"ball": 7.4, "isHighlight": false, "text": "Rohit: \"The world has really changed. Ishant is picking important wicket in a cricket match again and starts yelling straight away. And wait, someone who is calming him is WARNER, really??"}, {"ball": 7.5, "isHighlight": false, "text": "Sammy to Rahane,no run,he gets forward and across and pushes it to the off side"}, {"ball": 7.6, "isHighlight": false, "text": "Sammy to Rahane,1 wide,this was too wide outside off"}, {"ball": 7.6, "isHighlight": false, "text": "Sammy to Rahane,1 run,he stays back to a length ball and works it to the on side"}, {"ball": 7.6, "isHighlight": false, "text": "It's the strategic timeout"}, {"ball": 8.1, "isHighlight": false, "text": "Mishra to Rahane,1 run,Mishra tosses it up and he comes forward and drives wide of mid-off"}, {"ball": 8.2, "isHighlight": false, "text": "Mishra to Binny,1 run,tosses it down the leg side and he sweeps between the keeper's legs"}, {"ball": 8.3, "isHighlight": false, "text": "Mishra to Rahane,1 run,tosses it down the leg side and he sweeps"}, {"ball": 8.4, "isHighlight": false, "text": "Mishra to Binny,1 leg bye,the sharp googly, Binny was down the track and didn't pick it, inside edge to the leg side"}, {"ball": 8.5, "isHighlight": false, "text": "Mishra to Rahane,2 runs,this was tickled down the leg side"}, {"ball": 8.6, "isHighlight": false, "text": "Mishra to Rahane,no run,looked like another googly, inside edge to the pads"}, {"ball": 9.1, "isHighlight": false, "text": "Sammy to Binny,no run,he comes down the track and works a low full toss to midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Sammy to Binny,1 run,bowls it wide outside off and he flays at it and clears cover"}, {"ball": 9.3, "isHighlight": false, "text": "Sammy to Rahane,1 run,he makes room and he chops it towards point"}, {"ball": 9.4, "isHighlight": false, "text": "Sammy to Binny, $$SIX$$ ,did that go all the way? This was bowled short and sat up nicely for Binny to biff it over midwicket, the question was whether the ball hit the boundary cushion on the full or on the half volley, Richard Illingworth asks the third umpire and after studying a few replays he calls it a six"}, {"ball": 9.5, "isHighlight": false, "text": "Sammy to Binny,no run,moves away from him and he looks to cut but misses"}, {"ball": 9.6, "isHighlight": false, "text": "Sammy to Binny, $$FOUR$$ ,another clean pull, this is poor bowling, too short, sits up nicely for the pull, one bounce to deep midwicket"}, {"ball": 10.1, "isHighlight": false, "text": "Mishra to Rahane,no run,tossed up and he gets forward and drives"}, {"ball": 10.2, "isHighlight": false, "text": "Mishra to Rahane, $$FOUR$$ ,committed to the sweep early, tossed up on the pads and he gets down and sweeps with conviction"}, {"ball": 10.3, "isHighlight": false, "text": "Mishra to Rahane,no run,skids through, stays back and punches it back to the bowler"}, {"ball": 10.4, "isHighlight": false, "text": "Mishra to Rahane,1 run,flatter one and turned to the on side, Mishra himself does the chasing"}, {"ball": 10.4, "isHighlight": false, "text": "SDR: \"As Captain surely now Watson should put himself back where he belongs. The opening position is where he can be most effective, especially in the IPL.\""}, {"ball": 10.5, "isHighlight": false, "text": "Mishra to Binny,1 run,picks the googly late, tucks it to the on side and they set off, the throw to the bowler's end was wide and the Hyderabad fielders ask the umpires if Binny was obstructing the throw intentionally, the umpires have a short discussion but they move on"}, {"ball": 10.6, "isHighlight": false, "text": "Mishra to Rahane,2 runs,turned away towards deep square leg and Ishant does well to slide and cut it off"}, {"ball": 10.6, "isHighlight": false, "text": "naveen: \"I don't know why dhawan is giving ball to Sammy when there is well packed bowlers like Steyn, Bhuvi, Ishant, Mishra, Karan\""}, {"ball": 11.1, "isHighlight": false, "text": "I Sharma to Binny,2 runs,he comes down the track and gets an inside edge to deep square leg"}, {"ball": 11.2, "isHighlight": false, "text": "I Sharma to Binny,1 run,this is slightly short and wide and he makes room and carves it down to third man"}, {"ball": 11.3, "isHighlight": false, "text": "I Sharma to Rahane,no run,ouch! That nearly dislodges the visor altogether! Rahane picks the wrong ball to charge down the track, it was short and as he pulled the ball hit him straight on the grill and the screws come off"}, {"ball": 11.3, "isHighlight": false, "text": "Rahane sends for a new helmet. Slight break in play"}, {"ball": 11.4, "isHighlight": false, "text": "I Sharma to Rahane,no run,he stays behind the line and punches it to the off side"}, {"ball": 11.5, "isHighlight": false, "text": "I Sharma to Rahane,2 runs,that was punched nicely on the back foot, beats cover and the sweeper mops up"}, {"ball": 11.6, "isHighlight": false, "text": "I Sharma to Rahane,1 run,Rahane continues to charge Ishant, gets an inside edge"}, {"ball": 11.6, "isHighlight": false, "text": "Rajasthan are on the upswing. No need to try anything silly."}, {"ball": 11.6, "isHighlight": false, "text": "Abdullah: \"This is a crucial tournament for Binny. With the WC in Aus and NZ 10 months away he can confirm his position in the Indian squad as a medium fast bowling all rounder. Could be a crucial role given the conditions.\""}, {"ball": 12.1, "isHighlight": false, "text": "KV Sharma to Rahane,no run,he stays back and punches it to the off side"}, {"ball": 12.2, "isHighlight": false, "text": "KV Sharma to Rahane,2 runs,gets forward and across and pushes it wide of cover"}, {"ball": 12.3, "isHighlight": false, "text": "KV Sharma to Rahane,1 run,goes back at the crease and pulls along the ground"}, {"ball": 12.4, "isHighlight": false, "text": "KV Sharma to Binny,1 run,he rocks back and pulls and it's in the air but drops short of deep midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "KV Sharma to Rahane,1 run,goes back at the crease and plays with the turn to the offside"}, {"ball": 12.6, "isHighlight": false, "text": "KV Sharma to Binny,1 run,length ball on middle and leg and turned to the leg side"}, {"ball": 12.6, "isHighlight": false, "text": "Sanju Z: \"Dhawan as captain is SRH's weakness. He was terrible in the CLT20 where he often would underbowl Mishra and barely given Karn Sharma an over. I like the makeup of SRH, but I doubt they will win with Dhawan as captain. \""}, {"ball": 13.1, "isHighlight": false, "text": "I Sharma to Binny,1 run,this was short and wider outside off and he punches it wide of point and Bhuvneshwar is swift in the deep"}, {"ball": 13.2, "isHighlight": false, "text": "I Sharma to Rahane,1 run,good running, he pushes it with soft hands towards cover point and sets off"}, {"ball": 13.3, "isHighlight": false, "text": "I Sharma to Binny,no run,Binny makes room to Ishant but a bit too much, ends up chopping it back down the track"}, {"ball": 13.4, "isHighlight": false, "text": "I Sharma to Binny,no run,this was a low full toss and ha made room and ended up pushing it back to bowler off the toe of the bat"}, {"ball": 13.5, "isHighlight": false, "text": "I Sharma to Binny,2 runs,close call for Binny as he made room to pull and miscued it just wide of midwicket, they take two"}, {"ball": 13.6, "isHighlight": false, "text": "I Sharma to Binny, $$FOUR$$ ,in the air but very safe in the end, it was pitched up and he made a bit of room to carve that over the off side, bisected mid-off an cover very well, the field was up"}, {"ball": 13.6, "isHighlight": false, "text": "Paragordius: \"People are always ready to criticize someone. The same was said about Rohit Sharma when he gets as made Mumbai's captain. We all know how that ended. The same with Dhawan. Give him a chance. He is in the middle. He knows what he is doing. On a related note, nice to see most of the Indian top order batsmen are captains of their respective teams. Dhawan, Kohli and Rohit, not to forget Dhoni\""}, {"ball": 14.1, "isHighlight": false, "text": "Steyn to Rahane, $$FOUR$$ ,outside edge but no slip, this was full and swinging away, he drove hard at it and the edge flew past the keeper and down to third man, fifty for Rahane! Well played"}, {"ball": 14.2, "isHighlight": false, "text": "Steyn to Rahane, $$FOUR$$ ,back to back boundaries off Steyn, psychological edge to Rajasthan, this was nicely punched down the ground wide of mid-off off a full delivery"}, {"ball": 14.3, "isHighlight": false, "text": "Steyn to Rahane,1 run"}, {"ball": 14.4, "isHighlight": false, "text": "Steyn to Binny,2 runs,this was shorter and Binny made room, weaved away and sliced it to third man"}, {"ball": 14.5, "isHighlight": false, "text": "Steyn to Binny,1 run,fires a full ball on the pads and he makes room and digs it out to the on side"}, {"ball": 14.5, "isHighlight": false, "text": "Rahul: \"How can two matches play out so differently on the same pitch? So much wear and tear already? Perhaps playing the entire much under lights? I just can't imagine Maxwell walking out to bat next and struggling!!\""}, {"ball": 14.6, "isHighlight": false, "text": "Steyn to Rahane,1 run,cleverly played but just a single, this was short and he weaved backwards, opened the face and steered it one bounce to third man"}, {"ball": 15.1, "isHighlight": false, "text": "Mishra to Rahane,2 runs,they continue to use their feet, this time he's lucky as the inside edge trickles past the stumps"}, {"ball": 15.2, "isHighlight": false, "text": "Mishra to Rahane,no run,gives it more air and he drills it down the track"}, {"ball": 15.3, "isHighlight": false, "text": "Mishra to Rahane,1 run,goes back and punches a googly to long-on"}, {"ball": 15.4, "isHighlight": false, "text": "Mishra to Binny,2 runs,this was tossed up wide outside off and he flays at it, beats cover and Finch does well to move to his left, slide and cut it off"}, {"ball": 15.5, "isHighlight": false, "text": "Mishra to Binny,1 run,tossed up and he goes for the sweep but doesn't control it"}, {"ball": 15.6, "isHighlight": false, "text": "Mishra to Rahane, $$OUT$$ ,Rahane's caught in the deep but has it come too late for Hyderabad? Rahane continues to give the bowlers the charge, this was tossed up, Rahane made room for himself to free his arms as he looked to clear long-off, hit it flat and straight to Finch"}, {"ball": 15.6, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$c$$ $$Finch$$ $$b$$ $$Mishra$$ $$59$$ $$(53b$$ $$6x4$$ $$0x6)$$ $$SR:$$ $$111.32$$"}, {"ball": 16.1, "isHighlight": false, "text": "KV Sharma to Hodge,no run,drills it back to the bowler"}, {"ball": 16.2, "isHighlight": false, "text": "KV Sharma to Hodge,no run,gets forward and drives to cover"}, {"ball": 16.3, "isHighlight": false, "text": "KV Sharma to Hodge,1 run,turns it against the turn to midwicket and he's off the mark"}, {"ball": 16.4, "isHighlight": false, "text": "KV Sharma to Binny,1 run,flatter one and he turns it away to long leg"}, {"ball": 16.5, "isHighlight": false, "text": "KV Sharma to Hodge,no run,Hodge goes for the slog but misses"}, {"ball": 16.6, "isHighlight": false, "text": "KV Sharma to Hodge,no run,tries to work it to the legside but misses"}, {"ball": 17.1, "isHighlight": false, "text": "Mishra to Binny,1 run,Binny went down the track and was foxed by Mishra's flight, ended up getting a leading edge"}, {"ball": 17.2, "isHighlight": false, "text": "Mishra to Hodge,no run,comes forward and drives back to the bowler"}, {"ball": 17.3, "isHighlight": false, "text": "Mishra to Hodge,no run,the googly! This was bowled slower and it spun  back in and kept low, Hodge nearly dragged it on"}, {"ball": 17.4, "isHighlight": false, "text": "Mishra to Hodge, $$OUT$$ ,impatience gets the better off Hodge! Is there a twist? Determined to fetch a boundary he risks slogging against the turn, it was the leg break, fetches it from outside off, Sammy takes it well in front of the deep midwicket rope"}, {"ball": 17.4, "isHighlight": false, "text": "$$BJ$$ $$Hodge$$ $$c$$ $$Sammy$$ $$b$$ $$Mishra$$ $$1$$ $$(8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$12.50$$"}, {"ball": 17.5, "isHighlight": false, "text": "Mishra to Binny, $$FOUR$$ ,a pressure-relieving boundary for Binny, this was flighted on the pads, he was on his knee early and swept it firmly to fine leg"}, {"ball": 17.6, "isHighlight": false, "text": "Mishra to Binny,2 runs,turns it wide of midwicket and they hurry the second run, the fielders are not happy they conceded two"}, {"ball": 17.6, "isHighlight": false, "text": "17 off 12. More manageable for Rajasthan but Steyn has an over"}, {"ball": 18.1, "isHighlight": false, "text": "Steyn to Bhatia, $$FOUR$$ ,what a way to start the over! Bhatia whips a full delivery on middle and leg with such force that the ball blazes away wide of midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "Steyn to Bhatia,no run,looked like the slower one and he made room and failed to get bat on ball"}, {"ball": 18.3, "isHighlight": false, "text": "Steyn to Bhatia, $$OUT$$ ,another wicket goes and Hyderabad are still in it! Or wait... they are checking the catch at the deep, it was the off cutter from Steyn, Bhatia was aiming to clear long-on, the ball dips as it reaches Finch who was quite in front of the rope, he falls forward and takes it inches off the ground, replays confirm that the catch was clean"}, {"ball": 18.3, "isHighlight": false, "text": "$$R$$ $$Bhatia$$ $$c$$ $$Finch$$ $$b$$ $$Steyn$$ $$4$$ $$(3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 18.3, "isHighlight": false, "text": "Rajasthan are making it difficult for themselves with these wickets"}, {"ball": 18.4, "isHighlight": false, "text": "Steyn to Binny, $$FOUR$$ ,Binny meanwhile relieves the pressure with a boundary, he makes room to a length ball and cuts him hard and fast past backward point, big gap there"}, {"ball": 18.5, "isHighlight": false, "text": "Steyn to Binny,no run,Binny makes room and he makes too much of it, can't slap it away"}, {"ball": 18.6, "isHighlight": false, "text": "Steyn to Binny,1 run,that was a snorter from Steyn, quick one on the body and Binny swings and the ball hits his body and drops to the off side"}, {"ball": 18.6, "isHighlight": false, "text": "8 to defend and Bhuvneshwar's got to bowl a solid over here"}, {"ball": 19.1, "isHighlight": false, "text": "Kumar to Binny,1 run,starts off with a yorker and it's a single, he makes room and jams it out to deep cover"}, {"ball": 19.1, "isHighlight": false, "text": "Fine leg is up, long-off and long-on are in place"}, {"ball": 19.2, "isHighlight": false, "text": "Kumar to Faulkner, $$FOUR$$ ,Faulkner doesn't need a sighter! This was too full and wide outside off, Faulkner made room and smashed it wide of cover, the sweeper can't cut it off"}, {"ball": 19.3, "isHighlight": false, "text": "Kumar to Faulkner, $$FOUR$$ ,back to back fours to finish things off! Bhuvneshwar fails to get the yorker in yet again, this time it's a low full toss and the Australian makes room and places it down to the vacant deep point region"}, {"ball": 19.3, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.3, "isHighlight": false, "text": "$$Watson$$ : \"It was a slightly smaller score than we expected. But 134 was always going to be challenging against their bowling. The wicket played very nicely.\""}, {"ball": 19.3, "isHighlight": false, "text": "Rahane is the  $$Man$$ $$of$$ $$the$$ $$Match$$ : \"When three went down I wanted to bat as long as possible, we needed one big partnership. Me and Binny enjoy each other's company very well. I backed my instincts. Credit also goes to Sunrisers bowlers.\""}, {"ball": 19.3, "isHighlight": false, "text": "Looks like no separate interview with Dhawan at the presentation. He spoke immediately after the game, where he said that 150 was the par score."}, {"ball": 19.3, "isHighlight": false, "text": "That's it from us here. A high-scoring chase followed by a middle of the road one. It's on to Dubai tomorrow for the first time for two more double-headers. Thanks for your company tonight. Cheers!"}, {"ball": 19.3, "isHighlight": false, "text": "$$End$$ $$of$$ $$match$$ : No wild celebration from Faulkner. He's done this before hasn't he? Holds his nerve again in a chase. Credit though to Rahane and Binny or setting it up for Rajasthan. Always a good sign when the Indian players play bigger rolls."}, {"ball": 19.3, "isHighlight": false, "text": "Dhawan says on  TV that Hyderabad should have at least made 150. Hyderabad showed good fight towards the end but they had too few to defend."}, {"ball": 19.3, "isHighlight": false, "text": "Surya: \"Dhawan missed a point here. Bhuvi should have been bowled 19th and Steyn 20th. \""}], "name": "Sunrisers Hyderabad v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729285.html?innings=2;view=commentary", "match_num": 4}