{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.58$$ $$pm$$  Couple of minutes away from the start. Gambhir leads the team inside the field. Simmons and Gautam are here too. Morne Morkel to start the innings. One slip in place"}, {"ball": 0, "isHighlight": false, "text": "Danish Patel: \"As good as CM Gautam may have been for a couple of games, you have to understand that he is not yet ready to face world class bowlers! Aditya Tare does a decent job against them though. Ideally, I would let Tare open with Lendl and drop CM Gautam for Praveen Kumar to head in with a 5 bowl attack keeping Anderson and Pollard as backup or variety. Since the batting is finally clicking for MI, they can afford five bowlers. Rest assured, PK can hit it out of the park too when needed\""}, {"ball": 0, "isHighlight": false, "text": "$$7.45$$ $$pm$$  \"Frankly, Anderson needs to be dropped and Marchant de Lange needs to be given a go. He can form a lethal pair with Malinga. Also, cant understand why Praveen is missing out,\" says Sahil."}, {"ball": 0, "isHighlight": false, "text": "Abhi Mukhopadhy: \"If KKR wins tonight, it will leave them as the top and as of now the lone contender for the fourth spot with SRH losing today..\""}, {"ball": 0, "isHighlight": false, "text": "\"Pollard vs Narine may not be a contest at all.. Pollard may not even face him.. he will get out to one of KKRs pace bowlers (Morkel).. but if contest does happen, Narine will get the better of him any day,\" feels Chibi and I agree with him on this."}, {"ball": 0, "isHighlight": false, "text": "Aashimi: \"Fun Fact: This season, Delhi has won against only two teams - Kolkata and Mumbai; while Punjab has lost to only two teams - Kolkata and Mumbai.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss:$$ $$Knight$$ $$Riders$$ $$win$$ $$the$$ $$toss$$ $$and$$ $$choose$$ $$to$$ $$bowl$$ . Kolkata bring in  $$Shakib$$ $$Al$$ $$Hasan$$  for Jacques Kallis. Gautam Gambhir says, \"Tough choice to drop Kallis but Shakib is a quality spinner. we like to chase... brrrb.. brrrrr.\" (Apologies, it's hard to keep up with his pace). Rohit says, \"t h e  p i t c h  s h o u l d  s t a y   t h e  s a m e.\" (that's more like it.)  Mumbai keep the same XI."}, {"ball": 0, "isHighlight": false, "text": "Anwy: \"Malinga's last game for Mumbai before he flies off to England. We gonna miss the yorkers...\""}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$  Alright, another team has been demolished by Kings XI. Action moves north-east to Cuttack where Kolkata Knight Riders are playing a home game against Mumbai Indians. Both teams are running for that fourth playoff spot."}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  Who expected Naman Ojha to dismantle the bowling the way he did! And if that wasn't enough, who then expected Saha and Vohra to whack it around with so much ease, ahead of Maxwell and Miller! Punjab are strolling now, we'll be ready once that match gets over."}, {"ball": 0, "isHighlight": false, "text": "We are midway into Powerplay 4 at  $$CricIQ$$ . How much have you scored? One good attempt could earn you a berth in the  $$video$$ $$round$$ , so keep playing."}, {"ball": 0, "isHighlight": false, "text": "MI v KKR... Pollard v Narine could decide which way this game goes. Tough to predict who will come out on top, but it's easier to back both of them to come good in your  $$Fantasy$$ $$XI$$ . Have you made your changes for the game?"}, {"ball": 0.1, "isHighlight": false, "text": "Morkel to Simmons,no run,on target first ball! Back of length and honing in on off, the batsman defends off the back foot"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Simmons,1 leg bye,slightly drifting on to the pads and Simmons, hopping on his toes, clips it to fine leg. That actually went off the thigh pad"}, {"ball": 0.3, "isHighlight": false, "text": "Morkel to Gautam,no run,peach of a delivery! Although, Gautam just plays inside the line of this rising length delivery, flies past the shoulder of the bat"}, {"ball": 0.4, "isHighlight": false, "text": "Morkel to Gautam,no run,gets some away movement from a line wide outside off, the batsman comes forward and lets it go through"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Gautam,2 wides,down the leg side, it flies past the pads and the keeper doesn't collect it cleanly, allowing an extra run"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Simmons,no run,he stays on the back foot and defends the length delivery to off"}, {"ball": 0.6, "isHighlight": false, "text": "Morkel to Simmons,no run,stays in the crease and hops to defend the length delivery down the pitch"}, {"ball": 0.6, "isHighlight": false, "text": "Raghu: \"Gautam Gambhir persisted and is now flourishing. Has MI missed a trick by not persisting with Hussey. Hussey is a match winner\""}, {"ball": 0.6, "isHighlight": false, "text": "Umesh Yadav from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "UT Yadav to Gautam,no run,bowls it full with a bit of shape, the batsman leans forward and drives it straight to cover point"}, {"ball": 1.2, "isHighlight": false, "text": "UT Yadav to Gautam,no run,this one holds it line to beat the outside edge! Comes in the air and just nips away from a length, beating Gautam's forward push"}, {"ball": 1.3, "isHighlight": false, "text": "UT Yadav to Gautam, $$FOUR$$ ,poor delivery! He follows up two good deliveries with a leg side length delivery, it is helped on it's way to the fine-leg boundary"}, {"ball": 1.3, "isHighlight": false, "text": "Jignesh: \"@Raghu: GG persisted with Y Pathan too.. \" --- There comes the volley"}, {"ball": 1.4, "isHighlight": false, "text": "UT Yadav to Gautam,1 run,goes back to the line outside off, Gautam takes a step forward and punches it to cover, picks up a single as the fielder doesn't stop it cleanly"}, {"ball": 1.5, "isHighlight": false, "text": "UT Yadav to Simmons,1 run,he makes room and whacks the length delivery to the right of mid-off, Gambhir gets a hand to it, but can't stop it cleanly"}, {"ball": 1.6, "isHighlight": false, "text": "UT Yadav to Gautam,3 runs,looks to hoick it over midwicket but doesn't get much timing, Tendo chases it down from square leg"}, {"ball": 1.6, "isHighlight": false, "text": "Dan: \"Raghu, I agree about Hussey, last year he sets the record(tied) for a season with 733 runs, and this year can't get a game? All batsmen have a few off games but to not give him another chance seems ridiculous.\""}, {"ball": 2.1, "isHighlight": false, "text": "Morkel to Gautam,no run,short of length outside off, the batsman stayed rooted to the crease and has a poke at that, misses"}, {"ball": 2.2, "isHighlight": false, "text": "Morkel to Gautam, $$OUT$$ ,straight to cover! Gautam was not very comfortable against the pace of Morkel, so this time he tries to force it. He moves to the leg side and tries to drive it on the up through covers, but is not able to keep it down. Good low catch by Surya"}, {"ball": 2.2, "isHighlight": false, "text": "$$CM$$ $$Gautam$$ $$c$$ $$SA$$ $$Yadav$$ $$b$$ $$Morkel$$ $$8$$ $$(10m$$ $$9b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$88.88$$"}, {"ball": 2.2, "isHighlight": false, "text": "Rayudu is the next man.."}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Rayudu,1 wide,wrong line, this is down the leg side and is an easy call for the umpire"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Rayudu,(no ball) 1 run,length delivery on off, the batsman dabs it to cover for a quick single, but Morkel has  $$overstepped$$  here"}, {"ball": 2.3, "isHighlight": false, "text": "$$Free-hit$$  coming up"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Simmons,1 wide,smart reply! This is a short delivery and the batsman looks to flat-bat back down the ground but doesn't make any contact. But that's too high, has been called a wide"}, {"ball": 2.3, "isHighlight": false, "text": "$$Still$$ $$free-hit$$"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Simmons,1 run,the short one is followed by a 145 kph yorker, the batsman wanted to dig it out down the ground but gets an inside edge to deep square leg"}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Rayudu,no run,length delivery on the stumps, the batsman defends it to cover"}, {"ball": 2.5, "isHighlight": false, "text": "Morkel to Rayudu, $$SIX$$ ,superb hit! This carries all the way. Rayudu is carrying his from from the last game, he comes down the pitch and lofts the length delivery over mid-on effortlessly"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Rayudu,no run,stays calm and defends the follow up delivery to point"}, {"ball": 2.6, "isHighlight": false, "text": "Sagar Patil: \"Sarkar Captain: I strongly believes Mumbai need a big hitter as one of the opener, either Anderson or Tare should work.. Getting the runs at 6 RPO in first 10 overs and expecting the midlle order to score another 120 runs in next 10 overs is ridiculous!!\""}, {"ball": 2.6, "isHighlight": false, "text": "Now Shakib comes in"}, {"ball": 3.1, "isHighlight": false, "text": "Shakib Al Hasan to Simmons,no run,tossed up delivery outside off, the batsman sweeps it from there to square leg"}, {"ball": 3.2, "isHighlight": false, "text": "Shakib Al Hasan to Simmons,no run,he moves to the leg side, gets a quick flat delivery on the stumps and punches it back to the bowler"}, {"ball": 3.3, "isHighlight": false, "text": "Shakib Al Hasan to Simmons, $$FOUR$$ ,now back to the sweep shot! it's not hit hard, just controlled well enough to pierce the gap at backward square leg"}, {"ball": 3.4, "isHighlight": false, "text": "Shakib Al Hasan to Simmons,no run,slows it down and follows the batsman who was making room, Simmons defends"}, {"ball": 3.5, "isHighlight": false, "text": "Shakib Al Hasan to Simmons, $$FOUR$$ ,another sweep and another one heads to the boundary, this one is finer, beats the short third man fielder"}, {"ball": 3.6, "isHighlight": false, "text": "Shakib Al Hasan to Simmons,1 run,this time he plays it in front of the wicket, driving the tossed up delivery to wide mid-off for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Narine comes in early. One slip in place"}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Simmons,1 run,tosses it up on off stump, Simmons leans forward and picks up a single to long on"}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Rayudu,no run,fires it flat on off, the batsman comes forward and defends to off"}, {"ball": 4.2, "isHighlight": false, "text": "Slip goes out to short third man"}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Rayudu,no run,this is the other one now, but Rayudu spots it and defends it to point"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Rayudu,2 runs,Shakib gets there at deep square leg but  $$drops$$  it! It was a big top-edge as the batsman went for a sweep, and Shakib did very well to run in from deep midwicket, got both hands to it, but couldn't hold on"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Rayudu,no run,flatter delivery on the stumps, the batsman defends it off the back foot"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Rayudu,no run,wide outside off and Rayudu looks to cut it through backward point, but is not able to beat the fielder"}, {"ball": 4.6, "isHighlight": false, "text": "Jon: \"The success of the Gambhir-Uthappa combo in the past few matches is what is making KKR think they can manage without Kallis. However KKR has a way of dropping the wrong guys for a match. When they dropped Yusuf, they ended in a super over needing him the most. Similarly when they dropped Kallis last time, they suffered a middle order collapse. \""}, {"ball": 5.1, "isHighlight": false, "text": "Shakib Al Hasan to Simmons, $$OUT$$ ,this one goes below the radar! Shakib bowls these balls from time to time.. It's the arm-ball, keeps coming in and stays mighty low. Simmons was aiming for the sight screen - he was out of the crease and gave it a proper swing, but the bat just met thin air and the ball crashed low into the leg stump. He makes amends for that dropped catch"}, {"ball": 5.1, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$12$$ $$(24m$$ $$14b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$85.71$$"}, {"ball": 5.1, "isHighlight": false, "text": "Rohit Sharma comes in"}, {"ball": 5.2, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,tossed up and slow at 79.9 kph, the batsman waits and defends it to off"}, {"ball": 5.3, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,still slower from Shakib, the batsman pushes it to cover"}, {"ball": 5.4, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,comes forward and punches this to the left of Shakib"}, {"ball": 5.5, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,uses his feet to get to the pitch of the delivery and drives it down to long-off to get off the mark"}, {"ball": 5.5, "isHighlight": false, "text": "Sumanth: \"After the last match, this match feels like the last session of a dead rubber test match.\""}, {"ball": 5.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,skips down the pitch and eases it to long-off for another single. A sedate start for Mumbai here."}, {"ball": 5.6, "isHighlight": false, "text": "Aashir: \"@Jon They dropped McCullum in the finals two years back and won it.\""}, {"ball": 5.6, "isHighlight": false, "text": "Gambhir goes back to Umesh."}, {"ball": 6.1, "isHighlight": false, "text": "UT Yadav to Rayudu,no run,he fires this on the off stump line, the batsman stays in the crease and defends"}, {"ball": 6.2, "isHighlight": false, "text": "UT Yadav to Rayudu, $$FOUR$$ ,smartly played from Rayudu! He uses his feet, moves slightly to the leg side to give himself some room and just drives it over mid-off for another boundary"}, {"ball": 6.3, "isHighlight": false, "text": "UT Yadav to Rayudu,no run,length delivery on off, the batsman pushes it to cover. It probably stayed a touch low as it hit the toe of the bat"}, {"ball": 6.4, "isHighlight": false, "text": "UT Yadav to Rayudu,1 run,he comes forward and pushes the length delivery softly to long-on for a single"}, {"ball": 6.5, "isHighlight": false, "text": "UT Yadav to Sharma,no run,waits in the crease and pushes the length delivery to cover"}, {"ball": 6.6, "isHighlight": false, "text": "UT Yadav to Sharma,1 run,attempts a slower delivery, the batsman waits on the back foot before nudging it to deep square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Amitav Mitra: \"The chances for MI will depend on how well they play Narine...most of the teams who have defeated KKR this season have attacked Narine\""}, {"ball": 6.6, "isHighlight": false, "text": "Piyush Chawla is the next change"}, {"ball": 7.1, "isHighlight": false, "text": "Chawla to Sharma,no run,lots of loop on this one, the batsman looks to drive it to off but gets it off the toe, straight to cover"}, {"ball": 7.2, "isHighlight": false, "text": "Chawla to Sharma,1 run,he waits on the back foot and punches the flatter delivery to deep midwicket"}, {"ball": 7.3, "isHighlight": false, "text": "Chawla to Rayudu,1 run,lots of air again from Chawla, Rayudu was out of the crease, makes it a half-volley and eases it to long off"}, {"ball": 7.4, "isHighlight": false, "text": "Chawla to Sharma,no run,flatter from the bowler, Rohit defends it off the front foot"}, {"ball": 7.5, "isHighlight": false, "text": "Chawla to Sharma,1 run,bowls the top spinner, Rohit goes deep in the crease and punches it to deep cover"}, {"ball": 7.6, "isHighlight": false, "text": "Chawla to Rayudu,no run,he is very very lucky here! This one is similar to that underground delivery bowled by Shakib.. Rayudu was lucky that this was just outside the line of off, he gets beaten and crouches down on the pitch.."}, {"ball": 7.6, "isHighlight": false, "text": "Yusuf Pathan gets the ball.. He is playing his 100th IPL match today.."}, {"ball": 8.1, "isHighlight": false, "text": "Pathan to Sharma,2 runs,gets some turn in to the batsman, easily punched to wide long-on for a single. Oh no, Manish charges in and is not able to pick up the ball, allows an extra"}, {"ball": 8.2, "isHighlight": false, "text": "Pathan to Sharma,no run,another one that stays very low, Rayudu lucky again as it's outside off"}, {"ball": 8.3, "isHighlight": false, "text": "Pathan to Sharma,1 run,flatter and shorter outside off, the batsman cuts it down to short third man for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Pathan to Rayudu, $$FOUR$$ ,finds the gap at backward point this time.. He does it better than what Rohit did in the last ball"}, {"ball": 8.5, "isHighlight": false, "text": "Pathan to Rayudu,2 runs,stays on the back foot and punches it to deep point for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Pathan to Rayudu,1 run,tossed up outside off but Rayudu drags it from there to deep midwicket with an agricultural sweep"}, {"ball": 8.6, "isHighlight": false, "text": "Use the strategic time-out wisely. Play  $$CricIQ$$  and stay in contention for big prizes, including a trip to Lord's to watch India play England."}, {"ball": 8.6, "isHighlight": false, "text": "Chawla comes in after the time-out. Mumbai are prepared to bide time."}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to Rayudu,2 runs,he stays in the crease and pushes this softly in the gap at deep midwicket for a quick couple"}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Rayudu,1 run,dances down the pitch but doesn't get hold of this flighted delivery, drives it down to long on"}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Sharma,1 run,this is the googly, but it is short enough for Rohit to rock back and punch it to deep cover"}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to Rayudu,1 run,flatter delivery on the stumps, the batsman pushes it to long on for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to Sharma,no run,gets some turn by bowling it slower, the batsman pushes it back down the pitch"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Sharma,1 run,tossed up delivery outside off, the batsman comes forward and drives it down to deep extra cover"}, {"ball": 10.1, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,fires this one on the pads, again, it stays low.. Rohit squeezes it out back towards the bowler"}, {"ball": 10.2, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,again, it stays a touch low, it hits the pads and rolls close towards the keeper"}, {"ball": 10.3, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,no run,flatter delivery, Rohit can't get it away, pushes it back to the bowler"}, {"ball": 10.4, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,stays in the crease and works this one away to deep midwicket for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Amitav Mitra: \"MI's planning is not very clever...every match they lose wickets they go to safe mode...whearas a team like CSK or KXIP go for counterattack.Surely they can try Anderson in the role.They are losing out precious overs.And sadly when Pollard/Anderson get chance it is too late\""}, {"ball": 10.5, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,no run,keeps coming in with the arm, the batsman can only punch it back to the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "Shakib Al Hasan to Rayudu,1 run,looks to heave this to the leg side but realises this is not bouncing much, changes his shot to a push to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "jose: \"Difficult to say, whether MI is biding time or bidding bye from the race for a play-off spot.\""}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to Rayudu,1 run,he comes down the pitch and punches this back past the bowler, it was not very far from the right hand.. The ball stuck in the pitch and the batsman played it back in the air"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to Sharma,no run,some width this time but Rohit cuts it straight to point"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Sharma,1 run,pushes at it away from the body and picks up a single to point, and again it stops a touch on the surface"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Rayudu, $$FOUR$$ ,this is poor, lot of width provided and Rayudu crashes it in front of square off the back foot"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to Rayudu, $$OUT$$ ,the sagging run scoring takes its first victim! Rayudu comes down the pitch to force the pace, wanted to smash it over long-on but doesn't get hold of it - the ball has been stopping in the pitch all day. This one is safely taken at long-on"}, {"ball": 11.5, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$SA$$ $$Yadav$$ $$b$$ $$Chawla$$ $$33$$ $$(39m$$ $$27b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$122.22$$"}, {"ball": 11.5, "isHighlight": false, "text": "Anderson is the next man"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to Anderson,no run,spins in and stays very low, Anderson does well to get some bat on it.. It was shaping for an lbw"}, {"ball": 11.6, "isHighlight": false, "text": "Raghu Ifmr: \"With all the MI bashing going around, i actually feel that they are not in that bad position. The wicket is slow and keeping low.. Seems like even 140-150 is a competitive score and MI do have both Bhajji & Ojha and ofcourse Malinga.. Will depend on how Anderson and Pollard play Narine to get to that total though..\""}, {"ball": 11.6, "isHighlight": false, "text": "Morkel comes in to add some zing"}, {"ball": 12.1, "isHighlight": false, "text": "Morkel to Sharma,no run,length delivery outside off, the batsman looks to steer it to third man but gets beaten.. Rohit feels it stays low, it didn't"}, {"ball": 12.1, "isHighlight": false, "text": "A floating slip in place"}, {"ball": 12.2, "isHighlight": false, "text": "Morkel to Sharma,no run,length delivery on off, he comes forward and pushes this to cover. It's definitely not coming on to the bat, even at Morkel's pace"}, {"ball": 12.3, "isHighlight": false, "text": "Morkel to Sharma,1 run,No, Yusuf, No! He  $$drops$$  a sitter at wide long-on. He had all the time in the world to take a shower, brush his teeth then take the catch.. But he just allows it to slip through. Rohit got a huge edge as he looked to power this over midwicket. Chris Lynn must be aching"}, {"ball": 12.4, "isHighlight": false, "text": "Morkel to Anderson,no run,length delivery across the left-hander, Anderson leaves it alone"}, {"ball": 12.5, "isHighlight": false, "text": "Morkel to Anderson,1 run,no room from Morkel, the batsman dabs it towards cover and calls for a quick single"}, {"ball": 12.5, "isHighlight": false, "text": "Kunal: \"Can'r bat, can't bowl, now dropping catch!! What's the role of Pathan in the team?\""}, {"ball": 12.5, "isHighlight": false, "text": "Sandeep: \"I think they are thinking correctly. At this point, they do not want to crash and end up with a total of 100-120. Instead they think they should get 150-160 and defend it with their good bowling attack. CSK are at the top and can afford to attack from start.\""}, {"ball": 12.6, "isHighlight": false, "text": "Morkel to Sharma, $$FOUR$$ ,this is a good ball! Rohit gets another top edge and picks up a four. He has picked up a lot of boundaries like this one in this season. this was a quick short ball, Rohit goes for the hook, but gets an edge over the keeper"}, {"ball": 12.6, "isHighlight": false, "text": "rssampat: \"It's a good time to be a cricketer i guess. Even if you can't bat, can't bowl & can't field, even then you are paid million's and also get to play the game!!! Y.Pathan must be wondering what else he has to do to get dropped!!!\""}, {"ball": 12.6, "isHighlight": false, "text": "Sid: \"Earlier, I thought that KKR playing with 10 players always with no contribution from Yousuf. Batting was still acceptable with me considering he is not damaging the team. Now his bowling and fielding are creating negative impact. KKR think-tank should act now.\""}, {"ball": 12.6, "isHighlight": false, "text": "Chawla to bowl after the time-out"}, {"ball": 13.1, "isHighlight": false, "text": "Chawla to Anderson,2 runs,flatter delivery outside off, it's short enough for Anderson to rock back and punch towards wide long-off, the fielder from long-off does well to cut it off"}, {"ball": 13.2, "isHighlight": false, "text": "Chawla to Anderson,no run,slower this time, the batsman can only push it back to the bowler"}, {"ball": 13.3, "isHighlight": false, "text": "Chawla to Anderson, $$SIX$$ ,flighted delivery, it's sent to the moon! It was full enough for the batsman to get under, he whacks it a long way over the sight screen"}, {"ball": 13.4, "isHighlight": false, "text": "Chawla to Anderson, $$FOUR$$ ,flatter and shorter now, Anderson gets room and time to smash it along the ground through cover, beats the fielder running in from deep point"}, {"ball": 13.5, "isHighlight": false, "text": "Chawla to Anderson,1 run,another one punched to deep cover off the back foot, there is a fielder there now"}, {"ball": 13.6, "isHighlight": false, "text": "Chawla to Sharma, $$FOUR$$ ,short again from Chawla! he is serving a few treats here, Rohit is not going to miss out on those. He rocks back and crashes it through cover"}, {"ball": 13.6, "isHighlight": false, "text": "Narine comes back"}, {"ball": 14.1, "isHighlight": false, "text": "Narine to Anderson,1 run,bowls it flat and gets it to cut away from Anderson, the batsman goes back and works it away to the leg side"}, {"ball": 14.2, "isHighlight": false, "text": "Narine to Sharma,no run,that's the other one, not sure if Rohit read that well. he was shaping to cut it, but pulls the bat in at the last moment"}, {"ball": 14.3, "isHighlight": false, "text": "Narine to Sharma,1 run,plays a pre-meditated sweep to a flatter delivery, manages a single to square leg"}, {"ball": 14.4, "isHighlight": false, "text": "Narine to Anderson,3 runs,he uses the slog sweep without worrying about the spin on the ball, this was the conventional offspinner, it takes the underedge and rolls between the legs of the keeper, runs almost all the way down to the boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Narine to Sharma,1 run,he comes forward and dabs it to cover for a quick single"}, {"ball": 14.5, "isHighlight": false, "text": "Arvind: \"That over from Chawla highlights the problem Indian legspinners have had this IPL. Even if they are going through a good spell, they bowl one bad over which spoils their figures and turn the match on it's head\""}, {"ball": 14.6, "isHighlight": false, "text": "Narine to Anderson,no run,loud appeal for lbw as Anderson is hit on the back pad! It seems headed for the middle and leg stump, but looks like he was saved by where it pitched - Slightly outside leg in my opinion and also going over"}, {"ball": 14.6, "isHighlight": false, "text": "arun antony: \"you might be thinking Andesron looks clueless agaist Narine, trust me he narine was playing in that game were Anderson hit the fastest century.\""}, {"ball": 14.6, "isHighlight": false, "text": "Morkel comes in"}, {"ball": 15.1, "isHighlight": false, "text": "Morkel to Sharma,no run,bowls it full and on the middle and leg line, the batsman pushes it to midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Morkel to Sharma,2 runs,he looks to give himself some room but gets a yorker on his toes, manages to squeeze it to wide long-on to bring up the 100 of the team"}, {"ball": 15.3, "isHighlight": false, "text": "Morkel to Sharma, $$SIX$$ ,he brings out his fancy timing to the fore! Length delivery, this is clobbered over long-off easily"}, {"ball": 15.4, "isHighlight": false, "text": "Morkel to Sharma,1 wide,now looks to lap it over the keeper's head, but this one is called a wide as it was too far down leg"}, {"ball": 15.4, "isHighlight": false, "text": "Fine leg goes back"}, {"ball": 15.4, "isHighlight": false, "text": "Morkel to Sharma, $$SIX$$ ,another length ball, Rohit is announcing his presence now.. Plants his front foot out and launches the length delivery (146 kph) easily over extra cover"}, {"ball": 15.5, "isHighlight": false, "text": "Morkel to Sharma,1 run,moves about in the crease and gets a yorker, he gets a leading edge to cover for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Morkel to Anderson, $$OUT$$ ,this is a soft dismissal now! Just when you though Mumbai were making a charge, Anderson plays a tame chip shot straight to midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$Chawla$$ $$b$$ $$Morkel$$ $$18$$ $$(21m$$ $$12b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 15.6, "isHighlight": false, "text": "Kelvin: \"I think Corey Anderson had far too much hype around him to ever live up to expectations. He had 1 amazing knock, doesn't make him worth the price tag. I think in 3 or 4 years time once he's developed himself as a cricketer he will be worth that. But right now he is still very raw and got a lot to learn about his own game.\""}, {"ball": 15.6, "isHighlight": false, "text": "Four overs to go and Pollard comes in, but he will be at the non-striker's as Shakib comes in to bowl"}, {"ball": 16.1, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,he makes room and cuts the flatter delivery straight to point, can't find the gap"}, {"ball": 16.2, "isHighlight": false, "text": "Shakib Al Hasan to Pollard,no run,full and flighted delivery on off, pushed back to the bowler"}, {"ball": 16.3, "isHighlight": false, "text": "Shakib Al Hasan to Pollard,no run,he is no hurry, comes forward and defends the tossed up delivery"}, {"ball": 16.4, "isHighlight": false, "text": "Shakib Al Hasan to Pollard,2 runs,stays on the back foot to one that stays low, whips it to deep square leg for a couple"}, {"ball": 16.5, "isHighlight": false, "text": "Shakib Al Hasan to Pollard,1 run,works away the fuller delivery to deep midwicket for a single"}, {"ball": 16.6, "isHighlight": false, "text": "Shakib Al Hasan to Sharma, $$FOUR$$ ,moves about in the crease and manages to disturb Shakib. The bowler fires it flat outside off and Rohit cashes in by smashing it to the deep cover boundary off the back foot"}, {"ball": 16.6, "isHighlight": false, "text": "kamalnivas: \"@Kelvin: Very true.. 3 years? sound like the time Anderson would be sold to some other team by MI and he starts flourishing!!\""}, {"ball": 17.1, "isHighlight": false, "text": "Narine to Pollard,1 run,he takes it easy, pushes this flighted delivery to long on for a single"}, {"ball": 17.2, "isHighlight": false, "text": "Narine to Sharma,1 run,bowls a flat offspinner and it stays low, Rohit nudges it through midwicket for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Narine to Pollard,1 run,flatter and shorter outside off, Polly wanted to cut it fine but finds the man at short third man"}, {"ball": 17.4, "isHighlight": false, "text": "Narine to Sharma,2 runs,almost a medium pacer's delivery on off, Rohit nudges it to midwicket and calls for a quick couple"}, {"ball": 17.5, "isHighlight": false, "text": "Narine to Sharma,no run,he wanted a quick single to backward point but is rightly sent back in time"}, {"ball": 17.6, "isHighlight": false, "text": "Narine to Sharma,no run,beauty to finish the over! This was the other one and it beats the outside edge as Rohit attempts a cute little late cut"}, {"ball": 17.6, "isHighlight": false, "text": "Umesh comes back, Mumbai need a boost here."}, {"ball": 18.1, "isHighlight": false, "text": "UT Yadav to Pollard,1 run,he fires a low full toss on off, Pollard is still in no hurry, punches this straight to long off"}, {"ball": 18.1, "isHighlight": false, "text": "Brian Manlaws R: \"Kelvin I recall a SA batsmen by the name of Richard Levi who broke the world record for the fastest T20 100 against the Kiwis, now he battles to make the local Cobras team. One knock doesn't make a batsmen!\""}, {"ball": 18.2, "isHighlight": false, "text": "UT Yadav to Sharma,1 run,this is a good yorker! What's happening here? Rohit squeezes it out to point, comes out of the crease, then heads back.. Pollard also comes out of the crease and then heads back.. Gambhir sees the drama in the middle and fires a direct hit at the non-striker's .. Since Umesh was nowhere near, they pick up an extra off the ricochet"}, {"ball": 18.3, "isHighlight": false, "text": "UT Yadav to Pollard,1 run,another good delivery, not much room to get under this full delivery, Pollard hammers it down the ground to long on"}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Sharma, $$FOUR$$ ,this attempted yorker goes marginally wrong, but Rohit does well to slice this low full toss through cover point.. The deep fielders were all in front"}, {"ball": 18.4, "isHighlight": false, "text": "Badhri: \"@Brian Manlaws R : No marks for guessing which IPL team bought Richard Levi after that and have dumped him now. It is MI indeed.\""}, {"ball": 18.4, "isHighlight": false, "text": "Extra cover comes in, point goes back"}, {"ball": 18.5, "isHighlight": false, "text": "UT Yadav to Sharma,1 run,beautifully bowled, right at the base of off stump and he gets some inswing too, Rohit digs it out to third man"}, {"ball": 18.6, "isHighlight": false, "text": "UT Yadav to Pollard,1 run,gets away with this full toss as Pollard can only hit to deep midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to bowl the last one.. Can Mumbai make it to 150?"}, {"ball": 19.1, "isHighlight": false, "text": "Narine to Pollard,1 run,flatter delivery, he looks to hoick it to the leg side but looses his grip on the bat, gets an inside edge to short fine leg"}, {"ball": 19.2, "isHighlight": false, "text": "Narine to Sharma, $$OUT$$ ,Narine shows no emotion as he takes out Rohit! The batsman was looking to play the lap shot, he walked right across the stumps, but this zipped off the surface to crash to the top of off"}, {"ball": 19.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$b$$ $$Narine$$ $$51$$ $$(62m$$ $$45b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$113.33$$"}, {"ball": 19.2, "isHighlight": false, "text": "Tare  $$zameen$$ $$par$$ ..."}, {"ball": 19.3, "isHighlight": false, "text": "Narine to Tare,1 run,he stays on the back foot and cuts it behind point to get off the mark"}, {"ball": 19.4, "isHighlight": false, "text": "Narine to Pollard,1 run,quicker delivery, it squares up Pollard and he can only manage a single to cover"}, {"ball": 19.5, "isHighlight": false, "text": "Narine to Tare,no run,this is a good yorker! Tare wants to send it to the stars, but can only bury it near his toes"}, {"ball": 19.6, "isHighlight": false, "text": "Narine to Tare,1 run,slower this time, the batsman slaps it down to long-off, just for a single"}, {"ball": 19.6, "isHighlight": false, "text": "A contrasting match compared to the violent one earlier in the day. But this Cuttack pitch seems to be very different from the one that was used earlier in the tournament. The ball is staying low, it's sticking in too. Rohit Sharma's half-century might have given Mumbai a decent target to defend. Back in ten.."}, {"ball": 19.6, "isHighlight": false, "text": "Ravi: \"Mumbai have done well to recover and looking at this pitch 142 is going to be tough. This same KKR team failed to chase almost same score against CSK on similar pitch. Match on!! And on the talks of Anderson, people get selected on the potential in IPL (Not on age and experience) and if they dont fire then its not fault of selector....Tambe and Samson are perfect examples. \""}, {"ball": 19.6, "isHighlight": false, "text": "Sai Kiran: \"It is very important for KKR that Gambhir should play well today and continue his form. The pitch being slow and not bouncing much it is very important that Gambhir plays an important and responsible knock today since he is the only experienced batsman in their top order and no Kallis today as well. Mumbai has Malinga and Harbhajan, just to remember .\""}], "name": "Kolkata Knight Riders v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734009.html?innings=1;view=commentary", "match_num": 40}