{"commentary": [{"ball": 0, "isHighlight": false, "text": "We are all set for the chase. We are ready, the teams are ready, the umpires are ready, Gambhir and Uthappa are ready.. Harbhajan is ready at first slip, Malinga is ready with the ball"}, {"ball": 0.1, "isHighlight": false, "text": "Malinga to Uthappa,no run,fires in a yorker at the base of off, Uthappa pushes it to cover"}, {"ball": 0.2, "isHighlight": false, "text": "Malinga to Uthappa, $$FOUR$$ ,this is superbly timed through midwicket! Another attempted yorker and it marginally dropped short of the correct length.. Robin was waiting, he stays still and whips this through the gap"}, {"ball": 0.3, "isHighlight": false, "text": "Malinga to Uthappa,no run,length delivery outside off, beats the bat and stays low, reaches the keeper on the bounce"}, {"ball": 0.4, "isHighlight": false, "text": "Malinga to Uthappa,no run,another one wide outside off, it keeps going away from the bat and flies past the outside edge"}, {"ball": 0.5, "isHighlight": false, "text": "Malinga to Uthappa,1 run,another away-going length delivery, the batsman comes forward and guides it to third man"}, {"ball": 0.6, "isHighlight": false, "text": "Malinga to Gambhir,1 wide"}, {"ball": 0.6, "isHighlight": false, "text": "Malinga to Gambhir,1 run,superb yorker on the toes! The same ball hit Gambhir's leg stump as he fell over, but now he is back in form, a bit more self-assured, he stays upright and flicks it to fine leg"}, {"ball": 1.1, "isHighlight": false, "text": "Bumrah to Gambhir,1 leg bye,bowls length on the pads, it tickles fine on the leg side off the thigh pad"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to Uthappa,no run,back of length delivery on off, Uthappa gets on top of that and defends it to point"}, {"ball": 1.3, "isHighlight": false, "text": "Bumrah to Uthappa,1 run,big inswing from wide of the crease, hits the batsman high up on the bat as he looks to nudge it to the leg side, they steal a single to midwicket"}, {"ball": 1.4, "isHighlight": false, "text": "Bumrah to Gambhir,no run,back of length and on the stumps, Gambhir stays back and drops it down by his feet"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to Gambhir,no run,he moves to the leg side and looks to carve it over the infield, but this takes off from back of length and beats the bat"}, {"ball": 1.6, "isHighlight": false, "text": "Bumrah to Gambhir, $$FOUR$$ ,on the pads, not a good finish by Bumrah. Gambhir tickles it fine on the leg side and gets a boundary"}, {"ball": 1.6, "isHighlight": false, "text": "Bhajji comes in.."}, {"ball": 2.1, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,1 run,squares up the batsman with a flatter delivery, Robin gets an outside edge to short third man"}, {"ball": 2.1, "isHighlight": false, "text": "He goes round the wicket"}, {"ball": 2.2, "isHighlight": false, "text": "Harbhajan Singh to Gambhir,1 run,he waits on the back foot and guides the flatter delivery to short third man for a quick single, Ojha doesn't collect the ball cleanly"}, {"ball": 2.3, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,1 run,he looks to come out of the crease, Bhajji shortens his length and Robin responds by chopping it straight to short third-man.. Another misfield, now by Tare, it gives them a single"}, {"ball": 2.4, "isHighlight": false, "text": "Harbhajan Singh to Gambhir,no run,waits on the back foot and punches the flatter delivery straight to cover"}, {"ball": 2.5, "isHighlight": false, "text": "Harbhajan Singh to Gambhir,1 run,comes out of the crease and looks to play this tossed up delivery inside out, but gets an inside edge to mid on"}, {"ball": 2.6, "isHighlight": false, "text": "Harbhajan Singh to Uthappa, $$FOUR$$ ,now Robin uses his feet and although he is not to the pitch of the ball, he goes ahead with his chip shot, just manages to beat Malinga's leap at mid-off"}, {"ball": 3.1, "isHighlight": false, "text": "Bumrah to Gambhir,no run,the inside edge saves Gambhir there! The batsman was rooted to the crease and pushing at the length ball away from his body"}, {"ball": 3.2, "isHighlight": false, "text": "Bumrah to Gambhir,no run,now he is beaten by the pace and bounce on this short of length delivery! He wanted to cut it over point but makes no connection"}, {"ball": 3.3, "isHighlight": false, "text": "Bumrah to Gambhir,1 run,stays on the back foot and steers the length delivery down to third man"}, {"ball": 3.4, "isHighlight": false, "text": "Bumrah to Uthappa, $$FOUR$$ ,that has been cracked off the front foot! I heard the thud of the bat all the way in Mumbai! It was on a length and Robin comes to the front foot to smash it past the bowler"}, {"ball": 3.5, "isHighlight": false, "text": "Bumrah to Uthappa, $$FOUR$$ ,he keeps going straight! This is not that full but Robin comes forward and chips it back over the bowler's head"}, {"ball": 3.6, "isHighlight": false, "text": "Bumrah to Uthappa,1 run,he misses out as he flicks the low full toss straight to midwicket"}, {"ball": 3.6, "isHighlight": false, "text": "k\"Unique action aside, I really like the look of Bumrah. Pretty brisk, and bowls it at an awkward height and angle for the batsman. Was wondering if he bowls the one that swings away from the right hander as well? \" --- Kart, if he has that one, I haven't seen it yet"}, {"ball": 3.6, "isHighlight": false, "text": "Ojha now."}, {"ball": 4.1, "isHighlight": false, "text": "Ojha to Uthappa,no run,flatter delivery, the batsman has to change to defence after coming out of the crease.."}, {"ball": 4.2, "isHighlight": false, "text": "Ojha to Uthappa,no run,he waits on the back foot and chops the flatter delivery straight to point"}, {"ball": 4.3, "isHighlight": false, "text": "Ojha to Uthappa, $$SIX$$ ,this is clean hitting from Robin! He gets the fuller length delivery and again, he comes forward to play a clean straight drive, sending it all the way over long on"}, {"ball": 4.4, "isHighlight": false, "text": "Ojha to Uthappa,no run,quicker one outside off, he cuts it straight to point"}, {"ball": 4.5, "isHighlight": false, "text": "Ojha to Uthappa,1 run,comes forward and dabs the length delivery to cover for a quick single"}, {"ball": 4.6, "isHighlight": false, "text": "Ojha to Gambhir,2 runs,he bends down on his knee early and sweeps this one comfortably to deep square leg for a couple"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga comes back"}, {"ball": 5.1, "isHighlight": false, "text": "Malinga to Uthappa,no run,bowls length on off, this swings a touch away too. Robin gets squared up in his defence"}, {"ball": 5.2, "isHighlight": false, "text": "Malinga to Uthappa,1 wide,attempts the slower one, but this one slips down the leg side"}, {"ball": 5.2, "isHighlight": false, "text": "Malinga to Uthappa,no run,length delivery outside off, the batsman dabs it to point. Gambhir wants a single, but is rightly sent back"}, {"ball": 5.3, "isHighlight": false, "text": "Malinga to Uthappa,no run,superb outswinger! How does he get this much movement? It pitches on a length on off, then completely squares up Robin, beating the outside edge by a long way"}, {"ball": 5.4, "isHighlight": false, "text": "Malinga to Uthappa,no run,and again, this movement is troubling Robin. He wanted to dab this to the leg side but gets a leading edge to cover"}, {"ball": 5.5, "isHighlight": false, "text": "Malinga to Uthappa, $$FOUR$$ ,now he gets an outside edge, but this is a cruel world if you are bowler.. There is no slip in place and the third-man is square..Not that Ojha would have stopped it ... Robin lets Malinga know that he is struggling by tapping his shoulder"}, {"ball": 5.6, "isHighlight": false, "text": "Malinga to Uthappa,no run,another of those outswingers, the batsman defends it to cover point"}, {"ball": 5.6, "isHighlight": false, "text": "Nitin Chaudhary: \"Mumbai always underutilized their resources except Malinga. I think this has more to do with not showing enough faith in a player, Ojha is best example. he was best spinner when he played for DC and the day he joind MI he is not performing even 50% of what is used to do with DC.\""}, {"ball": 5.6, "isHighlight": false, "text": "Ojha to continue after the mini-break"}, {"ball": 6.1, "isHighlight": false, "text": "Ojha to Gambhir,1 run,he skips out of the crease and whips the turning delivery to square leg.. Malinga makes a half-stop but can't prevent the single"}, {"ball": 6.2, "isHighlight": false, "text": "Ojha to Uthappa,1 run,slower and tossed up outside off, Robin dabs it to short third man for a quick single"}, {"ball": 6.3, "isHighlight": false, "text": "Ojha to Gambhir,2 runs,lots of air on this one, Gambhir comes out of the crease but as the ball spins in, he gets an inside edge down to fine leg"}, {"ball": 6.4, "isHighlight": false, "text": "Ojha to Gambhir,no run,shorter and flatter outside off, Gambhir misses out as he chops this straight to short third man"}, {"ball": 6.5, "isHighlight": false, "text": "Ojha to Gambhir,1 run,and again! He cuts it straight to short third man, Robin scoots for a quick one this time, brings the 50 of the stand"}, {"ball": 6.6, "isHighlight": false, "text": "Ojha to Uthappa,no run,he goes back and punches this flatter delivery straight to cover"}, {"ball": 6.6, "isHighlight": false, "text": "Avinash: \"Completely agree with Niteen. Look at Maxwell, Smith, Hussey and for that matter Jayasuriya, Ponting, etc. I think there is a basic issue of environment within the team set up. People are not able or not allowed to express themselves. Or probably presence of some serious stalwarts in the dugout makes them think small of themselves.\" ---- Somehow they managed to win the IPL and the Champions League last season.."}, {"ball": 6.6, "isHighlight": false, "text": "Bhajji comes back, over the wicket"}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Gambhir,no run,gets big turn and the batsman lets it go as it's wide"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Gambhir, $$OUT$$ ,he chops it on! Gambhir has been looking to play that short for a while, he goes back to play it again, expecting the ball to turn away, but this one doesn't...he gets a thick inside edge and shatters his stumps"}, {"ball": 7.2, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$14$$ $$(35m$$ $$18b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$77.77$$"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 wide,big spin greets Pandey, but it spins too far down the leg side. Oh, they are checking for the stumping.. Pandey never lifted his foot. A bit unnecessary"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,flatter and quicker outside off, the batsman defends it off the back foot"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,lots of flight on this one, Pandey comes forward and drives it down to long off"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,1 run,he goes down on his knee and paddles the ball from outside off down to deep backward square leg, it was in the air for a while"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,spins in from outside off to hit the pads, but this was turning down leg"}, {"ball": 7.6, "isHighlight": false, "text": "Ojha continues"}, {"ball": 8.1, "isHighlight": false, "text": "Ojha to Uthappa,1 run,loopy delivery outside off, he punches it down to long off for an easy single"}, {"ball": 8.1, "isHighlight": false, "text": "Ashwin: \"KKR have missed a trick here by not sending Shakib in. He is more experienced in handling these tough conditions and a left hand-right hand combination will have troubled Mumbai too.\""}, {"ball": 8.1, "isHighlight": false, "text": "A slip comes in.."}, {"ball": 8.2, "isHighlight": false, "text": "Ojha to Pandey,1 run,teasing flighted delivery, Pandey pushes it to long off"}, {"ball": 8.3, "isHighlight": false, "text": "Ojha to Uthappa,1 run,tosses it up outside off, the batsman reaches out and drives it to deep cover"}, {"ball": 8.4, "isHighlight": false, "text": "Ojha to Pandey,no run,solidly comes forward and defends it back to the bowler"}, {"ball": 8.5, "isHighlight": false, "text": "Ojha to Pandey,1 run,comes down the pitch and pushes the flatter delivery to long-on, it was in the air as it crossed the non-striker"}, {"ball": 8.6, "isHighlight": false, "text": "Ojha to Uthappa, $$FOUR$$ ,he finds the boundary by making some room and cutting it behind point"}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,slower and heading to the off stump, Pandey goes back and nudges it behind square leg for a single"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to Uthappa, $$FOUR$$ ,this almost went into the hands of short third-man! Bhajji is not impressed with Bumrah, who dives forward but doesn't get his body behind the ball. Uthappa played a sweep to the leg-sidish delivery"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,1 run,he comes forward and drives it to long off"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,did that hit something? Looks like it, probably flicked the pad on its way to the keeper"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Pandey,no run,attempts the doosra, Pandey can't get it away, defends it back down the pitch"}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to Pandey,1 run,slower and tossed up on off, Pandey pushes it easily to long on"}, {"ball": 9.6, "isHighlight": false, "text": "Simmons comes in to bowl"}, {"ball": 10.1, "isHighlight": false, "text": "Simmons to Pandey,2 runs,short of length delivery that gets stuck in the pitch, Pandey chips it to deep midwicket. He wasn't in control of that shot"}, {"ball": 10.1, "isHighlight": false, "text": "Rama: \"Really impressed with Bhajji this year. He has improved his lines and the pace variation this year. On the other hand Ashwin's bowling has deteriorated with him bowling mainly on leg stump line getting some lucky wickets on sweep etc.\""}, {"ball": 10.2, "isHighlight": false, "text": "Simmons to Pandey,1 run,comes slow of the surface again, tis time Pandey punches it to deep cover"}, {"ball": 10.2, "isHighlight": false, "text": "Manoj: \"@ashwini...i agree with you but pandey cannot adjust to batting order so quickly we have seen him the past failing when his batting order is changed...kkr want to use shakib as a finisher rather than specialist batsmen..!! \""}, {"ball": 10.3, "isHighlight": false, "text": "Simmons to Uthappa, $$FOUR$$ ,that stays very very low! He brings his bat down just in time and manages to get an outside edge for a boundary..Mumbai lost a wicket to that kind of ball.. Simmons it was"}, {"ball": 10.4, "isHighlight": false, "text": "Simmons to Uthappa,1 run,length delivery outside off, Uthappa brings up yet another fifty as he punches it to deep cover"}, {"ball": 10.4, "isHighlight": false, "text": "Pushkar: \"Uthappa is now the top scorer in this year's IPL among indians and 3rd overall. This combined with his performance in the 3 domestic tournaments that he helped his state win, he should surely be in the Indian team. Atleast to the Bangladesh series\""}, {"ball": 10.5, "isHighlight": false, "text": "Simmons to Pandey,1 run,looks for the yorker, easily flicked away to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Simmons to Uthappa,1 run,another single, this time he pushes it to cover point for a single"}, {"ball": 10.6, "isHighlight": false, "text": "James: \"If you are a Mumbai fan you gotta like KKR not sending in Shakib. Expect a massive collapse. Also if you are just a cricket fan then you might like this too. Shakib comes in at the end to make it interesting ... may be even make super over out of KKR's mess. \""}, {"ball": 10.6, "isHighlight": false, "text": "More lack of pace, Pollard comes in"}, {"ball": 11.1, "isHighlight": false, "text": "Pollard to Uthappa,no run,starts off with a length delivery outside off, the batsman lets it go through"}, {"ball": 11.2, "isHighlight": false, "text": "Pollard to Uthappa,1 run,back of length delivery on the stumps, Robin drops it by the stumps and calls for a single early"}, {"ball": 11.3, "isHighlight": false, "text": "Pollard to Pandey,2 runs,short of length, sits up nicely outside off and Pandey hammers it to deep midwicket for a couple"}, {"ball": 11.4, "isHighlight": false, "text": "Pollard to Pandey,1 run,another short of length delivery on the pads, Pandey drags it to deep midwicket again"}, {"ball": 11.5, "isHighlight": false, "text": "Pollard to Uthappa,2 runs,slower length delivery on the stumps, Uthappa dabs it softly to deep midwicket and calls for a couple"}, {"ball": 11.6, "isHighlight": false, "text": "Pollard to Uthappa,1 run,length delivery on the stumps, Robin keeps stealing singles, this time with a dab towards point"}, {"ball": 12.1, "isHighlight": false, "text": "Ojha to Uthappa,no run,looks to chop it through point, but can't beat Simmons there"}, {"ball": 12.2, "isHighlight": false, "text": "Ojha to Uthappa,2 runs,waits in the back foot and crashes it off the back foot, but Pollard cuts it off at wide long off"}, {"ball": 12.3, "isHighlight": false, "text": "Ojha to Uthappa,1 run,almost gets beaten by the quicker one but manages to push it to long off for a single"}, {"ball": 12.4, "isHighlight": false, "text": "Ojha to Pandey,no run,he comes out of the crease and punches the flatter delivery to cover"}, {"ball": 12.5, "isHighlight": false, "text": "Ojha to Pandey,no run,slower from Ojha, the batsman pushes it to cover again"}, {"ball": 12.6, "isHighlight": false, "text": "Ojha to Pandey,no run,looks to find that tiny gap at backward point, but unfortunately he can't"}, {"ball": 12.6, "isHighlight": false, "text": "KKR in complete control and Uthappa is making me hungry.. Is Cook playing somewhere today?"}, {"ball": 12.6, "isHighlight": false, "text": "Bumrah is back"}, {"ball": 13.1, "isHighlight": false, "text": "Bumrah to Uthappa,no run,he looks to punch the length delivery on the up, but gets an inside edge to midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Bumrah to Uthappa, $$FOUR$$ ,poor delivery, it's a low full toss outside off and Uthappa has seen enough balls today, he slices it past point"}, {"ball": 13.3, "isHighlight": false, "text": "Bumrah to Uthappa,1 run,back of length delivery, this is dabbed behind point for another easy single. It's all too easy, life is easy"}, {"ball": 13.4, "isHighlight": false, "text": "Bumrah to Pandey,1 run,short ball outside off, it comes off the pitch like this is Roland Garros, Manish Pandey plays a over the shoulder top spin shot down the ground for a single"}, {"ball": 13.5, "isHighlight": false, "text": "Bumrah to Uthappa,1 run,he is driving on the highway, steers the length delivery down to third man"}, {"ball": 13.6, "isHighlight": false, "text": "Bumrah to Pandey,1 run,slower delivery outside off, Pandey stretches out and pushes it to wide mid-off for a single"}, {"ball": 13.6, "isHighlight": false, "text": "Sam: \"You need to find BUTCHER before you find COOK\" --- We have Butcher in the Huddle today.. hope he can help"}, {"ball": 13.6, "isHighlight": false, "text": "Danish Patel`: \"where's the bad bounce????? just the one so far and that too edged for 4! \""}, {"ball": 14.1, "isHighlight": false, "text": "Harbhajan Singh to Pandey, $$OUT$$ ,another inside edge, another wicket! That's what Mumbai need - a few that stay low. This one was bowled at a snail's pace, Pandey goes on the back foot to cut, but this one just doesn't rise.. He chops it on to his leg stump"}, {"ball": 14.1, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$14$$ $$(26m$$ $$21b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 14.1, "isHighlight": false, "text": "Here's the man himself, Playing is 100th match.. It's Yuuuuusuuuf Pathaaaan. Ah WWF!!"}, {"ball": 14.2, "isHighlight": false, "text": "Harbhajan Singh to Pathan,no run,bowls a slower one outside off, the batsman defends it to the off"}, {"ball": 14.2, "isHighlight": false, "text": "amit: \"(Allan) LAMB with (graeme) ONIONS followed by some derek (PRINGLEs). Tasty!\""}, {"ball": 14.3, "isHighlight": false, "text": "Harbhajan Singh to Pathan,no run,loopy delivery on off, the batsman dabs it to cover and wants to run to the other end, but sent back"}, {"ball": 14.4, "isHighlight": false, "text": "Harbhajan Singh to Pathan,1 run,quicker delivery this time and it was very low too.. Had he missed, he was going to be plumb.. But he manages to get some bat and hits it to square leg for his opening run"}, {"ball": 14.5, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,2 runs,reverse sweep! He does play this well, goes almost outside off and drags it from leg stump for a couple"}, {"ball": 14.6, "isHighlight": false, "text": "Harbhajan Singh to Uthappa,1 run,slower and tossed up, Uthappa punches this down to long on"}, {"ball": 15.1, "isHighlight": false, "text": "Simmons to Uthappa, $$SIX$$ ,slower delivery, this is beautifully punched over wide long-off! He doesn't try to do fancy things, always just plays these drives with the straightest of bats.. Supreme hit"}, {"ball": 15.2, "isHighlight": false, "text": "Simmons to Uthappa, $$SIX$$ ,oh this is even prettier! This is not as full as the last one, but just a straight-batted drive over extra cover.. It's flat, it's long, it's over the boundary"}, {"ball": 15.2, "isHighlight": false, "text": "Arnie: \"(Matt) Prior to that, I would like to know the (Ray) Price of the whole food package please... \" ---- It comes free as you don't get to taste as it's imaginary"}, {"ball": 15.3, "isHighlight": false, "text": "Simmons to Uthappa,1 run,on the pads, the batsman pushes it to midwicket softly for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Karthik Perumal: \"Some (Micheal) Beer to top it off!\""}, {"ball": 15.4, "isHighlight": false, "text": "Simmons to Pathan,2 runs,this is on the pads and he tucks it to deep midwicket easily"}, {"ball": 15.4, "isHighlight": false, "text": "Anubhav: \"Excellent thinking from Robin Uthappa to attack Simmons. 3 out of remaining 5 overs are to be bowled by regular bowlers. Best way to be on a safe boat is to target other two bowlers.\""}, {"ball": 15.5, "isHighlight": false, "text": "Simmons to Pathan,1 run,length delivery outside off, Yusuf smashes it - or at least that was the intention - as this trickles to deep point"}, {"ball": 15.6, "isHighlight": false, "text": "Simmons to Uthappa, $$OUT$$ ,middle stump takes a beating! Uthappa was staying still while playing those smooth drives, but this time he moves to the leg side to make room and just plainly misses this one.."}, {"ball": 15.6, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$b$$ $$Simmons$$ $$80$$ $$(71m$$ $$52b$$ $$9x4$$ $$3x6)$$ $$SR:$$ $$153.84$$"}, {"ball": 15.6, "isHighlight": false, "text": "How far are we? Ok, 26 off 24.. There is one team that can mess it up.. It's in Bangalore.. KKR have the talent too..Shakib comes in."}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Pathan,1 wide,Gautam is enthusiastic behind the wicket and appeals for a caught behind, but this was a wide down the leg side.. Yusuf gives him a stare"}, {"ball": 16.1, "isHighlight": false, "text": "Malinga to Pathan, $$FOUR$$ ,this is down the leg side and Yusuf manages to tickle it past the diving wicketkeeper"}, {"ball": 16.2, "isHighlight": false, "text": "Malinga to Pathan,1 run,short ball, but this comes at an easy pace, Yusuf plays an upper cut to third man"}, {"ball": 16.2, "isHighlight": false, "text": "Kunal: \"i dont think having some (clive)RICE would do any harm , especially if served along with some (phil)MUSTARD!\""}, {"ball": 16.3, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,no run,short ball, the batsman looks to pull, then pulls out of line, looks to the umpire to see if this is a wide, but this flew over the leg stump"}, {"ball": 16.4, "isHighlight": false, "text": "Malinga to Shakib Al Hasan, $$FOUR$$ ,short ball again, this time it is outside off and Shakib cuts it over point easily to pick up another boundary"}, {"ball": 16.4, "isHighlight": false, "text": "Adithya: \"Can I have extra (Phil) Mustard on my (Sarel) Burger?\""}, {"ball": 16.5, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,1 run,finally the yorker makes an appearance, Shakib flicks it behind square easily"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga to Pathan,1 run,that's a  $$drop$$ ! Yusuf powers the low full toss back to Malinga who was a little slow to react to it as it came towards his face.. it actually ricochets towards cover, the fielder was not too far"}, {"ball": 16.6, "isHighlight": false, "text": "Krithikou: \"One more of these puns, and I'll Boycott cricinfo from now on...\""}, {"ball": 17.1, "isHighlight": false, "text": "Simmons to Pathan, $$FOUR$$ ,shorter and on the pads, Yusuf picks up the boundary as he drags it behind square on the leg side. Tare dives, but can't keep it in"}, {"ball": 17.2, "isHighlight": false, "text": "Simmons to Pathan,1 run,length delivery, he punches it on the up to long off for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Simmons to Shakib Al Hasan,1 run,fuller delivery, Shakib powers it down to long off for another single"}, {"ball": 17.4, "isHighlight": false, "text": "Simmons to Pathan,1 run,waits an extra bit and punches it in the air past the non-striker for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Simmons to Shakib Al Hasan,1 run,he looks for the big one, but can only get it as far as mid-on as this hits the toe of the bat"}, {"ball": 17.6, "isHighlight": false, "text": "Simmons to Pathan,no run,slides down the leg side but not given a wide. Yusuf is again not impressed"}, {"ball": 18.1, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,2 runs,fires it full on the toes, but Shakib gets his feet out of the way and flicks it to deep midwicket for a couple"}, {"ball": 18.2, "isHighlight": false, "text": "Malinga to Shakib Al Hasan,no run,slower delivery outside off, Shakib wanted to crash it over extra cover but is beaten"}, {"ball": 18.3, "isHighlight": false, "text": "Malinga to Shakib Al Hasan, $$OUT$$ ,another slower delivery and Shakib lifts it straight up in the air, easy catch by Rayudu who comes running in from long-on. He was looking for the big finish (he has done that in the past, against Nepal recently), but  is outfoxed by Malinga this time"}, {"ball": 18.3, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$c$$ $$Rayudu$$ $$b$$ $$Malinga$$ $$9$$ $$(13m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 18.4, "isHighlight": false, "text": "Malinga to Pathan, $$FOUR$$ ,Yusuf Pathan hits the winning runs to celebrate his 100th match. Short ball, pulled hard."}, {"ball": 18.4, "isHighlight": false, "text": "KKR break away from the cluster of teams with eight points. It was not the most attractive chase, but on a surface that was slow, they needed to grind it out. They got another strong start from their openers and then Robin Uthappa took it deep with yet another half-century. Mumbai Indians looked lacklustre without the runs on the board and their campaign has almost come to a close. Thanks for the comments and feedback. Till tomorrow, ciao ciao."}, {"ball": 18.4, "isHighlight": false, "text": "\"This shows the character of the team, the guys were really pumped up to get the campaign back on track,\"  $$Gambhir$$  says. \"Winning the toss, the bowlers did great to restrict the team to 140. He [Narine] is a mystery bowler and we are lucky to have a bowler like that in our team. \""}, {"ball": 18.4, "isHighlight": false, "text": "\"Yesterday I got hit by Cummins on my toe, so i would like to thank my staff for getting me back to play today,\" says  $$Robin$$ $$Uthappa$$ .  \"I have been working hard, i have been improving my skill too. I am trying to play in the V, i am playing with the correct technique too. It's a result of spending a lot of hours practicing.\""}, {"ball": 18.4, "isHighlight": false, "text": "\"The wicket was doing a little bit, it was not an easy pitch to bat,\"  $$Rohit$$ $$Sharma$$  says. \"But we were 20 runs short, it was not easy to defend 140 on this ground. You have to consistently keep scoring 170+ to win games. We have been bowling well, but we haven't been consistent in our bowling. We have Josh Hazlewood, Marchant de Lange, Krishmar Santokie (as replacements for Malinga)\""}, {"ball": 18.4, "isHighlight": false, "text": "\"It looks easy from outside but only the one in the middle knows how difficult it is in the middle,\" says  $$Yusuf$$ $$Pathan$$ . \"Our bowlers bowled very well, then we started really well. Robin's form is a good sign for our team - he is playng well, he is playing long. Our bench strength is also strong, that helps us to choose the right players for the right conditions. \""}, {"ball": 18.4, "isHighlight": false, "text": "Srinivas Goud: \"Thats luck favoring the hard work. KKR wins with their hardwork & their key competitor SRH goes down on the sameday! \""}, {"ball": 18.4, "isHighlight": false, "text": "Dev: \"Funnily enough, of the 4 games left to play, KKR and SRH (the 2 contenders for the 4th slot) play each other twice. Those will be the eliminators for the eliminator. Lots can change.\""}, {"ball": 18.4, "isHighlight": false, "text": "Farhan Siddique: \"Overall its a day for Wicket Keepers Naman Ojha, Saha and Uthappa.\""}], "name": "Kolkata Knight Riders v Mumbai Indians", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734009.html?innings=2;view=commentary", "match_num": 40}