{"commentary": [{"ball": 0, "isHighlight": false, "text": "Alright, we are ready for the start. Everyone is here, everyone's ready.. Daredevils are going to start with spin. JP to start. Rahane on strike. Jadhav at first slip."}, {"ball": 0, "isHighlight": false, "text": "$$8.00$$ $$pm$$  So just a baby delay here. The match will start in 15 minutes from now."}, {"ball": 0, "isHighlight": false, "text": "\"Is nobody surprised that last match's star performer, Ankit Sharma, has been dropped?\" ----- Yes Kumail, many comments have expressed their disappointment on the youngster missing out."}, {"ball": 0, "isHighlight": false, "text": "Omprakash Khoja: \"I don't think he was a star performer (Ankit) ...he got 2 wickets on 2 bad balls and in batting he was just ok (beaten on 60% of balls he faced)....So i m not surprised!\" ----- Point taken. On another note Omprakash, were you any good at I-spy?"}, {"ball": 0, "isHighlight": false, "text": "Nick Sharland: \"Kevin Pietersen has been Delhi's biggest liability. I can't help feeling that Ross Taylor had more of a chance of making an impact this year than the distracted and hyped ex-England star.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.50$$ $$pm$$  The drizzle has stopped and the covers should be off soon."}, {"ball": 0, "isHighlight": false, "text": "\"Why on earth is Shami not playing? He has the ability to swing the ball both ways and can be lethal in these windy conditions. This is precisely why DD are at the bottom of the pile...\" --- Danish, despite his talent, Shami, to be honest, has been expensive. No harm in trying out other combinations now that the campaign is over.."}, {"ball": 0, "isHighlight": false, "text": "Vinay: \"Bhuvneshwar and Shami both went for 4.25 cr in the auction if I'm not mistaken. Their seasons have been totally contrasting. Bhuvi holds the purple cap while Shami has been one of the worst bowlers this season to be bluntly honest. \""}, {"ball": 0, "isHighlight": false, "text": "$$7.45$$ $$pm$$  We saw that there was a strong breeze during the toss. Now we hear that  $$the$$ $$covers$$ $$are$$ $$on$$ ."}, {"ball": 0, "isHighlight": false, "text": "Raul: \"I am just a couple of kms away from the stadium, its all clear here and the game should start soon. The same thing happened yesterday as well but there was no rain. We are getting all 40 overs in.\""}, {"ball": 0, "isHighlight": false, "text": "Rajagopalan: \"Do you verify the IP addresses when people claim they live near the stadium, especially during the rains? Just saying :)\" --- No Rajagopalan, but I just trust anyone with a cool name."}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$  Surprise Surprise, $$Steven$$ $$Smith$$  has come out for toss as the captain of Royals.. Watson is sitting out with a niggle. \"Reaslistically, we are out of the competition,\" says KP. \"Hopefully we can cause some upsets. We need to enjoy the next 10 days.\""}, {"ball": 0, "isHighlight": false, "text": "$$Delhi$$ $$Daredevils$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$will$$ $$bowl$$ . Three changes in both teams - Delhi bring in Manoj Tiwary, Ross Taylor and Nadeem; Rajasthan bring in Samson, Dhawal Kulkarni and Ben Cutting. Keep an eye on the squads above to know who have been replaced."}, {"ball": 0, "isHighlight": false, "text": "KP thinks his batting is in good nick and would like his bowlers to bowl without the pressure of defending a total. Smith would have batted first anyway as he thinks the pitch might slow down later."}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  A two-day break from cricket follows, but before that, we have Rajasthan Royals and Delhi Daredevils squaring up against each other in a game that has more importance for Royals than Daredevils from the point of view of the table standings. However, Daredevils are in a position to rock others' boats now. While we wait for toss, here are a couple of good reads - first, the exploration into astrophysics of the game, \" $$the$$ $$time$$ $$and$$ $$space$$ $$of$$ $$T20$$ $$cricket$$ ,\" and second, this one  $$on$$ $$not$$ $$throwing$$ $$your$$ $$catalyst$$  into a wanted reaction."}, {"ball": 0, "isHighlight": false, "text": "Karthi The Rock: \"Exciting to see the playing 11s for RR. Hopefully Ankit sharma grabbed his place for this match atleast... Will they bring back Samson or continue with Yagnik? Whatever, Rahane should open the innings... RR just cant drop him down the order...\""}, {"ball": 0, "isHighlight": false, "text": "How many sixes has KP hit in IPL 2014? How many wickets has James Faulkner taken this year? If you have all the answers, well, we have all the questions on  $$CricIQ$$ . INR 10,000 to be won every single day, and tickets to London to watch India v England at Lord's up for grabs.  $$Play$$ $$now.$$"}, {"ball": 0, "isHighlight": false, "text": "Are KP and Faulkner in your  $$Fantasy$$ $$XI$$ ? Is Watson your captain? Big prizes to be won, even if you are starting your Fantasy journey today."}, {"ball": 0.1, "isHighlight": false, "text": "Duminy to Rahane,no run,he comes round the wicket and pushes it through on off, the batsman looks to punch it to off but chops it close to the stumps"}, {"ball": 0.2, "isHighlight": false, "text": "Duminy to Rahane, $$FOUR$$ ,he gets some room and he takes full toll, cracking it off the back foot and finding the gap at point"}, {"ball": 0.3, "isHighlight": false, "text": "Duminy to Rahane,1 run,lots of air on this one, the batsman whips it to deep midwicket for a single"}, {"ball": 0.4, "isHighlight": false, "text": "Duminy to Nair,1 run,another loopy delivery on the stumps, again clipped to deep midwicket for a single"}, {"ball": 0.5, "isHighlight": false, "text": "Duminy to Rahane,no run,not too full this time, Rahane comes forward and defends"}, {"ball": 0.6, "isHighlight": false, "text": "Duminy to Rahane,1 run,more flight and it's on the leg stump, Rahane picks up another single to deep midwicket"}, {"ball": 0.6, "isHighlight": false, "text": "Rahul Shukla starts from the other end"}, {"ball": 1.1, "isHighlight": false, "text": "Shukla to Rahane,4 leg byes,not a good start, this is heading down the leg side, clips the pads and runs down to the boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Shukla to Rahane, $$FOUR$$ ,this is superbly timed through midwicket! Rahane allows this to come in, then clips it in the air easily with the turn of wrists.. it races away"}, {"ball": 1.3, "isHighlight": false, "text": "Shukla to Rahane,no run,corrects his line and bowls this wide outside off, gets some away movement. Rahane lets it go through"}, {"ball": 1.4, "isHighlight": false, "text": "Shukla to Rahane,no run,he comes forward and defends the length delivery to cover point"}, {"ball": 1.5, "isHighlight": false, "text": "Shukla to Rahane,no run,he stands tall and punches the back of length ball straight to cover"}, {"ball": 1.5, "isHighlight": false, "text": "Krithikou: \"I think Delhi took \"send JP in early\" a touch too seriously!\""}, {"ball": 1.6, "isHighlight": false, "text": "Shukla to Rahane, $$FOUR$$ ,beautifully driven! It's a half-volley on off but Rahane gently comes forward, leans on it and caresses it through extra cover"}, {"ball": 1.6, "isHighlight": false, "text": "Muqeet Ahmed: \"Teams kits are very much similar, lets bring home and away kit like football leagues. I am sure it will become another exciting aspects in IPL, not forget it will also help revenue for teams and tournament.\" ---- I second you on that Muqeet. Hope they spent as much money as they spend on other things on some actual kit designers"}, {"ball": 1.6, "isHighlight": false, "text": "JP experiment ends..Now it's Sid Kaul"}, {"ball": 2.1, "isHighlight": false, "text": "Kaul to Nair,no run,he leaps and bowls a length delivery on off, the batsman clips it straight to midwicket"}, {"ball": 2.2, "isHighlight": false, "text": "Kaul to Nair,no run,length delivery outside off, not much bounce on this pitch as the keeper takes it below his knees after the batsman lets it through"}, {"ball": 2.3, "isHighlight": false, "text": "Kaul to Nair,no run,loose forward prod from Karun, he plays outside the line to this incoming delivery and inside edges it to his back pad"}, {"ball": 2.4, "isHighlight": false, "text": "Kaul to Nair,no run,he goes wide of the crease and bowls it short of length, the batsman punches it straight to point"}, {"ball": 2.5, "isHighlight": false, "text": "Kaul to Nair,1 run,crisply timed through point! He comes forward and pushes away from the body, but gets it off the middle of the bat"}, {"ball": 2.6, "isHighlight": false, "text": "Kaul to Rahane,no run,good delivery in the channel, some away movement too. Rahane comes forward and lets it go through"}, {"ball": 2.6, "isHighlight": false, "text": "Shukla continues.. Slip moves to gully"}, {"ball": 3.1, "isHighlight": false, "text": "Shukla to Nair,1 run,back of length delivery on the stumps, Nair pushes it softly towards mid-on and calls for a quick one"}, {"ball": 3.2, "isHighlight": false, "text": "Shukla to Rahane,1 run,he stays back and clips the back of length delivery to deep midwicket off his hips"}, {"ball": 3.3, "isHighlight": false, "text": "Shukla to Nair,1 run,short and wide, he would think that he missed out, chops this one straight to third-man"}, {"ball": 3.4, "isHighlight": false, "text": "Shukla to Rahane, $$FOUR$$ ,big outside edge and the keeper and the gully fielder look at each other, perfectly bisected, like using those compasses in school geometry.."}, {"ball": 3.5, "isHighlight": false, "text": "Shukla to Rahane,no run,back of length delivery on off, comes a touch slow off the pitch, punched to Tiwary at cover"}, {"ball": 3.5, "isHighlight": false, "text": "sree: \"For all the kit and merchandise hype. It is surprisingly difficult to get official IPL team merchandise online. Most of the teams have bad web sites, with stuff mostly out of stock! (Even here CSK's was the best and most organized site). Considering they charge Rs.600 for a Rs.200 T-Shirt, you would think they would be more interested in selling this stuff.\" ---- Some shirts sell for more than 2K"}, {"ball": 3.6, "isHighlight": false, "text": "Shukla to Rahane,no run,waits on the back foot and whips the back of length delivery to midwicket"}, {"ball": 3.6, "isHighlight": false, "text": "Sid Kaul to bowl his second"}, {"ball": 4.1, "isHighlight": false, "text": "Kaul to Nair,2 runs,this is just like Uthappa! He plants his front foot out and plays a smooth drive over the mid-off fielder with a very straight bat, picks up a couple as this wasn't timed as well as Uthappa"}, {"ball": 4.2, "isHighlight": false, "text": "Kaul to Nair, $$SIX$$ ,this one is 100% Uthappa, in timing, in distance. It's a length ball and he picks it up beautifully over extra cover"}, {"ball": 4.3, "isHighlight": false, "text": "Kaul to Nair,2 runs,now he clips it past the midwicket fielder easily for a quick couple"}, {"ball": 4.4, "isHighlight": false, "text": "Kaul to Nair,1 run,back of length delivery, he waits and runs it down to third man"}, {"ball": 4.5, "isHighlight": false, "text": "Kaul to Rahane,1 run,he stays in the crease and dabs the back of length delivery towards midwicket for a quick single"}, {"ball": 4.6, "isHighlight": false, "text": "Kaul to Nair, $$FOUR$$ ,another inside out drive! Karun is looking good here. This was fuller and slightly slower from Kaul and the batsman blasts it over extra cover. He doesn't get the distance but he would be happy with the result. Yes 6 is better than 4, but still a good result"}, {"ball": 4.6, "isHighlight": false, "text": "Nadeem comes in"}, {"ball": 5.1, "isHighlight": false, "text": "Nadeem to Rahane,no run,pushed through on the pads, the batsman defends it to the leg side"}, {"ball": 5.1, "isHighlight": false, "text": "vinayak: \"Doesn't IPL committee have any say in team's Kit. It is currently dominated by shades of blue/ red. Also, almost every team has gold/silver color coated numbers & kits. More importantly top run getter is supposed to wear a orange cap but the entire SRH team wears one. \" ----- Bling is the way to go, a bit like Mumbai's new international terminal"}, {"ball": 5.2, "isHighlight": false, "text": "Nadeem to Rahane,1 run,fuller delivery on the stumps, pushed to mid-on for a single"}, {"ball": 5.3, "isHighlight": false, "text": "Nadeem to Nair, $$OUT$$ ,that is plumb in front! This was the arm-ball and Nair plays down the wrong line, this would have knocked the middle and leg"}, {"ball": 5.3, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$lbw$$ $$b$$ $$Nadeem$$ $$19$$ $$(25m$$ $$14b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$135.71$$"}, {"ball": 5.3, "isHighlight": false, "text": "Immediate success for Nadeem.. Here is Cooper"}, {"ball": 5.4, "isHighlight": false, "text": "Nadeem to Cooper,1 run,moves to the leg side and throws his bat straightaway, doesn't get any timing, but picks a  single to deep midwicket"}, {"ball": 5.5, "isHighlight": false, "text": "Nadeem to Rahane,1 run,fuller and on the stumps, the batsman nudges it to square leg for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Nadeem to Cooper, $$SIX$$ ,flatter and Cooper likes to swing! He bared his intentions in the first ball, this time he goes all the way.. Straight towards the sight screen"}, {"ball": 5.6, "isHighlight": false, "text": "Pranav: \"As far as the kits' designs are concerned, I think everyone would agree that none of the teams have come close to beating KKR's uniform. But that probably has got to do with its owner Shah Rukh Khan being in the show business. Rest every franchise, I would have to agree with you, has honestly disapoointed in terms of designs.\" ---- They might have done well on the design side, but they forgot to put brain when naming the team."}, {"ball": 5.6, "isHighlight": false, "text": "Now Tahir"}, {"ball": 6.1, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,tossed up delivery on the stumps, Rahane dabs it towards midwicket, looks for two, but is sent back in time"}, {"ball": 6.1, "isHighlight": false, "text": "Arnie: \"@Vinayak: Same reason Narine is not interested in Purple cap these days ... entire KKR team have those already !\""}, {"ball": 6.2, "isHighlight": false, "text": "Imran Tahir to Cooper,3 leg byes,gets a googly which he didn't know about much, luckily this turns down the leg side and flicks the pads to run down fine.. Nadeem dives to save the boundary"}, {"ball": 6.3, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,slightly shorter outside off, Rahane turns it to deep midwicket with his wrists"}, {"ball": 6.4, "isHighlight": false, "text": "Imran Tahir to Cooper,no run,tossed up and not full enough, Cooper wants to swing it, but checks his drive to cover point"}, {"ball": 6.5, "isHighlight": false, "text": "Imran Tahir to Cooper,1 run,now goes for the long-handle shot, but luckily for him, doesn't time it.. It lands short of long-off"}, {"ball": 6.6, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,quicker on the off, the batsman pushes it to wide long-on for a single"}, {"ball": 6.6, "isHighlight": false, "text": "kamalnivas: \"WHether or not Cooper's move works, this is definitely the way to go. Use your power hitters in the middle overs to make sure the opposition is always under the pump! Smith looks to have a good cricketing brain!! \""}, {"ball": 6.6, "isHighlight": false, "text": "Nadeem continues"}, {"ball": 7.1, "isHighlight": false, "text": "Nadeem to Rahane,no run,tossed up on the stumps, Rahane pushes it back in the air almost all the way to the bowler"}, {"ball": 7.2, "isHighlight": false, "text": "Nadeem to Rahane,no run,slower on off, Rahane looks to punch it through the gap at cover, but the fielder dives to cut it off"}, {"ball": 7.3, "isHighlight": false, "text": "Nadeem to Rahane,1 run,a touch on the leg side, easily dabbed to midwicket for a single"}, {"ball": 7.4, "isHighlight": false, "text": "Nadeem to Cooper, $$SIX$$ ,this is not timed at all, but Cooper sends it over long-off! The fielder was kept interested, this is just over him."}, {"ball": 7.5, "isHighlight": false, "text": "Nadeem to Cooper,1 run,makes room and blasts it through extra cover, but there is a fielder in the deep for that shot.."}, {"ball": 7.6, "isHighlight": false, "text": "Nadeem to Rahane,no run,slower and loopy on off, Rahane defends it to cover point"}, {"ball": 8.1, "isHighlight": false, "text": "Imran Tahir to Cooper,no run,big swing of the bat but he was playing for the legspin, this is a googly and cuts him in half"}, {"ball": 8.2, "isHighlight": false, "text": "Imran Tahir to Cooper, $$FOUR$$ ,this is a proper legspinner and it turns too, takes the outside edge to run down to third-man boundary"}, {"ball": 8.3, "isHighlight": false, "text": "Imran Tahir to Cooper, $$FOUR$$ ,this is the googly now, doesn't turn that much.. Cooper plays it smartly, doesn't try to hit it hard, just chips it over the bowler's head and gets a boundary"}, {"ball": 8.4, "isHighlight": false, "text": "Imran Tahir to Cooper,1 run,now looks to punch it through cover, but gets an inside edge past the stumps to short fine leg"}, {"ball": 8.5, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,bowls this slightly short, Rahane rocks back and slaps it to deep midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Shahul: \"I think they should decorate the Purple cap and the Orange cap with some birds' feathers(peacock or eagle) or they should be given some cool cowboy hats. What's the point in wearing a plain colored caps?\""}, {"ball": 8.6, "isHighlight": false, "text": "Imran Tahir to Cooper,no run,swing and a miss! This spins past the outside edge and beats him"}, {"ball": 9.1, "isHighlight": false, "text": "Nadeem to Rahane,1 leg bye,pushed through on the pads, Rahane looks to flick it but it grazes is pad to short fine leg"}, {"ball": 9.1, "isHighlight": false, "text": "Over the wicket now"}, {"ball": 9.2, "isHighlight": false, "text": "Nadeem to Cooper,1 run,tossed up on leg stump, Cooper drives it hard past the bowler"}, {"ball": 9.3, "isHighlight": false, "text": "Nadeem to Rahane,1 run,pushed through on the stumps, he dabs it towards deep midwicket for a single"}, {"ball": 9.4, "isHighlight": false, "text": "Nadeem to Cooper,1 run,he moves way down the leg side and drives the fuller delivery along the ground to long off"}, {"ball": 9.5, "isHighlight": false, "text": "Nadeem to Rahane, $$FOUR$$ ,slower and tossed up on off, how well has he timed this! He comes on the front foot and carts it along the ground to the cover boundary.. The fielder was too straight there"}, {"ball": 9.6, "isHighlight": false, "text": "Nadeem to Rahane,1 wide,pushes it through down the leg side, Nadeem is not impressed with that call.. It was off the pad"}, {"ball": 9.6, "isHighlight": false, "text": "Nadeem to Rahane,no run,some turn now, it beats the outside edge as Rahane looks to turn it to midwicket"}, {"ball": 10.1, "isHighlight": false, "text": "Duminy to Cooper,1 wide,sprays it way outside off from round the stumps"}, {"ball": 10.1, "isHighlight": false, "text": "Duminy to Cooper, $$SIX$$ ,Cooper's hit another six, didn't look like going all the way as he hit it, it was a pitched up delivery, and Cooper swung it straight, went high, remained in the air for a while and eventually cleared the boundary comfortably"}, {"ball": 10.2, "isHighlight": false, "text": "Duminy to Cooper, $$OUT$$ ,he's gone now, but he's done his job, Duminy angles it wide across him, Cooper stretches to have a swat at it, it is another high mishit, and sweeper cover settles under it"}, {"ball": 10.2, "isHighlight": false, "text": "$$KK$$ $$Cooper$$ $$c$$ $$Shukla$$ $$b$$ $$Duminy$$ $$32$$ $$(20m$$ $$16b$$ $$2x4$$ $$3x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 10.3, "isHighlight": false, "text": "Duminy to Rahane,1 run,turned to deep midwicket for a single"}, {"ball": 10.4, "isHighlight": false, "text": "Duminy to Samson,1 run,forward to a tossed up ball from over the wicket and drives it down the ground"}, {"ball": 10.5, "isHighlight": false, "text": "Duminy to Rahane,1 run,pushes a full toss back to the bowler, who cannot stop it, and concedes the single"}, {"ball": 10.6, "isHighlight": false, "text": "Duminy to Samson,1 run,sees it pitching on a length outside off and backs away to cut, but cannot time the shot, chops it away for a single to the sweeper"}, {"ball": 10.6, "isHighlight": false, "text": "Tiwary to bowl some part time legspin"}, {"ball": 11.1, "isHighlight": false, "text": "Tiwary to Samson,no run,pushed off the front foot to point"}, {"ball": 11.1, "isHighlight": false, "text": "Manoj: \"Mission cooper is accomplished...!!\""}, {"ball": 11.2, "isHighlight": false, "text": "Tiwary to Samson,no run,tosses it up on the pad, it is nudged to midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Tiwary to Samson, $$SIX$$ ,tosses it up again, this is around off, Samson comes out immediately, and deposits it over the straight boundary"}, {"ball": 11.4, "isHighlight": false, "text": "Tiwary to Samson,no run,leaves the crease again, but Tiwary's not given this one as much flight, and it's also pitched well short of Samson, he defends"}, {"ball": 11.5, "isHighlight": false, "text": "Tiwary to Samson,1 run,gets away with one that sits up outside off from a good length, Samson waits and thumps it straight to the sweeper"}, {"ball": 11.6, "isHighlight": false, "text": "Tiwary to Rahane, $$FOUR$$ ,excellent placement, Rahane backs away and slaps it through extra cover, sweeper and long off converge, but it just beats them into the rope"}, {"ball": 12.1, "isHighlight": false, "text": "Duminy to Samson,1 run,short and quick on the body, the batsman is hurried into his pull but manages to drag it to deep square leg"}, {"ball": 12.2, "isHighlight": false, "text": "Duminy to Rahane,1 run,another short one, this one is pulled in front of the wicket, to deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Duminy to Samson,1 run,pushes it through on the legs with a round-arm action, the batsman clips it straight to short fine leg"}, {"ball": 12.4, "isHighlight": false, "text": "Duminy to Rahane,1 run,quicker delivery on the stumps, the batsman punches it down to long off"}, {"ball": 12.5, "isHighlight": false, "text": "Duminy to Samson,1 wide,fires it across the batsman, this is a bit too wide outside off, umpire not impressed"}, {"ball": 12.5, "isHighlight": false, "text": "Duminy to Samson,1 run,he moves to the leg and looks to hammer it over long-off, but doesn't get the timing.. it drops a few paces short of the fielder"}, {"ball": 12.5, "isHighlight": false, "text": "Suhaib: \"On the note of distinctions (purple & orange cap), special kits should be designed for the teams who are knocked out of the competition and those teams should wear them in their remaining matches. Like DD in this match may be, or definitely the next match if they loose this one. One idea could be clown outfits theme designed by Manish Malhotra may be.\" ------ to add much-needed seriousness to the tournament.."}, {"ball": 12.6, "isHighlight": false, "text": "Duminy to Rahane,1 run,waits on the back foot and chops it to backward point"}, {"ball": 12.6, "isHighlight": false, "text": "The next two minutes could be the most important of your day. Play  $$CricIQ$$  and book your seats on the plane to London, to watch India play England at Lord's."}, {"ball": 12.6, "isHighlight": false, "text": "Sanjay: \"Playing with WI cricketers, Indian batsmen have also get into their skin of not rotating the strike and depending only on boundaries. Rahane has struck 3 4's still his strike rate is just above run a ball, which could be achieved by scoring 1's and two's. Rahane should know he can never me a Gayle or a yuvi, so he should run like last year.\""}, {"ball": 13.1, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,short ball to start with, but Rahane picks the man at deep midwicket with his pull, just a single"}, {"ball": 13.2, "isHighlight": false, "text": "Imran Tahir to Samson,1 run,it's the googly and it's short enough for the batsman to drag it down to deep backward square leg"}, {"ball": 13.3, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,it;s the legspinner this time, Rahane allows it to turn, then chips it to wide long-on"}, {"ball": 13.4, "isHighlight": false, "text": "Imran Tahir to Samson,1 run,this is full enough for Samson to drive it firmly down to long-off"}, {"ball": 13.5, "isHighlight": false, "text": "Imran Tahir to Rahane,1 run,he comes out of the crease but realises he is not to the pitch of the ball, looks to defend but gets an inside edge to the leg side"}, {"ball": 13.6, "isHighlight": false, "text": "Imran Tahir to Samson, $$FOUR$$ ,superbly picks the gap at cover! The fielder in the deep are all too straight - there is one at deep extra cover and another at long-off, so the batsman places his cut shot square and no one moves"}, {"ball": 13.6, "isHighlight": false, "text": "ECB: \"I know KP is trying to enjoy his game and always smiling now and stuff... But he was much better as a player when he had aggression in his game..Sad to see that aggressiveness missing in this tournament..which is reflecting upon his batting and Delhi's team performance..\""}, {"ball": 13.6, "isHighlight": false, "text": "Back to pace, it's Sid Kaul"}, {"ball": 14.1, "isHighlight": false, "text": "Kaul to Rahane,1 run,back of length delivery on off, the batsman whips it to deep midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Kaul to Samson, $$SIX$$ ,it's a Samson special! how quick is he to spot the length! It's outside off and he swings it beautifully over long-off, just a clean golf swing"}, {"ball": 14.3, "isHighlight": false, "text": "Kaul to Samson,2 runs,short of length delivery on off, this was punched straight to extra cover but Nadeem allows it to slip through his legs, gives away an easy single"}, {"ball": 14.3, "isHighlight": false, "text": "Sanju wants to change his bat as Rahane gets some attention due to some stiffness"}, {"ball": 14.4, "isHighlight": false, "text": "Kaul to Samson, $$SIX$$ ,that is brilliantly played! This is short delivery outside off, the batsman plays a fore-hand topspinner down the ground.. This was played from shoulder level.. Over the boundary towards the sight screen"}, {"ball": 14.5, "isHighlight": false, "text": "Kaul to Samson,1 run,length delivery, this is powered to deep extra cover"}, {"ball": 14.6, "isHighlight": false, "text": "Kaul to Rahane,1 run,length delivery on off, now Rahane punches it with some flourish, but straight to long off"}, {"ball": 14.6, "isHighlight": false, "text": "Five overs to go, plenty of time and plenty of batting for Royals to make a dash towards 200"}, {"ball": 14.6, "isHighlight": false, "text": "Rahul Shukla comes in"}, {"ball": 15.1, "isHighlight": false, "text": "Shukla to Rahane,1 run,he wanted to smash this slower delivery out over long-on, but can only manage a thick outside edge fine on the off side, third man cuts it off"}, {"ball": 15.2, "isHighlight": false, "text": "Shukla to Samson, $$FOUR$$ ,it's a very good ball, a slower yorker on the pads, but it's equally well-played as Samson flicks it fine down the leg side, beats the short fine leg fielder to the boundary"}, {"ball": 15.3, "isHighlight": false, "text": "Shukla to Samson,1 leg bye,he hits the pads with a full toss and appeals, but this was heading down the leg side.. Samson should be disappointed he missed out on that"}, {"ball": 15.4, "isHighlight": false, "text": "Shukla to Rahane, $$FOUR$$ ,another one to the fine-leg boundary! Rahane gets his  $$fifty$$  with a kind-of paddle from off and middle. He was almost beaten by the slowness of it, but manages to show it the right direction"}, {"ball": 15.5, "isHighlight": false, "text": "Shukla to Rahane,2 runs,shuffles across to the off and clips the length delivery to deep backward square leg for a couple"}, {"ball": 15.6, "isHighlight": false, "text": "Shukla to Rahane, $$FOUR$$ ,what has Kaul done! He ran from fine-leg towards deep backward square leg and made it in time to cut it off, but as he slid on his knees, he slid all the way across, the ball comes later after he has gone to the other side and reaches the boundary. Not a great ball too - a full toss, it was asking to be hit"}, {"ball": 15.6, "isHighlight": false, "text": "Rohit: \"This is a great example of having a player withgood technique like Rahane in the team. Other good hitters can play around him as he brings stability to the innings....\""}, {"ball": 15.6, "isHighlight": false, "text": "Nadeem comes back"}, {"ball": 16.1, "isHighlight": false, "text": "Nadeem to Samson,1 wide,fires this wide down the leg side from over the wicket"}, {"ball": 16.1, "isHighlight": false, "text": "Nadeem to Samson,1 run,fires it on the base of offstump, the batsman toe-ends it to deep extra cover"}, {"ball": 16.2, "isHighlight": false, "text": "Nadeem to Rahane, $$SIX$$ ,low full toss is hardly going to test a batsman, not Rahane certainly! He thwacks it over wide long-on and into the crowd"}, {"ball": 16.2, "isHighlight": false, "text": "Ozee: \"RR looks set to get 200 may be more.....with the likes of Smith, faulkner and not to forget the hard hitting Cutting....may be people don't know much about him but i think he should be next....he is a big strong lad.\""}, {"ball": 16.3, "isHighlight": false, "text": "Nadeem to Rahane,1 run,another low full toss, this time it's driven straight to long on"}, {"ball": 16.3, "isHighlight": false, "text": "pauly mac: \"The only guarantees in life - death, taxes and Delhi Daredevils! He who dares wins, he who Daredevils - loses!\""}, {"ball": 16.4, "isHighlight": false, "text": "Nadeem to Samson,1 run,comes out of the crease and punches the tossed up delivery to long off for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Nadeem to Rahane, $$OUT$$ ,that's hit the top of middle and stump! Rahane has gone too far down the leg to make room and this one spins to beat his bat-swing"}, {"ball": 16.5, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$b$$ $$Nadeem$$ $$64$$ $$(78m$$ $$50b$$ $$8x4$$ $$1x6)$$ $$SR:$$ $$128.00$$"}, {"ball": 16.5, "isHighlight": false, "text": "Rahane may have done his job too well.. A fifty, now a few overs for the hitters.."}, {"ball": 16.5, "isHighlight": false, "text": "Binny? Really?"}, {"ball": 16.6, "isHighlight": false, "text": "Nadeem to Binny,no run,he comes round the wicket and bowls the arm-ball, Binny misses his flick and gets hit on the pads"}, {"ball": 16.6, "isHighlight": false, "text": "Tahir is in"}, {"ball": 17.1, "isHighlight": false, "text": "Imran Tahir to Samson,no run,bowls a quicker delivery on the stumps, Samson is hurried by that and inside edges it to his pads"}, {"ball": 17.2, "isHighlight": false, "text": "Imran Tahir to Samson,1 run,looks to cart it through cover, but doesn't get any timing, picks up a single to cover"}, {"ball": 17.3, "isHighlight": false, "text": "Imran Tahir to Binny, $$OUT$$ ,Binny comes and Binny goes! They are checking with the third umpire but it's out to the naked eye. Binny charges down the pitch, gets comprehensively beaten by the googly and is well short"}, {"ball": 17.3, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$st$$ $$†Karthik$$ $$b$$ $$Imran$$ $$Tahir$$ $$0$$ $$(2m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Binny may have just corrected RR's think-tank's mistake here"}, {"ball": 17.3, "isHighlight": false, "text": "Cutting comes in .. his strike rate is 159.. But this is IPL debut"}, {"ball": 17.4, "isHighlight": false, "text": "Imran Tahir to Cutting,1 run,picks up a single as the fielder at point fails to stop the cut cleanly"}, {"ball": 17.5, "isHighlight": false, "text": "Imran Tahir to Samson,no run,it's the flipper now, skids on to the batsman who was shaping to pull it, hits him on the thigh pad"}, {"ball": 17.5, "isHighlight": false, "text": "Ritesh: \"Isn't 4.5 crores a price too steep to just go for an occasional toss (and call it incorrectly). Steve smith missed out on leading from front today.\""}, {"ball": 17.6, "isHighlight": false, "text": "Imran Tahir to Samson, $$OUT$$ ,big legspinner, the batsman drags it down the ground off the toe off his bat, Jadhav runs in from long-on and takes a simple catch. This has been a superb over from Tahir"}, {"ball": 17.6, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$Jadhav$$ $$b$$ $$Imran$$ $$Tahir$$ $$40$$ $$(37m$$ $$25b$$ $$2x4$$ $$3x6)$$ $$SR:$$ $$160.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Faulkner comes in now.. Two overs.. That 200 is looking like a stiff hike now. Manoj Tiwary to bowl,  round the wicket"}, {"ball": 18.1, "isHighlight": false, "text": "Tiwary to Faulkner,2 runs,bowls some slow leg spin on the pads, Faulkner punches it to wide long-off for a quick couple"}, {"ball": 18.2, "isHighlight": false, "text": "Tiwary to Faulkner,1 run,slower on the stumps, the batsman can only pick a single to cover"}, {"ball": 18.3, "isHighlight": false, "text": "Tiwary to Cutting, $$SIX$$ ,Cutting cuts loose! This is outta here! Slow and spinning from outside leg stump towards the middle but short enough for Cutting to get under it.. That is one monster pull over deep midwicket, it's gone over the roof.. 101 meter hit"}, {"ball": 18.3, "isHighlight": false, "text": "new balls please. Tiwary goes over the wicket"}, {"ball": 18.4, "isHighlight": false, "text": "Tiwary to Cutting,1 run,bowls a slower one outside off, Cutting slaps it down to long-on"}, {"ball": 18.5, "isHighlight": false, "text": "Tiwary to Faulkner, $$SIX$$ ,tossed up, now Faulkner joins in.. He goes down on his knee and swings across the line.. The spin doesn't matter, this is into the crowd at deep midwicket"}, {"ball": 18.6, "isHighlight": false, "text": "Tiwary to Faulkner,1 run,shorter and flatter now, the batsman punches it to deep extra cover for a single to make it 17 off the over"}, {"ball": 18.6, "isHighlight": false, "text": "KP calls for Rahul Shukla..Fine-leg and third-man are up in the circle"}, {"ball": 19.1, "isHighlight": false, "text": "Shukla to Faulkner,(no ball) 1 run,high full toss, this is called a no-ball straight away.. Faulkner picks a single with a whip to square leg, doesn't get any distance on that"}, {"ball": 19.1, "isHighlight": false, "text": "Round the wicket"}, {"ball": 19.1, "isHighlight": false, "text": "Shukla to Cutting,no run,swings and misses as this doesn't bounce much, it misses the off stump too"}, {"ball": 19.2, "isHighlight": false, "text": "Shukla to Cutting,no run,now he beats the inside edge as Cutting aims for the crowd again, it came in a touch after pitching"}, {"ball": 19.3, "isHighlight": false, "text": "Shukla to Cutting,1 leg bye,he misses out again! This is a full toss on the pads, should have gone to Ahmedabad city centre, but it goes towards cover after hitting the pads.. Cutting is cutting a sorry figure in this over"}, {"ball": 19.3, "isHighlight": false, "text": "Three balls, can they get to 200.. can they? Shukla goes over the wicket"}, {"ball": 19.4, "isHighlight": false, "text": "Shukla to Faulkner, $$SIX$$ ,that's one step towards 200! Shukla bowls a half-volley and Faulkner loves it, smashes it over wide long-on. Keep them coming"}, {"ball": 19.4, "isHighlight": false, "text": "KP goes to have a friendly chat with the bowler."}, {"ball": 19.5, "isHighlight": false, "text": "Shukla to Faulkner, $$SIX$$ ,second tier gets themselves on big screen as the ball lands into them! Full delivery, whacked over long on to bring the team's 200"}, {"ball": 19.5, "isHighlight": false, "text": "Round the wicket he goes"}, {"ball": 19.6, "isHighlight": false, "text": "Shukla to Faulkner, $$OUT$$ ,he gets a free run-out wicket! faulkner swings at the length ball, gets a bottom edge back to the bowler, but Cutting is half-way down the pitch and sees no reason to return"}, {"ball": 19.6, "isHighlight": false, "text": "$$BCJ$$ $$Cutting$$ $$run$$ $$out$$ $$8$$ $$(18m$$ $$6b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 19.6, "isHighlight": false, "text": "Take out the Tahir over and Royals took 58 off four of the last five overs, that too despite losing four wickets to climb past 200. This is a very very good total on a pitch that looks a touch two-paced. Rahane held one end with a calm half-century but the throttle came from a mini Cooper assault. Then Samson scored a brisk 40 to keep the rate up and a flurry of sixes towards the end provided the ideal finish... Back in ten for the second round of this battle."}, {"ball": 19.6, "isHighlight": false, "text": "Harshad: \"Deja vu for Rahul Shukla...gotta feel bad for him,still remember him getting the crucial wicket of MSD in last years champions league while playing for RR\""}], "name": "Rajasthan Royals v Delhi Daredevils", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734011.html?innings=1;view=commentary", "match_num": 41}