{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back to live action. The teams are back in the field. KP walks in along with Mayank Agarwal. The big man to take strike.. Big task ahead of him. Dhawal Kulkarni to bowl the first over."}, {"ball": 0.1, "isHighlight": false, "text": "Kulkarni to Pietersen,no run,good start by the bowler, it's a length ball in the channel and it drifts away, KP lets it go"}, {"ball": 0.2, "isHighlight": false, "text": "Kulkarni to Pietersen,1 run,he walks across the stumps and whips the length ball from outside off to deep midwicket"}, {"ball": 0.3, "isHighlight": false, "text": "Kulkarni to Agarwal, $$FOUR$$ ,that is superb start from Mayank! Everyone has been hit by the Uthappa bug. It's a length ball and Mayank punches it over cover with the straightest of bats.."}, {"ball": 0.4, "isHighlight": false, "text": "Kulkarni to Agarwal,1 run, $$dropped$$  by Cutting at fine leg! Things have not gone well for him since that six!. The batsman gets a thick top-edge as he goes for the pull and Cutting moves to his left to get under the ball comfortably, but drops a sitter"}, {"ball": 0.5, "isHighlight": false, "text": "Kulkarni to Pietersen,no run,length delivery outside off, KP lets it go"}, {"ball": 0.6, "isHighlight": false, "text": "Kulkarni to Pietersen,no run,he stands tall and punches it on the up, but straight to cover"}, {"ball": 0.6, "isHighlight": false, "text": "Cutting is here"}, {"ball": 1.1, "isHighlight": false, "text": "Cutting to Agarwal, $$FOUR$$ ,not a good start with the ball either, he bowls a length delivery on the pads and that is tickled to the fine-leg boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Cutting to Agarwal, $$FOUR$$ ,and more runs, now he bowls it wide outside off and this has been smartly placed in the tiny gap between short third man and point"}, {"ball": 1.3, "isHighlight": false, "text": "Cutting to Agarwal,1 run,Unmukt cuts out a probably boundary at point! Width from Cutting again and Mayank punches it stylishly off the back foot, but Unmukt dives to his right to cut it off"}, {"ball": 1.4, "isHighlight": false, "text": "Cutting to Pietersen,1 run,he pushes it to mid-off and calls early for a quick one"}, {"ball": 1.4, "isHighlight": false, "text": "Raul: \"You are saying that the batsman are hit by the Uthappa bug but I feel you are the one who is still mesmerised by his last night innings.\""}, {"ball": 1.5, "isHighlight": false, "text": "Cutting to Agarwal,2 runs,short ball, the batsman pulls but is not in control, places it in the gap at midwicket though"}, {"ball": 1.6, "isHighlight": false, "text": "Cutting to Agarwal,1 run,plenty of width outside off, the batsman crashes it to deep cover off the front foot"}, {"ball": 1.6, "isHighlight": false, "text": "Jittery start for Cutting with the ball.."}, {"ball": 1.6, "isHighlight": false, "text": "Change in bowling, Faulkner comes in, over the wicket he comes"}, {"ball": 2.1, "isHighlight": false, "text": "Faulkner to Agarwal,no run,he climbs on top of that short of length delivery and punches this supremely, finds the man at extra cover though"}, {"ball": 2.2, "isHighlight": false, "text": "Faulkner to Agarwal,no run,looks to bisect the gap between short third man and point, but doesn't succeed, straight to the fielder"}, {"ball": 2.3, "isHighlight": false, "text": "Faulkner to Agarwal, $$OUT$$ ,attempts the Uthappa straight loft over mid-off but fails, he doesn't get it off the middle and ends up chipping it towards mid-off where Smith back pedals to take a simple catch"}, {"ball": 2.3, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Smith$$ $$b$$ $$Faulkner$$ $$17$$ $$(11m$$ $$10b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$170.00$$"}, {"ball": 2.3, "isHighlight": false, "text": "Apologies, I am done with Uthappa now. DK is the new man"}, {"ball": 2.4, "isHighlight": false, "text": "Faulkner to Pietersen,1 run,beautifully punched! He stands tall to this length ball and crunches it to wide mid-off where Smith makes the save"}, {"ball": 2.5, "isHighlight": false, "text": "Faulkner to Karthik,1 run,Unmukt runs in from point and hits the stumps direct, but KP makes it in time..  $$He$$ $$is$$ $$gone!$$ $$Hello$$ $$hello!$$ $$He$$ $$has$$ $$not$$ $$slid$$ $$his$$ $$bat$$ $$in$$ .. It gets stuck in the mud before the line.. It hasn't been referrred.. This is the repeat  of few matches ago when he was out and no one checked.. This is big big.. RR don't appeal for it... It happened the last time when DD played against Royals in Delhi.. KP is very lucky.. very very lucky"}, {"ball": 2.6, "isHighlight": false, "text": "Faulkner to Pietersen, $$FOUR$$ ,and he makes them pay straightaway, leans on the length ball and hammers it over mid-off"}, {"ball": 3.1, "isHighlight": false, "text": "Cutting to Karthik,no run,length delivery on off, the batsman drops it to the off side"}, {"ball": 3.1, "isHighlight": false, "text": "Andrew: \"Wow, the umpires made a mistake, when did that last happen? Oh, right...\" --- Not umpire's fault. $$.$$ $$no$$ $$one$$ $$appealed..$$"}, {"ball": 3.2, "isHighlight": false, "text": "Cutting to Karthik,1 run,he clips it to short fine leg for a single and takes a quick single"}, {"ball": 3.3, "isHighlight": false, "text": "Cutting to Pietersen,1 run,length delivery on the stumps, the batsman dabs it to point and Unmukt gets there quickly and fires a throw at non-striker's.."}, {"ball": 3.4, "isHighlight": false, "text": "Cutting to Karthik,1 run,dabbed to midwicket for a quick single off the back foot"}, {"ball": 3.4, "isHighlight": false, "text": "Abhishek: \"\"3rd umpires are called upon even when the batsman crosses the keeper, and invariably, the instance umpire does not call the third umpire, it is out.\""}, {"ball": 3.5, "isHighlight": false, "text": "Cutting to Pietersen,1 run,another quick single to midwicket as KP dabs it off the front foot"}, {"ball": 3.6, "isHighlight": false, "text": "Cutting to Karthik,no run,walks across the stumps and looks to whip it fine on the leg side but gets hit on the thigh pad"}, {"ball": 3.6, "isHighlight": false, "text": "Chad: \"There was a clear appeal by two players behind the wicket when the ball struck the bails. Ravi waved them off immediately.\" ---- Well you are right I think, but I won't blame the umpire for this one.."}, {"ball": 4.1, "isHighlight": false, "text": "Kulkarni to Pietersen,1 leg bye,he walks across the stumps and gets hit on the pads, appeal for lbw.. and only the bowler is interested. This could have been close too"}, {"ball": 4.2, "isHighlight": false, "text": "Kulkarni to Karthik,no run,he comes forward and punches the length ball straight to mid-on"}, {"ball": 4.3, "isHighlight": false, "text": "Kulkarni to Karthik,no run,looks to pull the back of length delivery across the line, but gets a bottom edge to short fine leg"}, {"ball": 4.3, "isHighlight": false, "text": "Swaroop: \"Don't be so harsh on the umpires. He followed the rules correctly. In these instances, the fielding team has to appeal to refer the decision to 3rd umpire. If there is a nick and bowler/keeper don't appeal, the batsman will not be given out by the umpire. This is similar to that. It is completely under the law. Fault is with RR for not noticing what happened there.\""}, {"ball": 4.4, "isHighlight": false, "text": "Kulkarni to Karthik, $$OUT$$ ,Cutting takes a catch at fine-leg! This time he settles under it nicely and gobbles it up.. Slower short ball, DK pulls it straight down to fine-leg"}, {"ball": 4.4, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Cutting$$ $$b$$ $$Kulkarni$$ $$3$$ $$(11m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$37.50$$"}, {"ball": 4.4, "isHighlight": false, "text": "JP Duminy comes in early.. Can he be the saviour?"}, {"ball": 4.5, "isHighlight": false, "text": "Kulkarni to Duminy,no run,bowls a length delivery across the left-hander, left alone"}, {"ball": 4.6, "isHighlight": false, "text": "Kulkarni to Duminy,no run,length delivery on off, the batsman pushes it straight to cover off the back foot"}, {"ball": 4.6, "isHighlight": false, "text": "Arvind: \"Dinesh Karthik has been one of the biggest disappointment of this season especially when some of his contemporary wicket keepers like Parthiv, Saha have done well. May be his big price tag has bogged him down\""}, {"ball": 4.6, "isHighlight": false, "text": "Cooper comes in now"}, {"ball": 5.1, "isHighlight": false, "text": "Cooper to Pietersen,1 leg bye,fires this on the middle and leg line, the batsman misses his flick and gets hit on the pads"}, {"ball": 5.2, "isHighlight": false, "text": "Cooper to Duminy,no run,looks to punch this length delivery off the front foot, but doesn't get the timing right, pushes it to cover"}, {"ball": 5.3, "isHighlight": false, "text": "Cooper to Duminy,no run,back of length delivery on the stumps, JP nudges it to fine leg"}, {"ball": 5.4, "isHighlight": false, "text": "Cooper to Duminy,1 run,slower delivery outside off, the batsman guides it down to third man"}, {"ball": 5.4, "isHighlight": false, "text": "Abhishek Jayswa: \"That's why I always appeal whenever I hit, or even miss, the stumps.. what's wrong with shouting after all you got millions to be there.\""}, {"ball": 5.5, "isHighlight": false, "text": "Cooper to Pietersen,1 wide,atrocious ball! This is very very wide down the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Cooper to Pietersen,no run,cracked to mid-off off the front-foot, does it too well and it reaches the fielder quickly, no chance of a single"}, {"ball": 5.6, "isHighlight": false, "text": "Cooper to Pietersen,1 run,he nudges the back of length delivery to square leg for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Here comes Tambe"}, {"ball": 6.1, "isHighlight": false, "text": "Tambe to Pietersen,1 run,bowls it flat and quick on the leg stump, KP punches it to long on"}, {"ball": 6.1, "isHighlight": false, "text": "Required rate already through the roof"}, {"ball": 6.2, "isHighlight": false, "text": "Tambe to Duminy,1 run,pushed through outside off, JP drives it to long off for a single"}, {"ball": 6.2, "isHighlight": false, "text": "Shanbhog: \"While everyone is talking about Yuvraj's failure at 14 Crore (who is now amongst the leading runscorers this season), KP + DK's failure has not received the same attention, who put together are worth almost 20 Crore... T20 WC final effect?\""}, {"ball": 6.3, "isHighlight": false, "text": "Tambe to Pietersen,1 run,quicker one on the pads again, cramps him for room, the batsman pushes it through midwicket for a single"}, {"ball": 6.3, "isHighlight": false, "text": "BJ: \"Yesterday Kings XI Punjab showed how to chase a 200+ total. Today Double-Ds are showing us how not to chase a 200+ total. 34/2 in 6 overs... Hope I'm wrong\""}, {"ball": 6.4, "isHighlight": false, "text": "Tambe to Duminy, $$SIX$$ ,how good is that! That was a low-trajectory ball and it looked like it was not going to be an easy one to get under.. But he smokes it over long on with flat hit"}, {"ball": 6.5, "isHighlight": false, "text": "Tambe to Duminy, $$OUT$$ ,JP is not going to be the saviour! He looks to cut the quicker delivery but cannot keep it down, straight to point"}, {"ball": 6.5, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$c$$ $$Nair$$ $$b$$ $$Tambe$$ $$8$$ $$(9m$$ $$8b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 6.6, "isHighlight": false, "text": "Tambe to Tiwary,2 runs,tossed up delivery on the stumps, Tiwary pushes it softly to deep midwicket and calls for a second"}, {"ball": 6.6, "isHighlight": false, "text": "Bhatia comes in"}, {"ball": 7.1, "isHighlight": false, "text": "Bhatia to Pietersen,no run,bowls a slow length ball on the stumps, KP punches it straight to extra cover"}, {"ball": 7.2, "isHighlight": false, "text": "Bhatia to Pietersen,1 run,slower still, this time it is punched to deep cover"}, {"ball": 7.2, "isHighlight": false, "text": "kamalnivas: \"This Duminy failure will now convince DD that Duminy is best suited to the role of a \"finisher\" and will continue to bat him at No.6 in the next season too!!\""}, {"ball": 7.3, "isHighlight": false, "text": "Bhatia to Tiwary,1 run,keeps it accurate on the stumps, the batsman pushes it to long on"}, {"ball": 7.4, "isHighlight": false, "text": "Bhatia to Pietersen,1 wide,this is too far down the leg side, easy call"}, {"ball": 7.4, "isHighlight": false, "text": "Bhatia to Pietersen, $$OUT$$ ,this is falling apart very quickly! Bhatia does it now, this is a slower delivery at 96 kph, KP gives himself room and looks to go over extra cover, but this comes slow off the surface, stays low too, takes the inside edge and ruins the stump arrangement"}, {"ball": 7.4, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$b$$ $$Bhatia$$ $$13$$ $$(37m$$ $$18b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$72.22$$"}, {"ball": 7.4, "isHighlight": false, "text": "Ross Taylor os the next man"}, {"ball": 7.5, "isHighlight": false, "text": "Bhatia to Taylor,1 run,length delivery on the pads, flicked to deep square leg for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Bhatia to Tiwary,no run,almost a flighted delivery from a spinner, the batsman pushes it back down the pitch"}, {"ball": 7.6, "isHighlight": false, "text": "Shan Fastian: \"That's not fair. Why do you run so long Bhatia , when you are gonna ball just a slow loopy lolypop cutter.\""}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to Taylor,1 wide,slips this down the leg side, another wide"}, {"ball": 8.1, "isHighlight": false, "text": "Tambe to Taylor,1 run,this stays low outside off, Tiwary pushes it to deep cover off the back foot"}, {"ball": 8.2, "isHighlight": false, "text": "Tambe to Tiwary,1 run,he comes out of the crease and pushes the tossed up delivery down to long on"}, {"ball": 8.3, "isHighlight": false, "text": "Tambe to Taylor,1 run,fuller delivery on the pads, Taylor dabs it to midwicket for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Tambe to Tiwary,1 run,uses his feet and nudges the flatter delivery to deep square leg"}, {"ball": 8.5, "isHighlight": false, "text": "Tambe to Taylor,1 run,tossed up delivery outside off, 90 kph, Taylor nudges it behind point for a quick single"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to Tiwary,1 wide,fires this one flat, but this is a big wide down the leg side, Samson has to dive to get to it"}, {"ball": 8.6, "isHighlight": false, "text": "Tambe to Tiwary,1 run,this one is flatter and spins away, Tiwary drags it to deep midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Darryl: \"I wonder if players get embarrassed when they get paid a huge IPL salary and don't perform? I'd be thinking of donating half my salary to local charities if I was performing like KP.\" --- Darryl, only the other day we had a chat among colleagues about the same thing. Very true. It was re Yuvraj before he played those two innings."}, {"ball": 8.6, "isHighlight": false, "text": "Gautham: \"A lot of ppl seem to be getting carried away with yuvraj's so called return to form. He has had two good innings on a flat wicket against teams with a plethora of slow/medium paced bowlers. I'm interested to see whether this \"form\" carries over when he faces the likes of morkel, steyn and johnson or even better slow ball bowlers like narine, badree and ashwin....\""}, {"ball": 8.6, "isHighlight": false, "text": "Bhatia continues"}, {"ball": 9.1, "isHighlight": false, "text": "Bhatia to Tiwary,1 run,Cutting is not sure if he has taken this catch or not!! He runs in from long-off to take this chipped shot.. But the replays show he didn't get his fingers under that.. Could have been a super catch..but it could be considered as a  $$drop$$  because he got there"}, {"ball": 9.1, "isHighlight": false, "text": "Vipul: \"On salary, if you were working for a tech company in charge of writing code and the code was buggy, would you donate your salary away? No. Will you stop becoming a project lead? No. Not until the company decides to fire you. Same thing here.\""}, {"ball": 9.2, "isHighlight": false, "text": "Bhatia to Taylor, $$OUT$$ ,one-hander from Bhatia! this is on a length and gets stuck in the pitch, Taylor punches it down the pitch but gets hit high on the bat, it lobs up softly towards the bowler who sticks his right-hand out and plucks it"}, {"ball": 9.2, "isHighlight": false, "text": "$$LRPL$$ $$Taylor$$ $$c$$ $$&$$ $$b$$ $$Bhatia$$ $$4$$ $$(9m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$80.00$$"}, {"ball": 9.2, "isHighlight": false, "text": "Jadhav comes in"}, {"ball": 9.3, "isHighlight": false, "text": "Bhatia to Jadhav,1 run,pushes the length ball straight to midwicket, but a wayward throw to the keeper from the fielder gives away an extra"}, {"ball": 9.3, "isHighlight": false, "text": "TJ: \"@ Darreyl we are a bunch of mechanics and we have an arrangement when one screws up or doesn't perform, he buys lunch and beer on friday for all crew. \""}, {"ball": 9.4, "isHighlight": false, "text": "Bhatia to Tiwary,no run,another legcutter, the batsman pushes it to cover point"}, {"ball": 9.5, "isHighlight": false, "text": "Bhatia to Tiwary,2 runs,drifting on to the leg side, the batsman goes down for a sweep and gets a faint tickle to run it down fine"}, {"ball": 9.6, "isHighlight": false, "text": "Bhatia to Tiwary,1 run,fuller delivery outside off, the batsman drives it down to long on"}, {"ball": 9.6, "isHighlight": false, "text": "WGSNG: \"@Gautham - Yuvraj was not even scoring against such mediocre attacks and that's why he seems to be back on form. The confidence that he might have got with those 2 innings will surely propel him to perform much better than he had been doing against any attack\""}, {"ball": 10.1, "isHighlight": false, "text": "Tambe to Tiwary,no run,attempts a reverse sweep at one bowled down the leg side, hits it straight to short third man"}, {"ball": 10.2, "isHighlight": false, "text": "Tambe to Tiwary,1 run,tossed up outside off, the batsman pushes it to deep cover for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Tambe to Jadhav,1 run,drifts in to the pads, the batsman sweeps it firmly to deep backward square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Tambe to Tiwary,1 run,comes down the pitch and drags the slower one down to deep midwicket without much timing"}, {"ball": 10.5, "isHighlight": false, "text": "Tambe to Jadhav,1 run,flatter delivery, Jadhav comes out of the crease and chips it to long off"}, {"ball": 10.5, "isHighlight": false, "text": "paul: \"T J Here everyone seems to be screwing up ! It will take all fridays of the year & more !!\""}, {"ball": 10.6, "isHighlight": false, "text": "Tambe to Tiwary,1 run,fuller delivery, he sweeps it to short fine leg for a quick single"}, {"ball": 10.6, "isHighlight": false, "text": "Cutting comes back"}, {"ball": 11.1, "isHighlight": false, "text": "Cutting to Tiwary,no run,bowls length outside off, it stays low and slips under the bat"}, {"ball": 11.2, "isHighlight": false, "text": "Cutting to Tiwary, $$FOUR$$ ,length delivery again, but the batsman manages to swing across the line and gets it in the gap at wide long on"}, {"ball": 11.3, "isHighlight": false, "text": "Cutting to Tiwary, $$FOUR$$ ,slower delivery outside off, Tiwary waits and waits before cutting it late past the keeper for another boundary"}, {"ball": 11.4, "isHighlight": false, "text": "Cutting to Tiwary, $$OUT$$ ,easy run-out! What a mixed day this is for Cutting! He bowls a slower one, the batsman pushes it to off, the non-striker charges down half-way, the striker stops, Cutting has all the time to take the aim at the non-striker's and he hits it direct.."}, {"ball": 11.4, "isHighlight": false, "text": "$$KM$$ $$Jadhav$$ $$run$$ $$out$$ $$3$$ $$(5m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 11.5, "isHighlight": false, "text": "Cutting to Tiwary,1 run,fires it full on the off side, the batsman squeezes it to point where Karun misfields allowing a single"}, {"ball": 11.6, "isHighlight": false, "text": "Cutting to Nadeem,no run,fuller delivery on the stumps, the batsman digs it out to the bowler"}, {"ball": 11.6, "isHighlight": false, "text": "sanjay: \"Re: Darryl; I am watching cricinfo from work ;) Naturally, my productivity is zero while match is ON. Should I take my salary for the day I watch cricket at work? \" ---- I am doing the same Sanjay, but luckily my productivity today is ok"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Tiwary,no run,bowls length at a normal pace, the batsman comes out of the crease and pushes it straight to cover"}, {"ball": 12.1, "isHighlight": false, "text": "Sanjay's Boss: \"Ah ha - I caught you! Get back to work or you're fired!\""}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Tiwary,1 run,slower and on the pads, the batsman goes deep in the crease and flicks it to deep square leg"}, {"ball": 12.2, "isHighlight": false, "text": "Pavan Savoy: \"@Vipul: IT company project lead analogy doesn't make sense. High paid cricketers are huge stakeholders, some companies haven't even broke even for the fee paid to buy the teams to BCCI ! More apt would be comparing a high paid VP for a s/w company. He would be FIRED instantly by most companies.\""}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Nadeem,no run,another slower one outside off, the batsman cuts it straight to point"}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Nadeem,1 run,the slower slower ball this one, the batsman looks to drag it to the on side, gets an inside edge down to short fine leg"}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Tiwary, $$SIX$$ ,another slower slower ball, but this time Tiwary makes some momentum by coming out of the crease and hammers it long over the cow corner"}, {"ball": 12.5, "isHighlight": false, "text": "Dex: \"@ ALL who have issue with what players are being paid - maybe a performance based salary structure is what is required here. X amount of dollars paid to a player for reaching to certain milestones - would make for interesting cricket wouldn't you say? \""}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Tiwary,1 run,tossed up outside off, the batsman paddles it to short fine leg"}, {"ball": 13.1, "isHighlight": false, "text": "Cutting to Tiwary,1 run,fires a yorker on the middle stump, the batsman gets an inside edge to his pads, it rolls over the off side and they take a single"}, {"ball": 13.2, "isHighlight": false, "text": "Cutting to Nadeem, $$OUT$$ ,Cutting's day is following a sine wave! It's heading towards the crest now, this one is full and swinging, beats the bat and hits the leg stump"}, {"ball": 13.2, "isHighlight": false, "text": "$$S$$ $$Nadeem$$ $$b$$ $$Cutting$$ $$1$$ $$(3m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$25.00$$"}, {"ball": 13.3, "isHighlight": false, "text": "Cutting to Imran Tahir,no run,he is getting nice inswing in these yorkers, the batsman digs it out down the pitch"}, {"ball": 13.4, "isHighlight": false, "text": "Cutting to Imran Tahir, $$FOUR$$ ,this is not quite a yorker, a half-volley and Tahir creams it through the gap at cover"}, {"ball": 13.5, "isHighlight": false, "text": "Cutting to Imran Tahir,no run,slower bouncer outside off, Tahir sways away from the line"}, {"ball": 13.6, "isHighlight": false, "text": "Cutting to Imran Tahir,no run,length ball, comes in towards off stump, the batsman defends"}, {"ball": 13.6, "isHighlight": false, "text": "Pritam: \"Gaah! Why does one team have to be so unfathomably awful every season? When will we have a season when no one team becomes an undisputed wooden spooner?\""}, {"ball": 13.6, "isHighlight": false, "text": "Binny has been sighted with the ball"}, {"ball": 14.1, "isHighlight": false, "text": "Binny to Tiwary,no run,length delivery on off, the batsman dabs it straight to point"}, {"ball": 14.1, "isHighlight": false, "text": "Swaroop Bachall: \"Bhatia bowls so slow that if he extends his follow through, he will reach the other before the ball does.\""}, {"ball": 14.2, "isHighlight": false, "text": "Binny to Tiwary,1 run,length delivery on the stumps, the batsman punches it to deep midwicket for a single"}, {"ball": 14.2, "isHighlight": false, "text": "The pitch has been a very slow one, Smith was right.. it has lost all the zing now"}, {"ball": 14.3, "isHighlight": false, "text": "Binny to Imran Tahir,no run,length delivery on the stumps, pushes to midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Binny to Imran Tahir, $$OUT$$ ,Tahir walks all the way to the off side to play a ramp, Binny keeps it straight and simple and preys on Tahir's error.. The batsman misses and the ball smashes the off stick"}, {"ball": 14.4, "isHighlight": false, "text": "$$Imran$$ $$Tahir$$ $$b$$ $$Binny$$ $$4$$ $$(15m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 14.4, "isHighlight": false, "text": "DM: \"You have to understand, Since the auction is pre-tournament, there IS a performance based salary structure, only thing is that the salaries are based on past performances."}, {"ball": 14.5, "isHighlight": false, "text": "Binny to Shukla,1 run,fuller delivery on the pads, Shukla flicks and picks a single to deep square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Binny to Tiwary,1 run,fuller one on off, the batsman wrists it to deep midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Sean: \"@Dex - I don't think a performance based salary is feasible. It would be inherently biased against players who are promoted / demoted from their normal playing position and fail. Let's say Kings XI had an opening partnership that lasted 17 overs and Maxwell was promoted but got out first ball, how is that system fair to him? It works for things like most runs, most wickets, and most sixes only.\""}, {"ball": 15.1, "isHighlight": false, "text": "Kulkarni to Tiwary,1 run,Kulkarni brings in some welcome pace, the batsman whips it to deep square leg easily"}, {"ball": 15.2, "isHighlight": false, "text": "Kulkarni to Shukla,1 run,short ball on the body, the batsman looks to pull it fine, but gets a glove that drops just before the keeper.. They take a single as the keeper tries to rearrange himself"}, {"ball": 15.3, "isHighlight": false, "text": "Kulkarni to Tiwary,no run,length delivery on the stumps, defended from the crease"}, {"ball": 15.3, "isHighlight": false, "text": "Mahesh: \"What a co-incidence! Quikr is sponsor of Delhi DareDevils. \""}, {"ball": 15.4, "isHighlight": false, "text": "Kulkarni to Tiwary,1 leg bye,slower bouncer, Tiwary looks to drag it to the leg side but takes a blow to his chest"}, {"ball": 15.4, "isHighlight": false, "text": "Pat: \"Bhatia bowls so slow that he can save time for his team and go back to his run up for the next delivery before the previous bowl reaches the batsman.\""}, {"ball": 15.5, "isHighlight": false, "text": "Kulkarni to Shukla,1 run,fires in a yorker, the batsman digs it out to midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Kulkarni to Tiwary,1 wide,another slower bouncer, it bounces over the batsman's head like this was Roland Garros surface"}, {"ball": 15.6, "isHighlight": false, "text": "Badri: \"Hope Bhatia doesnt bowl so slow that the batsment steal a bye before the ball reaches the striker's end...\""}, {"ball": 15.6, "isHighlight": false, "text": "Kulkarni to Tiwary,1 run,another yorker, the batsman pushes it to mid-off for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Anuj: \"@Sean In the long run everything will be even out\" ---- In the long run, we are all dead."}, {"ball": 15.6, "isHighlight": false, "text": "Krish: \"Bhatia bowls so slow that if he doesnt like the delivery that has come out of his hand, he will stop the ball midway and go back to his bowling mark to bowl again!!\""}, {"ball": 16.1, "isHighlight": false, "text": "Cooper to Tiwary,1 run,length delivery, the batsman charges out and smashes it back to the bowler, Cooper leaps up and gets both hands to it, but can't complete the catch"}, {"ball": 16.2, "isHighlight": false, "text": "Cooper to Shukla, $$FOUR$$ ,a low full toss, this is hammered down the ground for a boundary"}, {"ball": 16.3, "isHighlight": false, "text": "Cooper to Shukla,no run,swing and a miss, it bounces over the middle stump"}, {"ball": 16.3, "isHighlight": false, "text": "Rohit: \"Bhatia bowls so slowly that they should use the time it takes for the ball to reach the batsman to complete strategic time out's. :P\""}, {"ball": 16.4, "isHighlight": false, "text": "Cooper to Shukla,no run,a yorker now, the batsman gets a bat to it and then it ends up to the right of the keeper. The batsman had no clue"}, {"ball": 16.5, "isHighlight": false, "text": "Cooper to Shukla,1 run,a low full toss, this is powered down to long off"}, {"ball": 16.6, "isHighlight": false, "text": "Cooper to Tiwary, $$FOUR$$ ,short slower delivery, Tiwary picks up a boundary with a neat little steer through first slip region"}, {"ball": 16.6, "isHighlight": false, "text": "Prashant: \"Bhatia is bowling sooo.. sloooww... zzz... er \""}, {"ball": 17.1, "isHighlight": false, "text": "Binny to Shukla, $$FOUR$$ ,another boundary! Cutting slides at wide long-off but is not able to stop that one.. Oh well, Cutting is turning out to be quite a mixed bag"}, {"ball": 17.2, "isHighlight": false, "text": "Binny to Shukla,1 run,length ball, swung over to deep midwicket for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Binny to Tiwary,1 run,low full toss, driven down to wide long-on for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Abhinav Prakash: \"Bhatia balls so slow that by the time his one ball reaches batsman another bowler can complete a over from other side. \""}, {"ball": 17.4, "isHighlight": false, "text": "Binny to Shukla,no run,this is almost a yorker, the batsman pushes it back to the bowler"}, {"ball": 17.5, "isHighlight": false, "text": "Binny to Shukla,1 run,offcutter, the batsman pulls it down to deep backward square leg, reaches Cooper on the bouncer"}, {"ball": 17.6, "isHighlight": false, "text": "Binny to Tiwary, $$FOUR$$ ,looks to play the reverse paddle but gets an underedge past keeper for another boundary"}, {"ball": 17.6, "isHighlight": false, "text": "SidModi: \"Bhatia bowls so slow that replays are fast forwarded!\""}, {"ball": 18.1, "isHighlight": false, "text": "Cooper to Shukla, $$OUT$$ ,he gets a low full toss and he smashes it straight to extra cover, Smith takes an easy one"}, {"ball": 18.1, "isHighlight": false, "text": "$$R$$ $$Shukla$$ $$c$$ $$Smith$$ $$b$$ $$Cooper$$ $$14$$ $$(8m$$ $$12b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 18.2, "isHighlight": false, "text": "Cooper to Kaul,1 run,length delivery on off, the batsman pushes it to deep cover for a single"}, {"ball": 18.3, "isHighlight": false, "text": "Cooper to Tiwary,no run,bowls a yorker, the batsman digs it out to cover"}, {"ball": 18.3, "isHighlight": false, "text": "Roy: \"Bhatia is the only slow bowler whose full quota of 4 overs can hurt a team's over-rate\""}, {"ball": 18.4, "isHighlight": false, "text": "Cooper to Tiwary,no run,wants to drag this one from outside off to the leg side, misses it completely"}, {"ball": 18.5, "isHighlight": false, "text": "Cooper to Tiwary, $$FOUR$$ ,slower ball outside off, Tiwary drags this to deep backward square leg boundary"}, {"ball": 18.5, "isHighlight": false, "text": "rssampat: \"Bhatia bowls so slowly, that he bowls in this game and the ball arrives in the next game!\""}, {"ball": 18.6, "isHighlight": false, "text": "Cooper to Tiwary,1 run,meanwhile Tiwary gets to his  $$half-century$$  with a push to deep cover"}, {"ball": 18.6, "isHighlight": false, "text": "Albert Einstein: \"The extremely slow speed of Rajat Bhatia's delivery can cause the time itself to slow down, causing time (along with my interest in his performance) to dilate\""}, {"ball": 19.1, "isHighlight": false, "text": "Kulkarni to Tiwary,1 run,he comes round the wicket and fires it on the blockhole, the batsman digs it out to long on"}, {"ball": 19.2, "isHighlight": false, "text": "Kulkarni to Kaul,1 run,comes back over the wicket, the batsman steers it to third man for a single"}, {"ball": 19.3, "isHighlight": false, "text": "Kulkarni to Tiwary,2 runs,slower delivery, swung across the line to deep square leg.. There was a mix-up, but Binny's wild throws allows them to complete the second easily"}, {"ball": 19.3, "isHighlight": false, "text": "Krithikou: \"Guys, batsmen are still on the lookout for the ball Bhatia bowled in IPL 2009. It is yet to reach the other end.\""}, {"ball": 19.4, "isHighlight": false, "text": "Kulkarni to Tiwary,1 wide,fires this wide down the leg side"}, {"ball": 19.4, "isHighlight": false, "text": "Prabhat: \"Bhatia bowls so slow that Sanjay can actually do his work before the ball reaches the batsman and not get fired for being non productive!!!\""}, {"ball": 19.4, "isHighlight": false, "text": "Kulkarni to Tiwary, $$SIX$$ ,a low full toss on the pads, Tiwary takes some bonus runs, hoicking it over deep midwicket"}, {"ball": 19.5, "isHighlight": false, "text": "Kulkarni to Tiwary,2 runs,yorker length, the batsman punches it to deep midwicket and calls for a second.. Tiwary loses his bat at the other end"}, {"ball": 19.6, "isHighlight": false, "text": "Kulkarni to Tiwary,no run,bowls it wide outside off and the game is over"}, {"ball": 19.6, "isHighlight": false, "text": "There hasn't been a one-sided match as this one this year. It got over almost 10 overs ago. Rajasthan Royals continue to stick to the other two teams at the top of the table while Delhi Daredevils keep plummeting to depths unknown. The match, it seemed, was played on two surfaces - Royals scored over 200 with ease. Then Daredevils just couldn't get the innings going on this slow surface."}, {"ball": 19.6, "isHighlight": false, "text": "Thanks for your comments and feedback; they made the second half entertaining. Enjoy the two-day rest. We will be back soon. Devashish Fuloria signing off. Ciao ciao."}, {"ball": 19.6, "isHighlight": false, "text": "$$Steven$$ $$Smith$$  says, \"It was outstanding. I didn't have to do anything, sit on the sidelines and just field. it was perfect. I thought the wicket would slow up a bit and the bowlers bowled beautifully. It was a clinical performance all round. We like to target our opposition, the better players you know, and it has worked fine.. we hope to continue in the business end.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Rahane$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ . He says, \"Really enjoyed batting here. After first six overs, the wicket got a bit slow. We didn't really talk about targets during time out. We just wanted to back ourselves and stay positive. We just want one guy to bat till the end, today it was my turn.\""}, {"ball": 19.6, "isHighlight": false, "text": "\"I'd probably hold my hand and say that I got it wrong at the toss,\"  $$says$$ $$KP$$ . \"The pitch got a lot slower. It's not going according to the plan. We are not here to blame anybody. It's a young squad and we need to look to perform a lot better next year.\""}, {"ball": 19.6, "isHighlight": false, "text": "\"It's definitely a great feeling when you get KP or Taylor or Gambhir out,\"  $$says$$ $$Rajat$$ $$Bhatia$$ . \"I have never played for the country, but to get these big players out, is a great feeling. I thanks Royals for the opportunity. You know your role, that's why I am doing well.\""}, {"ball": 19.6, "isHighlight": false, "text": "paul: \"Provided K P They keep u for next year !!\""}, {"ball": 19.6, "isHighlight": false, "text": "Sandeep Sundar: \"What's wrong with the Delhi Daredevils? They started this year's auction from the scratch! Put-together a brand new team! But nothing has changed their fortune or skills! \""}, {"ball": 19.6, "isHighlight": false, "text": "Rij: \"This was a good pitch for batting, until Bhatia came to bowl. His deliveries were too slow for the pitch, so it turned slower and slower to keep up with his deliveries. \""}, {"ball": 19.6, "isHighlight": false, "text": "dk: \"bhatia once bowled to sachin. now his son arjun is preparing to face the same ball.\""}, {"ball": 19.6, "isHighlight": false, "text": "Bhawesh: \"Mathematically put, Speed of Light X Speed of Bhatia = 1\""}], "name": "Rajasthan Royals v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734011.html?innings=2;view=commentary", "match_num": 41}