{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$3.55$$ $$pm$$  \"I am sure it will be Ashwin or Badree vs Gayle in the first over,\" Mubin Faiz, Chennai are batting right now. So we'll have to wait on your prediction. For now, it will be Muthiah Muralitharan against Brendon McCullum and Dwayne Smith"}, {"ball": 0, "isHighlight": false, "text": "Swami: \"The last thing you'd want to see when you wake up at 4am on a Sunday is Danny Morrison screaming at you.\""}, {"ball": 0, "isHighlight": false, "text": "Kriti: \"You could use \"finisher\" in various ways - is it the guy who brings it home from 10+ overs out (like Michael Bevan) or someone who can take a few balls to settle in and then whack it around (like Lance Klusener). I would favor De Villiers for a longer finisher role because of his versatility in shot selection, but Dhoni for pure brutality towards the end (especially when we see more fast bowlers bowling). To be fair though, Dhoni has had his fair share long finishing.\""}, {"ball": 0, "isHighlight": false, "text": "Vivek: \"@ram, But remember abd hammered steyn twice..!\" Poor Steyn. he's not going to like this debate at all."}, {"ball": 0, "isHighlight": false, "text": "$$3.45$$ $$pm$$  \"Maybe MSD has scored less runs than ABD this IPL but when it comes to chasing 25 odd from 2 overs time and again, who would you go with? MSD is the obvious choice.\" Way to stick your neck out, Aravinth"}, {"ball": 0, "isHighlight": false, "text": "Ram: \"To all those lauding AB for destroying Steyn, let me remind you that Dhoni did the same thing a few IPLs ago. 20-odd in an over off Steyn--I remember it vividly.\"  Four players have hit Steyn for 2 or more sixes in the entire IPL - Dhoni (5), ABD (4), Bailey (2) and Manan Vohra (2)"}, {"ball": 0, "isHighlight": false, "text": "Srinath: \"CSK have left out their best ever fielder of this tournament - faf..! in a way david hussey is a great fielder too!\" Faf did suffer a bit of a leg injury in his last innings and Dhoni was taking no chances so close to the playoffs"}, {"ball": 0, "isHighlight": false, "text": "\"Competition between Ashwin and Gayle? In running between wickets?\" I'd pay to see that, Venkat. Let's set it up"}, {"ball": 0, "isHighlight": false, "text": "Hitesh: \"I think ABD nicks it on the pazzazz factor considering what he's done to the likes of steyn although MSD is more consistent\""}, {"ball": 0, "isHighlight": false, "text": "karthik: \"\" I think Ashwin has a larger role to play in today's match, keeping in view of \"left-handed RCB team\" and \"slow pitch in ranchi\".\""}, {"ball": 0, "isHighlight": false, "text": "$$3.30$$ $$pm$$ $$Chennai$$ $$Super$$ $$Kings$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$will$$ $$bat$$  MS Dhoni says the pitch might slow down and it's an afternoon game as well. \"I've taken the competition away from you,\"  he says when Morrison asked about their latest recruit,  $$David$$ $$Hussey$$ $$who$$ $$comes$$ $$in$$ $$for$$ $$Faf$$ $$du$$ $$Plessis$$ . Vijay Shankar sits out for Mithun Manhas.  $$RCB$$ $$have$$ $$included$$ $$Varun$$ $$Aaron$$ $$in$$ $$place$$ $$of$$ $$Vijay$$ $$Zol$$"}, {"ball": 0, "isHighlight": false, "text": "Virat Kohli says there's only been a couple of games where their bowlers haven't been up to the mark. \"It's all about backing them at the right times and they've delivered for us.\" Says it's lovely to see Yuvraj Singh playing the way he is. \"We all know how strong a character he is\""}, {"ball": 0, "isHighlight": false, "text": "Janarthan: \"We are speaking about MSD and ABD only. How about a contest between Ashwin and Gayle?. Waiting to see that\""}, {"ball": 0, "isHighlight": false, "text": "$$3.25$$ $$pm$$  Two of the best batting line-ups in the tournament take aim at each other and we threw the spotlight on their  $$finishers$$ . Where's your vote at? MS Dhoni or AB de Villiers?"}, {"ball": 0, "isHighlight": false, "text": "Siddartha Khand: \"So this is a a south-Indian derby led by lads from the eastern and Northern part of India, played at the eastern part of India as well. Talk about diversification IPL has bought to us.\""}, {"ball": 0, "isHighlight": false, "text": "OMPRAKASH KHOJA: \" Most awaited & Biggest encounter of the the Ipl.... Captain Cool vs Captain Hot !!!!\" Yes, it seems the enthusiasm has not dimmed one bit."}, {"ball": 0, "isHighlight": false, "text": "\"There you go.. Battle for the survival for Kohli & Team.. \" For a more detailed analysis than Mr Famzy, delve into Kanishkaa Balachandran's  $$preview$$"}, {"ball": 0, "isHighlight": false, "text": "$$3.15$$ $$pm$$  It's baaaack. Right, strap yourself in. throw away the key, forget about all the tumult that's happened over the past few days (a cricket ball was sent  $$into$$ $$space$$ , for heavens' sake!), we've got the Chennai Super Kings hosting Royal Challengers Bangalore in Ranchi. Or as Danny Morrison put it \"the riviera of Ranchi.\" It's going to be that kind of day. This is Alagappan Muthu and I shall be your  $$stipulated$$ $$nonsense$$ $$spewer$$  commentator for the evening."}, {"ball": 0, "isHighlight": false, "text": "------------------"}, {"ball": 0, "isHighlight": false, "text": "$$CricIQ$$  Powerplay 4 ends today. Can you slug away a couple of sixes in the last over to get to the top of that leaderboard?  $$Take$$ $$your$$ $$three$$ $$shots$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Muralitharan to Smith,no run,starts around the wicket as he flights it on middle and leg, Smith looks to flick through midwicket and misses. Leg before appeal turned down"}, {"ball": 0.2, "isHighlight": false, "text": "Muralitharan to Smith,1 run,manages to tickle one to short fine leg and get off strike. Murali looking to cramp the batsman up"}, {"ball": 0.2, "isHighlight": false, "text": "Chris Gayle is at slip"}, {"ball": 0.3, "isHighlight": false, "text": "Muralitharan to McCullum,no run,looped up on middle, Baz strides forward to block"}, {"ball": 0.4, "isHighlight": false, "text": "Muralitharan to McCullum, $$SIX$$ ,lashed down the ground and it goes all the way! Affords a little bit more room on this occasion and there is no spin so early in the innings. Baz hit through the line with no thought of keeping it down"}, {"ball": 0.5, "isHighlight": false, "text": "Muralitharan to McCullum,no run,pushes it through on leg stump, he tries to work it to fine leg but wears it on the pad"}, {"ball": 0.6, "isHighlight": false, "text": "Muralitharan to McCullum,no run,keeps it to a good length, but he keeps it on leg again. McCullum can't connect with the flick and is struck on the pad again"}, {"ball": 0.6, "isHighlight": false, "text": "Kannan: \"Its a very looong tail for RCB today- with Rana coming at No:6 ! Maybe they were expecting to win the toss and bat first\" Yes they were"}, {"ball": 0.6, "isHighlight": false, "text": "Vinay: \"I would love to see Danny Morrison screaming at me 4 am in the morning! Wouldn't need a cup of tea to wake me :)\""}, {"ball": 1.1, "isHighlight": false, "text": "Starc to Smith,no run,has a slash and misses. Starc works the angle across the right-hander and gets a moral victory"}, {"ball": 1.2, "isHighlight": false, "text": "Starc to Smith,no run,did him in again! This one is a little closer to off and Smith was looking to tap it past the slips to third man. Just back of a good length ball skims past the open face"}, {"ball": 1.3, "isHighlight": false, "text": "Starc to Smith,no run,three in a row! Smith plants his front leg down and looks to maul the full and wide delivery over mid-off. No dice"}, {"ball": 1.4, "isHighlight": false, "text": "Starc to Smith,1 run,this is a terrific over. It's a yorker dead on off stump this time. Smith manages to intervene and has hit is soft enough into the off side to take refuge at the other end"}, {"ball": 1.5, "isHighlight": false, "text": "Starc to McCullum,no run,targets middle and off with a good length ball, Baz blocks towards point"}, {"ball": 1.6, "isHighlight": false, "text": "Starc to McCullum,no run,belted to mid-off as he runs down the track and turns a length ball into a half-volley."}, {"ball": 1.6, "isHighlight": false, "text": "\"For me Smith is not in form today,he's going to pavilion below 20.\" says trigger-finger Harshil. it's Varun Aaron now"}, {"ball": 2.1, "isHighlight": false, "text": "Aaron to Smith,1 run,arches himself back to get enough room to guide a shortish ball outside off to deep third man"}, {"ball": 2.2, "isHighlight": false, "text": "Aaron to McCullum,no run,not too much footwork there as Aaron fires it in full and straight. Baz looks to smash it over mid-on but inside-edges onto his back pad. Lucky"}, {"ball": 2.3, "isHighlight": false, "text": "Aaron to McCullum,1 run,nips down the track and Aaron angles it into the pads, flicked calmly through square leg"}, {"ball": 2.4, "isHighlight": false, "text": "Aaron to Smith, $$FOUR$$ ,that was punched! And he held his pose, head down, high front elbow. Straight drive from the top draw. Although the bowler did err by pitching it up too much and his power did the rest"}, {"ball": 2.5, "isHighlight": false, "text": "Aaron to Smith,1 run,goes short and has Smith in a little bit of trouble. He was slow on the flat-batted swipe and gets a bit of an edge towards extra cover"}, {"ball": 2.6, "isHighlight": false, "text": "Aaron to McCullum, $$SIX$$ ,top edge for six, it's not an IPL match without one. Aaron goes short and gets some decent pace and height on this. But to his chagrin, this flies off Baz's bat and over the fine leg boundary comfortably"}, {"ball": 2.6, "isHighlight": false, "text": "Neeraj Pujari: \"Inspite of the news of the pitch getting slow as the day progresses, no target however big it is would be difficult for RCB with players like Gayle, Kohili, AB and Yuvi in their team. Go Go RCB !\""}, {"ball": 2.6, "isHighlight": false, "text": "Abu Nechim now, RCB are ringing in the changes"}, {"ball": 3.1, "isHighlight": false, "text": "Ahmed to Smith,no run,goes full and straight, Smith looks to hack it through midwicket but mistimes it. Finds the fielder"}, {"ball": 3.2, "isHighlight": false, "text": "Ahmed to Smith,1 leg bye,angled into the pads and Smith looks for the whip. After being a little slow on the shot, he has to settle for a leg bye behind point"}, {"ball": 3.2, "isHighlight": false, "text": "d84h: \"@harshil He never looks like inform,but still manages to hit 40s and 50s almost everytime\""}, {"ball": 3.3, "isHighlight": false, "text": "Ahmed to McCullum,1 run,that was a chance! And AB doesn't hit the target! It was pushed into the covers and they made a bit of late decision for the single. The fielder rushes in and sort of looped the throw past the stumps. Where was the one-bounce hurl?"}, {"ball": 3.4, "isHighlight": false, "text": "Ahmed to Smith,no run,keeps attacking the stumps and Smith keeps it out"}, {"ball": 3.5, "isHighlight": false, "text": "Ahmed to Smith,1 run,waits on his back foot and turns it away through midwicket"}, {"ball": 3.6, "isHighlight": false, "text": "Ahmed to McCullum,1 run,full and a little bit of room on offer, Baz says thank you with a slap to long-off"}, {"ball": 4.1, "isHighlight": false, "text": "Aaron to McCullum, $$FOUR$$ ,finally trickles into the midwicket boundary. Dances down to one just back of a good length and went through with a loft. Didn't get it off the middle, but he picked the gap well enough to reap dividends"}, {"ball": 4.2, "isHighlight": false, "text": "Aaron to McCullum, $$OUT$$ ,tees off again and when Starc is in the vicinity you'd better tuck your bat under your arms and walk off. Back of a length again from the bowler and Baz cleared his front leg to flay it over midwicket. But this time there was a man there"}, {"ball": 4.2, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$Starc$$ $$b$$ $$Aaron$$ $$19$$ $$(19m$$ $$13b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$146.15$$"}, {"ball": 4.3, "isHighlight": false, "text": "Aaron to Smith,no run,takes it from the off stump and flicks the shortish ball to square leg"}, {"ball": 4.4, "isHighlight": false, "text": "Aaron to Smith, $$OUT$$ ,another one and Aaron has paid off in his call back and how! Hurried into him with a short ball and Smith's pull skews off a top edge. AB's at cover and picks up a simple reverse-cup catch"}, {"ball": 4.4, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Aaron$$ $$9$$ $$(21m$$ $$15b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 4.4, "isHighlight": false, "text": "David Hussey marks his guard. Suresh Raina is at the other end. Two brand new batsman."}, {"ball": 4.4, "isHighlight": false, "text": "SDHegde: \"Nice skiddy and fast bowling from the local boy!!\""}, {"ball": 4.5, "isHighlight": false, "text": "Aaron to Hussey,no run,full and straight, nudged to mid-on with a lot of wrist work"}, {"ball": 4.6, "isHighlight": false, "text": "Aaron to Hussey,no run,gets behind a slower short ball and blocks on middle"}, {"ball": 4.6, "isHighlight": false, "text": "Raghu Ifmr: \"\"Fleming : Alright David, you're up. Show them why we picked you instead of anyone from the rest of 20 odd players in our squad.\" Well, he is the third-highest run-scorer in T20s"}, {"ball": 5.1, "isHighlight": false, "text": "Starc to Raina, $$FOUR$$ ,gifts a full toss on the pads and Raina has casually clipped it off his legs. The yorker gone wrong and that's just about the best ball a new batsman can get"}, {"ball": 5.2, "isHighlight": false, "text": "Starc to Raina, $$FOUR$$ ,ducks back in but Raina is able to ride the bounce and the late cut just scurries away. Third man had no chance"}, {"ball": 5.3, "isHighlight": false, "text": "Starc to Raina,1 run,gets behind the good length ball and Raina is a little tentative in defence. Gets an inside edge to long leg"}, {"ball": 5.3, "isHighlight": false, "text": "Starc from around the wicket"}, {"ball": 5.4, "isHighlight": false, "text": "Starc to Hussey,no run,fullish and outside off, Huss uses the open blade to push into the covers"}, {"ball": 5.5, "isHighlight": false, "text": "Starc to Hussey,no run,bit of room, but Huss drives straight to cover. Sweet timing."}, {"ball": 5.5, "isHighlight": false, "text": "zafarjaveds: \"Guess David hussey must also be commentating too back of his mind while batting!\""}, {"ball": 5.6, "isHighlight": false, "text": "Starc to Hussey,1 run,there's his escape route. Full and angled into the pads, a neat little tickle to deep square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Murali's back."}, {"ball": 6.1, "isHighlight": false, "text": "Muralitharan to Hussey,no run,flighted outside off, Huss shuffles across and blocks"}, {"ball": 6.2, "isHighlight": false, "text": "Muralitharan to Hussey,1 wide,turns right across from middle and Huss almost lost his balance as he went for the flick. But he managed to get his back foot grounded"}, {"ball": 6.2, "isHighlight": false, "text": "Muralitharan to Hussey, $$FOUR$$ ,how did he not get that?! This was looped up on off stump and lured Huss into a cover drive. The ball gripped and turned and took the inside edge and lobbed over the stumps to the fine leg boundary"}, {"ball": 6.3, "isHighlight": false, "text": "Muralitharan to Hussey,no run,doosra now, pitched just outside off stump and Huss comes forward to block"}, {"ball": 6.4, "isHighlight": false, "text": "Muralitharan to Hussey,no run,pulls his length back but it's the one that turned the other way. Huss is on the back foot as he blocks"}, {"ball": 6.5, "isHighlight": false, "text": "Muralitharan to Hussey,no run,rips from outside off and Huss tries to nudge it away off his knees. Murali's begun spinning that old web"}, {"ball": 6.6, "isHighlight": false, "text": "Muralitharan to Hussey,1 run,a little shorter this time and Huss taps it down the ground to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "cskfan: \"atleast in times like these, mithun manhas must be given a chance to bat early..he is a valuable strike rotator\" Tweakers from both ends. Here's young Chahal. Slip in place"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Hussey,1 run,lovely flight and he targets off stump, Huss pushes to the sweeper on the off side"}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Raina,no run,stays on the back foot and steers the good length ball towards point"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Raina,no run,that's the googly and he was left groping for it. Open face of the bat following the flighted delivery outside off"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Raina,no run,on middle and leg and Raina covers his stumps and nudges into the on side"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Raina,1 run,tapped down the ground off the back foot as Chahal goes a little short"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Hussey,1 run,waited for it to turn and Huss goes deep in his crease and whips it down to long-on. Loads of wrist work there"}, {"ball": 8.1, "isHighlight": false, "text": "Ahmed to Hussey,1 run,dabbed past the keeper to deep third man. Nechim is the new bowler and he sticks to a channel just outside off"}, {"ball": 8.2, "isHighlight": false, "text": "Ahmed to Raina,1 run,fullish on off stump, Raina is forward with a straight bat and pushes to long-off"}, {"ball": 8.3, "isHighlight": false, "text": "Ahmed to Hussey,no run,can't beat extra cover as he pushes at a good length ball just outside off"}, {"ball": 8.4, "isHighlight": false, "text": "Ahmed to Hussey,1 run,pushed across him and Raina hangs his bat out to dry. Moved away off the seam there"}, {"ball": 8.5, "isHighlight": false, "text": "Ahmed to Raina,no run,that's a beaut! Pushed a back of a good length delivery across the left-hander and Raina just hung his bat out to dry. Little nip away off the seam does him in"}, {"ball": 8.6, "isHighlight": false, "text": "Ahmed to Raina,1 run,slower ball, picked and punched down the ground to long-off"}, {"ball": 8.6, "isHighlight": false, "text": "That's the time out, by the way"}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Raina,no run,flighted just outside off, driven into the covers"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Raina,1 run,tossed up just outside off and Raina drives down the ground to long-off"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Hussey,no run,big appeal from Chahal. This was the legspinner that pitched and turned. Huss flicks across the line and gets hit on the front pad, but it might not have turned enough"}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Hussey,1 run,this time he drifts a little too close to leg stump and it's picked away through square leg"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Raina,no run,tossed up on off stump, pushed down the ground"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Raina,1 run,whipped to the other side of the ground to long-on. Raina absolutely content with single"}, {"ball": 9.6, "isHighlight": false, "text": "Aaron into his third, starts around the wicket. This is the lowest score after 10 overs for CSK this season"}, {"ball": 10.1, "isHighlight": false, "text": "Aaron to Raina,1 run,just enough room on the shortish ball to be steered down to third man"}, {"ball": 10.2, "isHighlight": false, "text": "Aaron to Hussey,1 run,more work for third man as Huss stays leg side of the shortish ball and dabs at it"}, {"ball": 10.3, "isHighlight": false, "text": "Aaron to Raina,1 wide,short ball slid down the leg side, didn't rise anywhere near enough to trouble Raina. Should have been pulled for a boundary that"}, {"ball": 10.3, "isHighlight": false, "text": "Moazzam: \"Last three Overs 1 * * * 1 1 1 1 * 1 * 1 * 1 * 1 * 1 kings playing a binary game \""}, {"ball": 10.3, "isHighlight": false, "text": "Aaron to Raina, $$FOUR$$ ,this time he takes full toll. Drags this from outside off and the short ball is carted away to the square leg boundary. Again a short ball doesn't get enough height"}, {"ball": 10.4, "isHighlight": false, "text": "Aaron to Raina, $$FOUR$$ ,this was the cross-seamed delivery angled into the off stump, Raina holds his ground and steers this into the third man boundary"}, {"ball": 10.5, "isHighlight": false, "text": "Aaron to Raina,1 run,slower bouncer and Raina was into the shot way too early. Midway through the shot he takes evasive action and manages to pull the ball down to long leg"}, {"ball": 10.6, "isHighlight": false, "text": "Aaron to Hussey,no run,good length ball on middle, Huss defends down the ground. Although with a whole lot of wrist than necessary"}, {"ball": 10.6, "isHighlight": false, "text": "Murali to bowl around the wicket"}, {"ball": 11.1, "isHighlight": false, "text": "Muralitharan to Raina,2 runs,dances down the track and lashes it through short extra cover. And some brisk running gets them a couple"}, {"ball": 11.2, "isHighlight": false, "text": "Muralitharan to Raina, $$FOUR$$ ,drags this one down short and Raina goes deep in his crease and pulls to the square leg boundary. Fell on his back but thankfully he had timed it well"}, {"ball": 11.3, "isHighlight": false, "text": "Muralitharan to Raina,1 run,flighted on leg, nudged to short fine leg"}, {"ball": 11.4, "isHighlight": false, "text": "Muralitharan to Hussey,1 run,tossed up just outside off, Huss rushes down the pitch and chips it over the infield. Deep midwicket is on hand though"}, {"ball": 11.5, "isHighlight": false, "text": "Muralitharan to Raina,1 run,goes back to a good length ball, which grips and turns. Raina was looking for a flick and then stops himself as he lets the ball strike the bottom of the bat and picks up a single towards cover"}, {"ball": 11.6, "isHighlight": false, "text": "Muralitharan to Hussey,1 run,goes back and whips it from off stump down the ground to long-on"}, {"ball": 12.1, "isHighlight": false, "text": "Chahal to Hussey, $$SIX$$ ,that's his first six of the season and it clatters into the sightscreen. Just a little more flight and Huss gave himself room and carved it down the ground"}, {"ball": 12.2, "isHighlight": false, "text": "Chahal to Hussey,1 run,flighted on the pads, worked down to long-on"}, {"ball": 12.2, "isHighlight": false, "text": "\"His commentary is terrible, I can't believe you guys had him,\" says Baz of his new team-mate"}, {"ball": 12.3, "isHighlight": false, "text": "Chahal to Raina,no run,nips down the track a bit, but has to settle for a defensive push"}, {"ball": 12.4, "isHighlight": false, "text": "Chahal to Raina,1 run,this time there's more conviction behind the shot as he lofts down the ground to long-off. AB won't let it go through"}, {"ball": 12.5, "isHighlight": false, "text": "Chahal to Hussey,1 run,whoa! That's loads of turn! This was drifted in on middle and leg and Huss set up for the flick through midwicket. But after pitching the ball rips outside off and takes the outside edge to short third man"}, {"ball": 12.6, "isHighlight": false, "text": "Chahal to Raina, $$SIX$$ ,away she goes. Raina advances to the pitch and smites it with the turn into the crowd behind long-on"}, {"ball": 12.6, "isHighlight": false, "text": "Use the strategic time-out wisely. Get a couple of sixes in on  $$Powerplay$$ $$4$$ $$of$$ $$CricIQ$$ , and book your free ride to London to watch the Lord's Test. Considerable criticism of David Hussey, but keep in mind, this pitch is offering quite a bit of turn"}, {"ball": 12.6, "isHighlight": false, "text": "Raghu Ifmr: \"@Moazzam : Now, the last 3 overs 12, 10 and 15.. No more binaries, only boundaries\" Sachin Rana to bowl some medium pace"}, {"ball": 13.1, "isHighlight": false, "text": "Rana to Hussey,1 run,clipped away to deep square leg. Took it from off stump as he went back in his crease"}, {"ball": 13.1, "isHighlight": false, "text": "around the wicket. MSD is rocking forwards and backwards in the dugout. Is he nervous? Nah, he's smiling"}, {"ball": 13.2, "isHighlight": false, "text": "Rana to Raina,2 runs,full on off stump, turned away to deep midwicket."}, {"ball": 13.3, "isHighlight": false, "text": "Rana to Raina,1 run,angled down the leg side, tucked away to the right of short fine leg"}, {"ball": 13.4, "isHighlight": false, "text": "Rana to Hussey,1 run,set up for a slash over the off side, but the slower ball doesn't afford him enough room. Pushed down the ground for a single"}, {"ball": 13.5, "isHighlight": false, "text": "Rana to Raina,no run,\"Wait,\" cries Huss as Raina uses the open face to find short third man"}, {"ball": 13.6, "isHighlight": false, "text": "Rana to Raina, $$FOUR$$ ,this time he manages to beat Murali on his left. Waited for the slower, length ball and guided it so very fine. Didn't try to imbue power into the stroke. Murali runs after it and tries to pull out the big boot, but his efforts were in vain."}, {"ball": 14.1, "isHighlight": false, "text": "Muralitharan to Hussey,1 wide,goes for the sweep but there is too much turn on it for him to connect"}, {"ball": 14.1, "isHighlight": false, "text": "Muralitharan to Hussey,1 run,turned away behind square leg and Gayle finds it hard to get down and employs the boot"}, {"ball": 14.2, "isHighlight": false, "text": "Muralitharan to Raina,1 run,chips down the track and pushes down to long-off"}, {"ball": 14.3, "isHighlight": false, "text": "Muralitharan to Hussey, $$OUT$$ ,do not hit it in the air to Mitchell Starc in the outfield. Period. This was a little short and Huss saw an easy escape as he pulls, but he picked the man almost perfectly"}, {"ball": 14.3, "isHighlight": false, "text": "$$DJ$$ $$Hussey$$ $$c$$ $$Starc$$ $$b$$ $$Muralitharan$$ $$25$$ $$(45m$$ $$29b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$86.20$$"}, {"ball": 14.3, "isHighlight": false, "text": "MSD's in da house!"}, {"ball": 14.4, "isHighlight": false, "text": "Muralitharan to Raina,1 run,good length ball, turning from leg stump. Defended into the covers and they almost collide with each other in the search for a quick single"}, {"ball": 14.5, "isHighlight": false, "text": "Muralitharan to Dhoni,no run,backs away a touch and taps it into the covers"}, {"ball": 14.6, "isHighlight": false, "text": "Muralitharan to Dhoni,2 runs,flighted just outside off, Dhoni comes forward and works it to long leg for a couple"}, {"ball": 14.6, "isHighlight": false, "text": "Sam: \"MSD? I was expecting Ashwin!! ;)\""}, {"ball": 14.6, "isHighlight": false, "text": "OMPRAKASH KHOJA: \"looking at tha slowness of the ranchi pitch ..its going to be very difficult for rcb...\" Badree, Ashwin, Jadeja and I bet Raina will roll his arm over as well"}, {"ball": 15.1, "isHighlight": false, "text": "Chahal to Raina,1 leg bye,flighted but on the pads, Raina sweeps but doesn't connect properly. But Dhoni is quick to hurtle across to the other end"}, {"ball": 15.2, "isHighlight": false, "text": "Chahal to Dhoni,no run,loopy legspinner which drifts in on the pads, Dhoni, wary of the turn he gets, defends"}, {"ball": 15.3, "isHighlight": false, "text": "Chahal to Dhoni, $$FOUR$$ ,swept fine and it has enough legs to reach the boundary. Not quite as well flighted and Dhoni puts it away with minimum fuss"}, {"ball": 15.4, "isHighlight": false, "text": "Chahal to Dhoni,1 run,better line and Dhoni pushes the tossed up delivery on middle down to long-off"}, {"ball": 15.4, "isHighlight": false, "text": "Murali: \"Murali is still unplayable, at times. The only worry is that he is unable to field well enough to keep his place. Age is something that takes toll on all. But he is a gem.\""}, {"ball": 15.5, "isHighlight": false, "text": "Chahal to Raina,no run,wanders down the track, but Chahal pulled the length back and almost had his man. This was the googly and Raina just about got bat to ball"}, {"ball": 15.6, "isHighlight": false, "text": "Chahal to Raina,1 run,a little shorter so Raina has a little more time to read the wrong 'un and steer it past point"}, {"ball": 15.6, "isHighlight": false, "text": "Abu Nechim comes back"}, {"ball": 16.1, "isHighlight": false, "text": "Ahmed to Raina,1 run,offers a full and wide delivery which is driven to extra cover to bring up his fifty, his second of the season"}, {"ball": 16.2, "isHighlight": false, "text": "Ahmed to Dhoni, $$OUT$$ ,short ball and Dhoni has slapped it straight into the hands of point. Gayle dives, and if that isn't news enough, Super Kings' trump card walks back after six balls. No finishing today."}, {"ball": 16.2, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ $$c$$ $$Gayle$$ $$b$$ $$Ahmed$$ $$7$$ $$(8m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 16.2, "isHighlight": false, "text": "Bruce Lee: \"@Omprakash Khoja: \"Khoja\" I think you are lost dude, Yuvi looks in superb form and we all know how dangerous he can be against the spinners.\" Here's Ravi Jadeja. He's pretty good at this stage of an innings"}, {"ball": 16.3, "isHighlight": false, "text": "Ahmed to Jadeja,no run,goes around the wicket to the left-hander. Gets a short of a good length delivery to just nip away off the seam late enough for Jaddu to flash and miss"}, {"ball": 16.3, "isHighlight": false, "text": "He was set up to take strike and then backs away at the very last minute. Nechim hadn't seen him and bowled a fuller one outside off"}, {"ball": 16.4, "isHighlight": false, "text": "Ahmed to Jadeja,1 run,this time he goes short and Jaddu pulls off the back foot. Single to deep square leg"}, {"ball": 16.4, "isHighlight": false, "text": "Indranil: \"Kohli needs a blue jersy..Dhoni needs 20th over with 10 runs required..Raina needs a yellow jersey...very choosy our players :P\""}, {"ball": 16.5, "isHighlight": false, "text": "Ahmed to Raina,no run,the wide yorker works. Raina goes down with it and tries to steer it away bit in vain"}, {"ball": 16.6, "isHighlight": false, "text": "Ahmed to Raina,1 run,full on off stump, Raina closed the face too early and gets a leading edge into the covers"}, {"ball": 16.6, "isHighlight": false, "text": "Pace now, here's Mitchell Starc"}, {"ball": 17.1, "isHighlight": false, "text": "Starc to Raina,1 run,goes for a front-foot pull and connects a little too high for his liking. Travels a good distance in the air, but long-on is back"}, {"ball": 17.2, "isHighlight": false, "text": "Starc to Jadeja,1 run,full and outside off, Jaddu comes forward and whips it to deep square leg"}, {"ball": 17.3, "isHighlight": false, "text": "Starc to Raina,no run,fullish and outside off, Raina dabs with an open face and gets an inside edge which is reined in by the keeper"}, {"ball": 17.4, "isHighlight": false, "text": "Starc to Raina,2 runs,hurls in a yorker on middle, Raina gets an inside edge towards deep square leg"}, {"ball": 17.5, "isHighlight": false, "text": "Starc to Raina,1 run,keeps it full and straight and Raina benefits from another thick inside edge towards short fine leg"}, {"ball": 17.5, "isHighlight": false, "text": "Surprised RCB fan: \"What is Abu Nechim doing today 3 overs for 10 runs really!!!!\""}, {"ball": 17.6, "isHighlight": false, "text": "Starc to Jadeja,1 run,full and wide outside off, Jaddu looks to flay it through the covers but his middle isn't as obliging as his inside edge. The slower pitch is messing with the batsman's timing"}, {"ball": 18.1, "isHighlight": false, "text": "Ahmed to Jadeja,1 run,well bowled. Jaddu was down the track, but Nechim hurled a wide yorker and keeps him to a single"}, {"ball": 18.2, "isHighlight": false, "text": "Ahmed to Raina,1 run,angled in and it's a little too full, Raina gets his front foot down the pitch and drills it to long-on"}, {"ball": 18.3, "isHighlight": false, "text": "Ahmed to Jadeja,1 run,fullish and outside off, Jaddu powers it down to long-on for a single"}, {"ball": 18.4, "isHighlight": false, "text": "Ahmed to Raina,2 runs,uses the open face this time as he keeps it full and outside off. Gets a couple to cover."}, {"ball": 18.5, "isHighlight": false, "text": "Ahmed to Raina,2 runs,he's brilliant on the boundary! This was soundly hit as Raina moved across to off stump and carved it through the covers. Starc had to rush to his left and slide to keep it in the field of play."}, {"ball": 18.6, "isHighlight": false, "text": "Ahmed to Raina,1 run,goes for the wild hoick and gets a thick outside edge that skews off to deep third man"}, {"ball": 18.6, "isHighlight": false, "text": "What a spell from Nechim. Gets Dhoni and keeps his economy under five!"}, {"ball": 18.6, "isHighlight": false, "text": "Three men square on the off side"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Raina,1 run,fullish and wide outside off, Raina looks to blast it through the covers but ends up inside edging to short fine leg"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Jadeja,2 runs,drew him outside off and Jaddu is good enough to slice it over the three man patrolling the point region. Gayle runs after it, gets in front of the ball and flicks it back with his boot"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to Jadeja,2 runs,fullish on middle, Jaddu lashes it down the ground for a couple"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Jadeja,1 run,goes full and wide, Jaddu finds long-on."}, {"ball": 19.5, "isHighlight": false, "text": "Starc to Raina,no run,shortish and outside off, Raina looks to cut it away but misses completely"}, {"ball": 19.5, "isHighlight": false, "text": "Shashi Kant: \"21 balls since last boundary........who said t20 will kill test matchces\""}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Raina,1 leg bye,the perfect yorker on leg stump, Raina looks to turn it away square and gets banged on the boot. Starc goes up in appeal, but this would have slid down."}, {"ball": 19.6, "isHighlight": false, "text": "$$5.35$$ $$pm$$  MS Dhoni said it was going to be a slow pitch and he was right. But Royal Challengers Bangalore milked everything out of it. Yuzuvendra Chahal was miserly, Mitchell Starc was brilliant in the death and Abu Nechim bowled four crucially tight overs to ensure Super Kings could not manage any momentum. Suresh Raina survived out there, inside edges and all and has provided a total that \"is about par,\" says David Hussey"}, {"ball": 19.6, "isHighlight": false, "text": "AshDubai: \"The difference between todays total and CSK average totals is not to do with the pitch alone - Openers gone at 29 was the key.\""}, {"ball": 19.6, "isHighlight": false, "text": "Mustak: \"It was abu nechim not Sachin rana who bowled 4 critical overs\" Thanks for the spot (he was one of  $$many$$ ), it's been changed"}], "name": "Chennai Super Kings v Royal Challengers Bangalore", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734013.html?innings=1;view=commentary", "match_num": 42}