{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$5.45$$ $$pm$$  Chris Gayle and Parthiv Patel are RCB's openers. Mohit Sharma has the ball in hand. Slip and a gully in place"}, {"ball": 0.1, "isHighlight": false, "text": "Sharma to Gayle,1 run,back of a good length, but he directs it on the pads. Gayle taps it through midwicket to get off the mark"}, {"ball": 0.2, "isHighlight": false, "text": "Sharma to Patel,no run,gets a little seam away, but it was pushed a little too far across the left-hander for him to reach"}, {"ball": 0.3, "isHighlight": false, "text": "Sharma to Patel, $$FOUR$$ ,whistles away! Just a touch overpitched and all Patel did was push it down the ground. He's timed the ball impeccably well there"}, {"ball": 0.4, "isHighlight": false, "text": "Sharma to Patel,no run,the bowler makes the predictable adjustment as he pulls his length back and Parthiv can cut it to point"}, {"ball": 0.5, "isHighlight": false, "text": "Sharma to Patel, $$FOUR$$ ,he's having no trouble with this pitch. It was a poor ball though as he targeted the pads of the batsman. Parthiv whipped it away to square leg"}, {"ball": 0.5, "isHighlight": false, "text": "rssampat: \"Give Parthiv Patel a total of 140 to get on any surface and he will get you off to a very solid start without much risk.\""}, {"ball": 0.6, "isHighlight": false, "text": "Sharma to Patel,no run,good length ball on and around off stump, Parthiv uses the open face to find point"}, {"ball": 0.6, "isHighlight": false, "text": "R Ashwin from around the wicket"}, {"ball": 1.1, "isHighlight": false, "text": "Ashwin to Gayle,no run,gets turn early as he pitches on off stump. Gayle stays back and blocks away from the body"}, {"ball": 1.2, "isHighlight": false, "text": "Ashwin to Gayle,1 run,scoots in low at him as the surface gives off a puff of dust. Picked away into the midwicket region"}, {"ball": 1.3, "isHighlight": false, "text": "Ashwin to Patel,no run,flighted outside off, Parthiv drives into the covers"}, {"ball": 1.4, "isHighlight": false, "text": "Ashwin to Patel,no run,tons of turn there. He flights it just outside off and the ball grips and turns considerably. Parthiv came forward to block and he was nowhere close"}, {"ball": 1.5, "isHighlight": false, "text": "Ashwin to Patel,no run,how much did that last ball contribute to this shot. Goes for a reverse sweep as this is tossed up on middle. Managed a little bat on it which saves him from the leg before appeal"}, {"ball": 1.6, "isHighlight": false, "text": "Ashwin to Patel,no run,goes back as he sees this one on a length, but the turn away makes reach out. Gets it off the bottom of the bat as his attempted cut shot goes back to the bowler"}, {"ball": 2.1, "isHighlight": false, "text": "Badree to Gayle,1 run,flighted on middle and leg, turned away into the on side"}, {"ball": 2.2, "isHighlight": false, "text": "Badree to Patel,1 run,looped up on the pads again, Parthiv clips to deep square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Badree to Gayle,1 run,keeps to his leg stump and Gayle has clipped it easily to deep midwicket"}, {"ball": 2.4, "isHighlight": false, "text": "Badree to Patel,1 run,nudged into the midwicket region as Badree continues to tuck him up on leg stump"}, {"ball": 2.5, "isHighlight": false, "text": "Badree to Gayle,no run,backs way outside leg and goes for a laborious-looking sweep shot. Takes a while to get back up"}, {"ball": 2.6, "isHighlight": false, "text": "Badree to Gayle,no run,down the track and he's drilled it back to the bowler, who shells it. The crowd think it's a catch, but it was a bump ball."}, {"ball": 3.1, "isHighlight": false, "text": "Ashwin to Patel,no run,he's in his element. Flighted from around the wicket and it whizzes past the outside edge"}, {"ball": 3.2, "isHighlight": false, "text": "Ashwin to Patel,no run,grips into the pitch and Parthiv was backing away to cut, misses"}, {"ball": 3.3, "isHighlight": false, "text": "Ashwin to Patel, $$OUT$$ ,the sweep seems to be his get out of trouble shot, but this time it's caused his downfall. Ashwin gets a little more bounce and the ball loops off the back of the bat towards first slip"}, {"ball": 3.3, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$c$$ $$Raina$$ $$b$$ $$Ashwin$$ $$10$$ $$(12m$$ $$14b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$71.42$$"}, {"ball": 3.3, "isHighlight": false, "text": "Virat Kohli is at No.3"}, {"ball": 3.4, "isHighlight": false, "text": "Ashwin to Kohli,1 run,good length ball just outside off, Kohli shuffles across and flicks it through square leg"}, {"ball": 3.4, "isHighlight": false, "text": "Two slips for Gayle"}, {"ball": 3.5, "isHighlight": false, "text": "Ashwin to Gayle,no run,slows it up and Gayle is lured into a poke outside off. Soundly beaten. Amazing control of flight from Ashwin"}, {"ball": 3.6, "isHighlight": false, "text": "Ashwin to Gayle,1 run,flighted on off stump, but this time Gayle reaches far enough forward to block"}, {"ball": 3.6, "isHighlight": false, "text": "Raghu Ifmr: \"FINALLYYYYYY.. The off-spinner in Ashwin turns up for the IPL.. We missed you..\""}, {"ball": 4.1, "isHighlight": false, "text": "Badree to Gayle,no run,he has a slip in place, but the flighted delivery is at the pads. Gayle sweeps to short fine leg"}, {"ball": 4.2, "isHighlight": false, "text": "Badree to Gayle,no run,goes down the track, but Badree pulls his length back. Makes him block"}, {"ball": 4.3, "isHighlight": false, "text": "Badree to Gayle,1 run,ventures towards off stump and Gayle goes for another sweep. It's too full for the stroke and he gets an inside edge towards short fine leg"}, {"ball": 4.4, "isHighlight": false, "text": "Badree to Kohli,no run,this was the wrong 'un just outside off, Kohli goes back and pushes to the bowler"}, {"ball": 4.5, "isHighlight": false, "text": "Badree to Kohli,no run,another googly which skids onto the bat, Kohli dabs to short third man"}, {"ball": 4.6, "isHighlight": false, "text": "Badree to Kohli,no run,shortish and outside off, Kohli plays within himself as he cuts behind point"}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Gayle,no run,yorker on off stump! He didn't like Gayle moving around in the crease and fired one in. This had a little bit of drift in as well."}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Gayle,no run,he is unplayable here, tossed up on middle and Gayle prods forward to defend. But the ball rips across his outside edge"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Gayle,no run,just a touch short and Gayle looks to cut. Gets it off the bottom of the bat"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Gayle,no run,flighted outside leg, Gayle sweeps and can't connect"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Gayle,no run,backs away and cuts to the man at extra cover"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Gayle,no run,another beaut to end the over. Flighted on middle and off, Gayle nudges forward to block but is left groping as it turns past him into the keeper's gloves"}, {"ball": 5.6, "isHighlight": false, "text": "RCB are 17 for 1, the third lowest powerplay score in IPL"}, {"ball": 6.1, "isHighlight": false, "text": "Badree to Kohli,1 run,tossed up on middle, Kohli goes for the sweep and inside edges it to midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Badree to Gayle, $$SIX$$ ,he has mauled that! Allowed him the room to free his arms and Gayle has launched the length ball out of the park over midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Badree to Gayle,1 wide,slides one down the leg side and it's a little too far for Gayle to connect with a sweep"}, {"ball": 6.3, "isHighlight": false, "text": "Badree to Gayle,1 run,pushed through on the pads and Gayle works a single into the leg side"}, {"ball": 6.4, "isHighlight": false, "text": "Badree to Kohli,4 leg byes,looks like his role is to stifle the batsmen, but this leg stump line is leaking runs. Kohli goes for the sweep and has tickled it fine enough"}, {"ball": 6.5, "isHighlight": false, "text": "Badree to Kohli,1 run,flighted on middle and Kohli drives down the ground"}, {"ball": 6.6, "isHighlight": false, "text": "Badree to Gayle,2 leg byes,he was into the shot a few hours before the ball arrived. Runs off his thighs and Raina chases it down. Dives and pulls the ball back, but in the process had disturbed the advertising hoardings. So he takes the time to pull it back and then throws the ball. Absolute belief that Gayle can't run too fast"}, {"ball": 7.1, "isHighlight": false, "text": "Raina to Kohli,no run,good length ball to start Raina's spell and Kohli defends off the back foot"}, {"ball": 7.2, "isHighlight": false, "text": "Raina to Kohli,no run,punched towards mid-on"}, {"ball": 7.3, "isHighlight": false, "text": "Raina to Kohli,1 run,goes down the track, but this is pushed through flatter. Kohli whips it away to square leg"}, {"ball": 7.4, "isHighlight": false, "text": "Raina to Gayle,no run,pushes him back with a skidder on middle and leg, Gayle keeps it out"}, {"ball": 7.5, "isHighlight": false, "text": "Raina to Gayle,1 run,clipped away through to midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Muthu Kumar: \"I think RCB has to play out Ashwin and be satisfied with run-a-ball against Badree. Other than these two bowlers, I don't think anyone else will trouble them at all, unless the batsmen make some mess! The big 4, Gayle, Kohli, Yuvi and ABD will find it relatively easy to chase againt M. Sharma, Pandey and Jadeja!\""}, {"ball": 7.6, "isHighlight": false, "text": "Raina to Kohli,1 run,turn for Raina as well, and this seemed to keep a touch low. Kohli doesn't mind as he flicks it away to deep midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Vageesan: \"Ashwin and his off spin bowling was always good against left hand batsmen. The problem was with the right hand batsmen. Mainly attacking right hand batsmen. But in this match he is bowling beautifully. He is unplayable is a under statement. \" He's been taken off now. Here's Jaddu"}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Kohli,2 runs,waits on it and then guides it past the lone slip fielder. Wonderful hands from Kohli"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Kohli,no run,tries it again, but this time Jaddu gets enough turn and bounce to beat him"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Kohli,no run,again, Kohli waits on his back foot set up for the late cut but cautions himself as the ball gets a lot more bite off the pitch"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Kohli,no run,fuller delivery and Kohli slices it to cover"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Kohli,1 run,this time the outside edge skews away straight down the ground. Flighted ball scythed down the ground"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Gayle,no run,keeps it well away from his hitting arc as he goes for a good length outside off, Gayle looks to cut and gets an inside edge. That shall be the time out"}, {"ball": 8.6, "isHighlight": false, "text": "Niladri Shekhar: \"the speed at which raina and jaddu completes an over, this match can be over in next 20 mins!!!\" Not the best match to get back on comms, I can tell you"}, {"ball": 9.1, "isHighlight": false, "text": "Raina to Kohli,no run,skips down the track but his flick can't beat square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Raina to Kohli,1 run,this time Ashwin fumbles. Kohli places it to his right but he is a little slow to set off"}, {"ball": 9.3, "isHighlight": false, "text": "Raina to Gayle,no run,shortish delivery, but it was quite slow. Gayle looks to pull and gets it off the bottom of the bat and the ricochet goes onto the boot"}, {"ball": 9.4, "isHighlight": false, "text": "Raina to Gayle,no run"}, {"ball": 9.5, "isHighlight": false, "text": "Raina to Gayle,1 run,flighted on the pads, Gayle goes for the sweep and collects a single to the right of short fine leg"}, {"ball": 9.6, "isHighlight": false, "text": "Raina to Kohli, $$FOUR$$ ,that's what RCB needed. A confided Kohli coming down the track and banishing a short ball from Raina into the wide long-on boundary."}, {"ball": 10.1, "isHighlight": false, "text": "Jadeja to Gayle,no run,goes forward to a wide delivery, but he can't breach the point field"}, {"ball": 10.2, "isHighlight": false, "text": "Jadeja to Gayle, $$FOUR$$ ,this time he goes back and cuts strongly in front of point. Is Gayle finding his timing?"}, {"ball": 10.2, "isHighlight": false, "text": "The captain had a little chat with his bowler. What has he cooked up?"}, {"ball": 10.3, "isHighlight": false, "text": "Jadeja to Gayle,1 wide,pushed too far outside off to draw Gayle's interest"}, {"ball": 10.3, "isHighlight": false, "text": "Jadeja to Gayle,1 run,gets some turn off a good length ball, Gayle sweeps to deep backward square leg"}, {"ball": 10.3, "isHighlight": false, "text": "$$Venkatesh$$ $$Prasad$$ $$debuts$$ $$on$$ $$The$$ $$Huddle$$ $$today.$$ $$Tweet$$ $$your$$ $$questions$$ $$for$$ $$the$$ $$show$$ $$with$$ $$the$$ $$hashtag$$ $$#TheHuddle$$ $$and$$ $$they$$ $$could$$ $$feature$$ $$on$$ $$the$$ $$show$$ $$in$$ $$between$$ $$the$$ $$two$$ $$games.$$"}, {"ball": 10.4, "isHighlight": false, "text": "Jadeja to Kohli, $$SIX$$ ,excellent use of the feet and unleashes a Kohli special over extra cover. Wasn't flighted enough that he could get to the pitch, but he went through with the stroke and connected near perfectly"}, {"ball": 10.5, "isHighlight": false, "text": "Jadeja to Kohli,1 run,belted down the ground and Gayle was quite late in taking evasive action. It was heading for his helmet, but ends up a single to long-on"}, {"ball": 10.5, "isHighlight": false, "text": "Cover is wide open"}, {"ball": 10.6, "isHighlight": false, "text": "Jadeja to Gayle,no run,flighted outside off, Gayle looks to launch it over cow corner but can't reach it"}, {"ball": 10.6, "isHighlight": false, "text": "Senthil: \"Chris Gayle is a real dangerous batsman to bowl in a low scoring game. RCB in it as long as Gayle stays there, I think he is waiting for Ishwar Pandey or David Hussey to bowl\" Not really, he isn't looking himself out there."}, {"ball": 11.1, "isHighlight": false, "text": "Raina to Kohli,no run,pushed through and Kohli isn't able to short-arm pull it away as well as he would like"}, {"ball": 11.2, "isHighlight": false, "text": "Raina to Kohli,1 run,nudged down to long-on as this has a little more flight outside off"}, {"ball": 11.2, "isHighlight": false, "text": "Slip still in place"}, {"ball": 11.3, "isHighlight": false, "text": "Raina to Gayle, $$FOUR$$ ,that's a reverse swat! When was the last time Gayle had to play something like that? It was a touch short and had enough room for him to use the innovation. Struck quite hard too"}, {"ball": 11.4, "isHighlight": false, "text": "Raina to Gayle,1 run,goes down the track and eases it behind the vacant square leg area"}, {"ball": 11.5, "isHighlight": false, "text": "Raina to Kohli,1 run,advances down the pitch and picks up a single straight of midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Raina to Gayle,1 run,whipped to deep midwicket as Raina angles it in on a good length from around the wicket"}, {"ball": 11.6, "isHighlight": false, "text": "Mohit's back, and starts around the wicket"}, {"ball": 12.1, "isHighlight": false, "text": "Sharma to Gayle,no run,slides one down the pads of the batsman who misses a flick. But the ump reckons there was a bit of trouser on it"}, {"ball": 12.2, "isHighlight": false, "text": "Sharma to Gayle,1 leg bye,looks to whip the good length ball into the leg side. Had to play across the line and he can't connect well. The ball wanders away into he covers and he finally gets on his bike"}, {"ball": 12.3, "isHighlight": false, "text": "Sharma to Kohli,1 run,calmly clipped away off his hips to deep square leg. He's looking very assured out there"}, {"ball": 12.3, "isHighlight": false, "text": "Kamal: \"MS should gamble with Ashwin's last over now!!!\""}, {"ball": 12.4, "isHighlight": false, "text": "Sharma to Gayle,no run,fullish on off stump, driven down the ground but the bowler sticks out his left hand to keep it to a dot"}, {"ball": 12.5, "isHighlight": false, "text": "Sharma to Gayle,1 run,keeps to a good length on off stump, Gayle goes for a heave-ho and gets an inside edge. Calls for a new bat"}, {"ball": 12.5, "isHighlight": false, "text": "Keeper up to the stumps"}, {"ball": 12.6, "isHighlight": false, "text": "Sharma to Kohli,2 runs,more fancy footwork on the boundary. This was taken off a length and Kohli's wrists had imbued enough power on it to hurtle towards the deep midwicket boundary. But Smith down there does good work"}, {"ball": 13.1, "isHighlight": false, "text": "Raina to Gayle,1 run,backs away outside leg and Raina bowls it fuller and wide of his reach. Gayle flat bats it down to long-off"}, {"ball": 13.2, "isHighlight": false, "text": "Raina to Kohli,1 run,skips down the track and eases it through extra cover. For only a single. Kohli punches his thighs in frustration"}, {"ball": 13.3, "isHighlight": false, "text": "Raina to Gayle,no run,good length, pushed through on off stump. Flicked into the on side"}, {"ball": 13.4, "isHighlight": false, "text": "Raina to Gayle,1 leg bye,this time he jumps outside off and looks for a sweep. It dribbles off his pads and Kohli calls him through for the single. He's looking terribly laborious out there"}, {"ball": 13.4, "isHighlight": false, "text": "Saroj Sharma: \"@kamal , why would captain waste his ultimate weapon for a maiden over at maximum ?? i think Aswin should bowl 17th or 18th over . till then other bowlers must fight hard.\""}, {"ball": 13.5, "isHighlight": false, "text": "Raina to Kohli,1 run,shortish and outisde off as he sees the batsman using his feet. Kohli lashes it down the ground"}, {"ball": 13.6, "isHighlight": false, "text": "Raina to Gayle,no run,goes for a sweep, loops off his pads into the off side"}, {"ball": 13.6, "isHighlight": false, "text": "MrGarreth: \"Sill reckon Gayle should be dropped for Rossouw. He's not fully fit and when he isn't hitting sixes regularly he is useless because he can't run quick singles or twos and forget about threes.\" Jaddu's back, with a slip"}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Kohli, $$OUT$$ ,saw him coming down and he fired it flat and outside off. Kohli tries to reach out as far as he could, but the pitch enables the ball to turn a lot more than he anticipated. He must have known he was in trouble halfway through his shot and though he tries his best to push that back leg of his back to safety, it gets stuck on the line. Dhoni takes care of the rest"}, {"ball": 14.1, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$st$$ $$†Dhoni$$ $$b$$ $$Jadeja$$ $$27$$ $$(38m$$ $$29b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$93.10$$"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to de Villiers,no run,loads of excitement as AB misses a reverse sweep. This flighted ball gets considerable rip and beats the shot. His back leg had been drawn outside the crease, but AB manages what Kohli couldn't. He pushes his back foot back before Dhoni can nip the bails off"}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to de Villiers,1 run,sliced to extra cover, who leaps up in hopes of catching it but it bursts through his hands. I had originally thought it was a bump ball but it was a chance!"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Gayle, $$FOUR$$ ,this time he drags it from outside off and mauls it over midwicket."}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Gayle, $$SIX$$ ,all the way! Gets underneath another length ball and since Jaddu was trying to keep it off his pads, he offers enough room for Gayle to cart it well over long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Gayle,no run,goes for the trifecta, but this time he can't reach the flatter delivery pushed outside off"}, {"ball": 14.6, "isHighlight": false, "text": "Vivek: \"One thing I have learnt watching Dhoni's ODI and T20 games: \"Thou shall not teach captaincy to Dhoni\"\" It takes a bit to stick to that when you see David Hussey bowling"}, {"ball": 15.1, "isHighlight": false, "text": "Hussey to de Villiers,no run,walks across outside off as AB looks to sweep. Gets struck on the pads, but the impact was a little too high reckons the umpire"}, {"ball": 15.2, "isHighlight": false, "text": "Hussey to de Villiers,2 runs,hoicked to deep midwicket for a couple"}, {"ball": 15.3, "isHighlight": false, "text": "Hussey to de Villiers,1 run,goes down and turns the flighted ball into a full toss. Timed to the left of deep midwicket and Jaddu runs around and keeps it to a single"}, {"ball": 15.4, "isHighlight": false, "text": "Hussey to Gayle,1 run,flatter delivery is helped by the pitch as it turns even further away from Gayle's reach. Gets a bottom edge down to long-on"}, {"ball": 15.5, "isHighlight": false, "text": "Hussey to de Villiers,no run,loads and loads of turn and AB misses a pull and gets hit below his stomach"}, {"ball": 15.6, "isHighlight": false, "text": "Hussey to de Villiers, $$SIX$$ ,there's the boundary ball and AB capitalises. Sends it soaring over the square leg boundary as Huss bowls one a little too short. Time out now"}, {"ball": 15.6, "isHighlight": false, "text": "Ramesh Mukka: \"Seriously!! Gayle's running between the wickets is slower than Rajat Bhatia's ball\""}, {"ball": 15.6, "isHighlight": false, "text": "Manu: \"It takes a really brave captain to keep away Ishwar Pandey (who has been bowling well this IPL) even during a very crucial phase of the match with two of the best players on crease, and bring on a part-time spinner\" Not as much, this pitch is offering a lot of help to the slow bowlers. And Pandey is just the right pace for Gayle. R Ashwin to bowl his last over. His figures so far  $$3-1-3-1$$"}, {"ball": 16.1, "isHighlight": false, "text": "Ashwin to Gayle,no run,pushed through on middle and off, Gayle goes back and punches it back to the bowler"}, {"ball": 16.2, "isHighlight": false, "text": "Ashwin to Gayle,1 run,goes back and slaps it through the covers and gets off strike"}, {"ball": 16.3, "isHighlight": false, "text": "Ashwin to de Villiers, $$SIX$$ ,he's outfoxed Ashwin! Moved across outside off stump, went so very very deep in his crease and pulled this carrom ball over the square leg boundary"}, {"ball": 16.4, "isHighlight": false, "text": "Ashwin to de Villiers,1 bye,its the orthodox offspinner this time and AB has moved too far across to connect with the sweep. Misses leg stump by a whisker and goes off for byes after it deflects off Dhoni's leg"}, {"ball": 16.5, "isHighlight": false, "text": "Ashwin to Gayle, $$SIX$$ ,that's outta here! This was flighted and it got some turn as well, but Gayle wound up and clobbered it straight. No question about where the ball was landing"}, {"ball": 16.6, "isHighlight": false, "text": "Ashwin to Gayle, $$OUT$$ ,he's got his man, but is it one hit too late? Dupes Gayle with his length and the turn he gets as the batsman moved outside leg. He was looking for another big hit, but seeing the ball not in his arc, he looked to defend with an open face and is beaten. And to make matters worse, off stump is knocked back"}, {"ball": 16.6, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$b$$ $$Ashwin$$ $$46$$ $$(66m$$ $$50b$$ $$3x4$$ $$3x6)$$ $$SR:$$ $$92.00$$"}, {"ball": 17.1, "isHighlight": false, "text": "Hussey to de Villiers, $$SIX$$ ,looped it up outside off and AB has slog swept it over the midwicket boundary. That could be the clincher"}, {"ball": 17.2, "isHighlight": false, "text": "Hussey to de Villiers, $$FOUR$$ ,tries to find the block hole, but AB stays nice and deep and has hammered it to the boundary past a desperately diving long-on"}, {"ball": 17.3, "isHighlight": false, "text": "Hussey to de Villiers,2 runs,skips down the track and swiped it to deep midwicket and collects two"}, {"ball": 17.4, "isHighlight": false, "text": "Hussey to de Villiers,2 wides,slid down leg and AB goes for a pull. Too wide for him to connect and the keeper can't stop it either"}, {"ball": 17.4, "isHighlight": false, "text": "Yuvraj Singh is the new batsman, with 15 from 15 to get"}, {"ball": 17.4, "isHighlight": false, "text": "Hussey to Yuvraj Singh,1 run,angled into his pads and Yuvi sweeps to long leg"}, {"ball": 17.5, "isHighlight": false, "text": "Hussey to de Villiers,no run,shortish and pushed through outside off. Skids on and gets the bottom edge as AB wanted to pierce the cover gap"}, {"ball": 17.6, "isHighlight": false, "text": "Hussey to de Villiers, $$OUT$$ ,another twist! AB has top edged a slog sweep. The RCB fans had their heads in their hands as they saw Jaddu hustling in off the boundary. He had a lot of ground to cover and he was quick enough to make it seem a pretty straight forward catch"}, {"ball": 17.6, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$c$$ $$Jadeja$$ $$b$$ $$Hussey$$ $$28$$ $$(19m$$ $$14b$$ $$1x4$$ $$3x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Jadeja to bowl out. Sachin Rana to face. Slip in place"}, {"ball": 18.1, "isHighlight": false, "text": "Jadeja to Rana,1 run,flighted on middle, Rana has flicked it to deep midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,no run,loads and loads of turn that stymies Yuvi's pull. He had set up for a pull, but the ball darts into him too quickly"}, {"ball": 18.3, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,no run,employs the sweep this time, but still can't out bat to ball"}, {"ball": 18.4, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,no run,wanders out of the crease but Jaddu pulls his length back and flummoxes Yuvi's timing again"}, {"ball": 18.5, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,2 runs,stays put in his crease this time and pulls, gets a thick inside edge which runs away towards the long leg boundary until Mithum Manhas intervenes"}, {"ball": 18.6, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,1 run,finds the block hole and Yuvi retains strike with a push to long-off"}, {"ball": 18.6, "isHighlight": false, "text": "Long conference by the bowler's end. And after everything it's David Hussey to bowl. Badree was there, Mohit was there, but Dhoni has made his decision. Around the wicket"}, {"ball": 19.1, "isHighlight": false, "text": "Hussey to Yuvraj Singh, $$SIX$$ ,in the slot and Yuvi has launched it over wide long-on. He murders spin and this is only part-time spin"}, {"ball": 19.2, "isHighlight": false, "text": "Hussey to Yuvraj Singh,2 runs,bowls a flat one outside off and Yuvi belts it for a couple to deep midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Hussey to Yuvraj Singh,1 run,fast and flat on off stump, Yuvi slices it to short third man. Scores are tied, Dhoni asks his field to come up"}, {"ball": 19.4, "isHighlight": false, "text": "Hussey to Rana, $$OUT$$ ,flighted outside off, Rana has pummeled it into the hands of short midwicket! He had nailed that, but Baz leaps up to his right and plucked a blinder"}, {"ball": 19.4, "isHighlight": false, "text": "$$S$$ $$Rana$$ $$c$$ $$McCullum$$ $$b$$ $$Hussey$$ $$1$$ $$(7m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "1 off 2 needed and outs walks Nechim"}, {"ball": 19.5, "isHighlight": false, "text": "Hussey to Ahmed, $$FOUR$$ ,dances down the track first ball and smites it to the long-on boundary. That's the game for Royal Challengers and they stay alive in the IPL. Kohli and Gayle are trapped in a bear hug with each other"}, {"ball": 19.5, "isHighlight": false, "text": "So there we have it, the IPL restarts with Royal Challengers securing a prized victory. They have a few more to rack up to stay in the tournament, but as far as the Super Kings are concerned, it is only a dent. They seem all set for the playoffs with quite a few matches in the kitty. This is Alagappan Muthu, scurrying away for an early dinner. Thank you for your company and comments. Switch over to the other game, where Kolkata Knight Riders and Sunrisers Hyderabad are in a  $$battle$$  for survival"}, {"ball": 19.5, "isHighlight": false, "text": ""}, {"ball": 19.5, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Probably one of the most difficult wickets that I played on. Surprised, I thought I was going to get one of these interesting awards and Abu was going to get Man of the Match. I got some of the balls away. I looked foolish a couple of times and took it to the end. I was disappointed to get out at the time, but Yuvi did it for us in the end\""}, {"ball": 19.5, "isHighlight": false, "text": "$$7.15$$ $$pm$$  \"They've gone already. Great win for us, especially after the wicket played in the second innings,\" says  $$Virat$$ $$Kohli.$$  \"Today was a great example of the character in the side. You have Gayle hitting out there, then AB and Yuvi in such for, you back your team. It was about rotating stirke as much as possible and hitting with the turn and not trying something fancy. Because with the old ball, it wasn't turning as much so you can stay on the back foot and work it away. No message, Yuvi told me he wanted Nechim to get a single, but he just stepped out and slammed the ball for six. That's the belief players have now\""}, {"ball": 19.5, "isHighlight": false, "text": "\"Tight game, really difficult wicket to play on and I managed to get some runs off the dropped catch,\" says  $$AB$$ $$de$$ $$Villiers$$ . \"It's the kind of wicket where you win the game and still have areas to work on. Huge boost for us. Pushed too hard, aiming 160 and it's really difficult to get the ball through. Bowlers did an amazing job in the last few overs\""}, {"ball": 19.5, "isHighlight": false, "text": "\"Knew the pitch would slow down further, the spinners did maintain the pressure and that's one of the reasons why the game went close,\" says  $$MS$$ $$Dhoni$$ . [Is a pattern developing, with such close losses so close to the playoffs] \"Not really, the best thing about stats is we can have a pattern and it changes. It's something the commentators can talk about and they have to talk about something. At the end of the day, catches win matches and you don't drop big players. Its not the first time we've made that mistake. Not really, it maybe your home venue but the team that wins plays better cricket. They bowled very well, especially in the last four overs. We lost five to 10 runs and if not more.\""}, {"ball": 19.5, "isHighlight": false, "text": "Tejas: \"I don't know why Hussey was even picked for this match. Faf was perfect for this sort of pitch. It's not Hussey's fault. You expect him to be rusty not having played for so long. And Dhoni really should have gone for Mohit and Badree instead of those two Hussey overs. Overall, a very poor game for CSK.. \""}, {"ball": 19.5, "isHighlight": false, "text": "$$7.10$$ $$pm$$  It was always going to be competitive with Super Kings' army of slow bowlers. Ashwin used the pitch magnificently well, but he had very little support. RCB hung in there. Kohli looked to have gained a little form, Gayle still looked out of touch. Yuvraj wasn't happy having to cope with the spin on this until David Hussey, plucked from the comm box and playing his first match of the season, was trusted with the last over"}], "name": "Chennai Super Kings v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734013.html?innings=2;view=commentary", "match_num": 42}