{"commentary": [{"ball": 0, "isHighlight": false, "text": "Finch and Dhawan to open. Morne Morkel has the new ball"}, {"ball": 0, "isHighlight": false, "text": "$$Sammy$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$Sunrisers$$ $$will$$ $$bat$$"}, {"ball": 0, "isHighlight": false, "text": "One change for Sunrisers. Captain Sammy is in for Henriques"}, {"ball": 0, "isHighlight": false, "text": "Gambhir says he would have chased anyway. KKR are unchanged"}, {"ball": 0, "isHighlight": false, "text": "Consensus on air is that the pitch appears to be a fine batting track. It is a shiny surface with just a hint of green"}, {"ball": 0, "isHighlight": false, "text": "Nissar: \"SRH - Captain Sammy, I am not at all surprised even a bit. Its an excellent move by the management of SRH. Dhawan is not suited for the Captaincy. Captaining a side doesn't mean a batsman in form, but a player with ability to lead his team from the front, especially in crunch situations. Sorry but Dhawan doesn't posses those qualities. Sammy and Finch were the contenders from the start.\""}, {"ball": 0, "isHighlight": false, "text": "KKRFan: \"As Tendo hasn't faced lots of balls this season and with the ball, he hasn't done much; I'd choose Lynn ahead of him. KKR needs a solid batsmen in the middle and Lynn has shown he is capable for that. \""}, {"ball": 0, "isHighlight": false, "text": "Hari : \"@vinod mhase : Even in earlier matches, Sammy was seen helping out Dhawan. Moreover, the team management would have felt that captaincy was affecting Dhawan's batting. I don't think it will affect them much.\""}, {"ball": 0, "isHighlight": false, "text": "Franc12: \"Looks like SRH has a legacy of captaincy changes during mid tournament. Sangakkara it was in the previous year.\""}, {"ball": 0, "isHighlight": false, "text": "Hajananth: \"Darren Sammy, the captain, the hard hitter and the complement bowler..\""}, {"ball": 0, "isHighlight": false, "text": "Vinod Mhase: \"The captain at such a crucial juncture of the tournament shows the low confidence of SRH.. Not a good thinking at all!!! \""}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$  VVS Laxman says on air that  $$Darren$$ $$Sammy$$ $$will$$ $$lead$$ $$Sunrisers$$  instead of Shikhar Dhawan for the rest of the season. \"We are hoping for a lot from Shikhar the batsman,\" Laxman says."}, {"ball": 0, "isHighlight": false, "text": "Tushar: \"As far as captaincy is concerned, they could have made someone who has been part of the XI for the whole season. Maybe Finch...?!\""}, {"ball": 0, "isHighlight": false, "text": "Barath: \"Good move from SRH. RCB should follow suit and hand over the captaincy to ABD. They need Kohli the batsman more than kohli the Captain.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.15pm$$  Welcome to our coverage of the 43rd match of this season, between KKR and Sunrisers in Hyderabad. RCB have joined KKR on ten points with their hard-fought win over CSK moments ago. Sunrisers, on eight, need to win this one more than KKR do."}, {"ball": 0, "isHighlight": false, "text": "-------------------  $$CricIQ$$  Powerplay 4 ends today. Can you slug away a couple of sixes in the last over to get to the top of that leaderboard?  $$Take$$ $$your$$ $$three$$ $$shots$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Morkel to Finch,no run,starts his favoured back of a length, some way outside off, left alone, decent carry to the keeper"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Finch,no run,slightly fuller, at 147.3 kph, Finch prefers to stay on the crease, even off the fuller length, the ball kicks, and he has to hop to play it down"}, {"ball": 0.3, "isHighlight": false, "text": "Morkel to Finch,no run,short of a length, angled into the right hander, he tries to force it past square leg, cannot beat Shakib there"}, {"ball": 0.4, "isHighlight": false, "text": "Morkel to Finch,1 run,Morne goes for the yorker, gets it right just outside off, but Finch manages to bring down some bat on it, just in time, and the ball rolls to fine leg"}, {"ball": 0.4, "isHighlight": false, "text": "Two slips"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Dhawan,2 wides,short of a length at 146 kph but that does not help as it starts outside leg and moves further down, keeper dives and parries it away"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Finch,1 run,caught on the crease with a good length ball that comes in, it pops up close to the pitch on leg, Morne runs for the ball, Dhawan for the single, Morne tries to push Dhawan out of the way, and immediately apologises, batsman and bowler shake hands to confirm all is well"}, {"ball": 0.6, "isHighlight": false, "text": "Morkel to Dhawan, $$FOUR$$ ,Dhawan ends the over on a high, Morne gives him slight width on the length ball and Dhawan flays it past cover"}, {"ball": 0.6, "isHighlight": false, "text": "Umesh Yadav"}, {"ball": 1.1, "isHighlight": false, "text": "UT Yadav to Finch,2 runs,is hurried on the pull on his 140 kph short ball, tries to take it from outside off, Shakib is after the top edge from square leg, he dives too, but it falls out of his reach, nice try though"}, {"ball": 1.2, "isHighlight": false, "text": "UT Yadav to Finch, $$FOUR$$ ,there is a slip, but this outside edge flies past him as Finch goes hard at a pitched up ball that swings away quite late"}, {"ball": 1.3, "isHighlight": false, "text": "UT Yadav to Finch, $$OUT$$ ,similar delivery, same response from the batsman, similar direction to the ball, Finch drives half-forward at another late outswinger, but this one zooms closer to third man, and Morne slides to his left to take a sharp catch,"}, {"ball": 1.3, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$c$$ $$Morkel$$ $$b$$ $$UT$$ $$Yadav$$ $$8$$ $$(6m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 1.4, "isHighlight": false, "text": "UT Yadav to Ojha,no run,Umesh straightens this on Ojha at 146 kph, pitches back of a length and opens him up, the ball falls well short of slip, not sure if that was bat or thigh pad"}, {"ball": 1.5, "isHighlight": false, "text": "UT Yadav to Ojha,no run,swings away full and late, Ojha moves forward and carefully opens the face to defend to covers"}, {"ball": 1.6, "isHighlight": false, "text": "UT Yadav to Ojha,no run,ends with a 143.4 kph outswinger on off stump that is softly pushed to point"}, {"ball": 2.1, "isHighlight": false, "text": "Morkel to Dhawan,1 run,taps a back of a length ball close to the track on off and takes the single"}, {"ball": 2.1, "isHighlight": false, "text": "Shantanu Agrawa: \"The way the ball travels these days, third man should be called deep slip!\""}, {"ball": 2.2, "isHighlight": false, "text": "Morkel to Ojha, $$FOUR$$ ,that is a strange effort from Narine at fine leg, this was tucked neatly off the pad, and the offspinner wasn't too far from it, it was indeed travelling but Narine gives up way too soon, forget diving, he does not even try to outrun it, Morne throws his hands up in frustration"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Ojha,no run,blocks a short of a length ball from the crease"}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Ojha,1 wide,full and furious from Morne at 148.2 kph but directed just down the leg side"}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Ojha,no run,gets behind the line of a back of a length ball and defends down the pitch"}, {"ball": 2.5, "isHighlight": false, "text": "Morkel to Ojha,no run,plays out a 146.4 kph short of a length ball to point and stops the non-striker, who was rushing up for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Ojha,1 run,they steal a single with a nudge in front of midwicket, fielder dives forward but he cannot pick up the ball, and Ojha is home by then anyway"}, {"ball": 2.6, "isHighlight": false, "text": "Satyajeet: \"This is some real fast bowling stuff. Steyn must be smiling. \""}, {"ball": 3.1, "isHighlight": false, "text": "UT Yadav to Ojha,1 run,Umesh starts with a 144 kph length ball that moves in to the right hander, who nudges it in front of square"}, {"ball": 3.2, "isHighlight": false, "text": "UT Yadav to Dhawan,no run,plays this good length ball from the crease, defends it solidly"}, {"ball": 3.3, "isHighlight": false, "text": "UT Yadav to Dhawan,no run,has a go at the cut on this widish short of a length ball angled across him, but misses, that climbed a lot"}, {"ball": 3.4, "isHighlight": false, "text": "UT Yadav to Dhawan, $$FOUR$$ ,this is a 148 kph delivery, but it is wide again, and this time he connects on the cut, absolutely no hope for third man"}, {"ball": 3.5, "isHighlight": false, "text": "UT Yadav to Dhawan,1 run,denies him width with a back of a length ball on the stumps, Dhawan dabs it to third man"}, {"ball": 3.6, "isHighlight": false, "text": "UT Yadav to Ojha,1 run,worked off the pad to fine leg"}, {"ball": 4.1, "isHighlight": false, "text": "Morkel to Ojha,1 run,taps it softly on the off side for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Morkel to Dhawan, $$FOUR$$ ,not more than a push to this pitched up ball, but it races off the middle of the bat past extra cover to the boundary"}, {"ball": 4.3, "isHighlight": false, "text": "Morkel to Dhawan,no run,he makes lots of room outside leg to a 150.6 kph delivery slanted across, but misses"}, {"ball": 4.4, "isHighlight": false, "text": "Morkel to Dhawan,1 run"}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Ojha,2 wides,plenty of bounce on this 148.2 kph short of a length ball but slanted well down leg, Uthappa takes it as he moves to his left, he carries on moving for an instant, and that is enough for them to pinch a bye"}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Dhawan, $$FOUR$$ ,full outside off, but Dhawan's squeezed this deftly to the fine third man boundary"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Dhawan,no run,tries the pull to a short of a length ball around off but misses it"}, {"ball": 4.6, "isHighlight": false, "text": "Sunil Narine"}, {"ball": 4.6, "isHighlight": false, "text": "Gunjandeep: \"Burden of Captaincy off, Dhawan is playing good already...\""}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Ojha,1 run,tosses it up full on middle and leg, it is pushed past the non striker to long on"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Dhawan,no run,appeal for leg before as Dhawan misses the sweep to a full one, but it pitched outside leg"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Dhawan,no run,length ball on the pad turned to square leg, non-striker has to get back"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Dhawan, $$OUT$$ ,after missing the sweep, Dhawan's lunged forward and tried a bigger one to this full offbreak outside off, he's only top-edged it, Gambhir at square leg settles under it, it pops out on the first attempt, but he takes it safely on the second"}, {"ball": 5.4, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$c$$ $$Gambhir$$ $$b$$ $$Narine$$ $$19$$ $$(26m$$ $$14b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$135.71$$"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Ojha,no run,turning away from the right hander, pushed square on the off side"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Ojha,no run,defended off the front foot"}, {"ball": 5.6, "isHighlight": false, "text": "Shakib Al Hasan"}, {"ball": 5.6, "isHighlight": false, "text": "zube: \"Dear Gunjandeep, Thanks for the jinx. Sincerely, SunRisers Fan\""}, {"ball": 6.1, "isHighlight": false, "text": "Shakib Al Hasan to Warner,no run,walks out, is not quite to the pitch and pushes it back to the bowler"}, {"ball": 6.2, "isHighlight": false, "text": "Shakib Al Hasan to Warner,1 run,stays back this time and drags a flat length ball to deep square leg"}, {"ball": 6.2, "isHighlight": false, "text": "Aravinth: \"No man in his right mind would attack narine so early.. Captaincy or no captaincy, a good start wasted again. \""}, {"ball": 6.3, "isHighlight": false, "text": "Shakib Al Hasan to Ojha,1 bye, $$missed$$ $$stumping$$ , Ojha's charged out to one that does not turn, carries in with the angle past his swipe, but Uthappa cannot collect it"}, {"ball": 6.4, "isHighlight": false, "text": "Shakib Al Hasan to Warner, $$SIX$$ ,couple of steps out a tossed up ball, reaches the pitch and smacks it over wide long on with the turn"}, {"ball": 6.5, "isHighlight": false, "text": "Shakib Al Hasan to Warner,1 run,worked square on the leg side for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Shakib Al Hasan to Ojha,no run,bowled slower, bounces from a good length, is pushed to point off the front foot"}, {"ball": 6.6, "isHighlight": false, "text": "Mudassir Hashmi: \"A thorough analysis will prove that David Warner's position gamble is leading to loss of runs.\""}, {"ball": 6.6, "isHighlight": false, "text": "RTD to bowl"}, {"ball": 7.1, "isHighlight": false, "text": "ten Doeschate to Warner,1 run,shortish ball sits up outside off, but is flayed straight to long on"}, {"ball": 7.2, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,short of a length again, 121.5 kph, he tries the cut and misses"}, {"ball": 7.3, "isHighlight": false, "text": "ten Doeschate to Ojha, $$SIX$$ ,he pitches it up this time, a slower one at 101 kph, and Ojha sends it soaring over the long on boundary"}, {"ball": 7.4, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,a good length ball around off, Ojha glides it to short third man, is not getting the single"}, {"ball": 7.5, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,similar delivery, he tries to run it past short third man, but misses this time"}, {"ball": 7.6, "isHighlight": false, "text": "ten Doeschate to Ojha,1 run,length ball on off pushed wide of backward point for a single"}, {"ball": 8.1, "isHighlight": false, "text": "Shakib Al Hasan to Ojha, $$SIX$$ ,Ojha gets a full one right under the bat on middle and off, and carts it straight over the bowler, it falls just before the sightscreen"}, {"ball": 8.2, "isHighlight": false, "text": "Shakib Al Hasan to Ojha,no run,turned straight to midwicket"}, {"ball": 8.3, "isHighlight": false, "text": "Shakib Al Hasan to Ojha, $$OUT$$ ,caught at backward point, Shakib bowls it very full and widish outside off, Ojha bends and squeezes it in the air, straight to the fielder"}, {"ball": 8.3, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$c$$ $$Pathan$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$22$$ $$(30m$$ $$24b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$91.66$$"}, {"ball": 8.3, "isHighlight": false, "text": "Rahul is the next man"}, {"ball": 8.4, "isHighlight": false, "text": "Shakib Al Hasan to Rahul,no run,tossed up and slower, Rahul comes forward and defends"}, {"ball": 8.5, "isHighlight": false, "text": "Shakib Al Hasan to Rahul,no run,slower still and it keeps coming in, the batsman inside edges it on to his pads"}, {"ball": 8.6, "isHighlight": false, "text": "Shakib Al Hasan to Rahul,1 run,fuller this time, he comes forward and pushes it to long-on to get off the mark"}, {"ball": 8.6, "isHighlight": false, "text": "Narine is back"}, {"ball": 9.1, "isHighlight": false, "text": "Narine to Rahul,1 run,bowls a straighter one outside off, the batsman pushes it through cover for a single"}, {"ball": 9.2, "isHighlight": false, "text": "Narine to Warner, $$SIX$$ ,he is not holding back! Everytime he sees a bit of flight he launches into it. This one is whacked deep over the midwicket boundary"}, {"ball": 9.3, "isHighlight": false, "text": "Narine to Warner,1 run,comes forward and pushes the slower delivery to long-off"}, {"ball": 9.4, "isHighlight": false, "text": "Narine to Rahul,no run,flatter and quicker, comes in after pitching, the batsman defends"}, {"ball": 9.5, "isHighlight": false, "text": "Narine to Rahul,no run,stays in the crease and defends this to midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "Narine to Rahul, $$FOUR$$ ,goes across to the offside and laps this straighter delivery fine on the leg side for a smartly controlled boundary, uses the bowler's pace"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla comes into the attack"}, {"ball": 10.1, "isHighlight": false, "text": "Chawla to Warner,1 run,starts with one going across the left hander, it is worked down to long on"}, {"ball": 10.2, "isHighlight": false, "text": "Chawla to Rahul,no run,reaches a wide legbreak and slaps it to extra cover"}, {"ball": 10.3, "isHighlight": false, "text": "Chawla to Rahul, $$FOUR$$ ,slightly short on middle, Rahul is quick to latch on and pull it past deep midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Chawla to Rahul,1 run,did him in the flight there, Rahul skipped out to a flighted one, wasn't quite to the pitch as he pushed at it, he slipped and ended up scooping it over the bowler"}, {"ball": 10.5, "isHighlight": false, "text": "Chawla to Warner,1 run,slaps a wrong 'un square on the off side"}, {"ball": 10.6, "isHighlight": false, "text": "Chawla to Rahul,no run,googly around off stump, steered to short third man"}, {"ball": 10.6, "isHighlight": false, "text": "Morkel back"}, {"ball": 11.1, "isHighlight": false, "text": "Morkel to Warner,1 run,a length ball around off is pushed down the ground, mid off is up and he reaches it"}, {"ball": 11.2, "isHighlight": false, "text": "Morkel to Rahul,1 run,stays on the crease to a 144.4 kph pitched-up ball outside off and runs it to third man"}, {"ball": 11.3, "isHighlight": false, "text": "Morkel to Warner, $$FOUR$$ ,Morne pitches it up again, width for Warner and he reaches out to slam it well wide of sweeper cover"}, {"ball": 11.4, "isHighlight": false, "text": "Morkel to Warner, $$FOUR$$ ,thick outside edge flies past the keeper as Warner pushes from the crease to one leaving him"}, {"ball": 11.5, "isHighlight": false, "text": "Morkel to Warner,1 run,pitched up again, around middle, tapped in front of point for a single"}, {"ball": 11.6, "isHighlight": false, "text": "Morkel to Rahul,1 run,hops and runs this short of a length ball behind point, who slides and stops it"}, {"ball": 12.1, "isHighlight": false, "text": "Chawla to Rahul,1 run,comes down the track to a legbreak and turns it from outside off through midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Chawla to Warner,no run,back and across to a tossed up delivery, defends it safely"}, {"ball": 12.3, "isHighlight": false, "text": "Chawla to Warner,1 run,90 kph flat and wide, cut straight to the sweeper"}, {"ball": 12.4, "isHighlight": false, "text": "Chawla to Rahul, $$OUT$$ ,he gets Rahul with the googly, bowls it on a length just outside off, Rahul decides to play from the crease, it spins in and hits him plumb in front"}, {"ball": 12.4, "isHighlight": false, "text": "$$KL$$ $$Rahul$$ $$lbw$$ $$b$$ $$Chawla$$ $$14$$ $$(18m$$ $$15b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$93.33$$"}, {"ball": 12.4, "isHighlight": false, "text": "Raghu Ifmr: \"Is it just me or is Warner playing like Sehwag of old times.. No foot movement, just excellent hand-eye coordination, goes after any delivery thats flighted by the spinners, even in not holding back when fastest bowler is bowling and getting that occasional thick outside edges to the boundary..\""}, {"ball": 12.4, "isHighlight": false, "text": "Irfan Pathan comes in ahead of Sammy"}, {"ball": 12.5, "isHighlight": false, "text": "Chawla to Pathan,1 run,a full one around off, turned to long on"}, {"ball": 12.6, "isHighlight": false, "text": "Chawla to Warner,1 run,stays back to a good length googly and works it down to long on"}, {"ball": 12.6, "isHighlight": false, "text": "john: \"first time I want to see IP dominating YP......\""}, {"ball": 12.6, "isHighlight": false, "text": "Umesh Yadav is back"}, {"ball": 13.1, "isHighlight": false, "text": "UT Yadav to Warner, $$FOUR$$ ,slants a slower length ball across Warner, who winds up and slams it between sweeper cover and long off"}, {"ball": 13.2, "isHighlight": false, "text": "UT Yadav to Warner, $$OUT$$ ,could have been another boundary, this was shortish and Warner's sent it rocketing with a front-foot pull but he's found midwicket in the way"}, {"ball": 13.2, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$c$$ $$Pathan$$ $$b$$ $$UT$$ $$Yadav$$ $$34$$ $$(33m$$ $$18b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$188.88$$"}, {"ball": 13.2, "isHighlight": false, "text": "Captain Sammy is in now"}, {"ball": 13.3, "isHighlight": false, "text": "UT Yadav to Sammy,no run,almost pops up to cover, he tries to turn a back of a length ball to the leg side and gets a leading edge"}, {"ball": 13.4, "isHighlight": false, "text": "UT Yadav to Sammy,2 runs,forces it off the pad to the left of fine leg, and charges back for the second, needs to dive in, and does so"}, {"ball": 13.5, "isHighlight": false, "text": "UT Yadav to Sammy,1 leg bye,was winding up with a big backlift, saw it angling into the pad again, and worked it square"}, {"ball": 13.6, "isHighlight": false, "text": "UT Yadav to Pathan,1 run,punches a 145 kph back of a length ball to the sweeper"}, {"ball": 14.1, "isHighlight": false, "text": "Chawla to Pathan,no run,pushes a flighted ball around off to extra cover"}, {"ball": 14.2, "isHighlight": false, "text": "Chawla to Pathan,no run,tries to push it through extra cover but this one straightens and bounces, and he mistimes it into the pitch"}, {"ball": 14.3, "isHighlight": false, "text": "Chawla to Pathan,1 run,pushed down to long off"}, {"ball": 14.4, "isHighlight": false, "text": "Chawla to Sammy,no run,tosses it up outside off, Sammy is carefully waiting on it and pushes it softly to point"}, {"ball": 14.5, "isHighlight": false, "text": "Chawla to Sammy,no run,right through him, a tossed up googly, Sammy does not pick it as he pushes half forward, is lucky that did not hit off"}, {"ball": 14.6, "isHighlight": false, "text": "Chawla to Sammy,no run,shorter and flatter, he goes back and hits it straight to cover"}, {"ball": 14.6, "isHighlight": false, "text": "Narine returns"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Pathan,1 run,slaps a length ball wide of the sweeper, but only getting the single"}, {"ball": 15.1, "isHighlight": false, "text": "rssampat: \"This the the problem with SRH. Sammy & Pathan bat way too up and are in far too early.\""}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Sammy,no run,the straighter one, Sammy backs away for the cut but is beaten by the bounce and the lack of turn"}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Sammy,1 run,squeezes this fuller one behind point for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Zaheer: \"IP is no YP. I don't expect fireworks from IP.\""}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Pathan,no run,dabs a length ball angled across, to short third man, trots out but has to turn back"}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Pathan,2 runs,drags this wide of deep midwicket for a couple"}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Pathan,1 run,a length ball on the pad, Irfan works it in front of square and charges down, but he will get only the single as deep midwicket runs in"}, {"ball": 15.6, "isHighlight": false, "text": "Susil Kumar: \"@Zaheer As it is, YP is no YP anymore and Mr. Zaheer, Zaheer is no Zaheer anymore too.\""}, {"ball": 16.1, "isHighlight": false, "text": "Chawla to Pathan, $$FOUR$$ ,a full ball but down the leg side, and Irfan sweeps behind square, easily beats the man in the deep"}, {"ball": 16.2, "isHighlight": false, "text": "Chawla to Pathan,1 run,moves forward and pushes, the ball pops up in the air wide of the bowler"}, {"ball": 16.3, "isHighlight": false, "text": "Chawla to Sammy,no run,Sammy sets himself up and has a heave, but this flighted ball turns in, and the inside edge goes to midwicket"}, {"ball": 16.4, "isHighlight": false, "text": "Chawla to Sammy,1 run,goes back to a length ball and pulls it hard, without much timing, to deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Chawla to Pathan, $$FOUR$$ ,Irfan skips out, and carts it straight over the bowler, times it well enough to beat the deep fielders"}, {"ball": 16.6, "isHighlight": false, "text": "Chawla to Pathan,2 runs,sweeps behind square and comes back for the second, it could have been close but he makes it"}, {"ball": 17.1, "isHighlight": false, "text": "Narine to Sammy,no run,Sammy pulls but does not connect as he has not picked the straighter one that bounces past outside off"}, {"ball": 17.2, "isHighlight": false, "text": "Narine to Sammy,2 runs,connects on the pull this time, and drags it wide of long on, who has to dive to stop it"}, {"ball": 17.3, "isHighlight": false, "text": "Narine to Sammy,no run,this is an offbreak and cramps him on the pull, which is why it cannot beat midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "Narine to Sammy,no run,cannot get it away again, this is very full but he does not manage much bat on it as it rolls away onto the pitch"}, {"ball": 17.5, "isHighlight": false, "text": "Narine to Sammy,1 run,a length ball, he pulls once more, and only gets a single to wide long on"}, {"ball": 17.6, "isHighlight": false, "text": "Narine to Pathan,no run,Irfan chops one turning away from him to short third man and he will have ti get back as there is no single"}, {"ball": 18.1, "isHighlight": false, "text": "Shakib Al Hasan to Sammy, $$OUT$$ ,a full toss outside off, Sammy clears front leg and slogs, but he hasn't got enough on it, long off runs to his right and takes it, been a struggle for Sammy tonight"}, {"ball": 18.1, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$Pandey$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$7$$ $$(19m$$ $$16b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$43.75$$"}, {"ball": 18.2, "isHighlight": false, "text": "Shakib Al Hasan to Pathan,2 runs,drives a full one outside off, to the right of long off for a couple"}, {"ball": 18.3, "isHighlight": false, "text": "Shakib Al Hasan to Pathan,no run,very full outside off, Irfan cannot get bat to it as it dips under"}, {"ball": 18.4, "isHighlight": false, "text": "Shakib Al Hasan to Pathan,1 wide,98 kph and hurled full down leg, Irfan misses the sweep"}, {"ball": 18.4, "isHighlight": false, "text": "Shakib Al Hasan to Pathan,1 run,slants it full and wide across the left hander at 94 kph, Irfan lifts it, on the bounce, to long off"}, {"ball": 18.5, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,2 runs,this is full just outside off, but he's made some room and squeezed it to short third man, who lets it slip through"}, {"ball": 18.6, "isHighlight": false, "text": "Shakib Al Hasan to Sharma,1 run,hit down to long on for a single"}, {"ball": 18.6, "isHighlight": false, "text": "Doosra: \"I fear this is curtains for the Sunrisers in the IPL. Perhaps they should be re-named the Sunsetters!\""}, {"ball": 19.1, "isHighlight": false, "text": "UT Yadav to Sharma,1 wide,Umesh starts the final over with a 143.5 kph full and wide one, too wide"}, {"ball": 19.1, "isHighlight": false, "text": "UT Yadav to Sharma,no run,full and wide again, inside the marker, Karn swings and misses"}, {"ball": 19.1, "isHighlight": false, "text": "Zaheer: \"This IPL, Zaheer is not Zaheer, Steyn is not Steyn, Gayle is not Gayle, Sammy is not Sammy, Kohli is not Kohli, Hussey is not Hussey, Mishra is not Mishra\""}, {"ball": 19.2, "isHighlight": false, "text": "UT Yadav to Sharma,1 run,full and wide it will be once more, he connects alright this time, but hits it to the sweeper on the bounce, RTD hops to cover the extra bounce"}, {"ball": 19.3, "isHighlight": false, "text": "UT Yadav to Pathan,1 run,  $$OUT$$ ,Irfan mishits the pull, but the ball falls in vacant space at midwicket, the evening turns worse for Sunrisers as Karn is found short of his ground with a direct hit, they ran the first, then Irfan turned for the second, Karn responded, Irfan stopped, Karn stopped too, but was way slow in getting his bat in, was not too far down the pitch"}, {"ball": 19.3, "isHighlight": false, "text": "$$KV$$ $$Sharma$$ $$run$$ $$out$$ $$4$$ $$(7m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "UT Yadav to Steyn,1 run,backs away to a low full toss and smashes it straight to extra cover"}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Pathan,1 wide,pace is up at 144.8 kph  but it is a wayward wide, high full toss outside off"}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Pathan,1 run,goes after a full delivery outside off, but cannot time it"}, {"ball": 19.6, "isHighlight": false, "text": "UT Yadav to Steyn, $$OUT$$ ,Umesh ends the innings with an accurate yorker, Steyn makes room outside leg and swings hard, but finds his off stump uprooted"}, {"ball": 19.6, "isHighlight": false, "text": "$$DW$$ $$Steyn$$ $$b$$ $$UT$$ $$Yadav$$ $$1$$ $$(2m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "The first time in three home games this season that Sunrisers have not made 150-plus. They could not defend both the previous totals. Does not look good for them. This is not a 142 wicket"}], "name": "Sunrisers Hyderabad v Kolkata Knight Riders", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734015.html?innings=1;view=commentary", "match_num": 43}