{"commentary": [{"ball": 0, "isHighlight": false, "text": "Lendl Simmons out to open for MI along with Michael Hussey. Ankit Sharma to start with left-arm spin"}, {"ball": 0, "isHighlight": false, "text": "$$Rohit$$ $$Sharma$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$MI$$ $$will$$ $$bat$$"}, {"ball": 0, "isHighlight": false, "text": "For RR, Unmukt Chand is in for Ajinkya Rahane for his first game of the season, Brad Hodge for Steven Smith, Ankit Sharma for Pravin Tambe. Ben Cutting makes way for the captain. That makes it four changes."}, {"ball": 0, "isHighlight": false, "text": "For MI, Rohit remembers the first two of three changes. Krishmar Santokie is in for Lasith Malinga, Shreyas Gopal makes his T20 debut. He is in for Karnataka team-mate CM Gautam. So Aditya Tare will keep wicket. Also returning is Michael Hussey, in place of Corey Anderson."}, {"ball": 0, "isHighlight": false, "text": "Rohit says it is a dry wicket and he would like to post a big total on it. Watson would have batted first as well"}, {"ball": 0, "isHighlight": false, "text": "Shane Watson is back to lead Royals after missing their previous game with a niggle"}, {"ball": 0, "isHighlight": false, "text": "James: \"Rajasthan always seem to punch above their weight in the IPL. I think there are 2 reasons for this (possibly related). The first is they tend to buy players they think can perform, rather than \"Big Name Superstars\" who don't always deliver. Second, they have been lucky enough to have had 2 of the shrewdest modern cricket brains in charge: Shane Warne and Rahul Dravid.\""}, {"ball": 0, "isHighlight": false, "text": "Rajan Raya: \"Finally Tambe is rested... good due to age factor, they surely needed him in knockout phase of the tournament. Also Chand getting a chance is good opportunity for him to show his talent. \""}, {"ball": 0, "isHighlight": false, "text": "Snehil: \"Looks like both the teams are trying to test their bench strength for this game. Or is it as Gambhir puts it \"horses for courses\"?\""}, {"ball": 0, "isHighlight": false, "text": "$$3.15pm$$  Welcome to our coverage of the 44th game of the season between Rajasthan and Mumbai in Ahmedabad. A win this afternoon should put RR in safe territory along with KXIP and CSK. MI need to win all their remaining four games and hope other results go their way"}, {"ball": 0, "isHighlight": false, "text": "Ramesh Mukka: \"Doors should be open now for Santokie in Malinga's absence!!\""}, {"ball": 0, "isHighlight": false, "text": "MI Fan?: \"The bitter truth has now fully dawned on us MI fans - the team is stuck with overrated (Rayudu, Pollard, Rohit, Anderson, Ojha) and over-the-hill (Bhajji, M. Hussey) players...and shockingly there is no one on the bench to take their places! Except Malinga (who we dont have anymore this season) there are no dependable / potential match-winners in the line-up. Hope the misery (hope of qualifying) ends today...and I can pass on my ticket to the Sunday game with RR to someone who is still interested in MI...\""}, {"ball": 0, "isHighlight": false, "text": "---------------------- The final Powerplay is on. No more chances. This is it. Get your eye in, and score big at  $$CricIQ$$  - The Greatest Test Ever."}, {"ball": 0.1, "isHighlight": false, "text": "Ankit Sharma to Hussey,1 run,a tossed up full ball is whipped out to deep midwicket for a single"}, {"ball": 0.2, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,punched to cover off the back foot"}, {"ball": 0.3, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,makes room outside leg but this is almost yorker length as he squeezes it out to cover"}, {"ball": 0.4, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,on the front foot to defend back to the bowler"}, {"ball": 0.5, "isHighlight": false, "text": "Ankit Sharma to Simmons,1 run,angles it full into the pad and it is worked to deep midwicket"}, {"ball": 0.6, "isHighlight": false, "text": "Ankit Sharma to Hussey,2 runs,he clips it off the pad to the left of deep midwicket, they decide to go for the second after an instant's thought, and make it comfortably"}, {"ball": 0.6, "isHighlight": false, "text": "Siddharth: \"Once again New opening pair for MI !! They could make a world record for having so many opening pairs !\""}, {"ball": 0.6, "isHighlight": false, "text": "Dhawal Kulkarni"}, {"ball": 1.1, "isHighlight": false, "text": "Kulkarni to Simmons,no run,moves across and pushes a good length ball to the off side"}, {"ball": 1.2, "isHighlight": false, "text": "Kulkarni to Simmons,no run,steps down the track now, Kulkarni bowls it widish and it swings further away from a length to beat Simmons' swish"}, {"ball": 1.3, "isHighlight": false, "text": "Kulkarni to Simmons,no run,Kulkrani raises his hand in appeal but this length ball was slipping down leg with the angle, also hit him high above the knee roll"}, {"ball": 1.4, "isHighlight": false, "text": "Kulkarni to Simmons,no run,Simmons charges out again but Kulkarni bowls an offcutter and he cannot find any timing as he flays at it"}, {"ball": 1.5, "isHighlight": false, "text": "Kulkarni to Simmons,no run,second appeal of the over for lbw but it is headed down leg once more, Simmons caught on the crease and missing the tuck to leg"}, {"ball": 1.6, "isHighlight": false, "text": "Kulkarni to Simmons, $$FOUR$$ ,Kulkarni ends the over with a slow bouncer, at 114 kph, Simmons is already setting himself up for the pull, he waits and then drags it past short fine leg from around chest height"}, {"ball": 2.1, "isHighlight": false, "text": "Ankit Sharma to Hussey,1 run,takes this full ball from just outside off and works it to deep midwicket"}, {"ball": 2.2, "isHighlight": false, "text": "Ankit Sharma to Simmons,1 run,moves down the track, bowler angles it in, and Simmons turns it to deep midwicket"}, {"ball": 2.3, "isHighlight": false, "text": "Ankit Sharma to Hussey,no run,Hussey connects with the reverse sweep off this full delivery on the stumps, but hits it straight to short third man"}, {"ball": 2.4, "isHighlight": false, "text": "Ankit Sharma to Hussey,3 runs,this is going down the leg side and Hussey nudges it to the left of short fine leg, where Bhatia's dive is clumsy and futile"}, {"ball": 2.5, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,hits Simmons on the forearm with some bounce as he misses the sweep, couple of quick shouts for leg before turned down"}, {"ball": 2.6, "isHighlight": false, "text": "Ankit Sharma to Simmons,1 run,backs away outside leg and drives to wide long off"}, {"ball": 3.1, "isHighlight": false, "text": "Kulkarni to Simmons, $$FOUR$$ ,Kulkarni provides some width early in the over, and Simmons cuts hard past backward point, third man is up in the circle, not that he would have had much chance had he been deep"}, {"ball": 3.2, "isHighlight": false, "text": "Kulkarni to Simmons,no run,Simmons sees it start on a similar line and sets up for a big shot again, but this is the slower one, it cuts in and takes a thick inside edge onto pad"}, {"ball": 3.3, "isHighlight": false, "text": "Kulkarni to Simmons,1 run,tries to smash the back of a length delivery through the off side, had lots of room, but it is difficult to time on this slow pitch, extra cover fields"}, {"ball": 3.4, "isHighlight": false, "text": "Kulkarni to Hussey,no run,overpitched and slanted across, Hussey drives nicely but cannot beat extra cover"}, {"ball": 3.4, "isHighlight": false, "text": "Chierag Panchal: \"Sensing a special innings from Mr. cricket.\""}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Hussey,1 wide,works up some pace and bounce from short of a length, but the line is down the leg side"}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Hussey,1 run,slower one cutting across to middle from outside leg, worked wristily to deep square leg"}, {"ball": 3.6, "isHighlight": false, "text": "Kulkarni to Simmons,no run,could have been close as Simmons worked a slower one to midiwicket and only Hussey took off, fielder was on to it but Hussey turned back in time"}, {"ball": 3.6, "isHighlight": false, "text": "James Faulkner"}, {"ball": 4.1, "isHighlight": false, "text": "Faulkner to Hussey, $$FOUR$$ ,shot, Hussey is stepping out first ball, and places the drive through the small gap at extra cover"}, {"ball": 4.2, "isHighlight": false, "text": "Faulkner to Hussey,no run,Faulkner goes short, into the left hander, Hussey tries to pull, misses, and is hit"}, {"ball": 4.3, "isHighlight": false, "text": "Faulkner to Hussey,1 run,again the ball does not come on and Hussey drags the pull to deep square"}, {"ball": 4.4, "isHighlight": false, "text": "Faulkner to Simmons, $$FOUR$$ ,there is not much pace available off the pitch, so Simmons cranks up to this length ball and thumps it past backward point's dive"}, {"ball": 4.5, "isHighlight": false, "text": "Faulkner to Simmons, $$FOUR$$ ,and again, Simmons makes plenty of room outside leg stump now and slices the drive in the air, through the gap at point"}, {"ball": 4.6, "isHighlight": false, "text": "Faulkner to Simmons,no run,Faulkner goes into the blockhole, and Simmons can only jab it to mid off even as he backs away again"}, {"ball": 4.6, "isHighlight": false, "text": "Kevon Cooper"}, {"ball": 5.1, "isHighlight": false, "text": "Cooper to Hussey,1 run,starts with a length ball angling across to off, is dabbed down to third man"}, {"ball": 5.2, "isHighlight": false, "text": "Cooper to Simmons, $$FOUR$$ ,Simmons is hitting 'em hard, Cooper overpitches outside off, and Simmons moves forward to smash it past extra cover"}, {"ball": 5.3, "isHighlight": false, "text": "Cooper to Simmons,no run,bouncer, climbs high outside off, Simmons hops and tries to upper-cut, misses"}, {"ball": 5.4, "isHighlight": false, "text": "Cooper to Simmons,1 no ball,confounds him now with a slow bouncer cutting in, Simmons fends at it awkwardly in the end, and is beaten, it is called a no-ball for being above shoulder height, harsh call"}, {"ball": 5.4, "isHighlight": false, "text": "Cooper to Simmons,no run,low full toss driven to mid off"}, {"ball": 5.5, "isHighlight": false, "text": "Cooper to Simmons,1 run,slower one dragged down to long on"}, {"ball": 5.6, "isHighlight": false, "text": "Cooper to Hussey,1 run,softly pushes a 117 kph length ball on leg to the off side for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Naman: \"Cooper is one of the most underrated players of IPL\""}, {"ball": 5.6, "isHighlight": false, "text": "Stuart Binny"}, {"ball": 6.1, "isHighlight": false, "text": "Binny to Hussey,1 run,starts on a good length outside off, Hussey pushes it to third man with an open face"}, {"ball": 6.2, "isHighlight": false, "text": "Binny to Simmons, $$FOUR$$ ,third man is up, this is short, wide and cutting further away, Simmons dabs it in the gap between short third and backward point quite easily"}, {"ball": 6.3, "isHighlight": false, "text": "Binny to Simmons,1 run,pitches it up, Simmons moves forward and pushes it to the sweeper past point"}, {"ball": 6.3, "isHighlight": false, "text": "Vishall Kalwani: \"RR haven't qualified yet for the final four to make so many changes. Feel they should have dropped Karun for Chand. The rest should have played. Tambe was required for today's game.\""}, {"ball": 6.4, "isHighlight": false, "text": "Binny to Hussey,2 runs,Hussey opens the face and drives a pitched up ball through point, sweeper has some running to do"}, {"ball": 6.4, "isHighlight": false, "text": "Rajesh: \"Rajasthan's experiments with the team balance will cost them. Surely Tambe should play on a responsive pitch\""}, {"ball": 6.5, "isHighlight": false, "text": "Binny to Hussey,no run,tries to pull a good length delivery, mishits to midwicket"}, {"ball": 6.6, "isHighlight": false, "text": "Binny to Hussey, $$FOUR$$ ,Hussey goes to the left of the sweeper now with a front foot drive to this widish length ball, and this time he's hit it well enough to beat the man by a fair distance"}, {"ball": 6.6, "isHighlight": false, "text": "First 50-plus opening partnership for MI this season"}, {"ball": 6.6, "isHighlight": false, "text": "Samiuddin Khaja: \"@Naman, you are the most underrated wicket-keeper batsman in the IPL\""}, {"ball": 6.6, "isHighlight": false, "text": "protik: \"Atleast today Pollard should come up the order....\""}, {"ball": 6.6, "isHighlight": false, "text": "Rajat Bhatia"}, {"ball": 7.1, "isHighlight": false, "text": "Bhatia to Simmons,2 runs,starts with a pitched up ball on the pad and is worked through midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Bhatia to Simmons,2 runs,a loop, slow, dipping, low full toss from Bhatia, Simmons leans out to softly push towards long on, and Hussey scrambles back for the second"}, {"ball": 7.3, "isHighlight": false, "text": "Bhatia to Simmons,no run,cannot get this one around off away, Bhatia fields on the off side"}, {"ball": 7.4, "isHighlight": false, "text": "Bhatia to Simmons,1 run,a length ball coming in at 92 kph, pushed to long on"}, {"ball": 7.5, "isHighlight": false, "text": "Bhatia to Hussey, $$FOUR$$ ,the pitch may be slow, but the outfield is very fast, Hussey opens the face and punches in the gap between backward point and short third man, and both the men have no chance in the chase"}, {"ball": 7.6, "isHighlight": false, "text": "Bhatia to Hussey,1 run,worked off the pad through square leg"}, {"ball": 8.1, "isHighlight": false, "text": "Kulkarni to Hussey,1 run,almost carries to sweeper cover as Hussey lofts this full delivery, gets to Binny on the bounce"}, {"ball": 8.2, "isHighlight": false, "text": "Kulkarni to Simmons,1 run,width on the length ball, Simmons slaps it to the sweeper"}, {"ball": 8.3, "isHighlight": false, "text": "Kulkarni to Hussey,1 run,this slow bouncer rises quite high on Hussey, he swivels and checks the hook, just guides it down to fine leg in the end"}, {"ball": 8.4, "isHighlight": false, "text": "Kulkarni to Simmons,1 run"}, {"ball": 8.5, "isHighlight": false, "text": "Kulkarni to Hussey,1 run,Hussey skips out as Kulkarni pitches it up from round the stumps, he lofts to the right of long off, Faulkner almost over runs the ball, but gets a hand to it to prevent the boundary"}, {"ball": 8.6, "isHighlight": false, "text": "Kulkarni to Simmons,1 run,down to third man who runs to his right and keeps them to one"}, {"ball": 8.6, "isHighlight": false, "text": "James: \"92kph from Bhatia. Not so much \"pace like fire\", more \"pace like a wet flannel\".\""}, {"ball": 9.1, "isHighlight": false, "text": "Bhatia to Simmons,1 run,almost plays on, he had backed away to leg and taken a swipe at this full delivery, thick inside edged it behind square on leg in the end"}, {"ball": 9.2, "isHighlight": false, "text": "Bhatia to Hussey,1 run,turned in front of square on leg off the pad"}, {"ball": 9.3, "isHighlight": false, "text": "Bhatia to Simmons,1 run,Simmons stands outside leg, Bhatia's delivery takes its time in arriving at 88 kph, Simmons almost hits it back to the bowler, just past his left to long off"}, {"ball": 9.4, "isHighlight": false, "text": "Bhatia to Hussey,1 run,overpitched, Hussey drills it straight past the bowler, long on runs around to field"}, {"ball": 9.5, "isHighlight": false, "text": "Bhatia to Simmons,1 run,and Bhatia almost gets Simmons again, he had walked out, Bhatia bowled his leg roller, and it bounced and moved away, Simmons pushed and it popped just wide of the bowler to his left"}, {"ball": 9.6, "isHighlight": false, "text": "Bhatia to Hussey,1 run,Hussey is managing to time nearly everything on this slow pitch, now he waits and punches a length ball just past extra cover"}, {"ball": 9.6, "isHighlight": false, "text": "Karthik: \"Am honestly baffled by RR's tactics. Continuing to persist with Binny and resting form players such as Tambe, Smith & Rahane. They should be looking to play full strength and win all 3 games, given that one of those is against table leaders KxiP \""}, {"ball": 10.1, "isHighlight": false, "text": "Faulkner to Hussey, $$SIX$$ ,starts with a slow back of a length ball cutting away outside off, Hussey sends it soaring over deep midwicket with a solid pull"}, {"ball": 10.2, "isHighlight": false, "text": "Faulkner to Hussey,no run,denies him width this time, Hussey nudges to midwicket"}, {"ball": 10.3, "isHighlight": false, "text": "Faulkner to Hussey,1 run,whips a length delivery to deep square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Faulkner to Simmons,1 run,makes some room and slogs down to long on"}, {"ball": 10.5, "isHighlight": false, "text": "Faulkner to Hussey,1 wide,steps down the track but Faulkner digs it short, too short it turns out"}, {"ball": 10.5, "isHighlight": false, "text": "Faulkner to Hussey,no run,hurls it full into the pad, Hussey misses the clip, trots out for a single, but Faulkner rushes forward to prevent that"}, {"ball": 10.6, "isHighlight": false, "text": "Faulkner to Hussey,1 run,Hussey times another drive through the off side, extra cover dives, takes pace off it"}, {"ball": 10.6, "isHighlight": false, "text": "kumar: \"Nice to see hussey back, playing his usual high standards. Hope brother Hussey does for CSK as well.\""}, {"ball": 11.1, "isHighlight": false, "text": "Ankit Sharma to Hussey,2 runs,gets some width from the left arm spinner and cuts through point, easy couple as sweeper runs around"}, {"ball": 11.2, "isHighlight": false, "text": "Ankit Sharma to Hussey, $$SIX$$ ,Hussey slog-sweeps, takes it from outside off, it flies 79 metres into the crowd in front of square"}, {"ball": 11.3, "isHighlight": false, "text": "Ankit Sharma to Hussey,1 run,chops the cut close to the pitch and takes the single to reach fifty in his IPL match since April 27"}, {"ball": 11.4, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,that turned, was angled in well down leg as Simmons moved away as well, then changed direction sharply to almost hit leg stump, Simmons beaten by a long way"}, {"ball": 11.5, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,straightening on middle, Simmons cannot force it past the bowler"}, {"ball": 11.6, "isHighlight": false, "text": "Ankit Sharma to Simmons,1 run,now he backs away to leg and pulls hard, deep midwicket runs to his left to cut it off"}, {"ball": 12.1, "isHighlight": false, "text": "Bhatia to Simmons,2 runs,Simmons moves outside leg and cracks this length ball, Watson dives to his left at extra cover and gets a hand to it"}, {"ball": 12.2, "isHighlight": false, "text": "Bhatia to Simmons, $$SIX$$ ,Bhatia bowls it at 96 kph, Simmons backs away and slogs, connects well enough to hit it way over deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Bhatia to Simmons,1 run,quicker and in the blockhole, Simmons swipes, inside-edges behind square leg"}, {"ball": 12.4, "isHighlight": false, "text": "Bhatia to Hussey,1 run,pitched up on middle and leg, driven down to long off"}, {"ball": 12.4, "isHighlight": false, "text": "Narbavi: \"Time to roll your over arm Mr.Watson.\""}, {"ball": 12.5, "isHighlight": false, "text": "Bhatia to Simmons,1 run,winds up and has another slog at a full one outside off, underedges it"}, {"ball": 12.6, "isHighlight": false, "text": "Bhatia to Hussey,no run,Hussey tries the reverse paddle to a full one just outside off, but misses"}, {"ball": 12.6, "isHighlight": false, "text": "Ayush: \"Rajasthan is making changes as if they have already qualified.Don't they know with whom their last matches are.\""}, {"ball": 12.6, "isHighlight": false, "text": "TrueMan: \"M. Hussey's innings showed the true problem for MI. They under-estimated Michael Hussey and over-estimated Corey Anderson.\""}, {"ball": 13.1, "isHighlight": false, "text": "Cooper to Simmons, $$SIX$$ ,Simmons goes maximum first ball of the over, Cooper pitches it up just outside off and Simmons clears front leg to clobber it over long off"}, {"ball": 13.2, "isHighlight": false, "text": "Cooper to Simmons,2 runs,goes much wider on a length, Simmons reaches it and stabs it wide of the sweeper"}, {"ball": 13.3, "isHighlight": false, "text": "Cooper to Simmons,1 run,wide outside off again, cut to sweeper cover for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Bala: \"Rajat Bhatia bowls so slow, he practises by himself. Bowls at one end, pads up and bats at the other end!! \""}, {"ball": 13.4, "isHighlight": false, "text": "Cooper to Hussey,2 runs,he's hit gaps so well today, this is full on off, he drills it through extra cover, Chand puts in the dive at long off to deny him the boundary"}, {"ball": 13.5, "isHighlight": false, "text": "Cooper to Hussey,1 run,shortish, pulled behind square leg"}, {"ball": 13.6, "isHighlight": false, "text": "Cooper to Simmons,no run,beaten as he pushes at a length ball outside off"}, {"ball": 13.6, "isHighlight": false, "text": "Time out"}, {"ball": 13.6, "isHighlight": false, "text": "KALYAN: \"@bala...Rajat Bhatia then comes back and does umpiring also....\""}, {"ball": 14.1, "isHighlight": false, "text": "Ankit Sharma to Hussey,1 run,moves back to a length ball on middle and off and works it behind square leg"}, {"ball": 14.1, "isHighlight": false, "text": "Shan Fastian: \"Stop Bhatia Trolls. Its hurting his performance.\""}, {"ball": 14.2, "isHighlight": false, "text": "Ankit Sharma to Simmons,no run,makes some room, but slaps it straight to extra cover"}, {"ball": 14.3, "isHighlight": false, "text": "Ankit Sharma to Simmons, $$OUT$$ ,they finally break the partnership, Ankit tosses it up, Simmons skips out and lofts it, he isn't quite to the pitch, and the ball spins away from him, Cooper settles under the skier in front of the sightscreen"}, {"ball": 14.3, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$c$$ $$Cooper$$ $$b$$ $$Ankit$$ $$Sharma$$ $$62$$ $$(69m$$ $$51b$$ $$6x4$$ $$2x6)$$ $$SR:$$ $$121.56$$"}, {"ball": 14.3, "isHighlight": false, "text": "Pollard at No 3"}, {"ball": 14.4, "isHighlight": false, "text": "Ankit Sharma to Hussey,1 run,sweeps in front of square from just outside off"}, {"ball": 14.5, "isHighlight": false, "text": "Ankit Sharma to Pollard,1 run,lots of turn, angles it to leg and turns it across the batsman, Pollard nudges it towards point"}, {"ball": 14.6, "isHighlight": false, "text": "Ankit Sharma to Hussey, $$OUT$$ ,two wickets in the over, Hussey tries to go a bit straighter with the slog sweep, this is bowled wide outside off and he has to fetch it, ends up finding long on, Cooper it is again"}, {"ball": 14.6, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$c$$ $$Cooper$$ $$b$$ $$Ankit$$ $$Sharma$$ $$56$$ $$(72m$$ $$39b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$143.58$$"}, {"ball": 14.6, "isHighlight": false, "text": "Rohit in at No 4"}, {"ball": 15.1, "isHighlight": false, "text": "Bhatia to Sharma,no run,comes in to around off stump, Rohit pushes forward and trots out, has to hurry back as the ball goes to point"}, {"ball": 15.2, "isHighlight": false, "text": "Bhatia to Sharma,1 run,opens the face on the leg cutter to guide it to point and takes the single, there is a direct hit but Pollard is home, almost past the stumps"}, {"ball": 15.3, "isHighlight": false, "text": "Bhatia to Pollard,no run,clear  $$run-out$$ $$chance$$  missed, Pollard had no chance of making it  back after coming too far down, midwicket picked up the ball and fired it to the keeper, who broke the stumps, but before that, he let the ball slip out of his gloves"}, {"ball": 15.4, "isHighlight": false, "text": "Bhatia to Pollard, $$SIX$$ ,next ball Pollard charges out and heaves it high, it is a mishit, but just clears the long on boundary"}, {"ball": 15.5, "isHighlight": false, "text": "Bhatia to Pollard,1 run,opens the face and guides a length ball to point"}, {"ball": 15.6, "isHighlight": false, "text": "Bhatia to Sharma, $$FOUR$$ ,more runs, Rohit bends forward for the paddle and executes it neatly from around off, picks up four to the fine leg rope"}, {"ball": 16.1, "isHighlight": false, "text": "Cooper to Pollard,1 run,a full toss, but Pollard inside edges it on to pad as he looks to hit it square on leg"}, {"ball": 16.2, "isHighlight": false, "text": "Cooper to Sharma,no run,a slower shortish delivery, Rohit is surprised by the lift and lack of pace, and is beaten"}, {"ball": 16.3, "isHighlight": false, "text": "Cooper to Sharma,no run,charges out and heaves, only manages an inside edge to the left of the keeper, Samson gathers, throws and hits the stumps, but Rohit has just made it back"}, {"ball": 16.4, "isHighlight": false, "text": "Cooper to Sharma, $$SIX$$ ,Cooper bowls another full toss, outside off, Rohit smashes it over the deep extra cover boundary"}, {"ball": 16.5, "isHighlight": false, "text": "Cooper to Sharma,no run,comes down the track and swings hard, but this is an offcutter, and comes in to beat him"}, {"ball": 16.6, "isHighlight": false, "text": "Cooper to Sharma,no run,Cooper gets away, third man is up, he bowls one more full toss outside off, Rohit steers it with nice timing, but picks the fielder"}, {"ball": 17.1, "isHighlight": false, "text": "Faulkner to Pollard,2 runs,Pollard comes down the track, inside edges in front of square, Faulkner goes after it, but they have time to take the second"}, {"ball": 17.2, "isHighlight": false, "text": "Faulkner to Pollard,no run,beats him with a full delivery that moves away late in the air, and almost hits the off stump"}, {"ball": 17.3, "isHighlight": false, "text": "Faulkner to Pollard,1 leg bye,comes outside the crease again but cannot get bat to ball on this pitched up delivery, Faulkner shouts for leg before, just in case"}, {"ball": 17.4, "isHighlight": false, "text": "Faulkner to Sharma,no run,now he beats Rohit, who makes room outside leg, Faulkner follows him there, and generates some more late swing to beat the bat"}, {"ball": 17.5, "isHighlight": false, "text": "Faulkner to Sharma, $$FOUR$$ ,Rohit tries to swipe this over square leg, the ball flies in the air between the keeper and short third man"}, {"ball": 17.6, "isHighlight": false, "text": "Faulkner to Sharma,1 run,more late away swing on this full delivery to end the over, but this time Rohit follows it to guide it to point"}, {"ball": 18.1, "isHighlight": false, "text": "Kulkarni to Sharma,1 run,low full toss from round the stumps flicked to deep midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "Kulkarni to Pollard,1 leg bye,another full ball into the pad, Pollard is making room but cannot connect"}, {"ball": 18.3, "isHighlight": false, "text": "Kulkarni to Sharma, $$SIX$$ ,decides to bowl it short now, and Rohit pulls it from around stomach height over deep square leg"}, {"ball": 18.4, "isHighlight": false, "text": "Kulkarni to Sharma,1 run,Rohit slogs at a length ball, mishits to deep midwicket"}, {"ball": 18.5, "isHighlight": false, "text": "Kulkarni to Pollard,2 runs,goes full around leg to Pollard again, he tries the reverse paddle, it hits the toe end and pops up behind square on the leg side"}, {"ball": 18.6, "isHighlight": false, "text": "Kulkarni to Pollard,1 leg bye,keeps Pollard quiet throughout the over with another full delivery outside leg stump, Pollard cannot connect yet again"}, {"ball": 19.1, "isHighlight": false, "text": "Faulkner to Pollard,1 run,that is the same ploy from Faulkner to Pollard as well, full just outside leg with some swing, Pollard swings and misses once more"}, {"ball": 19.2, "isHighlight": false, "text": "Faulkner to Sharma, $$SIX$$ ,does not work against Rohit, Faulkner full outside leg again, Rohit opens up a bit and crashes it over deep midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Faulkner to Sharma, $$SIX$$ ,a length ball, Rohit gets under it , clears front leg and lifts it over long off"}, {"ball": 19.4, "isHighlight": false, "text": "Faulkner to Sharma,no run,Faulkner pings in a sharp bouncer that comes in around head height, Rohit swings and misses"}, {"ball": 19.5, "isHighlight": false, "text": "Faulkner to Sharma, $$FOUR$$ ,Faulkner pitches it up after that bouncer, and even though it swings away, Rohit clears front leg again and is in a position to drill it into the straight boundary"}, {"ball": 19.5, "isHighlight": false, "text": "round the stumps"}, {"ball": 19.6, "isHighlight": false, "text": "Faulkner to Sharma, $$OUT$$ ,ends the innings with a perfect yorker, Rohit jams down the bat on it and trots out, Faulkner rushes forward, picks it up and removes the bail with Rohit far out"}, {"ball": 19.6, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$run$$ $$out$$ $$40$$ $$(23m$$ $$19b$$ $$3x4$$ $$4x6)$$ $$SR:$$ $$210.52$$"}, {"ball": 19.6, "isHighlight": false, "text": "Michael Hussey: \"I have been practising hard, hitting the ball well in the nets, just wasn't getting an opportunity. Glad to get the opportunity today.\" He thinks this is a good score, with the ball turning, but cautions that the outfield is very quick"}, {"ball": 19.6, "isHighlight": false, "text": "MI have three spinners. This could be a match-winning score on a slow turner."}, {"ball": 19.6, "isHighlight": false, "text": "Abdullah: \"@Jason: I guess you did not see the RR vs KKR match in Abu Dhabi this year. I was there and saw the mayhem he caused, live. \""}, {"ball": 19.6, "isHighlight": false, "text": ""}, {"ball": 19.6, "isHighlight": false, "text": "RRvsMI: \"Pravin Tambe would have been very effective on this pitch. Royals misread it completely I guess..\""}, {"ball": 19.6, "isHighlight": false, "text": "Bino Raaj: \"I do not understand RR's decision of \"resting\" Tambe on a pitch that favours spinners!!\""}, {"ball": 19.6, "isHighlight": false, "text": "Jason: \"I have always heard that Faulkner was an outstanding death bowler but the number of times I've seen him get carted around in the past few months for Australia and in the IPL is just ridiculous. Is he out of form or is he just facing quality opposition for the first time?\""}], "name": "Rajasthan Royals v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734017.html?innings=1;view=commentary", "match_num": 44}