{"commentary": [{"ball": 0, "isHighlight": false, "text": "Unmukt Chand and Karun Nair to open for RR. Bumrah with the new ball"}, {"ball": 0.1, "isHighlight": false, "text": "Bumrah to Nair,1 run,short of a length, coming in from wide outside off, guided to third man"}, {"ball": 0.2, "isHighlight": false, "text": "Bumrah to Chand,no run,comes in sharply with the angle, Chand pushes it towards point"}, {"ball": 0.3, "isHighlight": false, "text": "Bumrah to Chand,no run,he looks to punch through point, but it comes in sharply from outside off, and beats the inside edge"}, {"ball": 0.4, "isHighlight": false, "text": "Bumrah to Chand,no run,he bowls it fuller now, angles it in again, Chand tries a big drive and misses, the ball almost hits off"}, {"ball": 0.5, "isHighlight": false, "text": "Bumrah to Chand,1 run,swings again and gets a thick inside edge towards short fine leg now"}, {"ball": 0.6, "isHighlight": false, "text": "Bumrah to Nair,1 wide,bowls it much straighter but it starts way outside off"}, {"ball": 0.6, "isHighlight": false, "text": "Bumrah to Nair,1 run,pushes away from the body at a widish length ball and it goes to third man"}, {"ball": 0.6, "isHighlight": false, "text": "Santokie to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Santokie to Nair,1 run,starts on a length outside leg stump, is worked square"}, {"ball": 1.2, "isHighlight": false, "text": "Santokie to Chand,1 wide,swings it in but it starts outside leg and moves further down"}, {"ball": 1.2, "isHighlight": false, "text": "Santokie to Chand,no run,pitched up inswinger hits the pad, and rolls to the keeper"}, {"ball": 1.2, "isHighlight": false, "text": "hemant: \"it will not be easy for chand....first game and chasing a big target....no time to get his feet in\""}, {"ball": 1.3, "isHighlight": false, "text": "Santokie to Chand,1 run,would have been another wide down leg had he not nudged it to short fine leg"}, {"ball": 1.4, "isHighlight": false, "text": "Santokie to Nair, $$SIX$$ ,a full toss, Karun Nair moves outside leg stump, and slices it over the infield, it goes all the way over the deep point boundary"}, {"ball": 1.5, "isHighlight": false, "text": "Santokie to Nair,no run,a slower one bowled full on off, pushed to midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Santokie to Nair, $$FOUR$$ ,Karun gets it over the infield again, Santokie slants it on a length across him, and he wristily picks it just over Pollard's leap at point"}, {"ball": 1.6, "isHighlight": false, "text": "Milind: \"I feel Santokie is one of the most under-rated bowlers in T20. With his wicket taking ability and more than good Economy rate in T20, he would be a must-play bowler for any team !\""}, {"ball": 1.6, "isHighlight": false, "text": "Pragyan Ojha"}, {"ball": 2.1, "isHighlight": false, "text": "Ojha to Chand,no run,goes for a big sweep to a full ball straightening on off, thick inside-edges to backward square"}, {"ball": 2.2, "isHighlight": false, "text": "Ojha to Chand,no run,shortish ball slapped to extra cover"}, {"ball": 2.3, "isHighlight": false, "text": "Ojha to Chand, $$OUT$$ ,they have Hussey at deep midwicket, Chand pulls a short of a length delivery, Hussey runs and tumbles forward to complete the catch"}, {"ball": 2.3, "isHighlight": false, "text": "$$UBT$$ $$Chand$$ $$c$$ $$Hussey$$ $$b$$ $$Ojha$$ $$2$$ $$(12m$$ $$9b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$22.22$$"}, {"ball": 2.3, "isHighlight": false, "text": "Watson at No 3"}, {"ball": 2.3, "isHighlight": false, "text": "Anurag Sharma: \"Is there some underrated trend today? Cooper, Naman now Santokie\""}, {"ball": 2.4, "isHighlight": false, "text": "Ojha to Nair,2 runs,goes outside off, and dabs it with the spin past slip, short third man chases"}, {"ball": 2.5, "isHighlight": false, "text": "Ojha to Nair, $$FOUR$$ ,not the best effort at point from Harbhajan as Karun cuts hard, he runs to his right, square leg umpire is close by, perhaps that is why Harbhajan slides too early, and by the time he recovers and gets up to chase, the ball rolls into the boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Ojha to Nair, $$FOUR$$ ,some more width on a length from Ojha and Karun goes back to cut in front of square for four more"}, {"ball": 2.6, "isHighlight": false, "text": "Mudassir Hashmi: \"Unmukt Chand is the best example of high-expectations, low-output player. He needs more feats to justify his hype!!\""}, {"ball": 2.6, "isHighlight": false, "text": "Pollard comes on"}, {"ball": 3.1, "isHighlight": false, "text": "Pollard to Watson,no run,short of a length, just outside off, pushed to the bowler"}, {"ball": 3.2, "isHighlight": false, "text": "Pollard to Watson,no run,short of a length again, punched to extra cover"}, {"ball": 3.3, "isHighlight": false, "text": "Pollard to Watson, $$FOUR$$ ,fuller from Pollard and wide too, Watson cuts hard, not too far from Rayudu at backward point, but he lets it rush past"}, {"ball": 3.4, "isHighlight": false, "text": "Pollard to Watson,1 run,comes forward to an incoming ball, it runs square on the leg side"}, {"ball": 3.4, "isHighlight": false, "text": "Ashish: \"Amazing how many times we say 'Underrated' when RR is playing\""}, {"ball": 3.5, "isHighlight": false, "text": "Pollard to Nair,no run,not too much room to cut but Karun times the shot, Hussey stops it on the bounce at backward point"}, {"ball": 3.6, "isHighlight": false, "text": "Pollard to Nair, $$SIX$$ ,what a strike, he charges out to a length ball and mows it into the crowd beyond the long on boundary"}, {"ball": 3.6, "isHighlight": false, "text": "guruji: \"Nair going at it again... So much of young talent and just 11 positions in the national team! Totally not fair. Wish there was a way to get them a bigger platform.\""}, {"ball": 4.1, "isHighlight": false, "text": "Ojha to Watson,no run,Watson is looking for a big shot, but pushes the length ball to mid on in the end"}, {"ball": 4.2, "isHighlight": false, "text": "Ojha to Watson, $$OUT$$ ,he sees the chance to pull this shortish ball, but it spins away and bounces, and he toe ends it for mid on to take a simple catch to his right"}, {"ball": 4.2, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$Rayudu$$ $$b$$ $$Ojha$$ $$5$$ $$(7m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$83.33$$"}, {"ball": 4.3, "isHighlight": false, "text": "Ojha to Nair,1 run,walks to off and tries a big sweep to a full ball, underedges it to short fine leg"}, {"ball": 4.4, "isHighlight": false, "text": "Ojha to Samson,2 runs,goes back to a pitched up delivery but is able to punch through the covers for a couple"}, {"ball": 4.5, "isHighlight": false, "text": "Ojha to Samson,no run,quicker on middle, he backs away and cuts to cover"}, {"ball": 4.6, "isHighlight": false, "text": "Ojha to Samson,no run,it straightens just outside off, he punches from the crease to point"}, {"ball": 4.6, "isHighlight": false, "text": "Piyush: \"I believe Mumbai got their act right a bit too late. And now that they dont have Malinga, it takes the spice out of their bowling a bit. So RR might fancy chasing this big total down.\""}, {"ball": 5.1, "isHighlight": false, "text": "Santokie to Nair,1 run,a length ball down the leg side nudged behind square"}, {"ball": 5.2, "isHighlight": false, "text": "Santokie to Samson,no run,a slower one, good length, angling across, he is beaten as he pushes at it"}, {"ball": 5.3, "isHighlight": false, "text": "Santokie to Samson, $$OUT$$ ,another one goes, Samson tries going over the off-side infield, but he is nowhere in control as the slower one cuts away from him, he slices the mishit, Rayudu runs back from cover and takes it"}, {"ball": 5.3, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$Rayudu$$ $$b$$ $$Santokie$$ $$2$$ $$(5m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$40.00$$"}, {"ball": 5.4, "isHighlight": false, "text": "Santokie to Nair,2 runs,punches a good length ball to long off"}, {"ball": 5.5, "isHighlight": false, "text": "Santokie to Nair,no run,gets down for the sweep and connects off the length ball, but finds square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Santokie to Nair,1 wide,floats it up slow and way outside off"}, {"ball": 5.6, "isHighlight": false, "text": "Santokie to Nair,2 runs, $$difficult$$ $$chance$$  running back from mid on as batsman skies a slog, Gopal does well to get to the ball as it comes down from behind him, but cannot pouch it"}, {"ball": 6.1, "isHighlight": false, "text": "Ojha to Cooper,no run,plays a tossed up ball off the back foot, pushes it to point"}, {"ball": 6.2, "isHighlight": false, "text": "Ojha to Cooper,no run,has a heave at a tossed up ball  but is beaten by a long way with the sharp turn, Tare appeals for the stumping but Cooper's back foot is grounded"}, {"ball": 6.3, "isHighlight": false, "text": "Ojha to Cooper,2 runs,comes across and works it through vacant midwicket for a couple"}, {"ball": 6.4, "isHighlight": false, "text": "Ojha to Cooper,1 run,thick outside edge as he drives, Santokie dives at short third man to stop it"}, {"ball": 6.5, "isHighlight": false, "text": "Ojha to Nair, $$SIX$$ ,shout of 'catch it' as Karun lunges forward on a knee to hit a flat sweep, but it flies well over the man at deep square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Ojha to Nair,2 runs,now he goes back to cut from close to off, sweeper runs to his left, it is a tight second, but he makes it"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan from round the stumps"}, {"ball": 6.6, "isHighlight": false, "text": "Time out"}, {"ball": 6.6, "isHighlight": false, "text": "Use the strategic time-out wisely. Play your shots at  $$CricIQ$$ , and stay in the reckoning for tickets to London to watch India v England at Lord's."}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Cooper,no run,tossed up full one leg, pushed down the track"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Cooper,no run,sliding across the right hander from a length, Cooper is beaten on the cut"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Cooper,1 wide,way down the leg side, Cooper has a crack at it, misses"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Cooper,2 runs,another one down the leg side, Cooper swings and connects, gets it wide of short fine leg, deep square runs around to stop it"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Cooper, $$OUT$$ ,what an incredible sequence this is, Pollard leaps high to take a one-handed screamer at long on as Cooper swats a shortish delivery, Pollard staggers to the ground, takes a couple of steps towards the boundary, the second one is probably millimetres away from the rope, he throws the ball up as he goes over, then runs back several feet, and dives forward to complete the catch, given after they check with the third umpire"}, {"ball": 7.4, "isHighlight": false, "text": "$$KK$$ $$Cooper$$ $$c$$ $$Pollard$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$5$$ $$(12m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$62.50$$"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Nair,no run,full outside off, pushed to the bowler"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Nair,no run,full again, reverse swept straight to point"}, {"ball": 8.1, "isHighlight": false, "text": "Gopal to Ankit Sharma,2 runs,Gopal starts with a short legbreak, it is pulled between deep midwicket and long on, but not enough on it to beat the men"}, {"ball": 8.2, "isHighlight": false, "text": "Gopal to Ankit Sharma,1 wide,misses the sweep as this fuller one spins down the leg side"}, {"ball": 8.2, "isHighlight": false, "text": "Gopal to Ankit Sharma,2 runs,a flatter one outside off, he cuts well in front of square, Hussey prevents the boundary"}, {"ball": 8.3, "isHighlight": false, "text": "Gopal to Ankit Sharma, $$OUT$$ ,Rajasthan crumbling, Ankit Sharma slog-sweeps from around off and deep midwicket comes a few steps forward to his left to take it"}, {"ball": 8.3, "isHighlight": false, "text": "$$Ankit$$ $$Sharma$$ $$c$$ $$Rayudu$$ $$b$$ $$Gopal$$ $$4$$ $$(3m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 8.3, "isHighlight": false, "text": "Lokesh: \"Cannot believe my eyes as to what I just witnessed..Incredible!! Incredible!! Incredible!! \""}, {"ball": 8.3, "isHighlight": false, "text": "Vijay VV: \"Ooh my goodness, what did i just see, Pollard pulls off a stunner, hats off to the presence of mind. Was just waiting for one like this from him. Players, please hit atleast another 5-6 metres above where Pollard is standing.\""}, {"ball": 8.4, "isHighlight": false, "text": "Gopal to Nair,1 run,straightens just outside off, is cut to point"}, {"ball": 8.5, "isHighlight": false, "text": "Gopal to Binny,no run,a tossed up full googly, pushed down the track, bowler fields to his right with a dive"}, {"ball": 8.6, "isHighlight": false, "text": "Gopal to Binny,1 run,stays low from a good length around off, worked to deep midwicket"}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to Binny,no run,offbreak spins in sharply from outside off and hits the thigh pad"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to Binny,no run,appeal for lbw as he is hit on the pad with a fuller one"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to Binny,no run,quick and spinning in, worked to midwicket"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to Binny,no run,a fuller one, he comes forward and is hit on the pad again, another shout but he was outside the line"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Binny,1 run,tossed up outside off, inside edged off the front foot to the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to Nair,no run,full outside off, turned to midwicket with the spin"}, {"ball": 10.1, "isHighlight": false, "text": "Gopal to Binny,no run,comes down the track to one that does not turn much, and swats it to extra cover"}, {"ball": 10.2, "isHighlight": false, "text": "Gopal to Binny,no run,this one is tossed up high and full and turns away from his big attempted drive"}, {"ball": 10.3, "isHighlight": false, "text": "Gopal to Binny, $$OUT$$ ,excellent from the legspinner to get his Karnataka team-mate, he continues to flight it outside off, Binny charges out and heaves, is beaten by the sharp turn and it is an easy stumping"}, {"ball": 10.3, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$st$$ $$†Tare$$ $$b$$ $$Gopal$$ $$2$$ $$(6m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$"}, {"ball": 10.3, "isHighlight": false, "text": "Aamer: \"That was even better than Lynn's Catch!\""}, {"ball": 10.3, "isHighlight": false, "text": "Hodge is in"}, {"ball": 10.4, "isHighlight": false, "text": "Gopal to Hodge,no run,full delivery does not turn, Hodge steers it to point"}, {"ball": 10.5, "isHighlight": false, "text": "Gopal to Hodge,no run,goes back to a pitched up ball to push to mid off"}, {"ball": 10.6, "isHighlight": false, "text": "Gopal to Hodge,1 run,punched off the back foot to deep point"}, {"ball": 10.6, "isHighlight": false, "text": "Vishwas N S: \"Karun Nair , Lone Warrior at the other end watching RR crumble.\""}, {"ball": 11.1, "isHighlight": false, "text": "Harbhajan Singh to Hodge,no run,hits the pad on the forward push with sharp turn, shout for leg before, but he is outside the line"}, {"ball": 11.2, "isHighlight": false, "text": "Harbhajan Singh to Hodge,no run,another one pings the pad, and Harbhajan's appeal turned down again, possibly outside the line once more"}, {"ball": 11.2, "isHighlight": false, "text": "MeenaSathya: \"Did RR forget about top 2 finish ? They are missing a good opportunity to go second in the points table. Too many changes will create more confusion. \""}, {"ball": 11.3, "isHighlight": false, "text": "Harbhajan Singh to Hodge,no run"}, {"ball": 11.4, "isHighlight": false, "text": "Harbhajan Singh to Hodge,1 run,tosses it up high and full, it is worked through midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "Harbhajan Singh to Nair, $$FOUR$$ ,Karun still going strong, he gets down on a knee outside off stump and sweeps with the spin high over short fine"}, {"ball": 11.6, "isHighlight": false, "text": "Harbhajan Singh to Nair, $$OUT$$ ,Karun falls, he comes down the track to a flighted one, nowhere to the pitch as it dips, tries to go straight over the bowler, but mishits it badly, Santokie runs in from long off and tumbles forward to take it"}, {"ball": 11.6, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$c$$ $$Santokie$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$48$$ $$(55m$$ $$24b$$ $$4x4$$ $$3x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 12.1, "isHighlight": false, "text": "Gopal to Faulkner,no run,goes back to punch a legbreak to the bowler"}, {"ball": 12.1, "isHighlight": false, "text": "Hisham: \"I still prefer Lynn's catch over Pollard's catch because the catch he took today can be see now-a-days in T20 cricket but Lynn's catch was \"once in a lifetime catch\"\""}, {"ball": 12.2, "isHighlight": false, "text": "Gopal to Faulkner,2 runs,has him reaching to a spinning delivery, thick outside edge runs past slip"}, {"ball": 12.2, "isHighlight": false, "text": "Two slips"}, {"ball": 12.3, "isHighlight": false, "text": "Gopal to Faulkner,1 run,tossed up wrong 'un wide outside off, pushed off the front foot to the sweeper"}, {"ball": 12.3, "isHighlight": false, "text": "Lokesh Devan: \"Pollard you beauty!! You make the impossibles look so simple.\""}, {"ball": 12.4, "isHighlight": false, "text": "Gopal to Hodge,no run,has a heave at a flighted legbreak outside off and is beaten by the turn"}, {"ball": 12.5, "isHighlight": false, "text": "Gopal to Hodge,1 run,quicker and fuller, pushed wide of point for a quick single"}, {"ball": 12.6, "isHighlight": false, "text": "Gopal to Faulkner,1 run,tossed up slowly and dips full, he comes forward and opens the face to run it behind point"}, {"ball": 12.6, "isHighlight": false, "text": "Big Tummy: \"For every kid who is following (including my son), there are 2 lessons that you can learn here: 1. never rest your best player unless it is a dead rubber, 2. don't fix if it ain't broken.\""}, {"ball": 12.6, "isHighlight": false, "text": "Shuvam : \"This loss will hurt RR badly. Running out of steam at just the wrong time. This will be a test of their mental strength, how they can recover from such a pounding.\""}, {"ball": 13.1, "isHighlight": false, "text": "Harbhajan Singh to Faulkner,no run,flat offbreak outside off, turned to midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Harbhajan Singh to Faulkner,1 run,leans forward to work it past midwicket"}, {"ball": 13.3, "isHighlight": false, "text": "Harbhajan Singh to Hodge,no run"}, {"ball": 13.4, "isHighlight": false, "text": "Harbhajan Singh to Hodge,2 runs,slogs at a fullish one, wide of deep square leg for a couple, Rayudu stops it with a slide"}, {"ball": 13.5, "isHighlight": false, "text": "Harbhajan Singh to Hodge,1 run,bowled much slower on a length outside off, tapped in front of square for one"}, {"ball": 13.6, "isHighlight": false, "text": "Harbhajan Singh to Faulkner,no run,excellent delivery, tosses it up close to off, draws him forward, and it does not turn in, goes straight past the outside edge"}, {"ball": 13.6, "isHighlight": false, "text": "Sriram Raghava: \"More than the mental pounding, it's more of a NRR mess up for RR.\""}, {"ball": 14.1, "isHighlight": false, "text": "Gopal to Hodge,1 run,legbreak spins away outside off, Hodge helps it to the sweeper for one"}, {"ball": 14.2, "isHighlight": false, "text": "Gopal to Faulkner,1 run,in the blockhole now, squeezed back past the non-striker"}, {"ball": 14.3, "isHighlight": false, "text": "Gopal to Hodge, $$SIX$$ ,full on leg stump, Hodge slog-sweeps into the crowd over deep midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Gopal to Hodge,1 run,goes outside off now, Hodge cuts it to sweeper cover"}, {"ball": 14.5, "isHighlight": false, "text": "Gopal to Faulkner,1 run,slices a heave in front of long off, Pollard runs forward but cannot reach it in time"}, {"ball": 14.6, "isHighlight": false, "text": "Gopal to Hodge,2 runs,cut to sweeper cover for a couple"}, {"ball": 15.1, "isHighlight": false, "text": "Ojha to Faulkner,1 run,quick delivery just outside off, he cuts to cover who lets it slip through"}, {"ball": 15.2, "isHighlight": false, "text": "Ojha to Hodge,1 run,pulls a length ball on off to deep midwicket"}, {"ball": 15.3, "isHighlight": false, "text": "Ojha to Faulkner,1 run,comes in towards middle and leg, he makes room and punches to long off"}, {"ball": 15.4, "isHighlight": false, "text": "Ojha to Hodge,1 run,mistimes the cut towards point, will get only a single"}, {"ball": 15.5, "isHighlight": false, "text": "Ojha to Faulkner,1 run,punched off the back foot to long off"}, {"ball": 15.6, "isHighlight": false, "text": "Ojha to Hodge,1 run,backs away but cannot do anything more than slap the length delivery through cover for one"}, {"ball": 15.6, "isHighlight": false, "text": "Brad Hodge has gone past 6000 T20 runs"}, {"ball": 16.1, "isHighlight": false, "text": "Santokie to Hodge,1 run,slow length ball outside off, slapped to covers for a single"}, {"ball": 16.2, "isHighlight": false, "text": "Santokie to Faulkner,1 run,hits a length delivery to extra cover"}, {"ball": 16.3, "isHighlight": false, "text": "Santokie to Hodge,2 runs,low full toss squeezed to the left of the sweeper for a couple"}, {"ball": 16.4, "isHighlight": false, "text": "Santokie to Hodge,1 wide,hurls it way outside off stump with the angle"}, {"ball": 16.4, "isHighlight": false, "text": "Santokie to Hodge,2 runs,away swinging full toss hit wide of the sweeper"}, {"ball": 16.5, "isHighlight": false, "text": "Santokie to Hodge,1 run,guides a full ball outside off to short third man"}, {"ball": 16.6, "isHighlight": false, "text": "Santokie to Faulkner, $$SIX$$ ,Faulkner gets one away, he slogs this flat towards long on, there is no Pollard there this time, Rohit jumps but it clears him comfortably"}, {"ball": 16.6, "isHighlight": false, "text": "Jayadhevan: \"Looking at the number of changes RR make every match, I wonder if they actually value finishing in the top two. It could come back to bite them in the playoff clash.\""}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Hodge,2 runs,slogs a full delivery past the bowler, Rohit runs across from long off and fumbles, Faulkner rushes back for the second"}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to Hodge,no run,a wide, slow length ball, Hodge has a big heave at it but misses"}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to Hodge,1 run,another wide slower one, Hodge's heave results in a thick inside edge to short fine leg"}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Faulkner,1 wide,bowls it too far outside off this time"}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Faulkner,1 run,not happening for RR, Faulkner drives a wide and full one, along the ground, to extra cover"}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Hodge, $$SIX$$ ,Hodge finally connects to a wide length ball and mows it over long on"}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Hodge,no run,swings and misses a pitched up ball as it comes in with the angle outside off"}, {"ball": 18.1, "isHighlight": false, "text": "Santokie to Faulkner, $$SIX$$ ,Faulkner sends the first ball of the over, an away swinging length ball outside off, a long way over the long off boundary"}, {"ball": 18.2, "isHighlight": false, "text": "Santokie to Faulkner, $$FOUR$$ ,now he goes over extra cover, Santokie goes full outside off, and Faulkner clears front leg to slam it out of Pollard's reach at long off"}, {"ball": 18.3, "isHighlight": false, "text": "Santokie to Faulkner,1 leg bye,full outside leg stump now, Faulkner misses, the ball rolls behind square on off"}, {"ball": 18.3, "isHighlight": false, "text": "Anirudh: \"@jayadhevan RR are yet to make the playoffs\""}, {"ball": 18.4, "isHighlight": false, "text": "Santokie to Hodge, $$SIX$$ ,six more, a low full toss, Hodge moves outside off and slogs it over long on"}, {"ball": 18.4, "isHighlight": false, "text": "Santokie gets into delivery stride but does not bowl as Hodge moves towards off stump"}, {"ball": 18.5, "isHighlight": false, "text": "Santokie to Hodge, $$OUT$$ ,Hodge starts walking down the track even as Santokie runs in to bowl, Hodge stops and slogs, but the connection is not good enough, and Rohit hops to take it at wide long on"}, {"ball": 18.5, "isHighlight": false, "text": "$$BJ$$ $$Hodge$$ $$c$$ $$Sharma$$ $$b$$ $$Santokie$$ $$40$$ $$(29m$$ $$30b$$ $$0x4$$ $$3x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 18.6, "isHighlight": false, "text": "Santokie to Faulkner,1 run,a slower length ball pushed to cover for a single"}, {"ball": 19.1, "isHighlight": false, "text": "Bumrah to Faulkner,1 run,scythes a full toss to the sweeper"}, {"ball": 19.2, "isHighlight": false, "text": "Bumrah to Bhatia,1 run,drives a full one outside off to sweeper cover"}, {"ball": 19.3, "isHighlight": false, "text": "Bumrah to Faulkner,1 run,full again outside off, hit through cover for one"}, {"ball": 19.4, "isHighlight": false, "text": "Bumrah to Bhatia, $$FOUR$$ ,high full toss, Bhatia heaves, thick edge flies past the keeper on the off side"}, {"ball": 19.5, "isHighlight": false, "text": "Bumrah to Bhatia,no run,Bhatia done in by the lack of pace on this length ball, tries to dab it but misses"}, {"ball": 19.6, "isHighlight": false, "text": "Bumrah to Bhatia,1 run,wide short of a length delivery, he dabs it to third man for a single"}, {"ball": 19.6, "isHighlight": false, "text": "That is all for this game. Follow  $$Delhi$$ $$v$$ $$Punjab$$  here. Good bye"}, {"ball": 19.6, "isHighlight": false, "text": "$$Michael$$ $$Hussey$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match.$$  Hussey: \"I enjoyed the opening partnership. Lendl is a good striker of the ball. The wicket slowed down as the innings progressed. I have been working in the nets and hoping for another opportunity. We were saying 'no twos.' It was that hard (with the heat), so you either hit a four or a six. It was a pretty good total on that pitch.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Rohit$$ $$Sharma$$ : \"It was a good win. We do not want to think too far ahead. We want to keep winning and stay in the tournament as long as possible. We played fantastically today. Posting a total like that was not easy on this wicket. It was slow, it was turning.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Shane$$ $$Watson$$ : \"We misread the conditions. I did not think it would turn as much as it did in the second innings. Mumbai's world-class spinners made it very difficult to score. Wasn't really No 8 (for Hodge). We were trying a few options to make an impact through that middle period. Mumbai played very well, they batted very well. We did not think the pitch was going to change as much as it did.\""}, {"ball": 19.6, "isHighlight": false, "text": "Comfortable win for Mumbai Indians. Once they got as many as 178 on this slow turner, it was going to be very difficult for RR. Wonder why you would leave out Pravin Tambe on this pitch, and bring in Unmukt Chand for Ajinkya Rahane when you are still not through to the playoffs"}, {"ball": 19.6, "isHighlight": false, "text": "Abhi: \"RR virtually had virtually lost this match with the team selection they came in for this match. RR needs to immediately learn their lesson as I now see that the playoff berth for 3 and 4 spots are widely open for KKR, RCB, SRH, MI and RR. The league has definitely come to the most exciting part now.\""}, {"ball": 19.6, "isHighlight": false, "text": "Rohan: \"Disappointed as an MI fan. This was a good chance to gain a bit of NRR!\""}, {"ball": 19.6, "isHighlight": false, "text": "Neelesh: \"I wonder why Binny is in team. He is not bowling and in very poor batting form. Why not have Chand in place of Binny and let Rahane play? Keeping Tambe out who is your main wicket-taking bowler is a foolish decision. This is what RR does every season. Arrive in good position and then let it slip away.\""}], "name": "Rajasthan Royals v Mumbai Indians", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734017.html?innings=2;view=commentary", "match_num": 44}