{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00pm$$  Alrighty then. Here we go. The umpires walk in, pick up the ball from the top of a pyramid formed by three niftily arranged cricket bats. KP will open for Delhi, and with him is M Vijay. Sandeep Sharma will take the new ball for Punjab."}, {"ball": 0, "isHighlight": false, "text": "$$7.45pm$$  News, finally. Daredevils have left out Ross Taylor, Rahul Shukla, Siddarth Kaul and Shahbaz Nadeem."}, {"ball": 0, "isHighlight": false, "text": "Revanth doesn't approve of Punjab choosing to bowl: \"Why bailey why? This match is a dead rubber and we all want max and miller to go out there and provide entertainment. Delhi will probably get out below 150.\""}, {"ball": 0, "isHighlight": false, "text": "AVI: \"Stage set for Virender Sehwag's debut match against Delhi Daredevils.. \""}, {"ball": 0, "isHighlight": false, "text": "Naman: \"Last time the number-1 team played the number-8 team this season, the former lost...just saying\""}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  Toss time! It's heads, which means George Bailey has won the toss, and the Kings XI captain has chosen to bowl first. One change - Beuran Hendricks is in for Mitchell Johnson."}, {"ball": 0, "isHighlight": false, "text": "KP says he'd have chased too. Four changes for DD: Parnell, Shami, Unadkat and Vijay are in, he says, but doesn't say who they've replaced. No one asked him. We'll update you as soon as we know."}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$  Hello and welcome to our live commentary of tonight's second game, between Delhi Daredevils and Kings XI Punjab at the Feroz Shah Kotla. It's a top-versus-bottom match, from which Daredevils stand to gain little besides the pride that everyone talks about at such junctures. For more, read this  $$preview$$ , by Siddarth Ravindran."}, {"ball": 0, "isHighlight": false, "text": "Kings XI Punjab have been the kings (very imaginative, you'll agree) of the 200-plus chase across all seasons of the IPL. Relive the biggest IPL chases in our  $$IPL$$ $$Watcher$$  blog."}, {"ball": 0, "isHighlight": false, "text": "The final Powerplay is on. No more chances. This is it. Get your eye in, and score big at  $$CricIQ$$  - The Greatest Test Ever."}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Vijay,1 run,bit of inswing. Lots of inswing, in fact, and Vijay gets an inside edge that skitters away towards fine leg."}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,no run,straightens this time, from just outside off, and KP defends solidly. He's taking guard outside the crease."}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,no run,swishes at a wide, full ball, misses. Suspect it was the slower one."}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,1 run,jams this off the inside part of his bat towards backward square leg"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to Vijay, $$FOUR$$ ,gorgeous. outswinger, full and wide, and Vijay leans into it to send it hurrying past cover."}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to Vijay,no run,another full ball, Vijay pushes it to mid-off."}, {"ball": 0.6, "isHighlight": false, "text": "Beuran Hendricks, left-arm over."}, {"ball": 1.1, "isHighlight": false, "text": "Hendricks to Pietersen,no run,full and wide, slapped to cover."}, {"ball": 1.2, "isHighlight": false, "text": "Hendricks to Pietersen, $$FOUR$$ ,short, and pulled witheringly in front of midwicket."}, {"ball": 1.3, "isHighlight": false, "text": "Hendricks to Pietersen,1 run,cramped for room, hit towards square leg."}, {"ball": 1.4, "isHighlight": false, "text": "Hendricks to Vijay,no run,back of a length, on off, pushed off the back foot into the off side."}, {"ball": 1.4, "isHighlight": false, "text": "TheKlingon: \"DD might have finally got the the balance right with two international bowlers. Too little too late though\""}, {"ball": 1.5, "isHighlight": false, "text": "Hendricks to Vijay,no run,slower ball, angled from middle towards off, goes off the inside edge towards midwicket."}, {"ball": 1.6, "isHighlight": false, "text": "Hendricks to Vijay,no run,good line, giving the batsman no room. Vijay tries to force it past point, finds the fielder."}, {"ball": 1.6, "isHighlight": false, "text": "keeper stands up, two men in the covers"}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,1 run,stays in his crease, opens his bat-face to steer it behind point."}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Vijay,1 wide,swing, but it's wasted, goes way down the leg side"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Vijay,no run,back of a length, just outside off, Vijay drives to extra cover"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Vijay, $$OUT$$ ,taken! short, Vijay half-pulls, half-flicks, and the top-edge goes way up in the air. Swirls all the way as it comes down, and Beuran Hendricks is running back from the 30-yard circle towards the deep square leg boundary, and is facing away from the field as he takes it, inches from the rope. Top catch."}, {"ball": 2.3, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$Hendricks$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$5$$ $$(12m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$62.50$$"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,1 wide,down the leg side again, and KP hurriedly sticks his back foot into the crease when he realises Saha is standing up. Lovely take down the leg side, lightning hands."}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Pietersen, $$FOUR$$ ,width, and KP slashes it powerfully, from halfway forward, to the deep point boundary."}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,no run,closer to off stump this time, and KP steers it to short third man, who had come up for this ball as point went back."}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,1 run,straightens from a good length on off stump, driven to the off-side sweeper."}, {"ball": 2.6, "isHighlight": false, "text": "DK is in at 3, by the way."}, {"ball": 3.1, "isHighlight": false, "text": "Hendricks to Pietersen,2 runs,worked off his hips behind square leg."}, {"ball": 3.2, "isHighlight": false, "text": "Hendricks to Pietersen, $$FOUR$$ ,bit of width again, sits up, and KP stays leg side of the ball to flay it between point and cover"}, {"ball": 3.3, "isHighlight": false, "text": "Hendricks to Pietersen,no run,similar length to the previous ball, but closer to off stump. Pushed to mid-off"}, {"ball": 3.4, "isHighlight": false, "text": "Hendricks to Pietersen, $$FOUR$$ ,width again, and KP throws his bat at it. Thick edge goes flying away to the left of third man."}, {"ball": 3.5, "isHighlight": false, "text": "Hendricks to Pietersen,2 runs,short, sits up again, but KP doesn't quite get hold of the pull. Falls well short of the deep midwicket boundary."}, {"ball": 3.6, "isHighlight": false, "text": "Hendricks to Pietersen, $$SIX$$ ,short again, but the bowler got much more shoulder into this one, and it rises up towards KP's right shoulder. He wasn't fully in control of that hook, but it flew over the deep backward square leg boundary."}, {"ball": 4.1, "isHighlight": false, "text": "Sandeep Sharma to Karthik,1 wide,uh oh. Another one slides down the leg side."}, {"ball": 4.1, "isHighlight": false, "text": "Sandeep Sharma to Karthik,1 run,bit of inswing. DK comes forward to defend, gets a thick inside edge into the leg side."}, {"ball": 4.1, "isHighlight": false, "text": "surya: \"The Scorecard would show 18 runs of the over.But Hendricks didn't bowl one delivery you would call bad nor was KP in control of 14 of the 18 runs scored.\" That's T20 for you!"}, {"ball": 4.2, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,no run,angles in towards KP's pads. Wristy flick, stopped by midwicket diving to his left."}, {"ball": 4.3, "isHighlight": false, "text": "Sandeep Sharma to Pietersen,1 run,short, wide, but point had been pushed back in Sandy's previous over, and he's there to stop this slash from KP."}, {"ball": 4.4, "isHighlight": false, "text": "Sandeep Sharma to Karthik,no run,thrusts forward to an outswinger outside off, defensive push to the left of cover."}, {"ball": 4.5, "isHighlight": false, "text": "Sandeep Sharma to Karthik, $$SIX$$ ,down on one knee. It was swinging away from middle stump, but he's still middled that sweep, or was it a pull from a sweep-ish position, over deep square leg."}, {"ball": 4.6, "isHighlight": false, "text": "Sandeep Sharma to Karthik,1 run,pushes forward outside off with an open face, steers it backward of deep point."}, {"ball": 4.6, "isHighlight": false, "text": "Akshar Patel comes on now."}, {"ball": 5.1, "isHighlight": false, "text": "Patel to Karthik,1 wide,leg-stumpish ball, DK misses the sweep. Slightly harsh wide call, you'd think."}, {"ball": 5.1, "isHighlight": false, "text": "Patel to Karthik, $$FOUR$$ ,short, wide, cut away in front of point."}, {"ball": 5.2, "isHighlight": false, "text": "Patel to Karthik,1 run,loopy ball on leg stump, tucked towards midwicket."}, {"ball": 5.3, "isHighlight": false, "text": "Patel to Pietersen,1 run,looks for the cut, ball tucks him up, and he manages to chop it down in front of point."}, {"ball": 5.4, "isHighlight": false, "text": "Patel to Karthik,1 run,worked to wide mid-on off the pads."}, {"ball": 5.5, "isHighlight": false, "text": "Patel to Pietersen,no run,skids on, KP misses the flick, and it thuds into his pad, but well wide of leg stump."}, {"ball": 5.6, "isHighlight": false, "text": "Patel to Pietersen,no run,another one goes with the arm. KP was looking to drive through the covers, gets an inside edge that trickles towards fine leg."}, {"ball": 5.6, "isHighlight": false, "text": "Rishi Dhawan into the attack"}, {"ball": 6.1, "isHighlight": false, "text": "Dhawan to Karthik,no run,angled in towards off. DK presses forward to defend."}, {"ball": 6.2, "isHighlight": false, "text": "Dhawan to Karthik,no run,angled in again, good length, and DK pushes it into the off side."}, {"ball": 6.3, "isHighlight": false, "text": "Dhawan to Karthik,1 run,slower ball, driven down to a straightish mid-off."}, {"ball": 6.4, "isHighlight": false, "text": "Dhawan to Pietersen,2 runs,another typical Rishi Dhawan delivery, angled in towards off, and KP stays leg-side of it and drives it to deep cover."}, {"ball": 6.5, "isHighlight": false, "text": "Dhawan to Pietersen, $$FOUR$$ ,width this time, and that's as good a square cut as you'll see, goes flying away behind point."}, {"ball": 6.6, "isHighlight": false, "text": "Dhawan to Pietersen, $$FOUR$$ ,driven this time, and it's timed really well. The sweeper on the off side boundary didn't have too far to run to his right, but the ball streaks past him as he threw himself at it. He got a hand to it, though."}, {"ball": 7.1, "isHighlight": false, "text": "Patel to Karthik,no run,goes with the angle, dowm the leg side, and it hits DK's pad as he misses the flick"}, {"ball": 7.2, "isHighlight": false, "text": "Patel to Karthik,1 run,tries to sweep, is hit on the pad again"}, {"ball": 7.3, "isHighlight": false, "text": "Patel to Pietersen,2 runs,flicked towards mid-on"}, {"ball": 7.4, "isHighlight": false, "text": "Patel to Pietersen,1 run,stays next to the line of a straight ball and drives it towards deep cover"}, {"ball": 7.5, "isHighlight": false, "text": "Patel to Karthik,no run,down the track, looks to work it into the leg side, is hit on the pad again."}, {"ball": 7.6, "isHighlight": false, "text": "Patel to Karthik,1 run,gets bat on it this time, good-looking flick to deep midwicket."}, {"ball": 7.6, "isHighlight": false, "text": "Vikas, who is one of many people saying more or less the same thing: \"Hope Delhi make a huge score here so that we can see the Max-Miller show\""}, {"ball": 7.6, "isHighlight": false, "text": "\"Sehwag with glasses(those which enhance vision mind you) looks an umpire for every reason if not for his jersey\" What other kind of glasses exist, Rahul?They've taken a time-out now."}, {"ball": 8.1, "isHighlight": false, "text": "Dhawan to Karthik, $$FOUR$$ ,short, wide, cut, four. Anything short is sitting up on this pitch. There was some bounce, but DK got on top of it really well."}, {"ball": 8.2, "isHighlight": false, "text": "Dhawan to Karthik,no run,walks across the stumps, tries to work this from outside off past midwicket, hits it to the fielder."}, {"ball": 8.3, "isHighlight": false, "text": "Dhawan to Karthik,no run,looks to beat short fine leg this time with a hard-hit sweep, but once again, straight to the fielder"}, {"ball": 8.4, "isHighlight": false, "text": "Dhawan to Karthik,1 run,angled in, back of a length, tucks DK up, pushes it down to long-on"}, {"ball": 8.5, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,inventive from KP, almost beats short third man, but Sehwag dives full-length to his left to cut off this cute little dab, from middle stump."}, {"ball": 8.6, "isHighlight": false, "text": "Dhawan to Karthik,1 run,tries to flick, gets an inside-edge onto the pad, bounces off towards point."}, {"ball": 8.6, "isHighlight": false, "text": "Shivam Sharma now."}, {"ball": 8.6, "isHighlight": false, "text": "Lots of answers to my question about glasses, but Coder has the best one yet: \"There is the type worn by Tamil superstars, at night, inside the building, in darkness - which gives them super senses!!\""}, {"ball": 9.1, "isHighlight": false, "text": "Shivam Sharma to Karthik,no run,tossed up, outside off, doesn't turn, pushed back to the bowler."}, {"ball": 9.2, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,slog-sweep to deep square leg."}, {"ball": 9.3, "isHighlight": false, "text": "Shivam Sharma to Pietersen,2 runs,short, and KP chops it down to deep point."}, {"ball": 9.4, "isHighlight": false, "text": "Shivam Sharma to Pietersen,1 run,worked wristily from outside off to long-on."}, {"ball": 9.5, "isHighlight": false, "text": "Shivam Sharma to Karthik,2 runs,turns in from off, tucked away towards midwicket, Maxi runs in from the boundary and sends in a flat throw to the keeper, but the batsmen completed two comfortably."}, {"ball": 9.6, "isHighlight": false, "text": "Shivam Sharma to Karthik,no run,down the track, gets too close to the pitch, pushes it back to the bowler."}, {"ball": 9.6, "isHighlight": false, "text": "Akshar comes back into the attack"}, {"ball": 10.1, "isHighlight": false, "text": "Patel to Pietersen,no run,keeps a bit low, KP is vigilant, jams down on it."}, {"ball": 10.2, "isHighlight": false, "text": "Patel to Pietersen,no run,looking for the cut, but it goes on with the arm, and he pushes defensively at it."}, {"ball": 10.3, "isHighlight": false, "text": "Patel to Pietersen, $$OUT$$ ,what a ball! All those balls that went straight on were maybe playing on KP's mind, and he pushed forward here and was playing for the angle rather than for the turn. Unfortunately for him, it does turn, and turns appreciably to beat his outside edge and crash into middle and off."}, {"ball": 10.3, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$b$$ $$Patel$$ $$49$$ $$(48m$$ $$32b$$ $$6x4$$ $$1x6)$$ $$SR:$$ $$153.12$$"}, {"ball": 10.3, "isHighlight": false, "text": "In comes Duminy now."}, {"ball": 10.4, "isHighlight": false, "text": "Patel to Duminy,no run,back in his crease, defends watchfully."}, {"ball": 10.5, "isHighlight": false, "text": "Patel to Duminy,no run,tucks this leg-stump ball off his hips to short fine leg"}, {"ball": 10.6, "isHighlight": false, "text": "Patel to Duminy,no run,driven down to mid-off."}, {"ball": 11.1, "isHighlight": false, "text": "Shivam Sharma to Karthik, $$FOUR$$ ,walks across, gets down on one knee, and finally beats short fine leg with the sweep, Sandeep almost cuts it off with a dive on the boundary, but can't quite complete the task."}, {"ball": 11.2, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,slogged down to wide long-on"}, {"ball": 11.2, "isHighlight": false, "text": "around the wicket to the left-handed Duminy."}, {"ball": 11.3, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,tossed up, checked drive to long-off."}, {"ball": 11.4, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,short, doesn't turn, DK pulls it to long-on. He might have been looking to hit more towards midwicket."}, {"ball": 11.5, "isHighlight": false, "text": "Shivam Sharma to Duminy,no run,tries to give himself room and cut. Cramped for room, hits it to point."}, {"ball": 11.6, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,worked off his pads to deep square leg."}, {"ball": 11.6, "isHighlight": false, "text": "Akshar Patel's is the first maiden in the second half of the innings this season"}, {"ball": 12.1, "isHighlight": false, "text": "Dhawan to Duminy,1 run,pushed towards long-off for a single by Duminy"}, {"ball": 12.2, "isHighlight": false, "text": "Dhawan to Karthik, $$FOUR$$ ,short of length ball just outside off, Karthik sways away to make room and thumps that past point, superbly struck"}, {"ball": 12.3, "isHighlight": false, "text": "Dhawan to Karthik,no run,not as good a shot this, it was back of a length and outside off, Karthik goes for the slog to midwicket but misses out"}, {"ball": 12.4, "isHighlight": false, "text": "Dhawan to Karthik,no run,this time he tries a cute reverse-dab, wanting to get the ball fine past the keeper who is standing up, he doesn't connect, and a disappointed Karthik walks away from the stumps to take a moment to clear his head"}, {"ball": 12.5, "isHighlight": false, "text": "Dhawan to Karthik,1 run,eased towards long-off for a single"}, {"ball": 12.6, "isHighlight": false, "text": "Dhawan to Duminy,1 run,Duminy gets forward and tapped it to long-off for one more, a tidy over from Dhawan despite the boundary"}, {"ball": 13.1, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,length ball is punched off the back foot to long-off for one more"}, {"ball": 13.2, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,tossed up, full ball, Karthik wants to swat it away, but mistimes it towards midwicket"}, {"ball": 13.3, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,slanting in towards the pads, defended towards the leg side for a single"}, {"ball": 13.4, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,shortish ball outside off, Karthik wants to power that down the ground, again doesn't middle it and the ball rolls towards long-off"}, {"ball": 13.5, "isHighlight": false, "text": "Shivam Sharma to Duminy,no run,crisply driven off the front foot, but not past short cover"}, {"ball": 13.6, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,full ball on the pads, Duminy moves across and whips it to midwicket for a single, played with a flourish that shot"}, {"ball": 14.1, "isHighlight": false, "text": "Dhawan to Duminy, $$FOUR$$ ,shortish ball that sits up, Duminy doesn't try to hammer that out of the park, instead deftly guides it towards fine leg for four, Dhawan not thrilled with the length there"}, {"ball": 14.2, "isHighlight": false, "text": "Dhawan to Duminy,1 run"}, {"ball": 14.3, "isHighlight": false, "text": "Dhawan to Karthik, $$SIX$$ ,drives this on the up, doesn't seem to have put in too much power on this, the back swing stops before the end of the blade reaching shoulder height, but that comes right off the middle of the bat and amazingly the ball soars over long-off for six"}, {"ball": 14.4, "isHighlight": false, "text": "Dhawan to Karthik, $$FOUR$$ ,Dhawan drops short, Karthik capitalises, hammers this one to the midwicket boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Dhawan to Karthik,1 run,fuller and on off stump, driven towards long-on for a single"}, {"ball": 14.6, "isHighlight": false, "text": "Dhawan to Duminy,1 run,full and on the pads, clipped in front of square leg for a single"}, {"ball": 15.1, "isHighlight": false, "text": "Shivam Sharma to Duminy,no run,whoah, how low did that stay? a short of length ball just above creeps above ankle height, Dumin gets his bat down in time"}, {"ball": 15.2, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,whips this one in front of square leg for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Shivam Sharma to Karthik, $$FOUR$$ ,there's the slog sweep from Karthik, it's a shot he plays very well, gets on one knee and connects with the length ball, he can't send it all the way, but he can put it in the gap and that bounces away to the square-leg boundary"}, {"ball": 15.4, "isHighlight": false, "text": "Shivam Sharma to Karthik, $$SIX$$ ,a full toss, Karthik skips down the track and launches this straight over the bowler's head, middles it and that's six towards the sightscreen"}, {"ball": 15.5, "isHighlight": false, "text": "Shivam Sharma to Karthik,1 run,wants to bludgeon this one, can one send it dribbling towards midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Shivam Sharma to Duminy,1 run,tucked to the leg side for a single, and that will be the  $$strategic$$ $$time-out$$"}, {"ball": 15.6, "isHighlight": false, "text": "Prashant: \"Hits a full-toss straight down for a six?! And not swing across the line over mid-wicket or squarer?! Give that man an award!!\" They just might, there are plenty handed out at the end of every IPL match."}, {"ball": 16.1, "isHighlight": false, "text": "Hendricks to Duminy,1 leg bye,Hendricks returns with a superb yorker that follows Duminy, who somehow manages to get a bit of bat on it and turns over the strike, the third-umpire is needed to see whether Karthik has made his ground, he has"}, {"ball": 16.2, "isHighlight": false, "text": "Hendricks to Karthik,2 runs,full ball from round the wicket, guided down towards deep backward square leg, Karthik scrambles back for the second"}, {"ball": 16.2, "isHighlight": false, "text": "Huzefa: \"I wonder how many people are rooting for DD to get 180-190 today just to watch the chase !!\""}, {"ball": 16.3, "isHighlight": false, "text": "Hendricks to Karthik,1 run,full ball on the pads, worked behind square leg for a single"}, {"ball": 16.3, "isHighlight": false, "text": "Dannie: \"Do Punjab let the opposition hit a big score intentionally, so that they can repeatedly prove that they can chase massive scores very easily? And to make the match interesting? Haha, right? It's raining fours and sixes\""}, {"ball": 16.4, "isHighlight": false, "text": "Hendricks to Duminy,2 runs,goes for the yorker again, Hendricks misses the length just a touch, a low full toss on the pads, slapped away towards deep square"}, {"ball": 16.4, "isHighlight": false, "text": "raja saleem: \"KP & DK have made a platform for another Maxwell 90+... come on #maxi...\""}, {"ball": 16.5, "isHighlight": false, "text": "Hendricks to Duminy, $$OUT$$ ,this time the yorker has gone completely awry, it is a nice put-it-away full toss, but in T20 even this sort of delivery can get you a wicket, Duminy wanted to put it away but he doesn't hit it well enough clear Maxwell at wide long-on"}, {"ball": 16.5, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$c$$ $$Maxwell$$ $$b$$ $$Hendricks$$ $$17$$ $$(28m$$ $$21b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$80.95$$"}, {"ball": 16.5, "isHighlight": false, "text": "David Jeyaraj: \"With no other particular interest, I am rooting for DK to get that century that continues to elude this year's IPL.\" What others reasons keeping you guys hooked?"}, {"ball": 16.6, "isHighlight": false, "text": "Hendricks to Karthik, $$FOUR$$ ,another full toss, slams this wide of wide long-on this time, Karthik showing Duminy how the previous ball should have been dealt with, gets a boundary"}, {"ball": 16.6, "isHighlight": false, "text": "Chetan: \"@Huzefa: Everyone at the stadium for sure. This is the most Kotla has been filled up this season, its almost a sell-out crowd, and considering the hosts' poor form, you know why everyone has turned up! \""}, {"ball": 16.6, "isHighlight": false, "text": "Kedar Jadhav comes in at No. 5"}, {"ball": 17.1, "isHighlight": false, "text": "Sandeep Sharma to Jadhav, $$OUT$$ ,the promotion for Jadhav doesn't work as he perishes first ball, it was a length ball to hit out of the park, but Jadhav hits it only as far as deep midwicket where Maxwell is waiting"}, {"ball": 17.1, "isHighlight": false, "text": "$$KM$$ $$Jadhav$$ $$c$$ $$Maxwell$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.2, "isHighlight": false, "text": "Sandeep Sharma to Karthik,no run,superb ball form Sandeep, a yorker from round the wicket, Karthik jams his bat down in time"}, {"ball": 17.3, "isHighlight": false, "text": "Sandeep Sharma to Karthik,1 run,targetting the legstump with yorkers here, Karthik gets on one knee as he looks to thrash it through the leg side, he misses and is struck on the flap of the back pad, struck outside leg so the lbw appeal is turned down"}, {"ball": 17.4, "isHighlight": false, "text": "Sandeep Sharma to Agarwal, $$SIX$$ ,wow! what a shot first ball from Mayank, Sandeep delivers a length ball from over the wicket, a crisp, clean hit over cover for four, top shot"}, {"ball": 17.5, "isHighlight": false, "text": "Sandeep Sharma to Agarwal, $$OUT$$ ,full ball on legstump from around the wicket, Sandeep has decided that is going to be his strategy, and it is working for him, Mayank goes for the reverse-sweep, he misses and loses his leg stump"}, {"ball": 17.5, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$b$$ $$Sandeep$$ $$Sharma$$ $$6$$ $$(2m$$ $$2b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$300.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Sandeep Sharma to Tiwary, $$FOUR$$ ,full toss on middle stump, pretty high, Manoj Tiwary opens the face and sends that in front of point for four"}, {"ball": 17.6, "isHighlight": false, "text": "Nakul Bhugra: \"So,I guess finally DD have found their right batting order which fires against a team who knows how to chase well..!!\""}, {"ball": 18.1, "isHighlight": false, "text": "Hendricks to Karthik, $$OUT$$ ,wickets tumbling here, a short slow ball there from Hendricks, bowled from the back of the hand, sits up for Karthik, who looks to hook that away for six, but doesn't get enough on it and holes out to deep square leg"}, {"ball": 18.1, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Dhawan$$ $$b$$ $$Hendricks$$ $$69$$ $$(74m$$ $$44b$$ $$7x4$$ $$3x6)$$ $$SR:$$ $$156.81$$"}, {"ball": 18.1, "isHighlight": false, "text": "Sunil Sharma: \"What was Agarwal doing? First ball he faced, he played a cricketing shot. Second ball, he turned his mind and played Gilli-danda..Truly, an allrounder in the offing...\""}, {"ball": 18.2, "isHighlight": false, "text": "Hendricks to Tiwary,1 run,low full toss on middle stump, driven towards long-on for a single"}, {"ball": 18.2, "isHighlight": false, "text": "rssampat: \"When you can hit a MAGNIFICENT six like THAT, why the hell do you need to play a low percentage, high risk shot like the Reverse switch hit?\" I've edited out the 20 other question marks rssampat sent."}, {"ball": 18.3, "isHighlight": false, "text": "Hendricks to Parnell,2 runs,length ball on the pads, a clip over midwicket for two, touch-play from Parnell there, not looking to hammer the ball"}, {"ball": 18.4, "isHighlight": false, "text": "Hendricks to Parnell, $$OUT$$ ,Maxwell! can this man do anything wrong this season? sensational catch from him, Parnell did hammer this one as Hendricks gifted a length ball, the ball goes high and drops sharply down, Maxwell skips back towards the rope, and he's less than a yard from the boundary when he gets his hands on the ball, he doesn't collect it on the first time, but as the ball drops he sticks out his left hand to pluck that one, a wide grin shows how much he enjoyed that"}, {"ball": 18.4, "isHighlight": false, "text": "$$WD$$ $$Parnell$$ $$c$$ $$Maxwell$$ $$b$$ $$Hendricks$$ $$2$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 18.5, "isHighlight": false, "text": "Hendricks to Tiwary,no run,full and outside off, batsman has backed away from the stumps, and can't get near the ball"}, {"ball": 18.6, "isHighlight": false, "text": "Hendricks to Tiwary,1 run,send away towards deep midwicket for a single"}, {"ball": 18.6, "isHighlight": false, "text": "Deepster: \"5 wickets in 12 balls. That's how to lose a game of cricket.\""}, {"ball": 19.1, "isHighlight": false, "text": "Patel to Tiwary,1 run,short of length ball, defended towards cover for a single"}, {"ball": 19.2, "isHighlight": false, "text": "Patel to Mohammed Shami,no run,skips down the track, defended by shamoi"}, {"ball": 19.3, "isHighlight": false, "text": "Patel to Mohammed Shami,1 run,worked towards cover for another single, great start to the over from Patel"}, {"ball": 19.4, "isHighlight": false, "text": "Patel to Tiwary,2 runs,a swipe towards midwicket, Tiwary scrambles back for the second"}, {"ball": 19.4, "isHighlight": false, "text": "arun8283: \"The haste DD is showing in the end is just confirming that they are also waiting for the M&M show. The"}, {"ball": 19.5, "isHighlight": false, "text": "Patel to Tiwary,no run,moves well across the stumps, looking to sweep, he misses, the balls down the leg side, umpire doesn't signal a wide, correctly"}, {"ball": 19.6, "isHighlight": false, "text": "Patel to Tiwary,1 run,tapped to the off side for a single, which means there's just four from the final over"}, {"ball": 19.6, "isHighlight": false, "text": "Barath: \"Really got to appreciate the confidence of Bailey and Bangar (or the double Bs as Danny would call them). KXIP have used only 5 bowlers in most of their games. I am not able to think of any other team which has done that.If you are a bowler, best team for you is KXIP. Bangar should get a chance to be the coach of atleast the U-19 team \""}, {"ball": 19.6, "isHighlight": false, "text": "Just nine runs off the final two overs - Daredevils were looking set for about 180 when Karthik was going strong, but have ended on 164, which might not be enough given how good Kings XI have chased so far, and how poorly Daredevils have bowled so far. It's T20 though, and anything can, and usually does, happen. Join us shortly for the chase."}], "name": "Delhi Daredevils v Kings XI Punjab", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734019.html?innings=1;view=commentary", "match_num": 45}