{"commentary": [{"ball": 0, "isHighlight": false, "text": "Here come Kings XI's openers, Virender Sehwag and Manan Vohra. Wayne Parnell to bowl."}, {"ball": 0.1, "isHighlight": false, "text": "Parnell to Sehwag,1 leg bye,starts wit ha back of length 143kph ball on the pads, tipped down to fine leg by Sehwag"}, {"ball": 0.2, "isHighlight": false, "text": "Parnell to Vohra,1 wide,that was too far outside off for Vohra"}, {"ball": 0.2, "isHighlight": false, "text": "Parnell to Vohra,1 run,on leg stump, Vohra goes deep in the crease and tucks the ball towards square leg"}, {"ball": 0.3, "isHighlight": false, "text": "Parnell to Sehwag,2 runs,once more it is aimed at Sehwag's thigh pad, Sehwag tucks it past short fine, but it isn't fine enough to beat deep backward square"}, {"ball": 0.4, "isHighlight": false, "text": "Parnell to Sehwag,1 run,behind square leg for one more"}, {"ball": 0.4, "isHighlight": false, "text": "Donepudi: \"Sehwag didnt hit four on first ball. How often you see that ??\" He did it four matches in a row before this one"}, {"ball": 0.5, "isHighlight": false, "text": "Parnell to Vohra,no run,short of length, 143kph, slapped towards cover but not wide of the fielder"}, {"ball": 0.6, "isHighlight": false, "text": "Parnell to Vohra,no run,a bouncer to end the over, a good one too, 143kph, Vohra ducks under that one"}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Sehwag, $$FOUR$$ ,starts with a short of length ball, moving away after starting well outside off, Sehwag - as ever - doesn't need to move his feet as he puts that away, a lofted chop over cover for four"}, {"ball": 1.1, "isHighlight": false, "text": "Rohit: \"There...Sehwag thought that Parnell's was a trial over. Normalcy resumed. \" Ha!"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Sehwag,1 leg bye,this is much better, seams in towards the pads, and just the leg bye this time"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 wide,down the leg side, 142kph"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 run,bottom edges as he looks to pull that one, the ball dribbles towards midwicket"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Sehwag, $$FOUR$$ ,good delivery from Shami, better response from Sehwag, it was back of a length and moving away, Sehwag had to adjust as he was looking to drive, opens the face at the last moment to guide the ball towards third man for four"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,struck on the body this time as Shami angles the ball in"}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,blocks the ball, drops a couple of yards away from him but the batsmen still pinch a single"}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Vohra,1 wide,starts with one well down the leg side, Parnell hitting good pace here, 144kph"}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Vohra,1 wide,chases a ball that is wide outside off, this time a wide on the other side of the wicket"}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Vohra,no run,superb delivery from Parnell, a middle-stump yorker, squeezed out by Vohra"}, {"ball": 2.2, "isHighlight": false, "text": "Parnell to Vohra,no run,short of length ball, tucked towards midwicket, that hit high on the bat, Parnell gets across to field, Vohra sets off for a quick single, Sehwag doesn't like quick singles, Vohra has to turn back"}, {"ball": 2.3, "isHighlight": false, "text": "Parnell to Vohra, $$FOUR$$ ,lovely drive from Vohra, beats a diving Pietersen at cover for four"}, {"ball": 2.4, "isHighlight": false, "text": "Parnell to Vohra, $$SIX$$ ,a hit-me ball from Parnell, on a length around off stump, thumped over mid-off for four, or is that six? it is six, a yard over the rope"}, {"ball": 2.5, "isHighlight": false, "text": "Parnell to Vohra, $$FOUR$$ ,Vohra getting boundaries all over the park now, this time he wasn't intentional, he was looking to thrash a shortish ball to midwicket, a thick bottom edge and down to fine leg for four"}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Vohra,no run,length ball on middle and off, defended back towards the bowler"}, {"ball": 2.6, "isHighlight": false, "text": "Prabhash Miri: \"Can someone please please get out, 12.32am in Perth, I need to sleep. You know why i am waiting for MX\""}, {"ball": 3.1, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,short of length and just outside off, opens the face to guide the ball towards point"}, {"ball": 3.2, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,short of length once more, driven towards mid-on"}, {"ball": 3.3, "isHighlight": false, "text": "Mohammed Shami to Sehwag,1 leg bye,slanted in towards his pads, cramps Sehwag, off the top of his pads towards backward point"}, {"ball": 3.4, "isHighlight": false, "text": "Mohammed Shami to Vohra,no run,Vohra looks to guide the ball down to third man but it slips past the outside off"}, {"ball": 3.5, "isHighlight": false, "text": "Mohammed Shami to Vohra, $$SIX$$ ,an incredible shot from Vohra, astonishing hit from him, Sehwag walks across and pats his back, this was an offcutter coming in, Vohra was on the back foot but he coolly carves it over cover for six, right off the middle of the bat, hardly any follow through but the ball goes a long way, great to watch"}, {"ball": 3.6, "isHighlight": false, "text": "Mohammed Shami to Vohra, $$SIX$$ ,this one is down the ground, a length ball is launched over the bowler's head for six"}, {"ball": 4.1, "isHighlight": false, "text": "Unadkat to Sehwag,2 runs, $$dropped$$ , that was a tough chance for Tahir at mid-off, he had run back to get under the ball, and had to take the catch as the ball dropped over his shoulder, he was well placed to take it, but couldn't finish the job, it was a checked drive from Sehwag which sends the ball soaring to mid-off"}, {"ball": 4.2, "isHighlight": false, "text": "Unadkat to Sehwag,no run,stays low outside off, Sehwag can't get bat on it"}, {"ball": 4.3, "isHighlight": false, "text": "Unadkat to Sehwag,1 run,pushed behind point for a single this time"}, {"ball": 4.3, "isHighlight": false, "text": "Pritpal Pabla: \"It looks like another M is going to join Maxi&Miller group... \""}, {"ball": 4.4, "isHighlight": false, "text": "Unadkat to Vohra,no run,length ball on off stump, driven towards cover"}, {"ball": 4.5, "isHighlight": false, "text": "Unadkat to Vohra,5 runs,angling in towards the pads, Vohra clips it to short fine, Sehwag looked to be short of his ground when the throw came in from Jadhav, Sehwag wasn't stretching, Jadhav mised and the backing up is poor, there are four overthrows in addition to the single"}, {"ball": 4.6, "isHighlight": false, "text": "Unadkat to Sehwag,1 wide,another wide, down the leg side, Daredevils giving away freebies here"}, {"ball": 4.6, "isHighlight": false, "text": "Unadkat to Sehwag,no run"}, {"ball": 5.1, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 wide,a bouncer that is too high, another wide, Daredevils struggling here"}, {"ball": 5.1, "isHighlight": false, "text": "Mohammed Shami to Vohra, $$FOUR$$ ,short of length ball outside off, Vohra waits for the ball to arrive and steers it past short third man, who had just come in from the deep, clever work there"}, {"ball": 5.2, "isHighlight": false, "text": "Mohammed Shami to Vohra, $$FOUR$$ ,Shami drops it short, Vohra pulls this authoritatively over midwicket for a one-bounce four, Preity Zinta likes that, she's up from the chair and waving the team flag"}, {"ball": 5.3, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 run,misfield at mid-on as Vohra thumps the ball down the ground, just a single"}, {"ball": 5.4, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,shortish ball over the stumps, Sehwag arches back as he looks to carve that over point, he misses"}, {"ball": 5.4, "isHighlight": false, "text": "varun kashyap: \"I wonder what sehwag will be thinking , seeing the way Vohra is batting.. like sehwag of the old\""}, {"ball": 5.5, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,slow full ball, pushed towards mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "Mohammed Shami to Sehwag,1 run,Shami sees Sehwag backing away and follows his, Sehwag pushes the ball towards the off side and takes off, a direct hit would have given a few anxious moments for Vohra, but there isn't one"}, {"ball": 5.6, "isHighlight": false, "text": "$$Time-out$$ , Daredevils have plenty to think about."}, {"ball": 5.6, "isHighlight": false, "text": "Karthik: \"Poor Shaun Marsh. KXIP's most consistent batsman, in fact in the whole of IPL, but can't get a game!\""}, {"ball": 5.6, "isHighlight": false, "text": "Vish: \"Its sad to see Shami, the supposedly replacement for Zak, being blasted all over the park :(\""}, {"ball": 5.6, "isHighlight": false, "text": "Srinivas Goud: \"@kashyap most of them r playing like sehwag of old... except Sehwag, himself!\""}, {"ball": 5.6, "isHighlight": false, "text": "Here's Tahir"}, {"ball": 6.1, "isHighlight": false, "text": "Imran Tahir to Sehwag,1 run,starts with a length ball that is pushed towards long-off"}, {"ball": 6.2, "isHighlight": false, "text": "Imran Tahir to Vohra, $$OUT$$ ,and Tahir has a wicket straightaway, flighted overpitched ball, Vohra looks to launch that out of the park, it's a good-looking shot but he picked out the man at long-off, end of another hugely impressive cameo from the 20-year-old"}, {"ball": 6.2, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$c$$ $$Vijay$$ $$b$$ $$Imran$$ $$Tahir$$ $$42$$ $$(35m$$ $$19b$$ $$4x4$$ $$3x6)$$ $$SR:$$ $$221.05$$"}, {"ball": 6.2, "isHighlight": false, "text": "Here's the man the crowd is here to see. Glenn Maxwell."}, {"ball": 6.3, "isHighlight": false, "text": "Imran Tahir to Maxwell,1 wide,that kept low, it was a googly as well, luckily for Maxwell that wasn't in line with the stumps, down the leg side"}, {"ball": 6.3, "isHighlight": false, "text": "Imran Tahir to Maxwell,no run,huge lbw appeal after Maxwell misses out on the sweep, pitched outside leg, hit him outside leg"}, {"ball": 6.4, "isHighlight": false, "text": "Imran Tahir to Maxwell,no run,defended back towards the bowler this time"}, {"ball": 6.5, "isHighlight": false, "text": "Imran Tahir to Maxwell, $$SIX$$ ,and it begins, Maxwell effortlessly swipes that a long long way, to cow corner for a big six, the crowd is delirious"}, {"ball": 6.5, "isHighlight": false, "text": "CricPendulus: \"Manan's form has added another dimension to KXIP's batting ... They are looking really dangerous now, the KXIP ... \""}, {"ball": 6.6, "isHighlight": false, "text": "Imran Tahir to Maxwell,1 run,driven towards deep extra cover for a single"}, {"ball": 7.1, "isHighlight": false, "text": "Duminy to Maxwell,1 run,Duminy starts with a shortish ball on the pads, tucked towards deep square leg"}, {"ball": 7.2, "isHighlight": false, "text": "Duminy to Sehwag,1 run,length ball on the pads, pushed towards long-on for a single"}, {"ball": 7.3, "isHighlight": false, "text": "Duminy to Maxwell,1 run,short ball outside off, Maxwell looks for the big hit, bottom-edges it towards mid-off"}, {"ball": 7.3, "isHighlight": false, "text": "Sagar: \"Ah, typical from Maxwell.. (yawn)\""}, {"ball": 7.4, "isHighlight": false, "text": "Duminy to Sehwag, $$SIX$$ ,Sehwag shows he can hit them big as well, length ball well outside off, clubbed over cover for six"}, {"ball": 7.5, "isHighlight": false, "text": "Duminy to Sehwag, $$OUT$$ ,Sehwag goes for it again, again Duminy bowls it full and wide, Sehwag can't get enough power on this one, which means he find the man at sweeper cover"}, {"ball": 7.5, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$Tiwary$$ $$b$$ $$Duminy$$ $$23$$ $$(43m$$ $$22b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$104.54$$"}, {"ball": 7.5, "isHighlight": false, "text": "\"Oh dear,\" Daredevils fans will be thinking, \"the new batsman if David Miller.\""}, {"ball": 7.6, "isHighlight": false, "text": "Duminy to Maxwell,1 run,Maxwell works the final ball of the over to short fine leg for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Sriki: \"I don't know what's it with spinners and Number 99, Ashwin, Amit Mishra and Tahir all have 99 no. jersey !\""}, {"ball": 8.1, "isHighlight": false, "text": "Imran Tahir to Maxwell,2 runs,skids straight on after pitching on off stump, chopped towards deep point for two"}, {"ball": 8.2, "isHighlight": false, "text": "Imran Tahir to Maxwell,1 wide,full and way down the leg side, well kept by Karthik"}, {"ball": 8.2, "isHighlight": false, "text": "Criczinger: \"Only when KXIP is batting and someone gets out playing a poor shot, we don't say \" how silly!\" \""}, {"ball": 8.2, "isHighlight": false, "text": "Imran Tahir to Maxwell,1 leg bye,Maxwell was charging down and looking to go big, his bat doesn't get near the ball, luckily for him it hits his pads and goes wide of the keeper"}, {"ball": 8.3, "isHighlight": false, "text": "Imran Tahir to Miller,no run,quicker one outside off, Miller looks to work the ball through off but is beaten"}, {"ball": 8.4, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,spinning in towards the pads, eased towards long-on for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Arun: \"Sehwag always plays for the crowd..Early days, he was an entertainer for the crowd and now he knows crowd wants to see M&M batting...So, he left the big stage for M&M sacrificing himself\""}, {"ball": 8.5, "isHighlight": false, "text": "Imran Tahir to Maxwell,2 runs,nearly a catch in the deep, Maxwell can't connect as well as he wants, but he will be lucky he didn't connect just a little bit more as the ball lands just short a diving Manoj Tiwary, who is struck on his shoulder and manages to slow the ball enough to stop it reaching the rope, Tahir applauds the effort"}, {"ball": 8.5, "isHighlight": false, "text": "Brad: \"99 problems but spin ain't one!!!\""}, {"ball": 8.6, "isHighlight": false, "text": "Imran Tahir to Maxwell, $$OUT$$ ,Tahir has got the big one, the googly has crashed into the off stump, Maxwell misses the swipe, Maxwell has to go, Tahir has already gone off on his usual over exuberant celebratory run"}, {"ball": 8.6, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$b$$ $$Imran$$ $$Tahir$$ $$14$$ $$(13m$$ $$11b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$127.27$$"}, {"ball": 9.1, "isHighlight": false, "text": "Duminy to Miller,no run,inside-edges this one onto his pads"}, {"ball": 9.2, "isHighlight": false, "text": "Duminy to Miller,1 run,worked away to long-off for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Duminy to Saha,1 run,pushed to long-on for a single"}, {"ball": 9.4, "isHighlight": false, "text": "Duminy to Miller,no run,defended back towards the bowler, Duminy getting through a quiet over here"}, {"ball": 9.5, "isHighlight": false, "text": "Duminy to Miller, $$OUT$$ ,the game is changing here, dramatically, Punjab have lost Miller now, he was looking to send that down the ground, he doesn't connect, the ball connects with leg stump, Punjab have lost four in three and a half overs"}, {"ball": 9.5, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$b$$ $$Duminy$$ $$2$$ $$(8m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 9.5, "isHighlight": false, "text": "Sarim: \"Imran Tahir is a great wicket-taking option in t20s and was in fantastic form in the wt20. Staggering that he wasn't picked up by anyone in the auction itself.\" Perhaps because the auction was before the World T20."}, {"ball": 9.6, "isHighlight": false, "text": "Duminy to Patel,1 run,sliding on towards off, inside-edges it towards backward square leg"}, {"ball": 9.6, "isHighlight": false, "text": "Vee: \"@ Brad - Spin seems to be 100% of the problem right now.\""}, {"ball": 9.6, "isHighlight": false, "text": "Yusuf: \"@Criczinger; thats an excellent way to jinx the whole team :)\""}, {"ball": 9.6, "isHighlight": false, "text": "Here's Unadkat"}, {"ball": 10.1, "isHighlight": false, "text": "Unadkat to Patel,no run,gets some extra bounce there, this was just outside off, Patel is beaten"}, {"ball": 10.1, "isHighlight": false, "text": "Sriki: \"It would be nice to see ho KXIP bat now with neither Miller nor Maxi to finish things for them and target still a fair distance away. \""}, {"ball": 10.2, "isHighlight": false, "text": "Unadkat to Patel,no run,defended towards short midwicket this time"}, {"ball": 10.3, "isHighlight": false, "text": "Unadkat to Patel, $$FOUR$$ ,short and wide outside off, poor ball and gets the treatment, Patel reaches out and hits that towards deep extra cover"}, {"ball": 10.4, "isHighlight": false, "text": "Unadkat to Patel,no run,slants in towards off, batsman opens the face and misses"}, {"ball": 10.5, "isHighlight": false, "text": "Unadkat to Patel,no run,short of length ball just outside off, defended down the track"}, {"ball": 10.6, "isHighlight": false, "text": "Unadkat to Patel,1 run,hacked towards long-off for a single, bringing up the 100"}, {"ball": 10.6, "isHighlight": false, "text": "Ravi: \"Thanks to all the leg spinners for bringing back the respect for this art of bowling. Before the T20 worldcup only spinners who were considered good(in T20) were those having the doosras and teesras. But the art Leg spin is equally destructive in all forms of cricket...thanks for reminding\""}, {"ball": 10.6, "isHighlight": false, "text": "Singhy: \"Why does Bailey insist on batting down the order? Surely the international captain is the best choice to guide a chase with a low required rate?\""}, {"ball": 11.1, "isHighlight": false, "text": "Duminy to Patel,1 wide,there's an appeal for a stumping after the ball slips down the leg side, third umpire is called for, Patel was looking to glance that one but he missed, his back leg was out of the ground for a moment, but he quickly drags it back, seemed straightforward but the third umpire takes many, many replays before deciding"}, {"ball": 11.1, "isHighlight": false, "text": "Raja: \"Bailey seems to be in Dhoni mode !! Coming late to only finish things off !\""}, {"ball": 11.1, "isHighlight": false, "text": "freddie: \"Way to go guys, George Bailey can still provide the finishing touch's if these guys stick around till the 16th.\""}, {"ball": 11.1, "isHighlight": false, "text": "Duminy to Patel,1 run,towards the pads, looks to whip it away but doesn't connect"}, {"ball": 11.2, "isHighlight": false, "text": "Duminy to Saha,1 run,length ball is wristily worked towards long-on for a single"}, {"ball": 11.3, "isHighlight": false, "text": "Duminy to Patel,1 run,length ball outside off, thumped towards wide long-on"}, {"ball": 11.4, "isHighlight": false, "text": "Duminy to Saha,1 run,Saha goes for the reverse-dab, sends the ball towards short third for a single"}, {"ball": 11.5, "isHighlight": false, "text": "Duminy to Patel,1 run,driven along the ground towards long-off for a single"}, {"ball": 11.6, "isHighlight": false, "text": "Duminy to Saha,1 run,length ball ,Saha skips down the track, sends the ball towards deep midwicket for a single"}, {"ball": 11.6, "isHighlight": false, "text": "prakash: \"Can you publish the number of times Maxwell has been out to a leg spinner in IPL?\" Our stats man Bishen, named after the great left-arm spinner, has dug this up: \"Maxwell against leg spin in the IPL: He has scored 133 runs of 68 balls at a SR of 195.59. He has been dismissed 5 times and therefore averages 26.6.\""}, {"ball": 11.6, "isHighlight": false, "text": "Ali: \"@freddie and @Raja would you guys stop jinxing Kings XI, really now watch Bailey come and get a golden duck\""}, {"ball": 12.1, "isHighlight": false, "text": "Unadkat to Saha,3 runs,from round the wicket, pushed towards cover, where it should have been a single at most, but Shami put in an amateur effort and lets the ball through, conceding two extra runs"}, {"ball": 12.2, "isHighlight": false, "text": "Unadkat to Patel,no run,short of length ball is slapped towards backward point, where there is a diving stop"}, {"ball": 12.2, "isHighlight": false, "text": "PrasadAR: \"Important Info to all those people who were waiting for the M&M show, has been cancelled due to technical difficulties. :-)\""}, {"ball": 12.3, "isHighlight": false, "text": "Unadkat to Patel,1 run,on the pads, helped down to fine leg for a single"}, {"ball": 12.4, "isHighlight": false, "text": "Unadkat to Saha,no run,slower ball, just back of a length, defended to the off side, Saha thinks about the single and then decides against it"}, {"ball": 12.5, "isHighlight": false, "text": "Unadkat to Saha,1 run,length ball is eased towards sweeper cover for one more"}, {"ball": 12.5, "isHighlight": false, "text": "Aalhad Kulkarni: \"@ PrasadAR, Its only postponed till the next match :)\""}, {"ball": 12.6, "isHighlight": false, "text": "Unadkat to Patel,2 runs,a low full toss and that is clubbed towards long-on, another misfield concedes an extra run, Vijay the culprit this time, Unadkat had four overthrows earlier in the game as well, besides these misfields"}, {"ball": 12.6, "isHighlight": false, "text": "rssampat: \"2 back to back wicket's here for the DD's should set up the match beautifully with about 45 to get from 36 balls and 4 wickets in hand with a single specialist batsman left.\""}, {"ball": 13.1, "isHighlight": false, "text": "Duminy to Saha, $$FOUR$$ ,way outside off, Saha skips down the track and stretches forward as he reaches for the ball, connects well enough to get a boundary behind point"}, {"ball": 13.2, "isHighlight": false, "text": "Duminy to Saha,1 run,pushed towards long-on for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Duminy to Patel,1 run,length ball on off, eased to long-on for one more"}, {"ball": 13.3, "isHighlight": false, "text": "Mrinal: \"Had Bishen included Ashwin for calculating that Leg Spin Vs Maxi stats? Ashwin nowadays mostly bowls leg spin and in betwen slipping some googlies .... oh... Off Break..\""}, {"ball": 13.4, "isHighlight": false, "text": "Duminy to Saha,no run,Saha again going for the reverse-dab, bottom edges it and the ball bounces through to the keeper"}, {"ball": 13.5, "isHighlight": false, "text": "Duminy to Saha,no run,dances down the track and defends to the off side"}, {"ball": 13.6, "isHighlight": false, "text": "Duminy to Saha,1 wide,wide down the leg side"}, {"ball": 13.6, "isHighlight": false, "text": "Duminy to Saha,no run,length ball outside off, defended back to the bowler"}, {"ball": 13.6, "isHighlight": false, "text": "SoHeL: \"Caution for other teams: KXIP can also play sensible cricket when it is due.... They are showing this now...\""}, {"ball": 13.6, "isHighlight": false, "text": "kc: \"Even without M&M fireworks, KXIP is motoring along fairly smoothly. DD will rue their end-of-innings hash up. \""}, {"ball": 14.1, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,short of length ball angling across, past the outside edge to the keeper"}, {"ball": 14.2, "isHighlight": false, "text": "Mohammed Shami to Patel, $$FOUR$$ ,short ball and Shami continues to leak runs, thumped behind point for four, reaches the rope after one bounce"}, {"ball": 14.2, "isHighlight": false, "text": "Jayan Karthik: \"If KXI win the match, the coach will update the checklist with \"Lower middle Order tested: Check\" which was the only thing left.. \""}, {"ball": 14.3, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,defended back towards the bowler"}, {"ball": 14.4, "isHighlight": false, "text": "Mohammed Shami to Patel,no run,on legstump, tapped towards short midwicket"}, {"ball": 14.5, "isHighlight": false, "text": "Mohammed Shami to Patel,1 run,down the leg side, helped along to short fine"}, {"ball": 14.6, "isHighlight": false, "text": "Mohammed Shami to Saha,1 wide,full and wide, much too wide"}, {"ball": 14.6, "isHighlight": false, "text": "Mohammed Shami to Saha, $$OUT$$ ,full ball outside off, driven to short cover, was that a bump ball? the third umpire is called for after much delay, there wasn't too much of an appeal from the fielder Parnell initially, but the replays show the batsman is out, hit the ball just after it bounced and chipped it straight to Parnell, another wicket for Daredevils"}, {"ball": 14.6, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$c$$ $$Parnell$$ $$b$$ $$Mohammed$$ $$Shami$$ $$13$$ $$(29m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 14.6, "isHighlight": false, "text": "Raj: \"Its a crime to give 10 wides in any format... forget T20!\""}, {"ball": 14.6, "isHighlight": false, "text": "George Bailey is in now."}, {"ball": 15.1, "isHighlight": false, "text": "Parnell to Patel, $$FOUR$$ ,Parnell starts with a shortish ball outside off, carved behind backward point for four"}, {"ball": 15.2, "isHighlight": false, "text": "Parnell to Patel, $$FOUR$$ ,that was a superb comeback from Parnell, a toe-crusher of a yorker, that seemed a good shout for lbw, it is off the boot and past the keeper for four, umpire Dharmasena gives it as four runs, though that crashed straight into the boot, might have missed leg, but could have been given out as well"}, {"ball": 15.3, "isHighlight": false, "text": "Parnell to Patel,no run"}, {"ball": 15.4, "isHighlight": false, "text": "Parnell to Patel,no run,defended towards short midwicket"}, {"ball": 15.5, "isHighlight": false, "text": "Parnell to Patel,no run,shortish ball outside off, Patel swishes and misses"}, {"ball": 15.5, "isHighlight": false, "text": "Farhan: \"Another error by the umpires. That should have been a very important wicket for DD. That was plumb\""}, {"ball": 15.6, "isHighlight": false, "text": "Parnell to Patel, $$FOUR$$ ,on the pads, helped along to the fine leg boundary, poor deliveries to start and end the over, that means three fours in the over, and Kings XI remain in control"}, {"ball": 15.6, "isHighlight": false, "text": "$$Time-out$$"}, {"ball": 15.6, "isHighlight": false, "text": "Siva Kumar: \"It's a blessing in disguise for KXIP that Miller and Maxwell failed today. It'll test and also give some practice for the lower middle order with playoffs coming.\""}, {"ball": 15.6, "isHighlight": false, "text": "Here's Tahir. Can he do it for Daredevils?"}, {"ball": 16.1, "isHighlight": false, "text": "Imran Tahir to Bailey,1 run,Bailey eases the first ball towards long-on for a single"}, {"ball": 16.2, "isHighlight": false, "text": "Imran Tahir to Patel,no run,spinning away from the left-hander who defends towards point"}, {"ball": 16.2, "isHighlight": false, "text": "srini_bleed-red: \"Another error Yes! Important one? Not Sure.\""}, {"ball": 16.3, "isHighlight": false, "text": "Imran Tahir to Patel,no run,bottom edges the ball towards first slip this time, pretty cool that they have a first slip in place at this stage of the innings"}, {"ball": 16.4, "isHighlight": false, "text": "Imran Tahir to Patel,1 run,Tahir drags it short, Patel slaps it towards deep square leg for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Imran Tahir to Bailey,2 runs,short once more, Bailey sends it towards deep point for a couple"}, {"ball": 16.6, "isHighlight": false, "text": "Imran Tahir to Bailey,1 run,guided to backward point to complete a quick single"}, {"ball": 16.6, "isHighlight": false, "text": "Unadkat now"}, {"ball": 17.1, "isHighlight": false, "text": "Unadkat to Bailey,1 run,short of length ball outside off, steered down to third man for a single"}, {"ball": 17.1, "isHighlight": false, "text": "Anwy: \"It's definitely an important error. Akashar could be today's Man of the match. He picked up 1 wkt (KP) for 18 runs in 4 overs. Then now batting really well. Surely an important umpiring error by Dharmasena. \""}, {"ball": 17.2, "isHighlight": false, "text": "Unadkat to Patel,1 run,mistimes a hack down the ground, past the bowler for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Unadkat to Bailey,1 run,short of length and outside off, guided down to third man for a single, calm and risk-free from Bailey"}, {"ball": 17.4, "isHighlight": false, "text": "Unadkat to Patel,no run,a yorker into the toes, Patel jams it back towards the bowler, again the third umpire is called for after a half-hearted appeal from Unadkat, this time Patel played it into the ground, then onto the boot and to the bowler"}, {"ball": 17.5, "isHighlight": false, "text": "Unadkat to Patel, $$SIX$$ ,and that's surely the game, a full toss outside off is thumped over long-off for six, Patel a strong contender for Man of the Match here"}, {"ball": 17.6, "isHighlight": false, "text": "Unadkat to Patel,1 run,driven towards long-on for a single to end the over"}, {"ball": 18.1, "isHighlight": false, "text": "Imran Tahir to Patel,1 run,steps down and drives towards long-off for a single"}, {"ball": 18.2, "isHighlight": false, "text": "Imran Tahir to Bailey,no run,googly from Tahir, Bailey drives it in front of point"}, {"ball": 18.3, "isHighlight": false, "text": "Imran Tahir to Bailey, $$OUT$$ ,taken! this game is back alive, Bailey perishes, a needless big hit, don't think he picked the googly, and that flies off the inside half of the bat towards deep midwicket, where Jadhav takes a good diving catch, two rookies will have to finish the job now"}, {"ball": 18.3, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$c$$ $$Jadhav$$ $$b$$ $$Imran$$ $$Tahir$$ $$6$$ $$(17m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$85.71$$"}, {"ball": 18.4, "isHighlight": false, "text": "Imran Tahir to Patel,1 run,pushed towards cover for a tight single, almost an overthrow there, direct hit would have been close there"}, {"ball": 18.5, "isHighlight": false, "text": "Imran Tahir to Dhawan,no run,dot ball, Dhawan can't get it away, down the track"}, {"ball": 18.6, "isHighlight": false, "text": "Imran Tahir to Dhawan,no run,big googly from Tahir, nearly got through after Dhawan skips down the track, off the pads"}, {"ball": 18.6, "isHighlight": false, "text": "Nine needed in the final over."}, {"ball": 19.1, "isHighlight": false, "text": "Parnell to Patel,1 run,full and outside off, sliced towards deep point for a single"}, {"ball": 19.1, "isHighlight": false, "text": "Eight off five now."}, {"ball": 19.1, "isHighlight": false, "text": "Aalhad Kulkarni: \"So in a sense, Kumar Dharmasena should be the Man Of the Match if KXIP win :P\""}, {"ball": 19.2, "isHighlight": false, "text": "Parnell to Dhawan,2 runs,short ball, Dhawan doesn't know much about that one, a top edge towards square leg, Tahir has plenty of ground to cover, so the batsmen can hare back for the second, in time to beat the throw"}, {"ball": 19.3, "isHighlight": false, "text": "Parnell to Dhawan,2 runs,great running from Aksar Patel there, that full toss was drilled past the bowler, didn't look like there would be time for two, but Patel was nearly lapping Dhawan there, so quick was he off the blocks"}, {"ball": 19.4, "isHighlight": false, "text": "Parnell to Dhawan, $$FOUR$$ ,it's all over, Kings XI win another, making absolutely certain of their place in the playoffs, Delhi sink to their seventh straight loss, the result was confirmed with a powerful pull towards deep midwicket for four, it was tight, but once again Kings XI pull through"}, {"ball": 19.4, "isHighlight": false, "text": "Daredevils take it close but still can't snap their streak - they will look back on the lack of acceleration towards the end of their batting, and the large number of extras."}, {"ball": 19.4, "isHighlight": false, "text": "$$Pietersen$$ : \"Incredibly tough to get over that one, our strength has been our batting in the last five-six, but ...  it just wasn't meant to be. Hopefully, we can finish well, today was a team effort.\""}, {"ball": 19.4, "isHighlight": false, "text": "How good was Akshar Patel's innings? Keeping his cool even as the match got tight, after the M&M show ended early."}, {"ball": 19.4, "isHighlight": false, "text": "apoorvagj: \"Peitersen doesn't know Manan Vohra? Are you kidding me!!! What is means is that there was no strategy discussed against Vohra last night. \""}, {"ball": 19.4, "isHighlight": false, "text": "$$Presentation$$ $$ceremony:$$"}, {"ball": 19.4, "isHighlight": false, "text": "$$George$$ $$Bailey:$$  explains the decision to demote himself, says he wanted to keep the left-right combination going, especially as there was a short boundary on one side. \"I thought they got a better start than they should have, they were probably under par but only just.\""}, {"ball": 19.4, "isHighlight": false, "text": "Man of the Match is  $$Akshar$$ $$Patel:$$  \"If you want to play cricket for a long time, you have to perform in the pressure situations. I have told the captain that I don't mind bowling at any stage of the innings, I want to prove myself here.\""}, {"ball": 19.4, "isHighlight": false, "text": "Right, that's a wrap from me. Our video show 'The Huddle' will start soon. Stick around for that. Thanks for the mails today, will Daredevils ever win?"}], "name": "Delhi Daredevils v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734019.html?innings=2;view=commentary", "match_num": 45}