{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.00pm$$  Here we go, then. The umpires today are Anil Chaudhary and Nigel Llong. It's Chris Gayle and Parthiv Patel to open for Royal Challengers, and Bhuvneshwar Kumar to bowl the first over."}, {"ball": 0, "isHighlight": false, "text": "Tariq: \"Mayank Agarwal !\" Yup. That makes ten. One more name, people! And Alok chips in with Ronit More. We have a full team!"}, {"ball": 0, "isHighlight": false, "text": "Pavan Karanam: \"\"Venu in for Rahul\" my first thought - is it because he is from Karnataka and his weakness might be exposed?? later - oh come on!!! name one Karnataka Player in RCB to know him as a close team mate :p\""}, {"ball": 0, "isHighlight": false, "text": "That leads me to think we could have a Karnataka IPL XI (with no RCB players, of course): Rahul, Uthappa, Karun Nair, Manish Pandey, Stuart Binny, CM Gautam, Shreyas Gopal, Vinay Kumar, HS Sharath... (who have I missed out?)"}, {"ball": 0, "isHighlight": false, "text": "$$3.50pm$$  Chris Gayle, talking about Kieron Pollard's spectacular catch from the other day: \"He learned from the best. Chris Gayle.\""}, {"ball": 0, "isHighlight": false, "text": "Ashwani: \"@Karthik: As a Delhi fan I am supporting cricket today ;-)\""}, {"ball": 0, "isHighlight": false, "text": "Karthik Karumba has done the math for everyone. \"For all who are asking this. \"Whom to support\" Kings XI - Your call; CSK fans - Sunrisers; RR fans - Sunrisers; KKR fans - Sunrisers; RCB fans - You know who :) MI fans - RCB; Sunrisers - Well.. what do I say; Delhi fans - Oh come on!!\""}, {"ball": 0, "isHighlight": false, "text": "$$3.40pm$$  Confirmation on the Sunrisers changes. Parvez Rasool and Venugopal Rao are in for Amit Mishra and KL Rahul."}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm$$  Toss time, folks. It's... heads, and Virat Kohli says RCB will bat first. He echoes Darren Sammy's thoughts that the pitch looks a little dry. Sammy would have also batted. Anything below 150, Sammy says, will be chaseable."}, {"ball": 0, "isHighlight": false, "text": "Unchanged side for RCB. Two changes for Sunrisers. Amit Mishra and KL Rahul are out. Parvez Rasool (whom everyone has been waiting to watch) is in. We'll fill you in very very soon, on the who the other player is."}, {"ball": 0, "isHighlight": false, "text": "Sammy says Sunrisers are a team full of leaders, and nothing's really changed since he's become captain."}, {"ball": 0, "isHighlight": false, "text": "Virat Kohli, meanwhile, says it's exciting that progress, right now, is in RCB's hands. \"We're trying to peak at the right time.\""}, {"ball": 0, "isHighlight": false, "text": "Tariq: \"Lazy commentator and even lazier fans ! :)\" Amen."}, {"ball": 0, "isHighlight": false, "text": "Hemanth Peruri isn't one of your demanding fans. \"Wish RCB should hit 20 6's today,\" he says. \"Seems large. Considering the firepower in the line up, that's quite possible.\""}, {"ball": 0, "isHighlight": false, "text": "$$3.25pm$$  Loads of fans of teams not involved today have been mailing in, asking who they should support today. Like I said, look at the points table and work it out for yourselves, people! Cricinfo can't do all your work!"}, {"ball": 0, "isHighlight": false, "text": "Raghu B: \"Parvez Rasool should be in playing XI considering the likes of Parthiv Gayle and Yuvi in the opposition. It makes no sense playing 2 leg-spinners that too one of them is very rusty! \""}, {"ball": 0, "isHighlight": false, "text": "Baiju Joseph: \"Sunrisers have been effectively rendered toothless by the pitch... last year their strategy revolved around restricting the visiting teams on slow and low pitches... Now that strategy has been blown away... thank to the great curator... !!\""}, {"ball": 0, "isHighlight": false, "text": "Permutations: \"Hi, I'm a RR fan. Which team should i be supporting today?\" Sunrisers, I guess. If RCB win today and win their remaining matches, they can finish on 16 points. Rajasthan are on 14 right now, with two matches to go. The maximum Sunrisers can finish with is 14. For more, have a look at the  $$Points$$ $$Table$$ ."}, {"ball": 0, "isHighlight": false, "text": "$$3.15pm$$  Good afternoon, and welcome to our live ball-by-ball coverage of today's match between Sunrisers Hyderabad and Royal Challengers Bangalore. It's a must-win game for both teams, as this  $$preview$$ , by Rachna Shetty, will tell you. Sunrisers are yet to win on their home ground this season."}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Gayle,1 leg bye,leg-stumpish, bit of swing into Gayle, tucks it off his hips to deep backward square."}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Patel,no run,leaves Parthiv this time, and he presses forward to shoulder arms."}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Patel, $$FOUR$$ ,similar delivery, but it's overpitched, and its line is a touch closer to the batsman, and Parthiv leans on it to send it scurrying past cover. Lovely drive."}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Patel,no run,another one leaves Parthiv, extravagant movement, and Parthiv lets it go."}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Patel, $$OUT$$ ,that was set up perfectly. This one comes back, pitching middle, hitting middle, and Parthiv's head is falling over as he plays all around it and is struck on the front pad, right in front."}, {"ball": 0.5, "isHighlight": false, "text": "$$PA$$ $$Patel$$ $$lbw$$ $$b$$ $$Kumar$$ $$4$$ $$(3m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "In comes Kohli."}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Kohli,no run,teasing line, just outside off, bit of outswing. Kohli lets it go."}, {"ball": 0.6, "isHighlight": false, "text": "Dale Steyn to Chris Gayle. This should be fun."}, {"ball": 1.1, "isHighlight": false, "text": "Steyn to Gayle,no run,full and wide outside off, Gayle lets it go."}, {"ball": 1.2, "isHighlight": false, "text": "Steyn to Gayle,no run,pokes at this one from the crease, and he's beaten as it leaves him a touch."}, {"ball": 1.3, "isHighlight": false, "text": "Steyn to Gayle,no run,fuller, straighter, one of those top-of-off balls, defended watchfully into the off side. Gayle's front foot, as usual, is stationary."}, {"ball": 1.4, "isHighlight": false, "text": "Steyn to Gayle,2 runs,tucked off the hips to the right of deep backward square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Steyn to Gayle,no run,bit of away movement again, from back of a length, and a bit of bounce. Gayle gets on his toes to chop it down into the off side."}, {"ball": 1.6, "isHighlight": false, "text": "Steyn to Gayle,no run,full, heading towards off, Gayle defends towards cover"}, {"ball": 1.6, "isHighlight": false, "text": "\"Which other state besides Karnataka? I nominate Gujarat - Jadeja, Parthiv, Akshar, Rayudu, Pujara, Irfan, Yusuf, Bumrah, Manpreet, Unadkat, Bharghav\" That's cheating, Madhav. You have some Baroda and Saurashtra players in there :)"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Kohli,1 run,drifts onto Kohli's pads, worked away behind square"}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Gayle,no run,starts outside leg, swings towards the stumps, Gayle plays it watchfully into the leg side"}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Gayle, $$FOUR$$ ,down the pitch, hits it over cover, doesn't quite get hold of it, bounces away past the boundary"}, {"ball": 2.3, "isHighlight": false, "text": "Naman Ojha comes up to the stumps"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to Gayle,no run,flicked from outside off to backward square leg"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Gayle,1 run,tucked off the hips to deep square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to Kohli,1 run,typical Kohli nurdle, leans forward, wrists it from outside off towards mid-on"}, {"ball": 3.1, "isHighlight": false, "text": "Steyn to Kohli,no run,length ball outside off, defended towards mid-on"}, {"ball": 3.2, "isHighlight": false, "text": "Steyn to Kohli,1 run,opens his bat face, steers it behind point"}, {"ball": 3.3, "isHighlight": false, "text": "Steyn to Gayle,2 runs,length ball, angled across, Gayle opens his bat face and steers it behind point"}, {"ball": 3.4, "isHighlight": false, "text": "Steyn to Gayle,2 runs,drifts down the leg side this time, short, whipped off the hips backward of square."}, {"ball": 3.5, "isHighlight": false, "text": "Steyn to Gayle,1 run,shortish ball, Gayle pushes it square on the off side"}, {"ball": 3.6, "isHighlight": false, "text": "Steyn to Kohli,no run,back of a length, outside off, defended back to the bowler"}, {"ball": 3.6, "isHighlight": false, "text": "Rasool!"}, {"ball": 4.1, "isHighlight": false, "text": "Parvez Rasool to Gayle,1 run,full ball, worked down to long-on for a walked single"}, {"ball": 4.2, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,takes a couple of steps down the track, tucks it towards midwicket with the turn"}, {"ball": 4.2, "isHighlight": false, "text": "around the wicket to Gayle"}, {"ball": 4.3, "isHighlight": false, "text": "Parvez Rasool to Gayle,no run,down the track, fires it in, hits him on the pad"}, {"ball": 4.4, "isHighlight": false, "text": "Parvez Rasool to Gayle,no run,quickish ball, sees Gayle give himself room, angled down the leg side, goes off Gayle's pads towards the off side"}, {"ball": 4.5, "isHighlight": false, "text": "Parvez Rasool to Gayle,no run,down the pitch again, doesn't get to the pitch, defends towards the leg side"}, {"ball": 4.6, "isHighlight": false, "text": "Parvez Rasool to Gayle,1 run,quickish ball again, drops a touch short, Gayle flicks it towards deep midwicket"}, {"ball": 4.6, "isHighlight": false, "text": "Spin from both ends. Karn Sharma."}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Gayle, $$OUT$$ ,got him! looks to heave it over the leg side, gets an edge that balloons into the hands of short third man. That seemed to go off the back of the bat. Will have to wait for a replay. Nope, it hit the toe of the bat."}, {"ball": 5.1, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$c$$ $$Parvez$$ $$Rasool$$ $$b$$ $$Sharma$$ $$14$$ $$(24m$$ $$20b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$70.00$$"}, {"ball": 5.1, "isHighlight": false, "text": "Yuvraj is in now"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 leg bye,legbreak, turns from leg and middle down the leg side, seemed to go off his pad"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Kohli,1 run,drifts onto the pads, tucked away in front of square leg"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,down the pitch, Karn fires it full and wide, driven to cover"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,short, cut straight to point"}, {"ball": 6.1, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,full, on the stumps, flicked to deep midwicket"}, {"ball": 6.1, "isHighlight": false, "text": "around the wicket to Yuvraj"}, {"ball": 6.2, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,1 run,Yuvraj is down the track, gets too close to the pitch, flicks it to deep midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,full, on leg stump, worked towards deep backward square leg"}, {"ball": 6.4, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,no run,tucked away from outside off to square leg"}, {"ball": 6.5, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,no run,bit of width, Yuvraj forces it straight to cover"}, {"ball": 6.6, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,1 run,down the track, doesn't quite get to the pitch, ends up playing a half-hearted chip, which was a good thing for the batsman, because it dropped just short of Dhawan running in from long-on"}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,bit of turn, pitches middle, straightens towards middle and leg, defended"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,slog-sweep, doesn't get hold of it, and once again, it drops just short of a fielder. Steyn was a little late running in from deep midwicket.  Hang on, he got his hands to it."}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Kohli, $$FOUR$$ ,down the track, gets to the pitch, is in the perfect position to play the lofted drive over cover. Kohli can play that shot in his sleep."}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Kohli,no run,shortish, Kohli looks for the pull, but it's quick, and he jams it down towards the bowler"}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Kohli,2 runs,driven to the right of Warner at deep cover"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Kohli,no run,down the track, driven to long-off"}, {"ball": 7.6, "isHighlight": false, "text": "Rasool and Karn have gone for 15 in their four overs. More spin now, offspin from Venu"}, {"ball": 8.1, "isHighlight": false, "text": "Venugopal Rao to Yuvraj Singh, $$FOUR$$ ,full, overpitched, driven hard down the ground. Steyn runs to his right from long-on, dives full-length, can't stop it, lands awkwardly on his bowling shoulder, but he looks okay"}, {"ball": 8.2, "isHighlight": false, "text": "Venugopal Rao to Yuvraj Singh,no run,swept to short fine leg"}, {"ball": 8.3, "isHighlight": false, "text": "Venugopal Rao to Yuvraj Singh,no run,down the track, defends"}, {"ball": 8.4, "isHighlight": false, "text": "Venugopal Rao to Yuvraj Singh,1 run,length ball, swept to deep square leg"}, {"ball": 8.5, "isHighlight": false, "text": "Venugopal Rao to Kohli,1 run,quickish ball on the stumps, worked to deep midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Venu has been bowling over the stumps to Kohli, around to Yuvraj"}, {"ball": 8.6, "isHighlight": false, "text": "Venugopal Rao to Yuvraj Singh,1 run,what's happening here? Finch runs in this time from long-off, dives forward, and this chip from Yuvraj drops just short of him."}, {"ball": 8.6, "isHighlight": false, "text": "It's time for a time-out. Another bowling change. Irfan Pathan now, from the Pavilion end."}, {"ball": 8.6, "isHighlight": false, "text": "Bhanu: \"RCB has so much power in their engine, but still their car refuses to move. \""}, {"ball": 9.1, "isHighlight": false, "text": "Pathan to Yuvraj Singh,no run,length ball, driven straight, too straight, hits the stumps at the bowler's end"}, {"ball": 9.2, "isHighlight": false, "text": "Pathan to Yuvraj Singh,no run,short, wide, Yuvraj has to reach for it, and doesn't time it at all. Chopped to point"}, {"ball": 9.3, "isHighlight": false, "text": "Pathan to Yuvraj Singh,no run,short and wide again, tries to slash at it, misses, good take from Naman Ojha, standing up"}, {"ball": 9.4, "isHighlight": false, "text": "Pathan to Yuvraj Singh,1 run,wide again, slightly fuller, square-drive to the off-side sweeper"}, {"ball": 9.5, "isHighlight": false, "text": "Pathan to Kohli,no run,straightish length ball, Kohli stays leg side of it, drives it to cover"}, {"ball": 9.6, "isHighlight": false, "text": "Pathan to Kohli, $$FOUR$$ ,overpitched, wide, and Kohli won't miss out. Drives that with a full swing of the bat, to the right of cover, to the left of long-off."}, {"ball": 10.1, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,no run,looks to sweep from outside off, inside-edge onto the back thigh."}, {"ball": 10.2, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh, $$FOUR$$ ,sees Yuvraj come down the pitch, Rasool fires it down the leg side, too far wide for Naman to take. Oh. Hang on. There was some bat on that, as Yuvraj swept."}, {"ball": 10.3, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,1 run,tucked towards square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,down the pitch, flicked to deep square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh, $$SIX$$ ,down the pitch, big extension of the arms, and that's another lucky break for Yuvraj. Dale Steyn ran left from long-on, jumped and stretched his arms out, got a hand to it but can't catch it."}, {"ball": 10.6, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh,no run,quickish, defended into the on side"}, {"ball": 11.1, "isHighlight": false, "text": "Sharma to Kohli, $$SIX$$ ,down the pitch, Kohli swings those arms through the line, and it goes high, and way over the straight boundary"}, {"ball": 11.2, "isHighlight": false, "text": "Sharma to Kohli, $$FOUR$$ ,drops short now, and Kohli is quickly back to cut powerfully to point's right"}, {"ball": 11.3, "isHighlight": false, "text": "Sharma to Kohli,no run,down the pitch, not quite to the pitch, bottom hand comes off as he plays an out-of-control drive to cover"}, {"ball": 11.4, "isHighlight": false, "text": "Sharma to Kohli,2 runs,shortish, pulled between long-on and deep midwicket. Long on picks it up running hard to his right."}, {"ball": 11.5, "isHighlight": false, "text": "Sharma to Kohli, $$SIX$$ ,down the pitch again, and he's in the perfect position for that lofted drive over extra cover. Made that look so simple."}, {"ball": 11.6, "isHighlight": false, "text": "Sharma to Kohli,1 run,length ball, bit of turn towards off stump, turns his wrists and bunts it into the leg side"}, {"ball": 11.6, "isHighlight": false, "text": "Rasool around the wicket to Kohli now"}, {"ball": 12.1, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,driven down to long-off"}, {"ball": 12.2, "isHighlight": false, "text": "Parvez Rasool to Yuvraj Singh, $$OUT$$ ,finally! Yuvraj hits this pretty well, but he might have been too close to the pitch to get any real elevation, goes flat and low to Steyn at long-on. This one carried nicely."}, {"ball": 12.2, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Steyn$$ $$b$$ $$Parvez$$ $$Rasool$$ $$21$$ $$(27m$$ $$25b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$84.00$$"}, {"ball": 12.2, "isHighlight": false, "text": "AB is in now. Rasool goes over the wicket"}, {"ball": 12.3, "isHighlight": false, "text": "Parvez Rasool to de Villiers,2 wides,drifts down the leg side, Naman doesn't gather cleanly"}, {"ball": 12.3, "isHighlight": false, "text": "Around the wicket to Kohli"}, {"ball": 12.3, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 wide,Change of angle doesn't help. Way down the leg side again"}, {"ball": 12.3, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,straighter, tucked off the pads wide of long-on"}, {"ball": 12.4, "isHighlight": false, "text": "Parvez Rasool to de Villiers,1 run,onto the pads once more, worked to deep midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Parvez Rasool to Kohli,no run,down the pitch, looks to drive it straight, goes off AB's pads to Rasool as the non-striker dives back into his crease"}, {"ball": 12.6, "isHighlight": false, "text": "Parvez Rasool to Kohli,1 run,tucked away to deep square leg"}, {"ball": 12.6, "isHighlight": false, "text": "The ball isn't really coming on off this pitch. It's been hard to hit through the line unless it's really full. It's slow, but there hasn't been too much turn just yet."}, {"ball": 12.6, "isHighlight": false, "text": "Here's Steyn now"}, {"ball": 13.1, "isHighlight": false, "text": "Steyn to Kohli,1 run,full, wide of off. Drives well, but Sammy does well to stop it, diving to his left from cover"}, {"ball": 13.2, "isHighlight": false, "text": "Steyn to de Villiers,1 run,full, almost in the blockhole, AB drives it to long-on"}, {"ball": 13.3, "isHighlight": false, "text": "Steyn to Kohli,1 run,length ball on the pads, flicked to deep backward square leg"}, {"ball": 13.4, "isHighlight": false, "text": "Steyn to de Villiers,2 runs,back of a length, outside off, punched wide of Sammy at cover"}, {"ball": 13.5, "isHighlight": false, "text": "Steyn to de Villiers,1 run,length ball, on off stump, driven to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Steyn to Kohli,1 run,full, outside off, flicked airily but safely down to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Irfan returns"}, {"ball": 14.1, "isHighlight": false, "text": "Pathan to Kohli, $$FOUR$$ ,full and wide. You don't bowl there to Kohli. Driven over extra cover."}, {"ball": 14.2, "isHighlight": false, "text": "Pathan to Kohli,1 run,straighter this tinme, pushed down to long-off"}, {"ball": 14.3, "isHighlight": false, "text": "Pathan to de Villiers,1 run,AB stays next to the line, slaps it to deep point"}, {"ball": 14.4, "isHighlight": false, "text": "Pathan to Kohli,1 run,slower ball, opens the bat-face and takes a quick single to short third man to bring up his first half-century of the season"}, {"ball": 14.5, "isHighlight": false, "text": "Pathan to de Villiers, $$FOUR$$ ,width, AB slashes at it on one knee, gets a thick edge that races down to the third man boundary. Poor ball."}, {"ball": 14.6, "isHighlight": false, "text": "Pathan to de Villiers,1 run,walks across the stumps, scoops it from outside off to deep backward square leg"}, {"ball": 14.6, "isHighlight": false, "text": "Sammy comes on now"}, {"ball": 15.1, "isHighlight": false, "text": "Sammy to de Villiers,2 runs,length ball, just outside off, chipped over cover"}, {"ball": 15.2, "isHighlight": false, "text": "Sammy to de Villiers, $$SIX$$ ,slower ball, AB spotted that early, and he waits, keeps a stable base, and swings cleanly through the line to launch that over the long-off boundary"}, {"ball": 15.3, "isHighlight": false, "text": "Sammy to de Villiers,1 run,tucked off the pads to deep midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Sammy to Kohli,1 wide,slides it full, down the leg side, and Naman takes it low, standing up"}, {"ball": 15.4, "isHighlight": false, "text": "Sammy to Kohli, $$SIX$$ ,slower ball again, and again, no disguise, and Kohli sends that whistling back over his head"}, {"ball": 15.5, "isHighlight": false, "text": "Sammy to Kohli,1 run,full, on off stump, wristy drive to long-off"}, {"ball": 15.6, "isHighlight": false, "text": "Sammy to de Villiers,2 runs,slower ball, almost in the blockhole, pushed down to long-on, took its time getting to the fielder, enough time for a comfortable two"}, {"ball": 15.6, "isHighlight": false, "text": "Bhuvi's back now"}, {"ball": 16.1, "isHighlight": false, "text": "Kumar to Kohli,2 runs,Kohli gives himself room and slashes it over cover, Dhawan is the sweeper, cuts it off after a fumble, sends in a good flat throw, but the batsmen complete two easily"}, {"ball": 16.2, "isHighlight": false, "text": "Kumar to Kohli,1 run,low full toss, and Kohli wrists it to long-on"}, {"ball": 16.3, "isHighlight": false, "text": "Kumar to de Villiers,1 run,that's very wide of off, and AB slaps it to cover, where Sammy misfields, ball goes rolling down to long-off"}, {"ball": 16.4, "isHighlight": false, "text": "Kumar to Kohli,1 run,angled in towards off, full, and Kohli hits it hard to long-on"}, {"ball": 16.5, "isHighlight": false, "text": "Kumar to de Villiers, $$FOUR$$ ,length ball, AB takes a big back-and-across step and hits it on-the-up over extra cover"}, {"ball": 16.6, "isHighlight": false, "text": "Kumar to de Villiers,1 run,dropped! slower ball, I think, doesn't come out right, it's a full toss, and AB slaps it over the off side, Dhawan dives forward and did well to get to it, but can't quite hold on"}, {"ball": 16.6, "isHighlight": false, "text": "Vishnu: \"Its getting cold and cloudy out here in Hitech City, 15kms away from the stadium. It might rain any time now. Hope it stays away from the stadium area -Uppal.\""}, {"ball": 17.1, "isHighlight": false, "text": "Pathan to de Villiers,1 bye,tries to slog this length ball out of the ground, gets no bat on it. Goes off Naman's gloves down to third man"}, {"ball": 17.2, "isHighlight": false, "text": "Pathan to Kohli, $$SIX$$ ,another length ball, right in Kohli's slot, and he flicks his wrists to send it soaring over wide long-on"}, {"ball": 17.3, "isHighlight": false, "text": "Pathan to Kohli, $$OUT$$ ,he's gone! Kohli swings through the line again, doesn't quite hit it cleanly. It was there to be hit, but this one goes high and drops into Steyn's palms, cupped Australian-style, after he runs to his right from long-off."}, {"ball": 17.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Steyn$$ $$b$$ $$Pathan$$ $$67$$ $$(72m$$ $$41b$$ $$4x4$$ $$4x6)$$ $$SR:$$ $$163.41$$"}, {"ball": 17.4, "isHighlight": false, "text": "Pathan to de Villiers,1 run,full and wide, AB opens his bat face to steer it to point"}, {"ball": 17.4, "isHighlight": false, "text": "Rana is the new man"}, {"ball": 17.5, "isHighlight": false, "text": "Pathan to Rana,no run,full, on off stump, Rana comes forward and drives to cover"}, {"ball": 17.6, "isHighlight": false, "text": "Pathan to Rana, $$FOUR$$ ,full and straight, Rana drives it powerfully between the stumps and the non-striker, no chance for long-off to cut that off"}, {"ball": 18.1, "isHighlight": false, "text": "Kumar to de Villiers, $$OUT$$ ,big wicket, this. It's full and angled in, and did that keep a touch low? AB went back and across and went into a crouch to swat this towards midwicket, but the ball went under his bat and rammed into the stumps."}, {"ball": 18.1, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Kumar$$ $$29$$ $$(28m$$ $$17b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$170.58$$"}, {"ball": 18.1, "isHighlight": false, "text": "Milind: \"Why is there a fuss about catching \"cupped Australian-style\". Every time a player catches that way, it is particularly mentioned. I heard even Jonty Rhodes mentioning that some Indian players are starting to catch that way.. Is it really that difficult but good method to catch?\" No fuss, Milind. Was just adding some detail to my description."}, {"ball": 18.2, "isHighlight": false, "text": "Kumar to Starc,no run,full, on off, slapped to cover"}, {"ball": 18.2, "isHighlight": false, "text": "Bhuvi's bowling around the stumps to Starc"}, {"ball": 18.3, "isHighlight": false, "text": "Kumar to Starc, $$FOUR$$ ,slower ball, but it's short, and Starc waits for it and cuts it behind point. Good placement."}, {"ball": 18.4, "isHighlight": false, "text": "Kumar to Starc,1 run,goes wide of the crease, angles the yorker towards the stumps, poked down to long-on"}, {"ball": 18.5, "isHighlight": false, "text": "Kumar to Rana,1 run,full, on off, and Rana looks for the big drive but can only send it trickling to long-off"}, {"ball": 18.6, "isHighlight": false, "text": "Kumar to Starc,no run,low-full toss, and Bhuvneshwar does well to cut off this drive on his follow-through"}, {"ball": 18.6, "isHighlight": false, "text": "Steyn to finish the innings"}, {"ball": 19.1, "isHighlight": false, "text": "Steyn to Rana,1 run,drifts onto the pads, Rana misses out, flicks it straight to short fine leg"}, {"ball": 19.2, "isHighlight": false, "text": "Steyn to Starc,no run,wide yorker, gets it very close to the tram line as Starc reaches out and misses, the umpire has a look but he's unmoved"}, {"ball": 19.3, "isHighlight": false, "text": "Steyn to Starc,1 run,looks for the wide yorker again, but it's a full toss that Starc slaps to deep point"}, {"ball": 19.3, "isHighlight": false, "text": "But of a delay as Rana calls for a new right pad"}, {"ball": 19.4, "isHighlight": false, "text": "Steyn to Rana, $$FOUR$$ ,Rana's done an AB! Walks across his crease, and scoops this full ball over short fine leg"}, {"ball": 19.5, "isHighlight": false, "text": "Steyn to Rana,2 runs,Steyn pulls his length back, and Rana mishits this pull. It goes way up, and drops between long on and deep midwicket, both running forward to converge on the ball"}, {"ball": 19.6, "isHighlight": false, "text": "Steyn to Rana, $$OUT$$ ,length ball outside off, Rana slashes and misses. Starc takes off from the non-striker's end, Rana doesn't run. Ojha runs towards the stumps, disturbs them, and continues on to remove the bails at the non-striker's end as well."}, {"ball": 19.6, "isHighlight": false, "text": "$$MA$$ $$Starc$$ $$run$$ $$out$$ $$6$$ $$(7m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "After a slow start, Royal Challengers did well to get to 160, with Virat Kohli and AB de Villiers putting on 61 off 31 balls. Having been 48 for 2 at the end of the 10th over, Royal Challengers scored 112 in the last 10. Parvez Rasool  bowled an economical spell in his first game of the season, but the allrounders, Irfan Pathan and Sammy, were expensive for Sunrisers. Can Sunrisers chase down 161? Stay tuned."}], "name": "Sunrisers Hyderabad v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734021.html?innings=1;view=commentary", "match_num": 46}