{"commentary": [{"ball": 0, "isHighlight": false, "text": "David Warner to open now. He's walked in with Shikhar Dhawan, so Aaron Finch will bat down the order. How will this work? Let's wait and watch. Muttiah Muralitharan has the new ball for RCB. Here we go. Murali will bowl around the wicket to Dhawan."}, {"ball": 0, "isHighlight": false, "text": "Vishnu: \"Target: 161 for SRH. Thats 10 more than what Sammy wanted at the Toss.\" Yup."}, {"ball": 0, "isHighlight": false, "text": "Carlos: \"Ojha just demonstrated how the double play works in baseball through the IPL! got to love this tournament \""}, {"ball": 0, "isHighlight": false, "text": "Bakthiar Ahmed: \"This shuffling and paddle scoop is almost become predictable these days, still persisting with short fine leg is out of my mind..!!\" So which fielder will you move into the circle?"}, {"ball": 0.1, "isHighlight": false, "text": "Muralitharan to Dhawan,no run,slow, loopy, on off stump. Dhawan presses forward and pushes it to point."}, {"ball": 0.2, "isHighlight": false, "text": "Muralitharan to Dhawan,no run,once again, Dhawan opens his face and pushes it to point."}, {"ball": 0.3, "isHighlight": false, "text": "Muralitharan to Dhawan,no run,a touch shorter this time, and Dhawan defends off the back foot, into the on side"}, {"ball": 0.4, "isHighlight": false, "text": "Muralitharan to Dhawan, $$FOUR$$ ,it's overpitched, and Dhawan drives, finds the gap through the covers"}, {"ball": 0.5, "isHighlight": false, "text": "Muralitharan to Dhawan,1 run,leg-stumpish, and Dhawan works it off his pads to deep square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Muralitharan to Warner,1 run,tucked off his pads into the leg side"}, {"ball": 0.6, "isHighlight": false, "text": "Mitchell Starc now"}, {"ball": 1.1, "isHighlight": false, "text": "Starc to Warner,no run,bit of shape away from Warner, who squirts it down off the back foot, defensively, towards the bowler"}, {"ball": 1.2, "isHighlight": false, "text": "Starc to Warner,1 leg bye,angles this into the pads, and hits Warner on the pads as he misses the flick"}, {"ball": 1.3, "isHighlight": false, "text": "Starc to Dhawan, $$FOUR$$ ,full, bit of shape away, but Dhawan watches it all the way, leans on it, and eases it to the right of cover"}, {"ball": 1.4, "isHighlight": false, "text": "Starc to Dhawan, $$FOUR$$ ,Caught at first slip! Or would have been, had Gayle stood at an orthodox first slip rather than a wide third slip. Classical outswinger on a good length, Dhawan pokes at it, and edges it wide of the keeper"}, {"ball": 1.5, "isHighlight": false, "text": "Starc to Dhawan,1 run,tucked into the on side"}, {"ball": 1.6, "isHighlight": false, "text": "Starc to Warner,no run,full, on off, defended back to the bowler"}, {"ball": 1.6, "isHighlight": false, "text": "Varun Aaron into the attack now. Right arm around"}, {"ball": 2.1, "isHighlight": false, "text": "Aaron to Dhawan,no run,Back of a length, angling into Dhawan. Slashes and misses."}, {"ball": 2.2, "isHighlight": false, "text": "Aaron to Dhawan,no run,this is short and wide, and Dhawan misses out. Cuts it hard but straight to Yuvraj at point"}, {"ball": 2.2, "isHighlight": false, "text": "change of angle, over the wicket now"}, {"ball": 2.3, "isHighlight": false, "text": "Aaron to Dhawan, $$SIX$$ ,Aaron bangs this in, and directs it well, it's rising towards Dhawan's shoulder, but he gets inside the line, watches it all the way, and hooks it over Gayle at fine leg"}, {"ball": 2.4, "isHighlight": false, "text": "Aaron to Dhawan, $$FOUR$$ ,short again, not as short as the previous ball, and Dhawan pulls this for four, just behind square"}, {"ball": 2.5, "isHighlight": false, "text": "Aaron to Dhawan,no run,full, bit of swing towards Dhawan's pads, and the batsman ends up jamming his attempted drive into the ground"}, {"ball": 2.6, "isHighlight": false, "text": "Aaron to Dhawan,no run,length ball, angling across towards off stump. Dhawan drives it to cover."}, {"ball": 3.1, "isHighlight": false, "text": "Starc to Warner, $$FOUR$$ ,mistimed, but safe. Warner looks to hit this length ball over the top, doesn't get to the pitch, ends up scooping it high and back over the bowler. No one back, and it goes one bounce over the rope."}, {"ball": 3.2, "isHighlight": false, "text": "Starc to Warner,2 runs,flicked off his pads towards deep midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Starc to Warner,2 runs,drifts onto the pads, and he works it behind square. Chahal runs to his left from deep square leg to cut it off, but can't stop them from running a second."}, {"ball": 3.4, "isHighlight": false, "text": "Starc to Warner,1 wide,slides down the leg side, trying, presumably, to bowl one into the blockhole"}, {"ball": 3.4, "isHighlight": false, "text": "Starc to Warner,1 bye,slower ball outside off stump, Warner slashes and misses, and Parthiv fumbles behind the stumps as the ball rolls down towards him"}, {"ball": 3.5, "isHighlight": false, "text": "Starc to Dhawan,no run,this is full, on off stump, and Dhawan drives it to wide mid-off"}, {"ball": 3.6, "isHighlight": false, "text": "Starc to Dhawan, $$FOUR$$ ,poor bowling this. Mitch has been all over the place, and this is short and wide. Dhawan has all the time in the world to slash this over point."}, {"ball": 3.6, "isHighlight": false, "text": "Murali returns"}, {"ball": 4.1, "isHighlight": false, "text": "Muralitharan to Warner, $$FOUR$$ ,and he's promptly greeted by Warner switching his hands and moving into a right-handed position to slap this powerfully behind square"}, {"ball": 4.2, "isHighlight": false, "text": "Muralitharan to Warner,no run,too close to cut, and Warner is beaten"}, {"ball": 4.3, "isHighlight": false, "text": "Muralitharan to Warner,no run,pushed down to mid-on"}, {"ball": 4.4, "isHighlight": false, "text": "Muralitharan to Warner,no run,gives himself room, cuts it from a middle-stump line to cover"}, {"ball": 4.5, "isHighlight": false, "text": "Muralitharan to Warner,no run,tries to cut again, again no width, and he's found the point fielder"}, {"ball": 4.6, "isHighlight": false, "text": "Muralitharan to Warner,1 run,no turn on this one, and Warner is tucked up again. Clips it off his pads to deep square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Abu Nechim comes in now. He was RCB's Man of the Match in their previous game"}, {"ball": 5.1, "isHighlight": false, "text": "Ahmed to Warner, $$FOUR$$ ,length ball, which gives Warner a bit of room outside off. He throws his hands at it, and sends it whistling over mid-off"}, {"ball": 5.2, "isHighlight": false, "text": "Ahmed to Warner,1 run,straighter this time, and Warner knocks it down to long-off"}, {"ball": 5.2, "isHighlight": false, "text": "Srinath: \"Dhawan - form is temporary; moustache is permanent\""}, {"ball": 5.3, "isHighlight": false, "text": "Ahmed to Dhawan,no run,back of a length, angled across Dhawan, who stays beside the line and punches it to point"}, {"ball": 5.4, "isHighlight": false, "text": "Ahmed to Dhawan,no run,a little fuller this time, and Dhawan pushes it towards point off the front foot"}, {"ball": 5.5, "isHighlight": false, "text": "Ahmed to Dhawan,no run,short ball, and Dhawan is into his pull too early. Ball hits him on the right thigh."}, {"ball": 5.5, "isHighlight": false, "text": "Kalyan Kumar: \"Correction ! Abu Nechim won the Kanna Keep calm award :P AB De was the Man of the MAtch :P \" You may well be right."}, {"ball": 5.6, "isHighlight": false, "text": "Ahmed to Dhawan,1 run,shortish, on leg stump, flicked off the hips towards midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "RCB were 25 for 2 after the Powerplay. Sunrisers have made 51 for no loss. RCB, you would think, need a wicket very soon to get back in the game."}, {"ball": 5.6, "isHighlight": false, "text": "Aaron now. Can he come back after a poor first over?"}, {"ball": 6.1, "isHighlight": false, "text": "Aaron to Dhawan,2 runs,full and wide, and Dhawan leans forward, gets low, and drives it past a diving cover. It's cut off at the boundary, though."}, {"ball": 6.2, "isHighlight": false, "text": "Aaron to Dhawan,1 run,back of a length, on off stump, and Warner chops it towards backward point, where Yuvraj makes a good diving stop"}, {"ball": 6.3, "isHighlight": false, "text": "Aaron to Warner,no run,shortish, leg-stumpish, and Warner misses out, looks to beat short fine leg with a swivelling flick-pull, but finds the fielder"}, {"ball": 6.4, "isHighlight": false, "text": "Aaron to Warner,no run,leg-stump again, tucked carefully towards midwicket off the front foot"}, {"ball": 6.5, "isHighlight": false, "text": "Aaron to Warner,1 leg bye,leg-stump again, Warner looks to glance it past short fine-leg and misses out again. Misses the ball and it goes off his pad towards the leg side"}, {"ball": 6.6, "isHighlight": false, "text": "Aaron to Dhawan,no run,angled across Dhawan, who tries to glide it behind point with an open face. He's beaten, and so is Parthiv, who can't collect cleanly behind the stumps"}, {"ball": 6.6, "isHighlight": false, "text": "Here's Chahal"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Warner,2 runs,tossed up onto leg stump, and Warner sweeps it towards deep square leg. Abu Nechim throws to the keeper's end, Warner dives in, and it's gone up to the third umpire. Comfortably in, beats the direct hit."}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Warner,no run,bit of turn towards leg stump. It isn't that short, and Warner inside-edges that pull into his pads"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Warner,1 run,this one skids on with the angle, and Warner pulls it to deep midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Dhawan,no run,tossed up, dips on the batsman and turns in, inside edge onto the pads"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Dhawan,no run,Dhawan stays back to this one. It keeps a little low, but he still manages to squirt it into the off side with an open face"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Dhawan,1 run,worked into the leg side. Deep midwicket runs in hard to keep it down to a single"}, {"ball": 7.6, "isHighlight": false, "text": "rj: \"dhawan hit 26 runs of boundaries and six, but the remaining 6 runs have come off 17 balls. This is the difference between him and others who rotate strike. He needs to play with less dot ball percentage unless he wants to be Sunrisers' Gayle.!!!\""}, {"ball": 8.1, "isHighlight": false, "text": "Ahmed to Dhawan,2 runs,full and wide, and Dhawan throws his bat at it. Gets a thick edge down to a diving Aaron at third man. He seems to have hurt his knee as he stopped the ball. Looks okay though,"}, {"ball": 8.2, "isHighlight": false, "text": "Ahmed to Dhawan, $$FOUR$$ ,drops this short, and Dhawan is in a good position to half-pull, half-flick it behind square. Lovely timing"}, {"ball": 8.3, "isHighlight": false, "text": "Ahmed to Dhawan,no run,Dhawan jumps up and squirts this rising ball down into the ground"}, {"ball": 8.4, "isHighlight": false, "text": "Ahmed to Dhawan,1 run,angled across again, a bit fuller, and Dhawan pokes it towards cover point"}, {"ball": 8.5, "isHighlight": false, "text": "Ahmed to Warner,1 run,shortish ball again, and Warner swivels to play a controlled pull that goes down to deep midwicket on the bounce"}, {"ball": 8.6, "isHighlight": false, "text": "Ahmed to Dhawan,1 run,a little bit of width, but third man is in place to cut off Dhawan's late dab"}, {"ball": 8.6, "isHighlight": false, "text": "Trenchant criticism from rssampat. \"The short ball must be the most stupid and unproductive ball in cricket T-20 history. 8 times out of 10 it is hammered to the boundary, 1/10 is a dot ball and only very rarely gets a wicket. It's a low percentage wicket taking ball but a high run yeilding ball and despite this, the \"Fast\" bowler's keep bowling it time and again, very consistently and use it at least once every over. Very silly cricket this.\""}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Dhawan,1 run,tossed up, and Dhawan is down the pitch to drive it wristily to long-on"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Warner,no run,tossed up again. Warner is back in his crease, pushes it into the off side"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Warner,no run,quickish this time, Warner is hurried into this shot from down the pitch, is hit on the front pad as he tries to work his bat around it."}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Warner,1 run,keeps a bit low, Warner is trying to cut, ends up jamming it down into the leg side"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Dhawan,no run,works this round from outside off just behind square on the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Dhawan,2 runs,down the track, shortish delivery, tucked off the hips to deep square leg. Abu Nechim throws to the keeper's end again. Direct hit may have gotten Dhawan. It went to the keeper, on the bounce, giving him enough time to drag his bat in."}, {"ball": 10.1, "isHighlight": false, "text": "Muralitharan to Warner,no run,inside-edges onto the pads as he tries to pull"}, {"ball": 10.2, "isHighlight": false, "text": "Muralitharan to Warner, $$SIX$$ ,Warner runs down the track to this one, and swings cleanly through the line to launch it over long on"}, {"ball": 10.3, "isHighlight": false, "text": "Muralitharan to Warner,1 run,tucked off the legs towards midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Muralitharan to Dhawan,no run,tries to push it into the off side, off the front foot, and run a quick single, but Warner sends him back"}, {"ball": 10.5, "isHighlight": false, "text": "Muralitharan to Dhawan, $$FOUR$$ ,down the wicket again, and gets inside the line to hit this inside-out over cover. Expert placement, and long-off has no chance running to his right"}, {"ball": 10.6, "isHighlight": false, "text": "Muralitharan to Dhawan,no run,drops his length back, and Dhawan defends into the on side"}, {"ball": 10.6, "isHighlight": false, "text": "Sunrisers are cruising here, both batsmen playing some clinical shots in the previous over. Royal Challengers need some sort of inspiration."}, {"ball": 11.1, "isHighlight": false, "text": "Chahal to Warner, $$SIX$$ ,Chahal had been bowling well so far, but he drags this one down short. It's a long hop, and Warner pulls it away over midwicket"}, {"ball": 11.2, "isHighlight": false, "text": "Chahal to Warner, $$SIX$$ ,over the same region again, but it's the slog-sweep this time. Warner clears his front leg and swings across the line"}, {"ball": 11.3, "isHighlight": false, "text": "Chahal to Warner,no run,tries to sweep again, misses, big lbw appeal, and it looked to be going towards the stumps, but he might have gotten some bat on it"}, {"ball": 11.4, "isHighlight": false, "text": "Chahal to Warner,1 run,tries the reverse-sweep, doesn't quite connect, goes trickling to point"}, {"ball": 11.5, "isHighlight": false, "text": "Chahal to Dhawan,1 run,pushed down to mid-off"}, {"ball": 11.6, "isHighlight": false, "text": "Chahal to Warner,no run,makes room to cut, hits it hard but straight to cover"}, {"ball": 11.6, "isHighlight": false, "text": "Manasseh Anand: \"What was Warner doing at No.3,4,5 etc when he can be at his dangerous best opening? I'm enjoying it :)\""}, {"ball": 12.1, "isHighlight": false, "text": "Muralitharan to Dhawan,1 run,fifty for Dhawan. Goes back in his crease and tucks it away towards midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Muralitharan to Warner,2 runs"}, {"ball": 12.3, "isHighlight": false, "text": "Muralitharan to Warner, $$OUT$$ ,he's gone, is he? Yup. Warner dabs it straight to backward point, and both batsmen take off immediately. Quick throw from Yuvraj to Parthiv, and it's extremely close as he whips off the bails. Dhawan seemed to be juuuust a touch short of dragging his bat over the line, though, and the big screen flashes OUT."}, {"ball": 12.3, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$run$$ $$out$$ $$50$$ $$(54m$$ $$39b$$ $$7x4$$ $$1x6)$$ $$SR:$$ $$128.20$$"}, {"ball": 12.3, "isHighlight": false, "text": "Naman Ojha is the new man. Murali stays around the wicket"}, {"ball": 12.4, "isHighlight": false, "text": "Muralitharan to Ojha,no run,presses forward, defends into the off side"}, {"ball": 12.5, "isHighlight": false, "text": "Muralitharan to Ojha,1 run,goes back, opens his face, pushes the ball towards point"}, {"ball": 12.6, "isHighlight": false, "text": "Muralitharan to Warner,no run,back of a length, hurries towards Warner, who inside-edges onto his pads as he looks to tuck it into the leg side"}, {"ball": 13.1, "isHighlight": false, "text": "Chahal to Ojha,1 run,tossed up, driven to wide long-off"}, {"ball": 13.2, "isHighlight": false, "text": "Chahal to Warner,1 run,tossed up again, and it's pushed down to the same fielder, who is now a wide long-on now that Warner is the batsman"}, {"ball": 13.3, "isHighlight": false, "text": "Chahal to Ojha,no run,pushed through, defended into the leg side"}, {"ball": 13.4, "isHighlight": false, "text": "Chahal to Ojha,1 run,quickish, flat ball on off stump, and Naman opens his bat face to dab it to point"}, {"ball": 13.5, "isHighlight": false, "text": "Chahal to Warner,1 run,flat googly on the stumps, and Warner works it into the midwicket region"}, {"ball": 13.6, "isHighlight": false, "text": "Chahal to Ojha, $$SIX$$ ,bit of air this time, and Naman clears his front leg to permit a free swing of his bat, and launches it over long-off"}, {"ball": 13.6, "isHighlight": false, "text": "\"The good thing for Indian cricket is \"All the regular members of Indian team are coming to form ahead of England series\"\" Very different conditons, and a very very different format, Ram..."}, {"ball": 13.6, "isHighlight": false, "text": "Starc returns now"}, {"ball": 14.1, "isHighlight": false, "text": "Starc to Warner,1 run,full, angled down leg, and Warner clips it off his toes to deep midwicket"}, {"ball": 14.1, "isHighlight": false, "text": "Left-arm around to Ojha"}, {"ball": 14.2, "isHighlight": false, "text": "Starc to Ojha,1 run,full, angled in towards off stump, driven to deep cover"}, {"ball": 14.3, "isHighlight": false, "text": "Starc to Warner,1 run,full toss, and Warner slogs that to deep midwicket to get to his half-century"}, {"ball": 14.4, "isHighlight": false, "text": "Starc to Ojha,no run,slower ball, and it's a high, dipping full toss. Ojha tries to dab it down to third man, misses"}, {"ball": 14.5, "isHighlight": false, "text": "Starc to Ojha,1 run,full this time, and angled into the stumps. Ojha comes forward but stays next to the line to allow the checked drive to the off-side sweeper"}, {"ball": 14.6, "isHighlight": false, "text": "Starc to Warner,1 run,slower ball, and Warner pushes his hands at it but checks himself at the last moment to chip it just wide of the bowler, to his right, for the single to long-off"}, {"ball": 14.6, "isHighlight": false, "text": "Abu Nechim returns. Right-arm around"}, {"ball": 15.1, "isHighlight": false, "text": "Ahmed to Warner, $$SIX$$ ,This is angled in, but angled in right into Warner's slot. He clears his front leg and swishes through the line to launch it over long off"}, {"ball": 15.2, "isHighlight": false, "text": "Ahmed to Warner,1 run,dropped! It was hit hard, and straight back towards Nechim, who put both his hands up in front of his chest, and took a painful glancing blow on one of his fingers for his effort. Bowling hand too. There's a bit of a delay with the injury, and they take the strategic time-out. We hope it isn't serious."}, {"ball": 15.2, "isHighlight": false, "text": "Yuvraj takes over from Nechim to complete the over"}, {"ball": 15.3, "isHighlight": false, "text": "Yuvraj Singh to Ojha,1 run,drags this short, but there's no room to do anything about it, and Naman chops it down to long-on"}, {"ball": 15.4, "isHighlight": false, "text": "Yuvraj Singh to Warner,1 run,short again, and Warner plays a checked pull to long-on"}, {"ball": 15.5, "isHighlight": false, "text": "Yuvraj Singh to Ojha,1 wide,yikes. That's a rubbish ball from Yuvraj. Drags it down short, and way down the leg side."}, {"ball": 15.5, "isHighlight": false, "text": "Yuvraj Singh to Ojha,no run,slower this time, comes out of the hand better, Naman tries to late cut but hits it to Gayle at short third man"}, {"ball": 15.6, "isHighlight": false, "text": "Yuvraj Singh to Ojha,no run,tries to cut again, hits it to point this time"}, {"ball": 15.6, "isHighlight": false, "text": "Aaron now"}, {"ball": 16.1, "isHighlight": false, "text": "Aaron to Warner, $$OUT$$ ,uh oh. That's a full toss, and it's close to waist-high. Warner gives himself room, doesn't get hold of it, and it goes loopily and straight to cover. They check for height, and it's okay. Could RCB claw their way back here?"}, {"ball": 16.1, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$c$$ $$Yuvraj$$ $$Singh$$ $$b$$ $$Aaron$$ $$59$$ $$(75m$$ $$46b$$ $$3x4$$ $$4x6)$$ $$SR:$$ $$128.26$$"}, {"ball": 16.1, "isHighlight": false, "text": "Aaron to Aaron Finch"}, {"ball": 16.2, "isHighlight": false, "text": "Aaron to Finch,1 run,low full-toss, and Finch pushes it back down the ground"}, {"ball": 16.3, "isHighlight": false, "text": "Aaron to Ojha,1 run,full, almost in the blockhole, and Ojha gives himself room to drive it down to long-off"}, {"ball": 16.4, "isHighlight": false, "text": "Aaron to Finch,1 run,back of a length ball, angled in, and Finch is hit on the pads as he tries to work it into the leg side, on the hop"}, {"ball": 16.5, "isHighlight": false, "text": "Aaron to Ojha,1 bye,slower ball, and it goes between the batsman and leg stump as he heaves and misses. Rolls down to Parthiv, and the batsmen set off for a bye. Parthiv misses with his underarm throw."}, {"ball": 16.6, "isHighlight": false, "text": "Aaron to Finch, $$FOUR$$ ,length ball, Finch makes room and slaps it over extra cover"}, {"ball": 16.6, "isHighlight": false, "text": "Yuvraj to continue. Important over, this."}, {"ball": 17.1, "isHighlight": false, "text": "Yuvraj Singh to Ojha,1 run,length ball, and Ojha stays leg-side of the ball and hits it over Yuvraj's head. Long-off runs around to cut it off"}, {"ball": 17.2, "isHighlight": false, "text": "Yuvraj Singh to Finch,no run,flat, fired in, and Aaron misses as he tries to pull. Ball just missed leg stump."}, {"ball": 17.3, "isHighlight": false, "text": "Yuvraj Singh to Finch,1 run,flat again, on the stumps, and Finch makes room this time to slap it down to the sweeper"}, {"ball": 17.4, "isHighlight": false, "text": "Yuvraj Singh to Ojha,2 runs,this is short and wide, and Naman cuts it past point, but the sweeper runs to his left to cut it off"}, {"ball": 17.5, "isHighlight": false, "text": "Yuvraj Singh to Ojha,1 run,fuller this time, and it's slogged along the ground to deep midwicket"}, {"ball": 17.6, "isHighlight": false, "text": "Yuvraj Singh to Finch,2 runs,gives himself a lot of room, and Yuvraj follows him with a flat, shortish ball. Finch tennis-forehands it to long-on, who sends in a good flat throw that hits direct at the batsman's end but Finch, according to umpire Chaudhary, had completed his second comfortably"}, {"ball": 18.1, "isHighlight": false, "text": "Aaron to Ojha,1 wide,Aaron isn't happy. Kohli isn't happy. It's a wide yorker, and it sends a cloud of white as it hits the tramline outside off, but it's given wide."}, {"ball": 18.1, "isHighlight": false, "text": "Aaron to Ojha,1 run,low full toss, angled into the stumps, and the batsman doesn't get hold of it. Goes down to long-off, on the bounce"}, {"ball": 18.2, "isHighlight": false, "text": "Aaron to Finch,1 run,length ball outside off, and Finch doesn't time this swat across the line. Goes rolling down to deep midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "17 from 10 now. Third man and fine leg are up"}, {"ball": 18.3, "isHighlight": false, "text": "Aaron to Ojha, $$SIX$$ ,He's given Ojha room outside off, and he's used it brilliantly, leaning back and slicing under the ball to send it soaring over the deep point boundary"}, {"ball": 18.4, "isHighlight": false, "text": "Aaron to Ojha, $$OUT$$ ,He's gone now! This was in the slot, full and outside off, but Naman has picked out the cover fielder"}, {"ball": 18.4, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$c$$ $$Yuvraj$$ $$Singh$$ $$b$$ $$Aaron$$ $$24$$ $$(33m$$ $$20b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$120.00$$"}, {"ball": 18.4, "isHighlight": false, "text": "Sammy now"}, {"ball": 18.5, "isHighlight": false, "text": "Aaron to Sammy, $$SIX$$ ,full, just outside off, and Sammy has launched that over the bowler for six. What a shot to play first ball!"}, {"ball": 18.6, "isHighlight": false, "text": "Aaron to Sammy,1 run,slower ball, outside off, and Sammy clubs that down to long-off"}, {"ball": 18.6, "isHighlight": false, "text": "What a difference that hit from Sammy made. It was 11 needed off 8, before that shot. Now, as Starc prepares to bowl the last over, Sunrisers have four runs to get"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Sammy,1 run,angled across Sammy and full, hit hard but all along the ground to wide long-off"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Finch,no run,ball! slower ball, yorker just outside off, and Aaron is beaten as he tries to drive it down the ground"}, {"ball": 19.2, "isHighlight": false, "text": "third man and fine leg up"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to Finch,1 run,full ball, just outside off. This is good bowling, and Finch drives it to long-off"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Sammy,2 runs,that's it! slower ball again, and Sammy gets it up and over cover, down towards the sweeper on the off side boundary. It goes bouncing down towards that fielder, giving the batsmen enough time to run the two runs they needed to win."}, {"ball": 19.4, "isHighlight": false, "text": "It's time for the presentation.  $$Darren$$ $$Sammy$$  \"We needed a win, last game in front of these beautiful fans. Those last two overs from Bhuvi and Dale kept us in the game. Credit to our openers. We'll go to Ranchi, try for a clinical performance, hope other results go our way.\""}, {"ball": 19.4, "isHighlight": false, "text": "$$David$$ $$Warner$$  is the Man of the Match. \"Different batting at the top. Wanted to bat till the end. Unfortunate run out for Shikhar, we'll have to work on that. Credit to the curators. They've produced fantastic wickets for us. We just wanted to back our instinct. Credit to Shikhar. Nice to see him dig in and get a good total after the first six.\""}, {"ball": 19.4, "isHighlight": false, "text": "That's it from us. Hope you enjoyed the game, and thanks for following our updates and sending in your comments."}, {"ball": 19.4, "isHighlight": false, "text": "While we wait for the presentation, you can start following tonight's other game, between Kolkata Knight Riders and Chennai Super Kings,  $$here$$ . If you can't bear to leave this page, we can tell you KKR have won the toss and chosen to field. Pat Cummins, excitingly enough, makes his IPL debut."}, {"ball": 19.4, "isHighlight": false, "text": "Rohan: \"One move by RR has opened up the entire tournament! With this SRH win, 5 teams have a chance of qualifying for the playoffs; don't think the latter half of any previous edition has been as interesting as this one!\""}, {"ball": 19.4, "isHighlight": false, "text": "$$Naman$$ $$Ojha$$  \"Davy and Shikhar set the tone for us, and me and Finchy played well to get us through. Hopefully, this is the right batting order for us, because it's clicked.\""}, {"ball": 19.4, "isHighlight": false, "text": "Chennai Super Kings, as a result of Sunrisers' victory today, have confirmed a Playoff slot."}, {"ball": 19.4, "isHighlight": false, "text": "$$Virat$$ $$Kohli$$  says Royal Challengers did well to pull it back after the start Sunrisers got. He says the pitch became slightly better to bat on under lights, which they hadn't expected before the toss."}, {"ball": 19.4, "isHighlight": false, "text": "\"I was looking to step up for the team,\" he says, about his own innings. \"No contribution is good enough if you don't win the game.\""}, {"ball": 19.4, "isHighlight": false, "text": "Handshakes all around. This is an important win for Sunrisers. Royal Challengers, now, will have to depend on other results if they are to go through to the playoffs. They did well to score 112 from their last 10 overs, but the fact that they only scored 48 in the first 10 came back to hurt them."}], "name": "Sunrisers Hyderabad v Royal Challengers Bangalore", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734021.html?innings=2;view=commentary", "match_num": 46}