{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00pm$$  Here come Brendon McCullum and Dwayne Smith, perhaps the most effective combination of this competition."}, {"ball": 0, "isHighlight": false, "text": "Dhinesh: \"Pat Cummins may bowl at 90mph. But can he match the experience of Morkel? This decision still baffles me, even though I am a CSK fan. \""}, {"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  Ashu: \"As a cricket lover, i would love CSK to win, just so that the fight for 4th place gets even more interesting.\""}, {"ball": 0, "isHighlight": false, "text": "kunal: \"@Naman : Go with Narine. He is sure shot performer bound to take wickets and that too with a good economy. I was hoping the same with Sehwag against DD yesterday but it didn't happen. With McCullum, you can never be sure :-)\""}, {"ball": 0, "isHighlight": false, "text": "Ayaan: \"Baz is going to miss his next game...take him if you have enough changes left !!! but don't risk he can smash another 150 :) !!\""}, {"ball": 0, "isHighlight": false, "text": "Jayakanth: \"somehow the the top half of the table looks very aristocratic!\""}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm$$  nitin: \"If Gambhir speaks too fast, what do you think of Azhar's rate of speech?\" Gambhir is quicker, but better enunciation. Was tough to know what Azhar was saying after his usual 'Boys played well' intro."}, {"ball": 0, "isHighlight": false, "text": "Naman: \"Seeing players dominate their former franchises, I'm in dilemma whether to take McCullum!!! ESPNCricinfo please HELP!! Narine (already in my side) or McCullum???\" Please help Naman."}, {"ball": 0, "isHighlight": false, "text": "Nishit: \"If there is a tie between two teams, the winner will be decided through a Super over. Then why there is a \"Tied\" column in the points table? It will never be used and is a waste of space. :P\" In the rare case that the match is washed out with the scores level on D/L. Or if a match is tied, but rain prevents a Super Over."}, {"ball": 0, "isHighlight": false, "text": "Anand: \"Both the Captains have gone with different bowling combinations. CSK with 2 Spinners, 3 Seamers and KKR with 2 Seamers and 3 Spinners. It will be interesting to see who has misread the conditions at the end of 40 overs.\""}, {"ball": 0, "isHighlight": false, "text": "Think you know everything about cricket. Prove it on  $$CricIQ$$ ?"}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  Mohan: \"Still no Baba Aparjith.. This is too bad when CSK needs a change at later stage..\" CSK have never been a team that experiment too much."}, {"ball": 0, "isHighlight": false, "text": "Raghu Ifmr: \"Though not a big fan of him, you have got to give it to Gambhir.. Started his season in the worst possible way, became a public joke with 3 ducks in a row and losing many matches.. But now has came back hard from all that criticism and leading from the front to take his team into the playoffs.. True fighter..\""}, {"ball": 0, "isHighlight": false, "text": "CSK fan: \"So much grass and just 2 pacers for KKR? Morkel or Kallis should have played i/o Shakib. I am not complaining.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  Hello all, Sunrisers have just spiced up the race for the fourth place with a win over RCB. How will KKR fare now?"}, {"ball": 0, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir$$  says the obvious things: \"We're not looking at the table too much, we just want to focus on playing good cricket.\" This is their first game at Eden Gardens this season. Does anybody speak quicker than Gambhir? Rattling away at an untranscribable pace."}, {"ball": 0, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$  says the large amounts of grass should hold the track together."}, {"ball": 0, "isHighlight": false, "text": "$$Kolkata$$ $$win$$ $$toss$$ $$and$$ $$bowl$$ . Gambhir says KKR have been chasing really well in recent matches, so he doesn't want to change things. He is also unsure about what would be a good score on the surface, saying that he hasn't seen this much grass on an Eden Gardens pitch in three seasons.  $$Pat$$ $$Cummins$$ $$comes$$ $$in$$ $$for$$ $$Morne$$ $$Morkel.$$"}, {"ball": 0, "isHighlight": false, "text": "Also, Royal Challengers' defeat has confirmed Super Kings qualification to the playoffs. Two changes: David Hussey and Samuel Badree out, Ben Hilfenhaus and Faf du Plessis come in."}, {"ball": 0, "isHighlight": false, "text": "Dhoni joked earlier with Danny Morrison about how he had given D hussey the final over of the previous game since as a commentator he would talk a lot about what pace the ball should be bowled, where it should be bowled and so on."}, {"ball": 0, "isHighlight": false, "text": "Syamantak Basu : \"Good to see the grass back on Eden Gardens pitch like they are during the domestic season. :-) \""}, {"ball": 0, "isHighlight": false, "text": "Dhinesh: \"So much of grass on and you sit Morkel out? What kind of strategy is this? \" Pat Cummins is no slouch either - he too can bowl over 90mph."}, {"ball": 0, "isHighlight": false, "text": "santhoshprn: \"Not sure what is with Dhoni and the commentators!! Every time Dhoni is seen pulling their legs!! EVERY TIME!! :-)\""}, {"ball": 0.1, "isHighlight": false, "text": "Shakib Al Hasan to Smith, $$FOUR$$ ,what a way to start the game, Shakib flights the ball first up, on a length, Smith plants his front foot forward and thumps the ball to long-off for a one-bounce four"}, {"ball": 0.2, "isHighlight": false, "text": "Shakib Al Hasan to Smith,no run,pummels it once more, on the bounce to mid-on"}, {"ball": 0.3, "isHighlight": false, "text": "Shakib Al Hasan to Smith,no run,fuller and on the pads, goes for the sweep, off the pads behind square leg"}, {"ball": 0.4, "isHighlight": false, "text": "Shakib Al Hasan to Smith,1 run,length ball heading for off stump, Smith gets deep in the crease and tucks the ball in front of square leg"}, {"ball": 0.5, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,flighted and full, slower in the air, outside off and McCullum reaches out and drives to cover"}, {"ball": 0.6, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,arm ball towards middle stump, watchful defence to end the over, good comeback from Shakib after that opening ball four"}, {"ball": 0.6, "isHighlight": false, "text": "Here's Pat Cummins"}, {"ball": 1.1, "isHighlight": false, "text": "Cummins to Smith,no run,starts with a 138kph delivery outside off, swerves away after pitching outside off, swings and misses"}, {"ball": 1.2, "isHighlight": false, "text": "Cummins to Smith, $$OUT$$ ,instant impact from Cummins! a beauty from him to knock over off stump, a rare failure for Smith, he as caught on the crease, played down the wrong line as the ball swings, he was looking to play it on middle stump line, ball takes out off stump"}, {"ball": 1.2, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$b$$ $$Cummins$$ $$5$$ $$(5m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$83.33$$"}, {"ball": 1.3, "isHighlight": false, "text": "Cummins to Raina,no run,Cummins fires it in full and outside off, bends as he gets an inside edge to the leg side"}, {"ball": 1.4, "isHighlight": false, "text": "Cummins to Raina,no run,full ball that is defended off the front foot"}, {"ball": 1.5, "isHighlight": false, "text": "Cummins to Raina,no run,can't time another pitched-up ball, which rolls away towards midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Cummins to Raina,no run,full ball and that is defended to the off side, a wicket maiden from Cummins, what a start from him"}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to McCullum,1 wide,Umesh starts with a wide down the leg side"}, {"ball": 2.1, "isHighlight": false, "text": "Adway Lele: \"Really, rare failure for Smith. Only other one was when he failed to get into retaining list by MI.\""}, {"ball": 2.1, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,on the pads and that is glanced towards fine leg for a single"}, {"ball": 2.2, "isHighlight": false, "text": "UT Yadav to Raina,no run,full and wide, no footwork from Raina as he reaches out for that one, slices it towards backward point"}, {"ball": 2.3, "isHighlight": false, "text": "UT Yadav to Raina,no run,pats this past the bowler, wants a single but McCullum doesn't"}, {"ball": 2.4, "isHighlight": false, "text": "UT Yadav to Raina,no run,length ball outside off, punched towards extra cover"}, {"ball": 2.5, "isHighlight": false, "text": "UT Yadav to Raina,no run,short of length ball on off stump, defended back down the track"}, {"ball": 2.6, "isHighlight": false, "text": "UT Yadav to Raina, $$FOUR$$ ,138kph, backs away from the stumps to make room, then makes it look so easy as he launches the ball over cover for four, as he has so many times in the IPL, a favourite hitting area on the off side for Raina"}, {"ball": 2.6, "isHighlight": false, "text": "jose: \"Pat came the reply from Cummins to all doubters; with a wicket maiden, that too the first over of his first match in IPL 7. What more you can ask from a guy?\""}, {"ball": 3.1, "isHighlight": false, "text": "Cummins to McCullum, $$SIX$$ ,full and outside off, 140.5kph, McCullum flashes at it, off the face of the bat and that flies over third man for six, a drawback of pace"}, {"ball": 3.2, "isHighlight": false, "text": "Cummins to McCullum,no run,driven towards mid-off by McCullum"}, {"ball": 3.3, "isHighlight": false, "text": "Cummins to McCullum, $$SIX$$ ,six more! McCullum loves to thrash the ball over cover, he wasn't entirely in control when he hit the third man six, this time he is totally in control, superb hit"}, {"ball": 3.4, "isHighlight": false, "text": "Cummins to McCullum,no run,full ball outside off, McCullum squeezes the ball towards cover, 150kph"}, {"ball": 3.5, "isHighlight": false, "text": "Cummins to McCullum, $$FOUR$$ ,full ball just outside off, 149.6kph says the speed gun, McCullum doesn't care, that is hammered through cover, McCullum gets forward and clubs that through the gap"}, {"ball": 3.6, "isHighlight": false, "text": "Cummins to McCullum,no run,length ball heading for off stump, defended cautiously by McCullum"}, {"ball": 3.6, "isHighlight": false, "text": "Sorry, some troubles over the past over with our commentary. Should be back on track now."}, {"ball": 4.1, "isHighlight": false, "text": "Narine to Raina, $$SIX$$ ,Narine, KKR's trump card, is welcomed to the crease with a six over long-on by Raina, top shot from Raina"}, {"ball": 4.2, "isHighlight": false, "text": "Narine to Raina,no run,short and wide outside off, slapped towards point this time"}, {"ball": 4.2, "isHighlight": false, "text": "Vijay: \"Pat is getting to learn about IPL pretty fast. One over you are up and next over you are down.\""}, {"ball": 4.3, "isHighlight": false, "text": "Narine to Raina,no run,spinning towards off after pitching around leg stump, careful defence"}, {"ball": 4.4, "isHighlight": false, "text": "Narine to Raina,no run,looks to block that ball that pitched outside leg, off the pads"}, {"ball": 4.5, "isHighlight": false, "text": "Narine to Raina,no run,defended off the front foot towards cover"}, {"ball": 4.6, "isHighlight": false, "text": "Narine to Raina,no run,superb over from Narine after the first-ball six, rounds it off with five dot balls, the final delivery is dabbed towards point"}, {"ball": 5.1, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,Shakib flights it once more, outside off, a thick outside edge sends the ball towards short third"}, {"ball": 5.2, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,McCullum gets back in the crease and tucks the ball towards deep square leg"}, {"ball": 5.3, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,comes down the track and defends to the off side"}, {"ball": 5.4, "isHighlight": false, "text": "Shakib Al Hasan to Raina,no run,that stays low outside off, pushed towards cover off the back foot"}, {"ball": 5.5, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,guides this towards short third and a diving stop keeps the batsmen to a single"}, {"ball": 5.6, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,no run,darts in towards off stump, blocked towards cover"}, {"ball": 5.6, "isHighlight": false, "text": "shams: \"after 5 overs, only 2 runs scored by running. Stunning!!\""}, {"ball": 5.6, "isHighlight": false, "text": "Suresh: \"Is running prohibited in T20? The number of DOTS so far is incredible! \""}, {"ball": 6.1, "isHighlight": false, "text": "UT Yadav to Raina,1 run,guides the ball towards deep midwicket for a single"}, {"ball": 6.1, "isHighlight": false, "text": "Ignatius A: \"At least this time i can take solace in the technical glitches for my comments not getting published. :P\""}, {"ball": 6.1, "isHighlight": false, "text": "Afzal: \"1 six, 1 four, 1 single and 15 dot balls .. way to go Raina..\""}, {"ball": 6.2, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,short of length ball heading for the pads,  tucked in front of square leg"}, {"ball": 6.3, "isHighlight": false, "text": "UT Yadav to Raina,2 runs,thick inside edge, the ball fizzes away towards fine leg"}, {"ball": 6.4, "isHighlight": false, "text": "UT Yadav to Raina,1 run,slower one, short of length and well outside off, steered behind square leg for a single"}, {"ball": 6.5, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,low full toss outside off, thumped towards sweeper cover"}, {"ball": 6.6, "isHighlight": false, "text": "UT Yadav to Raina,no run,short of length ball on off stump, Raina looks to carve the ball towards point, he misses"}, {"ball": 6.6, "isHighlight": false, "text": "Siddartha Khand: \"Talk about variety. KKR have a slow left arm bowler, a leg spinner, an off spinner, a bowler who bowls above 90 miles, one who bowls from 85-90 (Umesh) and one who takes pace off the ball (Ten Do). Anybody missing a chinaman?\""}, {"ball": 6.6, "isHighlight": false, "text": "Sabarinath: \"Not a single bouncer to Raina, with two bowlers bowling at 140+ on a slighlty greenish track with the new ball?\""}, {"ball": 7.1, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,length ball on off stump, McCullum gets on the front foot and plays with soft hands in front of point"}, {"ball": 7.2, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,full ball on middle stump, pushed towards long-on for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Jawa: \"Even with 15 dot balls i want Raina to face one or two more overs of Narine, since he is one of the very few who can pick him up\""}, {"ball": 7.3, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,length ball spinning away just a touch, chopped towards deep point"}, {"ball": 7.4, "isHighlight": false, "text": "Shakib Al Hasan to Raina, $$FOUR$$ , $$dropped$$ , Raina goes for the big hit, struck high on the bat and the ball swirls high, and doesn't carry long enough, Yusuf Pathan at long-off should have taken that, don't think he moved quickly enough, gets his hands on the ball as it is dropping, can't hang on, Raina survives"}, {"ball": 7.5, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,pushed to long-off for a single"}, {"ball": 7.6, "isHighlight": false, "text": "Shakib Al Hasan to McCullum,1 run,McCullum sweeps, gets the top edge and the ball lands safely beyond midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "jeffjero: \"they even have a chinaman bowler. KULDEEP YADAV\""}, {"ball": 8.1, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,short of length ball coming in towards off stump, 141kph, pushed towards cover for a single"}, {"ball": 8.2, "isHighlight": false, "text": "UT Yadav to Raina,1 run,length ball on off stump, pushed towards long-off"}, {"ball": 8.2, "isHighlight": false, "text": "Rezwan Navid: \"That miss may cost the game! And 4 run bonus! KKR do have the greatest bowling attack! but not the fielding tho!\""}, {"ball": 8.3, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,McCullum jumps down the track, wants to club the ball down the ground, bit of a bottom edge as the ball rolls towards long-on"}, {"ball": 8.4, "isHighlight": false, "text": "UT Yadav to Raina,1 run,length ball on off stump, pushed towards long-off for a single"}, {"ball": 8.5, "isHighlight": false, "text": "UT Yadav to McCullum,1 run,on off stump, back of length ball, McCullum backs away to make room, guides the ball towards third man and the 50 stand is up"}, {"ball": 8.6, "isHighlight": false, "text": "UT Yadav to Raina,no run,length ball on off stump, Raina looks to slap that down the ground, bottom edges it and the ball rolls back towards Umesh"}, {"ball": 8.6, "isHighlight": false, "text": "Aditya: \"Disappointed that Kuldeep Yadav hasn't got a game yet, loved watching him bowl int he u19 world cup.\""}, {"ball": 8.6, "isHighlight": false, "text": "How well do you know your cricket? Try out  $$CricIQ$$ ."}, {"ball": 8.6, "isHighlight": false, "text": "kartikeya junej: \"The score KKR can restrict CSK to will mainly depend on how well Gautam Gambhir can use his deadly weapon, Sunil Narine because CSK have set an excellent platform for a great score.\"Someone: \"I dont want this comment to be posted :p\" Why?"}, {"ball": 8.6, "isHighlight": false, "text": "End of  $$time-out$$ ."}, {"ball": 8.6, "isHighlight": false, "text": "ankit: \"I want this comment to be posted :D\" Right, enough of these."}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to McCullum,1 run,Chawla drops it a touch short, McCullum goes back in the crease and slaps the ball towards sweeper cover"}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Raina,no run,flighted length ball, thick outside edge sends the ball towards point"}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Raina,no run,another edge, leading edge as Raina looks to whip the ball to the leg side, the ball goes towards cover"}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to Raina,1 run,length ball on leg stump, steers the ball towards backward point for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to McCullum,1 run,googly from Chawla, not sure McCullum picked that, he had backed away looking to make room, the ball came in towards him but he still went for the cut, can't beat cover"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Raina,1 run,gets forward and guides the ball towards sweeper cover for a single, Chennai as usual setting a strong platform"}, {"ball": 10.1, "isHighlight": false, "text": "Narine to Raina,1 run,Narine is here as KKR look to break the stand, he starts with a slightly short ball, pushed towards mid-off for a single"}, {"ball": 10.2, "isHighlight": false, "text": "Narine to McCullum,no run,McCullum looks to sweep but misses, on the pad"}, {"ball": 10.3, "isHighlight": false, "text": "Narine to McCullum, $$OUT$$ ,terrific take from Suryakumar Yadav, the pressure tells, Narine gets the breakthrough, edges the ball as eh goes for a big hit, edges it and the ball goes a long way up, over and beyond the bowler, Shakib races in  but spots Suryakumar also sprinting in, Shakib stays away and Surya pouches it after having covered a lot ground, Shakib was coming in from long-off, Surya from long-on"}, {"ball": 10.3, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$SA$$ $$Yadav$$ $$b$$ $$Narine$$ $$28$$ $$(45m$$ $$24b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$116.66$$"}, {"ball": 10.4, "isHighlight": false, "text": "Narine to Raina,1 run,down the leg side, swiped towards backward square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Slip and silly mid-off in place. Gambhir wears the helmet as he goes in to silly mid-off. No shirking away though he is the captain"}, {"ball": 10.5, "isHighlight": false, "text": "Narine to du Plessis,1 run,spins away just a touch outside off, guides it towards cover for a single"}, {"ball": 10.6, "isHighlight": false, "text": "Narine to Raina,no run,outside off, Raina looks to deftly guide the ball, he is beaten"}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to du Plessis,no run,spinning away outside off, driven by Faf, straight to Gambhir at silly point, Gambhir is struck on the chest after a firm drive into the ground"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to du Plessis,1 run,skips down the track and sends the ball towards mid-on"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Raina, $$SIX$$ ,Raina is amazing in the IPL, can accelerate when he wants, this is a clean hit over cow corner for six"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Raina,1 run,stays back in the crease and guides the ball behind point"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to du Plessis,no run,goes straight on towards off, slapped towards short cover"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to du Plessis,1 run,pitched up, a legspinner is driven towards long-off for a single"}, {"ball": 11.6, "isHighlight": false, "text": "SDHegde: \"Silly mid-off in place, in T20! wow, goes to show the attacking and wicket taking ability of the bowler!\""}, {"ball": 11.6, "isHighlight": false, "text": "Cummins is back."}, {"ball": 12.1, "isHighlight": false, "text": "Cummins to du Plessis,2 runs,short of length ball outside off, chopped towards deep point, Faf puhses for the second and gets it"}, {"ball": 12.2, "isHighlight": false, "text": "Cummins to du Plessis,1 run,short of length and outside off, 139.5kph, hit towards sweeper cover"}, {"ball": 12.3, "isHighlight": false, "text": "Cummins to Raina,no run,superb slower one from Cummins, 113kph, the offcutter, Raina wanted to steer that behind point but can't get bat on it"}, {"ball": 12.4, "isHighlight": false, "text": "Cummins to Raina,1 run,length ball is thumped towards deep point"}, {"ball": 12.5, "isHighlight": false, "text": "Cummins to du Plessis, $$FOUR$$ ,another slower one, nicely done by Faf, waits for the ball to arrive and softly helps it along to fine leg, it was a flat-batted shot but he wasn't looking to power the ball"}, {"ball": 12.6, "isHighlight": false, "text": "Cummins to du Plessis,1 run,short and wide from Cummins, 139kph, slapped towards sweeper cover for a single to end the over"}, {"ball": 12.6, "isHighlight": false, "text": "Time for another  $$timeout$$ ."}, {"ball": 12.6, "isHighlight": false, "text": "Andrew: \"Not quite sure what Raina has been doing this innings. All very well to try and hold one end up early on but with the power hitters to come and just seven overs to go, it's boom or bust time.\""}, {"ball": 13.1, "isHighlight": false, "text": "Chawla to du Plessis,1 run,drops it a touch short, Faf goes back in the crease and carves the ball towards sweeper cover"}, {"ball": 13.1, "isHighlight": false, "text": "sri: \"Starting a campaign to include Baba Aprajith in the team. We want the local boy.\""}, {"ball": 13.2, "isHighlight": false, "text": "Chawla to Raina,1 run,Raina skips down the track, a full ball from Chawla on the pads, Raina is cramped up, tucked to the leg side for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Chawla to du Plessis,1 run,third single in a row, pitched up and that is pushed towards long-off"}, {"ball": 13.4, "isHighlight": false, "text": "Chawla to Raina, $$SIX$$ ,length ball, Raina knows it's time to go big, he steps down and launches that over long-on for another six, clean hit that"}, {"ball": 13.5, "isHighlight": false, "text": "Chawla to Raina, $$SIX$$ ,six more! all those dot balls from him have been made up for, he lashes this wide of long-on, very wide, no one there, and it doesn't matter as the ball soars over the rope"}, {"ball": 13.6, "isHighlight": false, "text": "Chawla to Raina, $$FOUR$$ ,Fifty for Raina, most valuable player over six seasons of the IPL? he gets to yet another half-century by guiding a wide ball off the back foot to the third man boundary, costly over this"}, {"ball": 13.6, "isHighlight": false, "text": "Narine back for his third, earlier than usual"}, {"ball": 14.1, "isHighlight": false, "text": "Narine to du Plessis,1 run,the hundred comes up as Faf works it for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Narine to Raina,2 runs,drops it short on seeing Raina come down, dabbed towards point for a couple"}, {"ball": 14.3, "isHighlight": false, "text": "Narine to Raina,1 run,that stayed low and spun away outside off, Raina slashes that towards sweeper cover"}, {"ball": 14.4, "isHighlight": false, "text": "Narine to du Plessis,1 run,spinning away outside off, another single for Faf, who is happy to let Raina take the bulk of the strike"}, {"ball": 14.5, "isHighlight": false, "text": "Narine to Raina,1 run,Raina looks to thrash a length ball through the off, edges it towards midwicket instead"}, {"ball": 14.5, "isHighlight": false, "text": "Rakesh: \"Its better to have Baba Aparajith in squad instead of Mahnas,because baba can be use as productive spinner.\""}, {"ball": 14.6, "isHighlight": false, "text": "Narine to du Plessis,1 run,goes deep in the crease and slaps the ball towards deep point for a single"}, {"ball": 14.6, "isHighlight": false, "text": "The lowest Raina has scored in an IPL season is 421 runs. He's just gone past 350 in 2014."}, {"ball": 14.6, "isHighlight": false, "text": "Mehul: \"Never underestimate Kohli in blue jersey and Raina in yellow jersey.\""}, {"ball": 14.6, "isHighlight": false, "text": "Raul: \"Raina from a Strike rate of 80's to 120's in a matter of 3 balls. That T20 cricket for you.\""}, {"ball": 15.1, "isHighlight": false, "text": "Shakib Al Hasan to du Plessis,no run,length from Shakib, pushed towards cover, dot ball"}, {"ball": 15.2, "isHighlight": false, "text": "Shakib Al Hasan to du Plessis, $$FOUR$$ ,full and wide, seemed to have mishit that one, but he has got enough on it as he lofts it to the long-off boundary, that one spun away more than Faf expected, hit low on the bat"}, {"ball": 15.3, "isHighlight": false, "text": "Shakib Al Hasan to du Plessis,1 run,spins in sharply this time, tucked from the back foot towards midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 run,full and outside off, squeezed out towards sweeper cover"}, {"ball": 15.5, "isHighlight": false, "text": "Shakib Al Hasan to du Plessis,1 run,flighted by Shakib, on a length and outside off, dabbed towards point"}, {"ball": 15.5, "isHighlight": false, "text": "Aamer: \"If I was a franchise team owner , the first player i would want in my team would be S.Raina\""}, {"ball": 15.6, "isHighlight": false, "text": "Shakib Al Hasan to Raina,1 wide,rare poor ball from Shakib, way outside off"}, {"ball": 15.6, "isHighlight": false, "text": "Shakib Al Hasan to Raina, $$SIX$$ ,six more for Raina, he was a nervous chap for a while after launching that ball towards the long-off boundary, Manish Pandey was wait9ing for the ball to land, it is behind Manish and beyond the rope, Manish gets a hand on it as he leaps to his left but can't prevent the six"}, {"ball": 16.1, "isHighlight": false, "text": "Cummins to du Plessis,1 run,short of length from Cummins, heading towards off, worked towards deep backward square leg"}, {"ball": 16.1, "isHighlight": false, "text": "Rakesh: \"Raina has scored more number of runs in Twenty20 than ODI's, that too in less number of games.. #Twenty20genius\""}, {"ball": 16.2, "isHighlight": false, "text": "Cummins to Raina,1 run,well outside off, carved towards deep point"}, {"ball": 16.3, "isHighlight": false, "text": "Cummins to du Plessis, $$OUT$$ ,length ball outside off, superb bit of fielding from Chawla, not often that I'll type that line, faf whips the ball towards midwicket, straight to Chawla, who takes aim and throws down the stumps, should be Dhoni time now"}, {"ball": 16.3, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$run$$ $$out$$ $$23$$ $$(28m$$ $$20b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$115.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Cummins to Raina,no run,short and slow outside off, 110.8kph, Raina chases after it and doesn't connect"}, {"ball": 16.5, "isHighlight": false, "text": "Cummins to Raina,1 run,short and outside off, slammed towards midwicket for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Crowd going wild with Dhoni in the middle."}, {"ball": 16.6, "isHighlight": false, "text": "Cummins to Dhoni,1 run,shortish ball outside off, guides it to backward point to get off the mark, just four off the over, pretty good debut for Cummins"}, {"ball": 16.6, "isHighlight": false, "text": "Chibi: \"Since T20 Leagues bring out the best in players like Raina, Rohit , Uthappa etc.. BCCI should consider sending them to other leagues like BBL and England T20.. That might get them more exposure to the conditions and might actually help in future tours.\""}, {"ball": 16.6, "isHighlight": false, "text": "Keyur: \"I would love to see teams from the IPL talking directly with players and their agents rather than auctions. Maybe a transfer window and buy back clauses would make the sales a lot more interesting. Players could give transfer requests if they wish to not play for a franchise anymore. \""}, {"ball": 16.6, "isHighlight": false, "text": "Chawla gets another over"}, {"ball": 17.1, "isHighlight": false, "text": "Chawla to Dhoni, $$FOUR$$ ,starts with a short ball, easy for Dhoni, who pummels this towards deep midwicket for four, not a great start from Chawla"}, {"ball": 17.2, "isHighlight": false, "text": "Chawla to Dhoni,1 run,full and down the leg side, a lap sweep towards short fine leg"}, {"ball": 17.3, "isHighlight": false, "text": "Chawla to Raina, $$OUT$$ ,Raina is gone, he was looking to clear wide long-on, this was quicker from Chawla though, Raina sends the ball higher than he wanted though, and ends up given a catch to ten Doeschate in the deep, end of a good innings from Raina"}, {"ball": 17.3, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$ten$$ $$Doeschate$$ $$b$$ $$Chawla$$ $$65$$ $$(73m$$ $$52b$$ $$3x4$$ $$5x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Harin Bansal: \"Atleast the players who are not in national side and when there are no domestic matches, in tat case BCCI should allow Indian players. This way players will get to know foreign conditions, help in enhancing skills plus the monetary increase as well. It will help the players overall.\""}, {"ball": 17.4, "isHighlight": false, "text": "Chawla to Dhoni,2 runs,spinning in towards the pads from outside leg, Dhoni plays it woth soft hands in front of square leg, hares back for the second"}, {"ball": 17.5, "isHighlight": false, "text": "Chawla to Dhoni,2 runs,sweeps firmly, nearly gets it past the man at deep backward square leg"}, {"ball": 17.6, "isHighlight": false, "text": "Chawla to Dhoni,1 run,quicker, and on off stump, shifting from the outside leg line, whipped towards midwicket for a single"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Dhoni,no run,spins in from a length, too much turn for Dhoni who is hit on the pads"}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Dhoni,1 run,spins away from Dhoni this time, Dhoni lashes the ball to point and takes a quick single"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Jadeja, $$SIX$$ ,massive from Jadeja, serious connection there, a flat-batted hit after getting on one knee and that is a long way beyond the long-on rope"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Jadeja,1 run,played off the back foot towards deep point"}, {"ball": 18.4, "isHighlight": false, "text": "Crowd chating, \"Dhoni, Dhoni\""}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Dhoni,no run,spinning away outside off, Dhoni chases but can't connect"}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Dhoni,no run,quicker and zips through outside off, again Dhoni can't connect, one over to go"}, {"ball": 19.1, "isHighlight": false, "text": "UT Yadav to Jadeja,1 run,full ball form Umesh outside off, Jadeja squeezes it towards deep point"}, {"ball": 19.1, "isHighlight": false, "text": "LK: \"Sir Jadeja these days starting his innings with a six.. what happend to him..? ;)\""}, {"ball": 19.2, "isHighlight": false, "text": "UT Yadav to Dhoni,2 runs,short of length ball just outside off, Dhoni clubs it towards wide long-on, Jadeja gallops back for the second"}, {"ball": 19.3, "isHighlight": false, "text": "UT Yadav to Dhoni, $$SIX$$ ,phew! is there a final over in which MSD hasn't hit a six, a short ball from Umesh is pulled away flat for six, powerful hit that, hardly any height on that as the ball made it's way to the rope"}, {"ball": 19.4, "isHighlight": false, "text": "UT Yadav to Dhoni,no run,Umesh responds with the perfect yorker, even Dhoni can't do much with that"}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Dhoni,1 no ball,goes for the yorker again, misses and it is a high full toss, Dhoni looks to hammer that through the off, top edge results in a catch to third man, replays needed to confirm that was above waist height, the crowd cheers loudly as they realises Dhoni has two more deliveries"}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Jadeja,1 run,length ball on middle and off, crashes this towards wide long-on"}, {"ball": 19.6, "isHighlight": false, "text": "UT Yadav to Dhoni,1 run,superb delivery to finish from Umesh, again it is a perfect yorker and Dhoni can't get under it, can only squeeze it back towards the bowler"}, {"ball": 19.6, "isHighlight": false, "text": "CSK end on 154, doesn't look like a big score, but this isn't the easiest of pitches either. Once again, Raina delivers for CSK, as he has for seven seasons now."}, {"ball": 19.6, "isHighlight": false, "text": "$$Pat$$ $$Cummins:$$  \"Wish I could bowl that on cue again (the ball to dismiss Smith). It is normally a spinner-friendly wicket here, but there was more pace in it today, but towards the end it did grip a bit.\""}], "name": "Kolkata Knight Riders v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734023.html?innings=1;view=commentary", "match_num": 47}