{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase. Gambhir and Uthappa walk out to open. Hilfenhaus has the new ball"}, {"ball": 0.1, "isHighlight": false, "text": "Hilfenhaus to Uthappa, $$FOUR$$ ,what a start, he leans forward into a pitched up outswinger and eases it between extra cover and mid off"}, {"ball": 0.2, "isHighlight": false, "text": "Hilfenhaus to Uthappa,2 runs,this bounces from short of a length outside off, Uthappa checks his push but he also guides it wide of third man"}, {"ball": 0.3, "isHighlight": false, "text": "Hilfenhaus to Uthappa,no run,beaten, short, climbing, moving away, Uthappa prods, survives"}, {"ball": 0.4, "isHighlight": false, "text": "Hilfenhaus to Uthappa,no run, $$dropped$$ , straight to Ashwin at slip and straight out, as Uthappa chases a good length outswinger and gets a thick edge"}, {"ball": 0.4, "isHighlight": false, "text": "Dhoni calls Raina to slip immediately, Ashwin sent to midwicket"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to Uthappa,1 wide,slants this down leg with the angle"}, {"ball": 0.5, "isHighlight": false, "text": "Hilfenhaus to Uthappa, $$FOUR$$ ,full and swinging into middle and off, Uthappa clips it superbly in front of square"}, {"ball": 0.6, "isHighlight": false, "text": "Hilfenhaus to Uthappa,1 run,pushed softly into the off side for a single"}, {"ball": 0.6, "isHighlight": false, "text": "Ishwar Pandey"}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Uthappa, $$FOUR$$ ,offers width on this length ball that moves further away, Uthappa moves forward and caresses it through extra cover"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Uthappa, $$FOUR$$ ,the man is in some touch, Pandey takes away the width this time, so Uthappa opens the face, beats slip easily, that is all he needs to do"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Uthappa,1 run,well bowled, this one comes in from just outside off, Uthappa turns it behind square leg"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Gambhir,no run,Gambhir lets go his first ball, a good length delivery angled across close to off stump"}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Gambhir,no run,moves forward to drive a slightly fuller one, but cannot time it at all"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Gambhir,no run,nicely bowled, comes in from just back of a length, Gambhir is fortunate not to play on as he tries to keep it down, wants the single but the ball is too close to the keeper"}, {"ball": 1.6, "isHighlight": false, "text": "Ozee: \"Before the start of the IPL a lot was being talked about Sehwag and Gambhir hitting some big runs and getting back into the national side....but now it seems as if uthappa is running with all the honors.\""}, {"ball": 1.6, "isHighlight": false, "text": "Here's Mohit"}, {"ball": 2.1, "isHighlight": false, "text": "Sharma to Uthappa, $$FOUR$$ ,superb from Uthappa, he's middling it, gets forward and slices this through cover for four, on the up shot is placed perfectly"}, {"ball": 2.2, "isHighlight": false, "text": "Sharma to Uthappa, $$FOUR$$ , $$dropped$$ , just a I type that he's middling it, he edges a pitched-up ball, through to slip once more, Raina's chance to give Uthappa a chance now, what's more and that is four more, this was a mich tougher chance than Ashwin's, lower and to Raina's left"}, {"ball": 2.3, "isHighlight": false, "text": "Sharma to Uthappa,1 run,pushed towards mid-off for a single"}, {"ball": 2.4, "isHighlight": false, "text": "Sharma to Gambhir,no run,Gambhir was gone if there was a direct hit from cover, Gambhir punched the ball towards cover, where Faf dives to his right to cut it off, Gambhir wanted one and was sprinting down, Uthappa didn't, Gambhir has to go back, he knows he can't make it in time and he's hoping Faf misses, Faf does miss, Uthappa walks up and chats with Gambhir"}, {"ball": 2.5, "isHighlight": false, "text": "Sharma to Gambhir, $$FOUR$$ ,now he's off the mark, through his favourite backward point region for four, how many boundaries have there been already?"}, {"ball": 2.6, "isHighlight": false, "text": "Sharma to Gambhir,no run,beaten outside off by a delivery that moves away outside off"}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Uthappa,no run,good length and outside off, through to the keeper"}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Uthappa,no run,gets forward and steers the ball towards backward point, where Jadeja makes a diving stop"}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to Uthappa,no run,swings and misses, the ball was swerving away outside off, Uthappa looks to drive through extra cover, no bat"}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to Uthappa,1 run,is he gone run-out? there is a direct hit, but Uthappa is in, Uthappa pushed the ball towards mid-off and set off immediately, shouting for the single"}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to Gambhir,no run,back of length and outside off, getting the ball to curve away, Gambhir wafted outside off and is beaten"}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to Gambhir,1 run,short of length ball on off and middle stump, whipped towards midwicket for a single"}, {"ball": 4.1, "isHighlight": false, "text": "Hilfenhaus to Gambhir,2 runs,length ball on leg stump from Hilfenhaus, Gambhir tucks it to the leg side for a couple"}, {"ball": 4.2, "isHighlight": false, "text": "Hilfenhaus to Gambhir,no run,length ball just outside off, Gambhir dabs towards point and sets off for a single"}, {"ball": 4.3, "isHighlight": false, "text": "Hilfenhaus to Gambhir,1 run"}, {"ball": 4.4, "isHighlight": false, "text": "Hilfenhaus to Uthappa,2 runs,length ball outside off, slogged towards cow corner though the ball is moving away"}, {"ball": 4.5, "isHighlight": false, "text": "Hilfenhaus to Uthappa,no run,Uthappa was looking so good when he was placing the ball through the covers early on, he's forgotten that and is now going for power slogs through the leg side, losing his shape and doesn't get bat on it"}, {"ball": 4.6, "isHighlight": false, "text": "Hilfenhaus to Uthappa, $$FOUR$$ ,why slog when you can do this? just a clip off the pads, sends the ball racing to the wide long-on boundary, superb timing on that one"}, {"ball": 4.6, "isHighlight": false, "text": "zube: \"Just saying, Matt Henry would be a better choice than Ben Hilfenhaus. Opposition teams haven't seen much of Henry, and he is much, much faster than Hilfenhaus. The IPL needs more raw pace anyway, and Henry could contribute with the bat as well!\""}, {"ball": 4.6, "isHighlight": false, "text": "R Ashwin is on, he'll have a big role to play here"}, {"ball": 5.1, "isHighlight": false, "text": "Ashwin to Gambhir,1 run,on middle stump, whipped towards square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Ashwin to Uthappa, $$FOUR$$ ,on middle and leg, Uthappa deftly lap sweeps this behind square for four, doesn't try to power it"}, {"ball": 5.3, "isHighlight": false, "text": "Ashwin to Uthappa,1 run,defended towards point for a single, this is a superb start from KKR"}, {"ball": 5.4, "isHighlight": false, "text": "Ashwin to Gambhir,no run,carrom ball towards the pads, Gambhir trapped on the back foot and is hit on thigh pad, going down"}, {"ball": 5.5, "isHighlight": false, "text": "Ashwin to Gambhir,no run,run-out? Gambhir is just in though Dhoni has again shown off his quick thinking, Gambhir guided the ball towards point and set off, Uthappa sends him back, Hilfenhaus fields and fires in the throw, Dhoni doesn't collect the ball but just deflects it onto the stumps, Gambhir is back in, just"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin to Gambhir,1 run,towards backward point for a single"}, {"ball": 6.1, "isHighlight": false, "text": "Pandey to Gambhir, $$FOUR$$ ,full and wide, Gambhir likes it there, reaches out and lofts that over cover for four, a shot we have seen Gambhir play many, many times"}, {"ball": 6.2, "isHighlight": false, "text": "Pandey to Gambhir,2 runs,short of length ball on the pads, clipped behind square leg for a couple"}, {"ball": 6.3, "isHighlight": false, "text": "Pandey to Gambhir, $$FOUR$$ ,short of length and outside off, Gambhir carves that behind backward point for four more, KKR are running away with this"}, {"ball": 6.4, "isHighlight": false, "text": "Pandey to Gambhir,1 run,a full toss outside off, Gambhir can't put it away, only down to third man for a single"}, {"ball": 6.4, "isHighlight": false, "text": "Adib: \"Uthappa's last 7 innings; 47, 65, 47, 46, 80, 40 and currently 41*. What form this man is in, haven't seen him this consistent before.\""}, {"ball": 6.5, "isHighlight": false, "text": "Pandey to Uthappa,1 run,length ball is worked towards mid-on for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Pandey to Gambhir, $$OUT$$ ,bowled 'im! CSK need a breakthrough badly, and they have got one, Gambhir wanted to loft that length ball over mid-on, inside-edge and onto the stumps"}, {"ball": 6.6, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$b$$ $$Pandey$$ $$21$$ $$(30m$$ $$20b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$105.00$$"}, {"ball": 6.6, "isHighlight": false, "text": "zafarjaveds: \"In their last 7 outings, Gambhir and Uthappa had 2 century partnerships and 3 50 partnership and still you said Smith and Brendon is the best pair of the tournament??\""}, {"ball": 6.6, "isHighlight": false, "text": "Dhoni gets CSK in a huddle, as he gives out instructions on what he expects from the team."}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Uthappa,1 run,short of length ball outside off, flat-batted towards long-off for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Pandey,no run,short of length ball is pushed towards cover off the front foot"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Pandey,1 run,Mohit gets the ball to curl in, thick inside edge towards square leg"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Uthappa,2 runs,full and swinging away, a thick outside edge sends the ball towards sweeper cover, it was Mohit's back-of-the-hand slower one"}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Uthappa,1 leg bye,short of length ball on the pads, Uthappa looks to glance the ball towards fine leg, no bat, off the thigh pad for a leg-bye"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Pandey,no run,shortish and well outside off, gets the ball to move away, Pandey happy to leave that alone"}, {"ball": 7.6, "isHighlight": false, "text": "Nitin: \"Uthappa HAS to be in the Indian team for the England series. The man is in ridiculous form in this IPL, and has had a good couple of seasons in domestic cricket.\""}, {"ball": 7.6, "isHighlight": false, "text": "Here's Sir."}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Uthappa,2 runs,first ball is worked towards midwicket for a single"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Uthappa,no run,length ball just outside off, defended off the front foot"}, {"ball": 8.2, "isHighlight": false, "text": "\"KKR, KKR,\" chants a vociferous Eden"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Uthappa,1 run,clipped to the leg side for one more"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Pandey,1 run,flighted delivery, pitched up and outside off, worked towards cover for one more"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Uthappa, $$FOUR$$ ,short of length ball outside off, Uthappa waits on the backfoot and guides that past the keeper for four more, brings up the half-century, what a vein of form he has struck"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Uthappa,1 run,length ball around off, steered behind point for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Time for the  $$time-out$$ ."}, {"ball": 8.6, "isHighlight": false, "text": "Andrew: \"CSK really need to force Pandey to face as many balls as possible while he is still new. Having no close-in fielders at the beginning only allows him to turn it over to Uthappa, who is just blasting it right now.\""}, {"ball": 9.1, "isHighlight": false, "text": "Ashwin to Uthappa,no run,big appeal for lbw, did that pitch in line? Ashwin from round the wicket, Uthappa caught on the crease, appeal turned down"}, {"ball": 9.2, "isHighlight": false, "text": "Ashwin to Uthappa,1 leg bye,looks to sweep an outside-leg delivery, off the pads"}, {"ball": 9.3, "isHighlight": false, "text": "Ashwin to Pandey,1 leg bye,this time it is Pandey who misses the sweep"}, {"ball": 9.4, "isHighlight": false, "text": "Ashwin to Uthappa,1 run,Ashwin drops it short this time, batsman doesn't capitalise, whacks it to deep midwicket"}, {"ball": 9.5, "isHighlight": false, "text": "Ashwin to Pandey,1 run,whipped towards deep square leg"}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin to Uthappa, $$SIX$$ ,massive hit from Uthappa, KKR cruising it here, full ball is slog-swept a long way over the midwicket rope"}, {"ball": 10.1, "isHighlight": false, "text": "Pandey to Pandey,no run,angling in, struck on the pads but that was going down the leg side"}, {"ball": 10.2, "isHighlight": false, "text": "Pandey to Pandey,1 run,short of length ball well outside off, steered towards deep point"}, {"ball": 10.3, "isHighlight": false, "text": "Pandey to Uthappa, $$FOUR$$ ,Uthappa continues to cruise, a length ball around off stump, Uthappa shuffles across and whips that to the midwicket boundary, superbly done"}, {"ball": 10.4, "isHighlight": false, "text": "Pandey to Uthappa,1 run,guided to backward point for one more"}, {"ball": 10.5, "isHighlight": false, "text": "Pandey to Pandey,1 run,that was in the air a long time, but somehow it lands short of the man at sweeper cover, there was a chance for the fielder at cover as well, but there was no proper calling, and no one really went for it"}, {"ball": 10.6, "isHighlight": false, "text": "Pandey to Uthappa,1 run,fuller length delivery and on the stumps, punched towards mid-on"}, {"ball": 11.1, "isHighlight": false, "text": "Jadeja to Uthappa,1 run,defended off the front foot to the off side"}, {"ball": 11.2, "isHighlight": false, "text": "Jadeja to Pandey,no run,looks to defend, the ball almost pops back to the bowler, lands well short though"}, {"ball": 11.3, "isHighlight": false, "text": "Jadeja to Pandey,1 run"}, {"ball": 11.4, "isHighlight": false, "text": "Jadeja to Uthappa, $$OUT$$ ,picks out long-off, Uthappa is crestfallen at that shot, he gets onto the front foot and chips this towards long-off, can't clear the fielder there, Uthappa is gone for 67, been a terrific innings from him, sets up KKR perfectly"}, {"ball": 11.4, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Jadeja$$ $$67$$ $$(53m$$ $$39b$$ $$10x4$$ $$1x6)$$ $$SR:$$ $$171.79$$"}, {"ball": 11.5, "isHighlight": false, "text": "Jadeja to Shakib Al Hasan,no run,defended off the front foot towards cover"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja to Shakib Al Hasan,1 run,on the pads, worked towards square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin round the wicket"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan,no run,that is heading for middle stump, defended carefully"}, {"ball": 12.2, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan,no run,length ball on off stump, pushed towards short cover"}, {"ball": 12.3, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan,1 run,skips down the track, tucks the ball towards square leg"}, {"ball": 12.4, "isHighlight": false, "text": "Ashwin to Pandey,no run,Ashwin from over the wicket, worked to the leg side, another dot ball, just one off the over so far"}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Pandey,1 run,full length ball is drilled towards long-on for a single"}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan,no run,short of length ball from round the wicket, Shakib skips down the track but can't get to the pitch, his shot is in the air for a bit but lands short of short extra"}, {"ball": 12.6, "isHighlight": false, "text": "Dj: \"@KKR Middle order: Please collapse and help keep tournament interesting!!\""}, {"ball": 13.1, "isHighlight": false, "text": "Jadeja to Pandey,no run,defended to the off side, Shakib wanted one, Pandey didn't, they decide against it"}, {"ball": 13.2, "isHighlight": false, "text": "Jadeja to Pandey,1 run,slaps this towards wide long-on for a single"}, {"ball": 13.3, "isHighlight": false, "text": "Jadeja to Shakib Al Hasan,2 runs,full ball on the pads, clipped towards deep square leg, Shakib shouts, 'two, two, two,' and they get two"}, {"ball": 13.4, "isHighlight": false, "text": "Jadeja to Shakib Al Hasan, $$SIX$$ ,big hit from Shakib, length ball is hammered over midwicket for six, solid connection on that slog sweep"}, {"ball": 13.5, "isHighlight": false, "text": "Jadeja to Shakib Al Hasan,1 run,mows it towards midwicket once more, not quite off the middle, the ball rolls towards the man in the deep"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja to Pandey,1 run,length ball well outside off, eased to sweeper cover for a single"}, {"ball": 14.1, "isHighlight": false, "text": "Ashwin to Pandey,no run,spinning in towards off, Pandey inside-edges onto his pads as he plays that off the back foot"}, {"ball": 14.2, "isHighlight": false, "text": "Ashwin to Pandey,1 run,whips this towards wide long-on for a single"}, {"ball": 14.3, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan, $$FOUR$$ ,lap sweep from Shakib, cleverly done there, plays it fine past the keeper to pick up a boundary"}, {"ball": 14.4, "isHighlight": false, "text": "Ashwin to Shakib Al Hasan,1 run,gets the front foot across and looks to sweep, hit on the pads"}, {"ball": 14.4, "isHighlight": false, "text": "Shams: \"Shakib needs to make a statement here why he is touted as one of the best all-rounders in the world\""}, {"ball": 14.5, "isHighlight": false, "text": "Ashwin to Pandey,no run,length ball is driven back towards Ashwin, who collects and the non-striker has to scramble back"}, {"ball": 14.5, "isHighlight": false, "text": "bidwan: \"Irrespective of what happens at the business end of the IPL, KKR has made a remarkable comeback..after that suicidal defeat to the RR! Most of the teams dont recover after such a defeat. RCB did once in IPL 2 under Kumble.\""}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin to Pandey,1 run,worked towards sweeper cover for a single"}, {"ball": 15.1, "isHighlight": false, "text": "Raina to Pandey,1 run,length ball on the pads, helped to fine leg for a single"}, {"ball": 15.2, "isHighlight": false, "text": "Raina to Shakib Al Hasan, $$FOUR$$ ,Shakib doing the job KKR need, skips out and launches this over the bowler's head for four"}, {"ball": 15.3, "isHighlight": false, "text": "Raina to Shakib Al Hasan,1 run,making room and slaps this towards deep point, Shakib showing why he should be playing at No. 4 in the order"}, {"ball": 15.4, "isHighlight": false, "text": "Raina to Pandey,1 run,Pandey clobbers that towards midwicket, a dive from McCullum almost stops that powerful hit"}, {"ball": 15.5, "isHighlight": false, "text": "Raina to Shakib Al Hasan,1 run,to sweeper cover for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Raina to Pandey,1 run,eased to long-on for one more"}, {"ball": 15.6, "isHighlight": false, "text": "$$Time-out$$  time."}, {"ball": 16.1, "isHighlight": false, "text": "Hilfenhaus to Pandey,1 run,short of length ball outside off, lashed towards sweeper cover, Pandey wanted two, but he hit it too well to have time for the second"}, {"ball": 16.2, "isHighlight": false, "text": "Hilfenhaus to Shakib Al Hasan,1 run,worked away towards midwicket for a single"}, {"ball": 16.3, "isHighlight": false, "text": "Hilfenhaus to Pandey,1 run,mistimes it towards midwicket for one more"}, {"ball": 16.4, "isHighlight": false, "text": "Hilfenhaus to Shakib Al Hasan, $$SIX$$ ,not off the middle, but it doesn't matter, over the fine-leg rope for six, he shuffles across and paddles that fine past the keeper, using the pace there"}, {"ball": 16.5, "isHighlight": false, "text": "Hilfenhaus to Shakib Al Hasan, $$FOUR$$ ,KKR galloping away with this game now, another boundary to Shakib, gets on one knee and hammers this towards deep square leg, should have been two, but Smith makes a has of the stop, letting the ball through for four"}, {"ball": 16.6, "isHighlight": false, "text": "Hilfenhaus to Shakib Al Hasan, $$FOUR$$ ,short and outside off, chopped for four more, Shakib wants this over pronto, 17 off the over, Hilfenhaus for Badree didn't work today for CSK"}, {"ball": 16.6, "isHighlight": false, "text": "Petera: \"Hilfenhaus vs Shakib.. Reminds me of 2012 finals! DeJaVu\" some crucial hits from Shakib in that match."}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Pandey,no run,short of length outside off, hacks at it and misses"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Pandey,1 run,slower one outside off, Pandey goes for another mow, bottom edges it, and the ball is at his feet, Shakib wanted the single, Mohit collects and takes the bails off, but Shakib has done well to make his ground, diving full length"}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to Shakib Al Hasan, $$FOUR$$ ,drops it short and Shakib helps it along to the deep backward square leg boundary, no need to power the ball"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Shakib Al Hasan,1 run,shortish ball outside off, extra bounce there, Shakib was advancing down the track, an awkward flat-batted hit towards long-on"}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to Pandey,1 run,slow loopy full ball outside off, Pandey pushes it to cover for one more"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Shakib Al Hasan, $$FOUR$$ ,crunch! what a way to finish the game, Shakib pummels that over the bowler's head to confirm an easy win, prompting the release of loads of purple balloons in the stands, CSK outclassed today and KKR get their fifth victory in a row"}, {"ball": 17.6, "isHighlight": false, "text": "KKR's clinical win means the table is split between the top four and the bottom four. Kings XI, CSK, RR and KKR are four points above the chasing pack."}, {"ball": 17.6, "isHighlight": false, "text": "$$MS$$ $$Dhoni:$$  \"It was a bad toss to lose, the wicket became slightly better to bat on, the bowlers created the opportunities but the fielder couldn't take it. The wicket was slow to start off, their spinners bowled really well, Raina played another good innings, 10 or 15 runs short.\""}, {"ball": 17.6, "isHighlight": false, "text": "$$Presentation$$ $$ceremony:$$"}, {"ball": 17.6, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir:$$  \"I think we were pretty professional with the bat and ball, Bowlers restricting CSK to 154 was exceptional. Hopefully we can turn up in a couple of days and do what we did today. We have quality spinners in the ranks, and irrespective of the pitch they perform, and I want to mention Umesh and Cummins as well, they don't get mentioned as often as they should.\""}, {"ball": 17.6, "isHighlight": false, "text": "Man of the Match is  $$Robin$$ $$Uthappa:$$  \"I've enjoyed batting here on this ground, the crowd is fantastic, I have always done well here, sort of a lucky ground for me. The wicket was coming on well, the dew factor also helped it. I just wanted to play to the merit of the ball, when you play T20 you tend to lose shape technically, that's what I have been trying to avoid, to not lose shape in the first six overs.\" Uthappa dedicates the innings to \"a very, very close friend Muffin\"."}, {"ball": 17.6, "isHighlight": false, "text": "That's a wrap from me. Our daily post-match video show will start shortly, stick around for that."}], "name": "Kolkata Knight Riders v Chennai Super Kings", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734023.html?innings=2;view=commentary", "match_num": 47}