{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00pm$$  Here we go, then. Kumar Dharmasena and Vineet Kulkarni are the umpires tonight. Kings XI will open with Sehwag and Manan Vohra, and Praveen Kumar will take the new ball for Mumbai Indians."}, {"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  First game of the season in Mohali, which, incidentally, has been an even more batting-friendly venue than the Chinnaswamy Stadium, across all IPL seasons. The average run rate has been 8.31 in Mohali, and 8.25 in Bangalore. Only the Holkar Stadium in Indore (8.56, but only 4 matches) and the Brabourne Stadium (8.54, 14 matches) have been more high-scoring."}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  Virender Sehwag says he enjoys batting in Mohali, and recalls that he once made \"180-something\" against Pakistan here. He says Sanjay Bangar is a wonderful coach, takes suggestions from senior players and implements them. He has good words for George Bailey too, says he encourages bowlers to follow their own plans."}, {"ball": 0, "isHighlight": false, "text": "Sehwag, I guess, was talking about  $$this$$ $$Test$$ $$match$$ , in which he scored 173. You'll probably remember the game for  $$that$$  match-saving Akmal-Razzaq partnership."}, {"ball": 0, "isHighlight": false, "text": "He also sings a Kishore Kumar song. Not particularly well, but still an aww moment."}, {"ball": 0, "isHighlight": false, "text": "\"Any word on why Johnson isn't playing?\" I guess they're just resting him, Aditya. And Beuran Hendricks took three wickets in their  $$previous$$ $$match$$ ."}, {"ball": 0, "isHighlight": false, "text": "Snehil: \"The only thing missing in this edition of IPL is a century...Maxwell came close to the landmark three times but failed to capitalize on it....With their first game in Mohali this season,I hope he hits a hundred tonight.. \""}, {"ball": 0, "isHighlight": false, "text": "Vishnu: \"Hope Kings XI bat second so that I can see them batting on TV after my shift ends. Much more fun than reading the commentary on Cricinfo. Sorry for that!\" That is devastating news. Our words don't paint beautiful pictures in your heads?"}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  It's time for the toss. Tails is the call, and it's tails, which means Rohit Sharma has won the toss.  $$Mumbai$$ $$Indians$$ $$will$$ $$field$$ $$first$$ . Rohit says it's a good track to bat on, and the ball comes on nicely, and it will stay that way."}, {"ball": 0, "isHighlight": false, "text": "Shaun Marsh will play his first game of the season for Kings XI, at the expense of David Miller, who's having a rest. Harbhajan Singh, meanwhile, is ill, and makes way for Praveen Kumar."}, {"ball": 0, "isHighlight": false, "text": "$$7.15pm$$  Hello, everyone. It's Kings XI Punjab against Mumbai Indians, who will have to win this match, and all their remaining games, to stay in contention for a Playoff spot. As you wait for tonight's game to begin, do have a look at the  $$preview$$ , by Devashish Fuloria."}, {"ball": 0, "isHighlight": false, "text": "Five teams vie for third and fourth places, and the permutations are too complex for me to explain here. Instead, I'll direct you to this  $$handy$$ $$guide$$  to all the scenarios, by Shiva Jayaraman."}, {"ball": 0, "isHighlight": false, "text": "And for something totally unrelated to tonight's game, or indeed the IPL, here's Scott Oliver, on the  $$joy$$ $$of$$ $$shouldered$$ $$arms$$  (wonder where that expression came from)."}, {"ball": 0, "isHighlight": false, "text": "Five days left to stake your claim to be at Lord's when India play England this summer.  $$Go$$ $$for$$ $$your$$ $$shots$$ $$on$$ $$CricIQ.$$ $$Now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Sehwag, $$FOUR$$ ,that's short and wide outside off, and Sehwag steers it past, no, through backward point. Kieron Pollard dived to his right but couldn't cut it off."}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Sehwag, $$SIX$$ ,whoa. What a start. This is wide outside off again, and full, and Sehwag swings merrily through the line to send it soaring over extra cover."}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Sehwag,no run,this straightened from off stump, and Sehwag checks his shot to push it towards cover"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Sehwag,1 wide,uh oh. Praveen doesn't seem to be in rhythm. This slides down the leg side. No real swing either."}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Sehwag,no run,comes in a touch from outside off, just back of a length, Sehwag defends from the crease"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Sehwag,no run,he missed out on that. It was short and wide, and he hit it straight to point"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Sehwag,no run,length ball, outside off, Sehwag opens his bat face and pushes it towards point"}, {"ball": 0.6, "isHighlight": false, "text": "Santokie now."}, {"ball": 1.1, "isHighlight": false, "text": "Santokie to Vohra, $$FOUR$$ ,wide and full, and Vohra leans elegantly over that, bends at the front knee, and caresses it through cover"}, {"ball": 1.2, "isHighlight": false, "text": "Santokie to Vohra,1 run,back of a length, tucked into the leg side"}, {"ball": 1.3, "isHighlight": false, "text": "Santokie to Sehwag,no run,slower ball, outside off, and Sehwag is beaten as he pokes at it"}, {"ball": 1.4, "isHighlight": false, "text": "Santokie to Sehwag, $$SIX$$ ,another slower one, outside off, but Sehwag has seen it early. Waits an age before launching it back over the bowler's head"}, {"ball": 1.5, "isHighlight": false, "text": "Santokie to Sehwag,no run,tries to slog this across the line, hits him on the front pad, outside leg, and bounces away into the off side"}, {"ball": 1.6, "isHighlight": false, "text": "Santokie to Sehwag,1 run,full and wide, and Sehwag seemed to hit that extremely well, so it was a little strange to watch it go to deep cover on the bounce"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Sehwag, $$OUT$$ ,oh man. That's such an unfortunate dismissal. The ball comes in off the seam, tucks Sehwag up. He pushes it down the ground, towards mid-on (or so he thinks) and both batsmen set off. The ball stops right next to the bowler, though, after hitting Vohra's foot, and PK only has to run back two yards to knock the bails off"}, {"ball": 2.1, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$run$$ $$out$$ $$17$$ $$(10m$$ $$11b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$154.54$$"}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Vohra,no run,outswinger, outside off. Vohra pokes and misses"}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Vohra,no run,this is another outswinger, wider this time, and Vohra's beaten, trying to steer that with half a bat"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to Vohra,1 run,Vohra walks across his stumps, out of his crease, and tucks it off his pads to deep backward square leg"}, {"ball": 2.4, "isHighlight": false, "text": "Shaun Marsh, to face his first ball of the season"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Marsh,no run,leg-stumpish, length ball, clipped towards midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to Marsh,no run,onto the pads again, but a bit of swing away from Marsh, who gets a soft leading edge that drops harmlessly next to him"}, {"ball": 2.6, "isHighlight": false, "text": "Rohit: \"Shaun Marsh's beard"}, {"ball": 2.6, "isHighlight": false, "text": "Bumrah now"}, {"ball": 3.1, "isHighlight": false, "text": "Bumrah to Vohra,no run,angled in, back of a length, outside off, left alone"}, {"ball": 3.2, "isHighlight": false, "text": "Bumrah to Vohra, $$FOUR$$ ,was he trying to pull that? It was short and outside off, and he was probably looking to hit it over midwicket, but it came on a bit quicker than he expected and it goes off the bottom half of his bat, over a leaping mid-off. Lucky boy."}, {"ball": 3.3, "isHighlight": false, "text": "Bumrah to Vohra,no run,outswinging full toss outside off. Vohra pokes and misses"}, {"ball": 3.4, "isHighlight": false, "text": "Bumrah to Vohra,no run,good short ball, follows Vohra, and he misses as he tries to ramp it over the keeper"}, {"ball": 3.5, "isHighlight": false, "text": "Bumrah to Vohra, $$FOUR$$ ,that's full, and Vohra throws his bat at it. He's leaning back a bit, and gets a thick outside edge to the third man boundary"}, {"ball": 3.6, "isHighlight": false, "text": "Bumrah to Vohra,1 run,tucked off the pads towards midwicket"}, {"ball": 4.1, "isHighlight": false, "text": "Kumar to Vohra,no run,length ball, outside off, pushed towards cover"}, {"ball": 4.1, "isHighlight": false, "text": "PK's wearing a heavy-duty gold chain, by the way"}, {"ball": 4.2, "isHighlight": false, "text": "Kumar to Vohra,no run,this one nips back in, and Vohra is hit on the pad as he tries to flick it. Was falling over a touch. But the ball was probably going over the stumps, which explains Dharmasena's lack of interest when PK appeals"}, {"ball": 4.3, "isHighlight": false, "text": "Kumar to Vohra,no run,short and wide, with a bit of outswing, and Vohra flashes and misses"}, {"ball": 4.4, "isHighlight": false, "text": "Kumar to Vohra,no run,comes down the track, PK pulls his length back a bit, and Vohra defends towards cover"}, {"ball": 4.5, "isHighlight": false, "text": "Kumar to Vohra,no run,back of a length, outside off, 129.2kph, but looked a lot slower, and Vohra waits and waits before defending back down the pitch"}, {"ball": 4.6, "isHighlight": false, "text": "Kumar to Vohra,1 run,that's short, and it's pulled to deep midwicket from just outside off"}, {"ball": 4.6, "isHighlight": false, "text": "Amit: \"Missing BappiDaa..thank u PK..\""}, {"ball": 5.1, "isHighlight": false, "text": "Ojha to Vohra, $$SIX$$ ,short, and Vohra's quickly back to pull this over long-on."}, {"ball": 5.2, "isHighlight": false, "text": "Ojha to Vohra,1 run,tucked off the pads towards midwicket"}, {"ball": 5.3, "isHighlight": false, "text": "Ojha to Marsh,no run,down the pitch, clipped to midwicket"}, {"ball": 5.4, "isHighlight": false, "text": "Ojha to Marsh,1 wide,this is short, and it's down the leg side"}, {"ball": 5.4, "isHighlight": false, "text": "Ojha to Marsh,no run,short again. Marsh is a little late on that flick-pull, and it rolls to square leg"}, {"ball": 5.5, "isHighlight": false, "text": "Ojha to Marsh,no run,Marsh goes across with his front foot, tucks it to square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Ojha to Marsh, $$SIX$$ ,massive! Marsh clears his front leg, gets down on one knee, and slog-sweeps way over deep midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Shreyas Gopal"}, {"ball": 6.1, "isHighlight": false, "text": "Gopal to Vohra,2 runs,tucked towards midwicket off the pads"}, {"ball": 6.2, "isHighlight": false, "text": "Gopal to Vohra,no run,that's short, and Vohra's quickly back in his crease, but it's the googly, and it hurries into him and hits his pad, but well outside off"}, {"ball": 6.3, "isHighlight": false, "text": "Gopal to Vohra, $$FOUR$$ ,short and wide, and Vohra opens his bat face to slice it behind point"}, {"ball": 6.4, "isHighlight": false, "text": "Gopal to Vohra,1 run,back of a length, Vohra goes deep in his crease and tucks that to deep midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Gopal to Marsh,2 runs,that's the googly, but it's short and wide, and Marsh cuts it to deep cover"}, {"ball": 6.6, "isHighlight": false, "text": "Gopal to Marsh,2 runs,better this time. Hangs in the air a bit before turning away from Marsh, who gets a leading edge down to long-off"}, {"ball": 6.6, "isHighlight": false, "text": "They've taken the time-out, it looks like"}, {"ball": 6.6, "isHighlight": false, "text": "Ganesh: \"Never thought I would say this, but MI is already missing Bhajji. He has been surprisingly good this season. Kings looking good for 200 again. \""}, {"ball": 7.1, "isHighlight": false, "text": "Ojha to Vohra,no run,tossed up a bit, and Vohra defends off the front foot"}, {"ball": 7.2, "isHighlight": false, "text": "Ojha to Vohra,1 run,this one's quite slow, too, and Vohra goes back to clip it off his hips towards square leg"}, {"ball": 7.3, "isHighlight": false, "text": "Ojha to Marsh,1 run,onto Marsh's pads, and it's flicked to deep backward square"}, {"ball": 7.4, "isHighlight": false, "text": "Ojha to Vohra,1 wide,fired down the leg side, and the umpire's arms shoot out even as Aditya Tare goes up in a loud appeal for caught behind"}, {"ball": 7.4, "isHighlight": false, "text": "Ojha to Vohra,1 run,short and flat, and Vohra pulls it to long-on"}, {"ball": 7.5, "isHighlight": false, "text": "Ojha to Marsh, $$FOUR$$ ,a bit more air this time, and Marsh clears that front pad and swats it over midwicket, two bounces and over the ropes"}, {"ball": 7.6, "isHighlight": false, "text": "Ojha to Marsh,4 leg byes,down the leg side again, and Marsh tickles it off his pads, very fine, and it runs away quickly to the boundary"}, {"ball": 8.1, "isHighlight": false, "text": "Gopal to Vohra,no run,slides down leg, with the angle, hits Vohra on the pads"}, {"ball": 8.2, "isHighlight": false, "text": "Gopal to Vohra,1 run,ooh, what's this? Vohra hits that hard, back down the ground, and it smashes into the stumps at the bowler's end. Dharmasena goes up to the third umpire, but it didn't look like Shreyas got a touch with his fingers as he dived. It passes quite close to the forefinger of his right hand, but there's too much doubt, and it's given not out."}, {"ball": 8.3, "isHighlight": false, "text": "Gopal to Marsh, $$FOUR$$ ,this is flat and short, and there's only one place that's going. Marsh rocks back and pulls it powerfully in front of deep midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Gopal to Marsh,2 runs,slower, fuller, and on the pads. Marsh flicks it towards deep square leg"}, {"ball": 8.5, "isHighlight": false, "text": "Gopal to Marsh, $$SIX$$ ,down the pitch, and he gets into the perfect position to loft that high and straight"}, {"ball": 8.6, "isHighlight": false, "text": "Gopal to Marsh,1 run,drops a touch short again, but this hurries towards Marsh, doesn't give him time for the pull that he's shaping for. He knocks it down instead to long-on"}, {"ball": 8.6, "isHighlight": false, "text": "Santokie returns"}, {"ball": 9.1, "isHighlight": false, "text": "Santokie to Marsh,2 runs,angles this into Marsh's pads, and he flicks it between deep midwicket and long-on"}, {"ball": 9.2, "isHighlight": false, "text": "Santokie to Marsh, $$OUT$$ ,he's picked him out! Slower ball, and Marsh hit it effortlessly, a touch too effortlessly, perhaps, straight to Pollard at long-on. He might not have picked that change of pace"}, {"ball": 9.2, "isHighlight": false, "text": "$$SE$$ $$Marsh$$ $$c$$ $$Pollard$$ $$b$$ $$Santokie$$ $$30$$ $$(31m$$ $$17b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$176.47$$"}, {"ball": 9.2, "isHighlight": false, "text": "Maxwell walks in"}, {"ball": 9.3, "isHighlight": false, "text": "Santokie to Vohra,no run,slower ball, clipped towards midwicket"}, {"ball": 9.4, "isHighlight": false, "text": "Santokie to Vohra,1 run,another slower ball, and Vohra shovels this towards long-on"}, {"ball": 9.4, "isHighlight": false, "text": "Banner goes up in the crowd. \"Glenndeep Singh Maxwell!\" The photo, as you'd imagine, has Maxwell with a pagdi."}, {"ball": 9.5, "isHighlight": false, "text": "Santokie to Maxwell,no run,slower ball again, wide outside off, and Maxwell pushes it to point"}, {"ball": 9.6, "isHighlight": false, "text": "Santokie to Maxwell,2 runs,on the pads this time, and Maxwell opens up a touch to push it to long-on with a straight bat"}, {"ball": 10.1, "isHighlight": false, "text": "Gopal to Vohra,no run,fires this down the leg side"}, {"ball": 10.2, "isHighlight": false, "text": "Gopal to Vohra,2 runs,Vohra comes down the track, doesn't get hold of it, goes down to long-on on the bounce. Pollard's throw to the bowler misses everyone, and they run an overthrow"}, {"ball": 10.3, "isHighlight": false, "text": "Gopal to Vohra,no run,that's a shocking delivery, flat and short and heading way down the leg side. Vohra misses out on it, hits it straight to short fine leg"}, {"ball": 10.4, "isHighlight": false, "text": "Gopal to Vohra, $$OUT$$ ,bowled 'im! That's a little bit slower, and Vohra slogs across the line and misses. Shreyas lets out a yell as it crashes into the top of middle"}, {"ball": 10.4, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$b$$ $$Gopal$$ $$36$$ $$(47m$$ $$34b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$105.88$$"}, {"ball": 10.4, "isHighlight": false, "text": "Bailey."}, {"ball": 10.5, "isHighlight": false, "text": "Gopal to Bailey,1 run,did that stop on him? It was the googly, and Bailey seemed surprised by that, pops it up towards mid-off, but it drops short of him"}, {"ball": 10.6, "isHighlight": false, "text": "Gopal to Maxwell, $$OUT$$ ,Mohali goes silent! slow, loopy wrong-un, and Maxwell probably picked it but played too early at it, and across it. Gets a thickish leading edge that loops straight back to the bowler."}, {"ball": 10.6, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$&$$ $$b$$ $$Gopal$$ $$2$$ $$(7m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 10.6, "isHighlight": false, "text": "Danny: \"That sure was Kumble bowling with Kumble action.\" Certainly some resemblance."}, {"ball": 10.6, "isHighlight": false, "text": "Here's Wriddhiman Saha, now"}, {"ball": 11.1, "isHighlight": false, "text": "Ojha to Bailey,1 run,down the leg side, and Bailey comes forward to flick towards midwicket"}, {"ball": 11.2, "isHighlight": false, "text": "Ojha to Saha,2 runs,tossed up, towards middle, and Saha stretches out to paddle it fine"}, {"ball": 11.3, "isHighlight": false, "text": "Ojha to Saha,no run,tossed up again, goes with the arm, and hits Saha high on the bat as he defends"}, {"ball": 11.4, "isHighlight": false, "text": "Ojha to Saha,1 leg bye,angles down the leg side once more, and Saha tickles it off his pads, very fine. Short fine leg runs across to cut it off"}, {"ball": 11.5, "isHighlight": false, "text": "Ojha to Bailey,no run,why are they appealing for this? It's angled well down the leg side, and Bailey is probably playing for turn. He gets an inside edge onto the front pad"}, {"ball": 11.6, "isHighlight": false, "text": "Ojha to Bailey,no run,goes back to cut, but doesn't have either the time or the room. Chops it down into the off side instead"}, {"ball": 12.1, "isHighlight": false, "text": "Gopal to Saha,no run,tossed up again, and Saha wristily pushes it back to the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Gopal to Saha,1 run,that's some exaggerated flight. Saha presses forward and drives to deep cover"}, {"ball": 12.3, "isHighlight": false, "text": "Gopal to Bailey,no run,slow and loopy again, goes with the angle. Bailey is well forward to defend"}, {"ball": 12.4, "isHighlight": false, "text": "Gopal to Bailey,2 runs,Bailey is drawn forward by the flight, and was possibly looking to play it towards cover, but it goes with the angle, hits the inside half of his bat, and trickles into the leg side"}, {"ball": 12.5, "isHighlight": false, "text": "Gopal to Bailey,1 run,a touch short, and he rocks back to cut to the sweeper"}, {"ball": 12.6, "isHighlight": false, "text": "Gopal to Saha,no run,lovely flight. Saha is down the track but doesn't get to the pitch. It's a googly, and he pushes it back to the bowler"}, {"ball": 13.1, "isHighlight": false, "text": "Ojha to Bailey,2 runs,sees Bailey down the pitch, pushes it towards his pads, flicked towards deep square leg"}, {"ball": 13.2, "isHighlight": false, "text": "Ojha to Bailey,no run,short and wide, Bailey cuts, and Rayudu makes a good stop, scrambling to his right at point"}, {"ball": 13.3, "isHighlight": false, "text": "Ojha to Bailey,no run,slower this time, and Bailey looks to push it towards long-on but Ojha runs across to stop it"}, {"ball": 13.4, "isHighlight": false, "text": "Ojha to Bailey,no run,Rayudu is made to work again as Bailey cuts to his right"}, {"ball": 13.5, "isHighlight": false, "text": "Ojha to Bailey,1 run,flat and into Bailey's pads, flicked to deep backward square leg"}, {"ball": 13.6, "isHighlight": false, "text": "Ojha to Saha,no run,short and outside off, Saha can't time this cut, and Rayudu stops it again"}, {"ball": 13.6, "isHighlight": false, "text": "babu: \"Miller not looking so happy sitting outside and talking with Commentator \" Yeah, he isn't really beaming in joy :)"}, {"ball": 14.1, "isHighlight": false, "text": "Bumrah to Bailey,no run,typical Bumrah delivery, angled in from wide of the crease, and Bailey is beaten trying to cut"}, {"ball": 14.2, "isHighlight": false, "text": "Bumrah to Bailey,no run,good ball, that! might have straightened a touch (which doesn't change the inward angle all that much), and Bailey is beaten trying to poke it towards point"}, {"ball": 14.3, "isHighlight": false, "text": "Bumrah to Bailey,1 run,fuller, angled towards the pads, pushed to long-on"}, {"ball": 14.4, "isHighlight": false, "text": "Bumrah to Saha, $$OUT$$ ,direct hit! Saha swings hard at this full ball, but doesn't time it. Rayudu ran in from mid-on and sent in a flat, powerful throw that hit the base of the stumps at the bowler's end with Saha well short of the crease"}, {"ball": 14.4, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$run$$ $$out$$ $$3$$ $$(11m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$37.50$$"}, {"ball": 14.4, "isHighlight": false, "text": "Aayush: \"am not saddened by Maxi's wicket although i have thoroughly enjoyed watching him play this season.... he saved my some 45 mins(9 overs) to prepare for tomorrow's microprocessor exam. STUDENT MODE:ON now!\""}, {"ball": 14.4, "isHighlight": false, "text": "zafarjaveds: \"All the unusual bowling actions go to Mumbai Indians? Malinga, Bumrah and Gopal.\""}, {"ball": 14.4, "isHighlight": false, "text": "Akshar Patel is the new batsman"}, {"ball": 14.5, "isHighlight": false, "text": "Bumrah to Bailey,1 run,back of a length ball, Bailey cuts off the front foot to the off-side sweeper"}, {"ball": 14.5, "isHighlight": false, "text": "around the wicket to the left-handed Akshar"}, {"ball": 14.6, "isHighlight": false, "text": "Bumrah to Patel,1 run,angled in, cramps Akshar for room, tucks it towards square leg for a quick single"}, {"ball": 14.6, "isHighlight": false, "text": "sh: \"Dear Aayush, I think you are not studying while commenting in cricinfo. Your Dad.\""}, {"ball": 14.6, "isHighlight": false, "text": "Time-out (I didn't notice this, sorry) ends, and Santokie resumes"}, {"ball": 15.1, "isHighlight": false, "text": "Santokie to Patel,no run,slower ball, outside off, and Patel tries to cut but can only chop it onto the pitch"}, {"ball": 15.2, "isHighlight": false, "text": "Santokie to Patel,no run,slower ball again, comes back into Patel a touch, and he defends it back to the bowler"}, {"ball": 15.3, "isHighlight": false, "text": "Santokie to Patel, $$FOUR$$ ,lovely shot. It's angled into the pads and full, and Akshar twirls his wrists to pick it up over midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Santokie to Patel,1 run,slower ball, flicked towards square leg from outside off"}, {"ball": 15.5, "isHighlight": false, "text": "Santokie to Bailey, $$FOUR$$ ,short and wide, and Bailey cuts this hard, past the right hand of a diving point fielder"}, {"ball": 15.6, "isHighlight": false, "text": "Santokie to Bailey,no run,that's an extremely slow slower ball, and Bailey waits an age before cutting it, off the front foot, to point"}, {"ball": 15.6, "isHighlight": false, "text": "Malav: \"Who would've thought Punjab could go 40 balls without a boundary this season!?\" Who, indeed. This has been some comeback from Mumbai. PK comes back now, around the wicket to Patel."}, {"ball": 16.1, "isHighlight": false, "text": "Kumar to Patel, $$OUT$$ ,whoops. Soft dismissal? That's a full toss, and Patel has popped that straight to cover. They're checking for height, and it's......... just under the waist. That's out."}, {"ball": 16.1, "isHighlight": false, "text": "$$AR$$ $$Patel$$ $$c$$ $$Sharma$$ $$b$$ $$Kumar$$ $$6$$ $$(9m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 16.1, "isHighlight": false, "text": "One former Mumbai Indian replaces another. Here's Rishi Dhawan now."}, {"ball": 16.2, "isHighlight": false, "text": "Kumar to Dhawan, $$FOUR$$ ,short, outside off, and Rishi has timed this pull beautifully in front of square. Deep midwicket had no chance, running left."}, {"ball": 16.3, "isHighlight": false, "text": "Kumar to Dhawan,no run,back of a length, outside off, and it keeps a little low. Rishi squirts it towards point."}, {"ball": 16.4, "isHighlight": false, "text": "Kumar to Dhawan,1 run,back of a length again, outside off again, and Rishi slaps it in front of point"}, {"ball": 16.5, "isHighlight": false, "text": "Kumar to Bailey,1 run,full-toss on the stumps, and Bailey flicks it to wide long-on. He wanted two, but Rishi sent him back"}, {"ball": 16.6, "isHighlight": false, "text": "Kumar to Dhawan,1 run,down the pitch, gets inside the line, and lofts it over cover. Doesn't get too much behind it, and it bounces down to Lendl Simmons on the boundary"}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Dhawan,1 run,wide of the crease, angled in towards the top of off stump, Rishi opens his face and pushes it behind point"}, {"ball": 17.1, "isHighlight": false, "text": "Andrew: \"No matter how many boundaries you can hit, a dot ball percentage of 51% is just not good enough. You have to have a backup plan when plan A doesn't work out.\""}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to Bailey,2 runs,slower ball, outside off, and Bailey doesn't quite time his slog across the line, streaks away towards deep square leg"}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to Bailey,2 runs,slower ball, outside off, swept (?) to long-on"}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Bailey,no run,full, outside off, Bailey can't get hold of this drive, goes straight to cover. Rohit throws at the stumps, misses, direct hit would have beaten Bailey's dive"}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Bailey, $$FOUR$$ ,you're a lucky man, Mr. Bailey. That's full, outside off, and Bailey makes room to drive through cover, gets a thick edge past the keeper"}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Bailey,1 run,full and angled into the pads, almost in the blockhole, heaved to long-on"}, {"ball": 17.6, "isHighlight": false, "text": "43 for 4 in the last eight overs"}, {"ball": 18.1, "isHighlight": false, "text": "Santokie to Bailey,2 runs,that's a terrible delivery. Drags this short and down the leg side, and Tare can't collect cleanly"}, {"ball": 18.2, "isHighlight": false, "text": "Santokie to Bailey,no run,slower ball, and Bailey inside-edges this attempted cover drive onto his pads. He's struggling to time the ball"}, {"ball": 18.3, "isHighlight": false, "text": "Santokie to Bailey,1 run,slower ball again, chipped to long-off."}, {"ball": 18.4, "isHighlight": false, "text": "Santokie to Dhawan, $$FOUR$$ ,that is really well played. Made it looked much simpler than it must have been. That was full and wide of off stump, and he's walked across and lapped it over the stumps and well out of range of short fine leg"}, {"ball": 18.5, "isHighlight": false, "text": "Santokie to Dhawan,1 run,couple of steps down the pitch, pushes this length ball down to long-off"}, {"ball": 18.6, "isHighlight": false, "text": "Santokie to Bailey, $$SIX$$ ,slower ball again, but it's short, and Bailey has all the time in the world to go deep in his crease and pull that over square leg"}, {"ball": 19.1, "isHighlight": false, "text": "Bumrah to Dhawan,1 run,slower ball, it ends up as a full toss outside off, and Rishi slaps it to the sweeper"}, {"ball": 19.2, "isHighlight": false, "text": "Bumrah to Bailey, $$SIX$$ ,that's another full-toss, and Bailey didn't seem to time it at all, but it sails over the bowler's head and comfortably clears the boundary."}, {"ball": 19.3, "isHighlight": false, "text": "Bumrah to Bailey, $$OUT$$ ,another slower ball, outside off, and that bottom-handed shovel-sweep goes high in the air and drops into Rayudu's hands at deep midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$c$$ $$Rayudu$$ $$b$$ $$Bumrah$$ $$39$$ $$(41m$$ $$30b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$130.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "Bumrah to Dhawan,1 run,low full-toss on the stumps, pushed to cover. The throw went to the keeper's end, where the batsman was comfortably home"}, {"ball": 19.4, "isHighlight": false, "text": "What can Beuran Hendricks do here?"}, {"ball": 19.5, "isHighlight": false, "text": "Bumrah to Hendricks, $$OUT$$ ,bowled! that's another slower ball, which crashes into the stumps as Hendricks takes a big back-and-across step and swings across the line."}, {"ball": 19.5, "isHighlight": false, "text": "$$BE$$ $$Hendricks$$ $$b$$ $$Bumrah$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Last ball. Shivam Sharma to face."}, {"ball": 19.6, "isHighlight": false, "text": "Bumrah to Shivam Sharma,1 run,into the blockhole, and it's driven to mid-off"}, {"ball": 19.6, "isHighlight": false, "text": "Kings XI made 90 in the first 10 overs and only 66 in the last 10. Mumbai's bowlers realised this wasn't as good a pitch to bat on as everyone had initially thought. Shreyas Gopal profited from slowing down his deliveries, while Bumrah and Santokie used their change of pace pretty well. Mumbai beat Kings XI the last time these two sides met. Can they do the double? Wait and watch."}], "name": "Kings XI Punjab v Mumbai Indians", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734025.html?innings=1;view=commentary", "match_num": 48}