{"commentary": [{"ball": 0, "isHighlight": false, "text": "All set then. Kings XI have a below-par total to defend here but this Mumbai batting can be fragile too. How well are there bowlers going to respond? Hussey and Simmons, who added more than 100 in the last match, are here. Sandeep Sharma to open the bowling. One slip in place"}, {"ball": 0, "isHighlight": false, "text": "kartikeya junej: \"Punjab are atleast 20-30 runs short. This is going to be the easiest of chases if Sandeep Sharma does not find his right areas and rhythm. \""}, {"ball": 0.1, "isHighlight": false, "text": "Sandeep Sharma to Simmons,no run,length delivery wide outside off, Simmons throws his bat at that but finds the fielder at point. Not a great ball to start"}, {"ball": 0.2, "isHighlight": false, "text": "Sandeep Sharma to Simmons, $$FOUR$$ ,easy pickings for Simmons! He doesn't move his feet but he doesn't need to. It's a gentle-paced loosener wide outside off and he hammers it through covers"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Simmons,1 wide,this one swings down the leg side and is duly called a wide"}, {"ball": 0.3, "isHighlight": false, "text": "Sandeep Sharma to Simmons,no run,here comes the big inswinger, surprises the batsman who was stuck on the crease, tucked to midwicket"}, {"ball": 0.3, "isHighlight": false, "text": "Four wickets and Sandeep can snatch that Purple cap from Bhuvneshwar.. Not sure if that would match with his kit though"}, {"ball": 0.4, "isHighlight": false, "text": "Sandeep Sharma to Simmons,no run,back of length, this is punched off the back foot, straight to the cover fielder"}, {"ball": 0.5, "isHighlight": false, "text": "Sandeep Sharma to Simmons, $$FOUR$$ ,enough of staying in the crease! He steps out and flat-bats the length delivery past a diving mid-on fielder. The man there did get a hand to it, but that had too much force on it"}, {"ball": 0.6, "isHighlight": false, "text": "Sandeep Sharma to Simmons, $$FOUR$$ ,this is timed through extra cover! Loose start for Kings XI. Simmons stays in the crease and punches it on the up through the tiny gap"}, {"ball": 0.6, "isHighlight": false, "text": "Beuran Hendricks, left-arm over"}, {"ball": 1.1, "isHighlight": false, "text": "Hendricks to Hussey,no run,into the blockhole, Hussey defends it into the off side"}, {"ball": 1.2, "isHighlight": false, "text": "Hendricks to Hussey,5 wides,slides down the leg side, and it hits Saha's right glove as he threw himself sideways"}, {"ball": 1.2, "isHighlight": false, "text": "Hendricks to Hussey,no run,comes back in sharply from back of a length, and cuts Hussey in half (not literally) as he tries to chop it to point"}, {"ball": 1.3, "isHighlight": false, "text": "Hendricks to Hussey,1 run,short, rising ball outside off, Hussey dabs it down to third man"}, {"ball": 1.4, "isHighlight": false, "text": "Hendricks to Simmons,no run,rises from back of a length, Simmons is on his toes to defend"}, {"ball": 1.5, "isHighlight": false, "text": "Hendricks to Simmons,no run,angled towards off stump, Lendl comes forward and plays a punchy drive to cover"}, {"ball": 1.6, "isHighlight": false, "text": "Hendricks to Simmons,1 run,back of a length, not much room, steered to third man off the back foot"}, {"ball": 1.6, "isHighlight": false, "text": "Suresh can see the future. \"Post match presentation comments: Bailey \" We are 20 runs short , but our bowlers tried their best to make the home crowd feel proud . We have one game left we will try to finish in top 2 \" On Miller's omission \"We tried to rotate our batsman and marsh responded well , its good to experiment before the play-offs\"\""}, {"ball": 2.1, "isHighlight": false, "text": "Sandeep Sharma to Simmons, $$FOUR$$ ,he had brought third man in and pushed point back, and he bowls it short and wide. Simmons cuts hard and late and it flies away into the gap"}, {"ball": 2.2, "isHighlight": false, "text": "Sandeep Sharma to Simmons,1 run,into the pads this time, and Simmons walks a single after flicking to deep square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Sandeep Sharma to Hussey,no run,length ball, angled across towards middle-and-off, and Hussey defends from the crease"}, {"ball": 2.4, "isHighlight": false, "text": "Sandeep Sharma to Hussey,1 run,tries to cut, not much room for that shot, gets it off the outside half of his bat down to third man"}, {"ball": 2.5, "isHighlight": false, "text": "Sandeep Sharma to Simmons,2 runs,lucky break for Simmons. it was banged in, outside off, and it rose quite high. Simmons tried to pull and top edged it high but safe, towards the third man boundary, where Beuran slides to pull the ball back just short of the ropes."}, {"ball": 2.6, "isHighlight": false, "text": "Sandeep Sharma to Simmons,1 run,short, angled down leg, but Simmons is into his pull too early. It hits the back of his bat and ricochets off his gloves into the point area"}, {"ball": 3.1, "isHighlight": false, "text": "Hendricks to Simmons,no run,length ball on the stumps, driven with a straight bat to wide mid-on."}, {"ball": 3.1, "isHighlight": false, "text": "What's happened here? Dharmasena has warned Beuran for running onto the pitch"}, {"ball": 3.2, "isHighlight": false, "text": "Hendricks to Simmons, $$FOUR$$ ,gives himself room, lifts this over cover from outside leg stump, goes bouncing down to the boundary"}, {"ball": 3.3, "isHighlight": false, "text": "Hendricks to Simmons,1 wide,he tried to make room here, and Beuran saw that and bowled a bouncer outside off. Beats Simmons' slash, it was out of his reach anyway, and the umpire calls a wide"}, {"ball": 3.3, "isHighlight": false, "text": "Hendricks to Simmons, $$FOUR$$ ,width this time, and Simmons had no need to make room to play his favourite flat-bat slash over the off side. Sliced over point this time."}, {"ball": 3.3, "isHighlight": false, "text": "Around the wicket now. This might be a result of that warning."}, {"ball": 3.3, "isHighlight": false, "text": "Darren Sammy, meanwhile, has tweeted this: @darrensammy88Oh my did anyone in ranchi felt that #earthquake. I swear someone was shaking my bed from under me."}, {"ball": 3.4, "isHighlight": false, "text": "Hendricks to Simmons, $$FOUR$$ ,change of angle hasn't worked. Bad ball. Drops it short, and Simmons pulls it over square leg."}, {"ball": 3.5, "isHighlight": false, "text": "Hendricks to Simmons,no run,that's short and wide and rising. Simmons has no chance of connecting, so he pulls out of his slash, and Saha takes it high above his head. Not called wide, but looked close."}, {"ball": 3.6, "isHighlight": false, "text": "Hendricks to Simmons,1 run,angled in, straightened away a touch, and Simmons steers it to third man"}, {"ball": 3.6, "isHighlight": false, "text": "Hendricks, from left-arm around, has a really difficult job on his hands. He has both third man and point back on the rope, so anything near the pads could disappear to the leg-side boundary. Maybe Bailey will have a new field for his next over."}, {"ball": 3.6, "isHighlight": false, "text": "Spin now, from Akshar Patel"}, {"ball": 4.1, "isHighlight": false, "text": "Patel to Simmons,no run,back of a length, punched to cover"}, {"ball": 4.2, "isHighlight": false, "text": "Patel to Simmons, $$FOUR$$ ,gives himself a bit of room this time, and places the cut perfectly past point"}, {"ball": 4.3, "isHighlight": false, "text": "Patel to Simmons,no run,makes room again, and cuts from a middle-stump line. Point throws himself to his left to stop that"}, {"ball": 4.4, "isHighlight": false, "text": "Patel to Simmons, $$FOUR$$ ,the umpire is sent ducking, Simmons flat-bats this length ball hard and straight."}, {"ball": 4.5, "isHighlight": false, "text": "Patel to Simmons,1 run,swept to square leg. Was a bit too full to really get hold of that shot"}, {"ball": 4.6, "isHighlight": false, "text": "Patel to Hussey,1 run,on the pads, and Hussey nudges it off them to deep square leg"}, {"ball": 4.6, "isHighlight": false, "text": "pallav: \"not only in ranchi....i live in jamshedpur (140 kms away) i also felt the earthquake....my laptop was shaking\""}, {"ball": 5.1, "isHighlight": false, "text": "Dhawan to Hussey,1 run,Angled across Hussey, length ball, steered to third man"}, {"ball": 5.2, "isHighlight": false, "text": "Dhawan to Simmons,2 runs,angled onto the hips, not a great idea when fine leg is in the circle. He tucks it past that fielder, but deep square leg runs around and stops it. Uh oh. What happened there? Simmons pulled up after completing his first run, and hopped all the way while running his second. He seems in pain here. He's holding his right ankle."}, {"ball": 5.2, "isHighlight": false, "text": "Back on his feet now"}, {"ball": 5.3, "isHighlight": false, "text": "Dhawan to Simmons, $$FOUR$$ ,once again, he's angled it into Simmons' hips, and he flicks it up and over short fine leg"}, {"ball": 5.4, "isHighlight": false, "text": "Dhawan to Simmons,1 run,better line now. In towards off stump, back of a length, and Simmons reaches his fifty with a quick single to cover. Ran that pretty quickly, so his ankle must be okay."}, {"ball": 5.5, "isHighlight": false, "text": "Dhawan to Hussey,no run,onto the pads, but Hussey can't connect as he tries to flick. His the pad and pops up into the off side"}, {"ball": 5.6, "isHighlight": false, "text": "Dhawan to Hussey,1 run,angled across, and that's pretty much been Hussey's only run-scoring zone so far, the steer down to third man"}, {"ball": 5.6, "isHighlight": false, "text": "Portentous statement from James. \"Beware of right handed West Indian openers who can't run. Yes, I remember Gordon Greenidge.\" Oh yes.  $$That$$  Lord's double-century."}, {"ball": 5.6, "isHighlight": false, "text": "Comments coming in from all over - Chennai, Visakhapatnam, Patna and so forth - confirming tremors in these regions."}, {"ball": 5.6, "isHighlight": false, "text": "Looks like they've taken a time-out. Hussey has only faced nine balls in six overs."}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Hussey,1 run,slow, tossed-up, onto the pads, and Hussey is happy to get away from strike with a little nudge down to deep square leg"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to Simmons, $$FOUR$$ ,comes forward and is probably looking towards the cover region, gets an outside edge that streaks away past short third man"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to Simmons,1 run,goes with the angle towards off stump, and Simmons comes forward to tap it towards point"}, {"ball": 6.4, "isHighlight": false, "text": "Patel to Hussey,no run,angled across Hussey, who times his reverse-sweep well but finds short third man"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to Hussey,no run,defended into the off side from the crease"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to Hussey, $$OUT$$ ,bowled him! that turned and skidded through. Hussey tried to work it across the line and missed. Hit the top of off stump."}, {"ball": 6.6, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Patel$$ $$6$$ $$(34m$$ $$13b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$46.15$$"}, {"ball": 6.6, "isHighlight": false, "text": "Shivam Sharma now, from around the wicket"}, {"ball": 7.1, "isHighlight": false, "text": "Shivam Sharma to Simmons, $$FOUR$$ ,that isn't too short, and it isn't wide, but he's back in a flash to cut that behind square. Races away to the boundary"}, {"ball": 7.2, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,tries to lap that, but doesn't quite get it off the middle, rolls down to short fine leg"}, {"ball": 7.2, "isHighlight": false, "text": "Rayudu on strike for the first time, right-arm over now"}, {"ball": 7.3, "isHighlight": false, "text": "Shivam Sharma to Rayudu,1 run,comes forward to this wide, full ball, and lofts it over cover. One bounce down to the man on the boundary"}, {"ball": 7.3, "isHighlight": false, "text": "back around the stumps to Lendl"}, {"ball": 7.4, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,on the pads, and flicked towards square leg"}, {"ball": 7.5, "isHighlight": false, "text": "Shivam Sharma to Rayudu,1 run,turns in from outside off. Rayudu waited and chopped it to short third man"}, {"ball": 7.6, "isHighlight": false, "text": "Shivam Sharma to Simmons,no run,full, almost in the blockhole, driven to wide mid-on"}, {"ball": 7.6, "isHighlight": false, "text": "Babu says there have been tremors in Chittagong as well"}, {"ball": 8.1, "isHighlight": false, "text": "Patel to Rayudu,2 runs,angled in towards the pads, and that's flicked over midwicket. Sandeep Sharma runs to his right from long-on and makes a good diving stop on the boundary"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to Rayudu,1 run,comes forward and eases it to deep extra cover"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to Simmons, $$FOUR$$ ,bit of air, and Simmons clears his front leg and flat-bats it brutally over the bowler's head"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to Simmons,1 run,short and wide, cut to deep cover point"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to Rayudu,1 run,down the pitch, pushed with a straight bat to wide long-off"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to Simmons,no run,flat, angled into the stumps, and Simmons defends carefully off the front foot"}, {"ball": 8.6, "isHighlight": false, "text": "VJain: \"MI should have sent in Pollard to finish this match off. If MI wins this in 14 overs, MI enters the positive NRR territory. They need that as much as they need to win all there matches. Why wait - they are winning this one for sure....just go for it!!\""}, {"ball": 9.1, "isHighlight": false, "text": "Shivam Sharma to Rayudu,1 run,tossed up, and Rayudu has to fetch this slog-sweep from way outside off, to deep midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Shivam Sharma to Simmons, $$SIX$$ ,Simmons takes one step down the pitch, gets low on one knee, and clouts that way over wide long-on"}, {"ball": 9.3, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,slogged hard, along the ground, to deep midwicket"}, {"ball": 9.4, "isHighlight": false, "text": "Shivam Sharma to Rayudu,1 run,down the track, hit hard down the ground. The bowler gets his left hand out to take some pace off the ball"}, {"ball": 9.5, "isHighlight": false, "text": "Shivam Sharma to Simmons,no run,that's wide of off stump. Simmons shapes to sweep, then changes his shot to what looks like an attempted dab to third man, is beaten"}, {"ball": 9.6, "isHighlight": false, "text": "Shivam Sharma to Simmons,2 runs,cut hard to the sweeper, Manan Vohra, who has to run hard to his left and dive to stop that"}, {"ball": 9.6, "isHighlight": false, "text": "Beuran Hendricks returns. Around the wicket again."}, {"ball": 10.1, "isHighlight": false, "text": "Hendricks to Rayudu,1 run,back of a length, angled in, and Rayudu jams that down, and it almost rolls onto the stumps"}, {"ball": 10.2, "isHighlight": false, "text": "Hendricks to Simmons,1 run,slower ball, short and wide, and it's cut to deep point"}, {"ball": 10.3, "isHighlight": false, "text": "Hendricks to Rayudu,2 runs,short, angled in, Rayudu bunts it down to third man with an open bat-face"}, {"ball": 10.4, "isHighlight": false, "text": "Hendricks to Rayudu,2 runs,short and wide again, and Rayudu cuts hard past point. Maxwell makes a super tumbling stop, running left from deep cover, before Marsh completed the fielding effort"}, {"ball": 10.5, "isHighlight": false, "text": "Hendricks to Rayudu,no run,short ball, dug in this time, and Rayudu is beaten trying to hook. That's one for the over, the umpire signals"}, {"ball": 10.6, "isHighlight": false, "text": "Hendricks to Rayudu,2 runs,slower ball, shortish, outside off, pulled to deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "\"Mohali crowd is getting to see Lendl Simmonjrekar instead of glendeep!!!\" Try harder, Sinbad. Or more accurately, don't try so hard!"}, {"ball": 11.1, "isHighlight": false, "text": "Dhawan to Simmons,no run,back of a length, outside off, beaten trying to cut"}, {"ball": 11.2, "isHighlight": false, "text": "Dhawan to Simmons, $$FOUR$$ ,Simmons has more width this time, and you don't give him that. That's cut with tremendous bat-speed, and third man has no chance, even though he didn't have too far to run"}, {"ball": 11.3, "isHighlight": false, "text": "Dhawan to Simmons,1 run,closer to off stump this time, and he opens his face to dab it behind point"}, {"ball": 11.4, "isHighlight": false, "text": "Dhawan to Rayudu,2 runs,slower ball, on the stumps, chipped straight back over the bowler"}, {"ball": 11.5, "isHighlight": false, "text": "Dhawan to Rayudu, $$OUT$$ ,He's gone! slower ball outside off, and Rayudu looks to give himself room and hit it over cover. Doesn't get the elevation, and hits it straight to Sehwag, at chest-height"}, {"ball": 11.5, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Sehwag$$ $$b$$ $$Dhawan$$ $$17$$ $$(18m$$ $$14b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$121.42$$"}, {"ball": 11.5, "isHighlight": false, "text": "Big Tummy does a little better: \"It's more like a Lendlkar show.\""}, {"ball": 11.5, "isHighlight": false, "text": "Rohit Sharma walks in, with 46 needed off 49"}, {"ball": 11.6, "isHighlight": false, "text": "Dhawan to Sharma,1 run,lets that come onto him and dabs it to third man. He didn't even move his bat there. Just angled it and let the ball hit it"}, {"ball": 11.6, "isHighlight": false, "text": "A lot of people mailing in, noting that the wicket fell at Nelson. Well spotted, but no prizes."}, {"ball": 12.1, "isHighlight": false, "text": "Patel to Sharma,no run,full and straight, defended back to the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to Sharma,no run,back of a length, pushed to cover"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to Sharma,no run,angled in, goes with the arm. Rohit dabs it behind point, looks for the single, is sent back"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to Sharma,no run,Rohit dabs it behind point again, no single again"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to Sharma,1 wide,this one is fired down leg. Rohit tries to lap it, and misses"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to Sharma,1 run,slower, tossed up, Rohit comes forward and plays a checked drive to the sweeper"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Simmons,no run,sees Simmons skip down the pitch and fires it into his pads. Simmons pushes it back to the bowler, who throws hard to the keeper, but the batsman is back in his crease"}, {"ball": 13.1, "isHighlight": false, "text": "Dhawan to Sharma,1 run,angles this into the pads, flicked behind square leg"}, {"ball": 13.2, "isHighlight": false, "text": "Dhawan to Simmons,1 run,slower ball on the stumps, takes a long time to get to the batsman, who pushes it to long-on with a straight bat"}, {"ball": 13.3, "isHighlight": false, "text": "Dhawan to Sharma,no run,another of those slower leg-cutters, on the stumps. Defended off the front foot"}, {"ball": 13.4, "isHighlight": false, "text": "Dhawan to Sharma,no run,stump-to-stump leg-cutter again. He doesn't really get any movement on these, though. Batsman defends back to the bowler."}, {"ball": 13.5, "isHighlight": false, "text": "Dhawan to Sharma,1 run,fuller this time, and Rohit drives it to long-off"}, {"ball": 13.6, "isHighlight": false, "text": "Dhawan to Simmons,1 run,he was looking to premeditate here. Don't know what he was trying, really. Stuck his front foot out towards square leg, but moved it back to an orthodox position when he saw the stump-to-stump ball and tucked it carefully into the leg side"}, {"ball": 13.6, "isHighlight": false, "text": "Sandy now, from right-arm around"}, {"ball": 14.1, "isHighlight": false, "text": "Sandeep Sharma to Simmons,no run,comes forward, drives it to cover"}, {"ball": 14.2, "isHighlight": false, "text": "Sandeep Sharma to Simmons, $$SIX$$ ,down the pitch, gives himself a lot of room. Sandy bowls it on the stumps, and Simmons has a lot of room to swing his bat through the line and launch it onto the sightscreen"}, {"ball": 14.3, "isHighlight": false, "text": "Sandeep Sharma to Simmons,2 runs,full, onto the pads, flicked to deep midwicket, tyrns back for the second and beats the throw to the keeper. Into the nineties now"}, {"ball": 14.4, "isHighlight": false, "text": "Sandeep Sharma to Simmons,1 run,full, on the pads, pushed down the ground towards long-on. Sandy runs back to field it."}, {"ball": 14.5, "isHighlight": false, "text": "Sandeep Sharma to Sharma, $$FOUR$$ ,slower ball, but it's short. Rohit waits, adjusts his feet to open up slightly, and pulls it powerfully over midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Sandeep Sharma to Sharma,2 runs,that's full and outside leg stump. Rohit had given himself a lot of room, and he drives it to sweeper cover"}, {"ball": 14.6, "isHighlight": false, "text": "Right through his innings, people have been mailing in saying Simmons is on course for the first century of the season. Now he definitely is."}, {"ball": 15.1, "isHighlight": false, "text": "Dhawan to Simmons,1 wide,down the leg side, and Saha collects neatly down the leg side and has the bails off in a flash. Such a good keeper, he is. But Simmons was in no danger."}, {"ball": 15.1, "isHighlight": false, "text": "Dhawan to Simmons,1 run,full, on off stump, pushed to cover"}, {"ball": 15.2, "isHighlight": false, "text": "Dhawan to Sharma, $$FOUR$$ ,short, not too wide, but wide enough for Rohit to cut witheringly past point"}, {"ball": 15.3, "isHighlight": false, "text": "Dhawan to Sharma,1 run,slower ball, angled towards leg and middle, pulled to deep midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Dhawan to Simmons,1 run,slower ball, outside off, Simmons leans forward and plays a checked drive to deep cover"}, {"ball": 15.5, "isHighlight": false, "text": "Dhawan to Sharma,no run,short and wide again, but Rohit's square cut finds point this time"}, {"ball": 15.6, "isHighlight": false, "text": "Dhawan to Sharma,1 run,that's a very slow slower ball, and Rohit waits before angling his bat face to dab it to third man"}, {"ball": 15.6, "isHighlight": false, "text": "*Plug alert* An hour to go have a shot at the daily leaderboard on  $$CricIQ$$ . Go for it."}, {"ball": 15.6, "isHighlight": false, "text": "They've taken a time out, and Vamsy has this question. \"Playing for MI changed Dwayne Smith a lot, bringing him back to the national team. Is this Simmons' turn now?\" Simmons is already part of the West Indies team, no?"}, {"ball": 15.6, "isHighlight": false, "text": "Here's Shivam, from around the wicket once more"}, {"ball": 16.1, "isHighlight": false, "text": "Shivam Sharma to Sharma,1 run,tucked away to deep midwicket for the strolled single"}, {"ball": 16.2, "isHighlight": false, "text": "Shivam Sharma to Simmons,no run,angled across Simmons, who pushes it to cover off the back foot"}, {"ball": 16.3, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,down the pitch, it's a high full-toss, and he hits it to deep midwicket. Didn't quite time it."}, {"ball": 16.4, "isHighlight": false, "text": "Shivam Sharma to Sharma,1 run,short, and Rohit pulls uppishly but on the bounce to deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,down the pitch, gets too close to the pitch, hits it hard to long-on"}, {"ball": 16.6, "isHighlight": false, "text": "Shivam Sharma to Sharma,no run,clears his front leg, hits his hard down the ground, along the ground, but Shivam's hand is in the way. He took a painful blow, there."}, {"ball": 16.6, "isHighlight": false, "text": "Hari IISc: \"It will be quite an irony that the first century of the season comes against KXIP\""}, {"ball": 16.6, "isHighlight": false, "text": "Hendricks now, left-arm around the wicket"}, {"ball": 17.1, "isHighlight": false, "text": "Hendricks to Simmons,1 wide,He's struggled with these shifts in angle, and his first ball slides well wide of leg stump"}, {"ball": 17.1, "isHighlight": false, "text": "Hendricks to Simmons,1 run,this was short, angling down leg again, and Simmons pulls it to deep backward square leg"}, {"ball": 17.2, "isHighlight": false, "text": "Hendricks to Sharma, $$OUT$$ ,that's such a soft dismissal. it's banged in, and Rohit had given himself room. He looks to ramp it and gets it off the middle of his bat, but it drops into Sandy's hands at third man. Was he looking to hit that a bit finer?"}, {"ball": 17.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$Sandeep$$ $$Sharma$$ $$b$$ $$Hendricks$$ $$18$$ $$(25m$$ $$20b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$90.00$$"}, {"ball": 17.2, "isHighlight": false, "text": "Kieron Pollard comes in now. Mumbai need 9, Simmons needs 3."}, {"ball": 17.3, "isHighlight": false, "text": "Hendricks to Pollard,1 run,down the pitch, flicks it between deep square leg and deep midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "Hendricks to Simmons,1 run,angled in and full, Simmons chips it down to long-on"}, {"ball": 17.5, "isHighlight": false, "text": "Hendricks to Pollard,no run,down the pitch, a bit of bounce, and Pollard takes his bottom hand off to defend into the leg side"}, {"ball": 17.6, "isHighlight": false, "text": "Hendricks to Pollard,no run,walks down the pitch once more. This is angled down leg, and Pollard is looking to get out of the way and get the wide, but it clips his thigh pad"}, {"ball": 18.1, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,tossed up, full, Simmons flicks it to wide long-on. Pollard wanted the second, but Simmons sent him back."}, {"ball": 18.2, "isHighlight": false, "text": "Shivam Sharma to Pollard,no run,tossed up, onto the stumps, driven to short midwicket"}, {"ball": 18.3, "isHighlight": false, "text": "Shivam Sharma to Pollard,1 run,onto the pads, flicked down to deep square leg"}, {"ball": 18.3, "isHighlight": false, "text": "He's on 99 now."}, {"ball": 18.4, "isHighlight": false, "text": "Shivam Sharma to Simmons,no run,full. Low full-toss, and he pushes it to mid-off"}, {"ball": 18.5, "isHighlight": false, "text": "Shivam Sharma to Simmons,1 run,there it is! It's on the pads again, and he clips it to deep midwicket. Jumps up to complete the single, before punching gloves with Pollard."}, {"ball": 18.6, "isHighlight": false, "text": "Shivam Sharma to Pollard, $$SIX$$ ,He has the license to go hard now, and he does just that. It's full, floated up into his hitting zone, and he swings it way over long-on."}, {"ball": 18.6, "isHighlight": false, "text": "That's it from us tonight. I hope you enjoyed the game. Keep coming back for our commentary, and keep sending in your comments. Good night!"}, {"ball": 18.6, "isHighlight": false, "text": "One last comment, before we're done for the day, from Nandakiran N. \"First 100 of this year's IPL by Simmons. Pollard brought up the 300th six of his T20 career (Only next to Gayle who leads with 435). Santokie picked up his 100th T20 wicket, fastest to get there. Too much to celebrate for WI in one day.\""}, {"ball": 18.6, "isHighlight": false, "text": "Presentation time.  $$Rohit$$ $$Sharma$$  signs the match ball, and says he's keeping his fingers crossed, with regards to qualifying. \"Anything is possible. The important aspect is, we go back to Bombay, and we hope we put up the performance that is expected of us.\""}, {"ball": 18.6, "isHighlight": false, "text": "$$Simmons$$ , unsurprisingly, is the MoM. \"Was a very good moment to me, was very excited when I got the call for Mumbai.\" Asked which shot he enjoyed the most, of all the ones he'd played today: \"I like playing my slog sweep, so I enjoyed that one.\""}, {"ball": 18.6, "isHighlight": false, "text": "Suresh: \"Looking at these West Indians, I wish IPL was 10 years older, Brian Lara would have set the stage on fire!\""}, {"ball": 18.6, "isHighlight": false, "text": "$$Anil$$ $$Kumble$$  says he can't put a finger on what went wrong in the UAE. \"I thought the bowlers did exceptionally well to bring the total down to 156. Shreyas Gopal picked up those two wickets, really nice to do a young legspinner doing well.\" He says all the legspinners have done really well for their teams. \"Really glad. Legspinners are attacking bowlers.\""}, {"ball": 18.6, "isHighlight": false, "text": "Don: \"Seriously what is MI doing here, i know it may be the gentlemanly thing to let Simmons get to his 100 here, but MI really couldn't afford to take 2-3 overs just taking a couple of singles to let him get to his 100. I wonder if the NRR they lost from not finishing the match of quick is gonna cost MI a place in the play offs. Honestly, Simmons would have gotten a lot more respect in my books if he had carried on playing aggressively and try and finish the match of rather than just take singles and get to that 100.\" Lots of people mailing in, saying the same thing."}, {"ball": 18.6, "isHighlight": false, "text": "$$George$$ $$Bailey$$  says it was the sort of pitch where it would have been good to chase. You'd have to agree. It did get a little quicker in the second half of the game."}, {"ball": 18.6, "isHighlight": false, "text": "Comfortable win for Mumbai, who have jumped to fifth on the table, with their net run rate taking them above Royal Challengers and Sunrisers for now. Fantastic century from Simmons. Played some outstanding shots, particularly those flat-batted hits down the ground and those fierce square cuts. Kings XI paid for a poor second half of their innings, after a pretty good start, and their bowling wasn't good enough to defend 156 on a good batting pitch. Mumbai have done the double over Kings XI this season."}], "name": "Kings XI Punjab v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734025.html?innings=2;view=commentary", "match_num": 48}