{"commentary": [{"ball": 0, "isHighlight": false, "text": "Gambhir and Uthappa walk out to open"}, {"ball": 0, "isHighlight": false, "text": "$$3.45pm$$  15 minutes to go. You could get in all your three shots  $$at$$ $$CricIQ$$  for today. And who knows, you could be on the flight to London to watch India play at Lord's this summer."}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm:$$ $$Kohli$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$RCB$$ $$will$$ $$bowl$$"}, {"ball": 0, "isHighlight": false, "text": "For RCB, Dinda in for Aaron, and Takawale in for Parthiv"}, {"ball": 0, "isHighlight": false, "text": "For KKR, Morne Morkel in for Cummins, and Vinay in for Piyush"}, {"ball": 0, "isHighlight": false, "text": "Kohli says the pitch played better under lights in the previous game here, and he is hoping for the same today. Gambhir says he was a bit confused about what to do. Batting first now could work in favour of his spinners, he adds"}, {"ball": 0, "isHighlight": false, "text": "----------- Anjan: \"For those who are against picking Dinda - I think they have picked him because he plays for Bengal in the Ranji Trophy and that he has a better idea how this pitch behaves than Aaron does. Otherwise, there is not much difference between Dinda and Aaron.\""}, {"ball": 0, "isHighlight": false, "text": "Subradeep: \"\"Parthiv Patels name should have been there in the playing XI. He has given superb starts to RCB throughout the tournament. Very surprised to see Takawale in his place and that too in this crucial match\"\""}, {"ball": 0, "isHighlight": false, "text": "Gareth: \"So Morkel has been spanked around this IPL, and despite a good showing against CSK no less, Cummins only gets one match. Poor choice Gauti. \""}, {"ball": 0, "isHighlight": false, "text": "Shahed: \"It's been a disappointing season for RCB. They do not have a balanced team say like CSK or KXIP. Further they are averse to taking risk in allowing newer talents to perform (like the Rajasthan Royals do). They need a rethink of their strategy. Four star batsmen in an XI is too much. Doesn't give the captain or the management the freedom to maneuver. As much as I am an RCB fan, I do not think they are there yet, as a team.\""}, {"ball": 0, "isHighlight": false, "text": "Gourav: \"I really don't understand why KKR management is taking continuous chance with Manish. He is struggling in every match. Why don't they think of Debabrata as an option?\""}, {"ball": 0, "isHighlight": false, "text": "Keshabraj: \"RCB don't have any other bowler than Dinda and Aaron? I think they should have one who can bowl at death.. for me it does not make any sense either Dinda or Aaron because they both are poor at death overs.. :( \""}, {"ball": 0, "isHighlight": false, "text": "Karthik: \"RCB's playing XI selection is just baffling. Aaron is any day better than Dinda. At least the former's got genuine pace which might create some opportunities, while the latter bowls at \"Please hit me out of the park\" lengths.\""}, {"ball": 0, "isHighlight": false, "text": "Andrew: \"One could argue that six batsmen is all you need in a short game like T20. However, I think that RCB are a bit light in this regard if Rana is the number six batsman. Surely they could have fitted in Parthiv and chosen between Rana and Dinda?\""}, {"ball": 0, "isHighlight": false, "text": "$$3.10pm$$  Welcome to our coverage of the 49th match of the season between KKR and RCB in Kolkata. Simple equation for RCB this afternoon. They win, they stay in the tournament. They lose, they are out. KKR win, they enter the playoffs. KKR lose, well, they stay on 14 points"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Uthappa,1 run,starts good length, just outside off, moves it in a tad, Uthappa leans forward and taps it softly to get off the mark"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Gambhir, $$FOUR$$ ,slips this length ball into the left-hander's pads, and Gambhir happily tickles it fine"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Gambhir,no run,gets the line right, bowls it full just outside off, swings away a touch, Gambhir pushes it to point"}, {"ball": 0.3, "isHighlight": false, "text": "Tanmoy Das: \"I do not thing dropping Chawla is a right choice, 3spinner formula is working fantastic for KKR and Eden is heaven for spinners\""}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Gambhir,no run,back of a length, moving away outside off, Gambhir tries to dab it late, is beaten"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Gambhir, $$OUT$$ ,second time Starc goes down the leg side to Gambhir, and this time he's gifted with the captain's wicket, a short of a length delivery climbs a bit, Gambhir tries to tickle it fine again, but only nicks it through to the keeper"}, {"ball": 0.5, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$†Takawale$$ $$b$$ $$Starc$$ $$4$$ $$(4m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "Manish Pandey"}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Pandey,no run,gets a short of a length ball, hops and brings it down onto the pitch"}, {"ball": 0.6, "isHighlight": false, "text": "kalyan: \"One man who has changed the fortunes of KKR is Robin Uthappa. This what happens when a dangerous batsman is in full form\""}, {"ball": 0.6, "isHighlight": false, "text": "Dinda to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Dinda to Uthappa,no run,pitches it up just outside off to start, Uthappa moves forward and pushes solidly to mid on"}, {"ball": 1.2, "isHighlight": false, "text": "Dinda to Uthappa,1 run,hits it in the air as he pushes at a length ball moving away and rising, falls well short of point though"}, {"ball": 1.3, "isHighlight": false, "text": "Dinda to Pandey, $$FOUR$$ ,Pandey is away, opens the face on this full and wide outswinger and eases it between cover-point and cover"}, {"ball": 1.4, "isHighlight": false, "text": "Dinda to Pandey,no run,now he takes a couple of steps down the track, but can only play out the length ball to point"}, {"ball": 1.5, "isHighlight": false, "text": "Dinda to Pandey,no run,loose, Pandey follows this from the crease as it kicks and jags away from short of a length, and is beaten"}, {"ball": 1.6, "isHighlight": false, "text": "Dinda to Pandey,1 wide,bouncer now, well outside off, Pandey tries to hook weeakly, misses, it is over his head and called a wide for height"}, {"ball": 1.6, "isHighlight": false, "text": "Dinda to Pandey, $$FOUR$$ ,Pandey survives again, he pushes uncertainly at a length ball outside off, and the thick inside edge flies to the fine leg boundary"}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Uthappa,1 run,Starc pitches it up just outside off, Uthappa flows forward and pushes it to the left of mid off for one, some inswing for Starc there"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Pandey,1 run,Pandey in no control of the front-foot pull as Starc digs it short of a length at nearly 147 kph, it pops up in front of square"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Uthappa,1 run,nicely across and forward to push a length delivery to cover for one"}, {"ball": 2.3, "isHighlight": false, "text": "Naman: \"The way Manish Pandey hangs his bat while playing balls outside the off-stump, reminds me of the times when I practiced slip-catching\""}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Pandey,no run,had the width on this full delivery, also created some by pushing back leg towards the on side, but thumped it straight to Gayle at cover-point"}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Pandey,no run,a slower one, bowled very wide again, Pandey stretches for it, connects again, but picks out cover now"}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Pandey, $$FOUR$$ ,finally hits the gap as he goes leg side this time, and forces a pitched up delivery through midwicket"}, {"ball": 3.1, "isHighlight": false, "text": "Dinda to Uthappa,1 run,tight start to the over with a length ball climbing around off, Uthappa is quick on the front foot and pushes it towards mid on for a single"}, {"ball": 3.2, "isHighlight": false, "text": "Dinda to Pandey,no run,Pandey walks down the track and outside off stump but cannot push a length ball past cover"}, {"ball": 3.3, "isHighlight": false, "text": "Dinda to Pandey,no run,and again, he moves outside off stump in the crease now, Dinda goes wider, and Pandey slaps it straight to cover once more"}, {"ball": 3.4, "isHighlight": false, "text": "Dinda to Pandey, $$OUT$$ ,Pandey picks out another fielder, and this time on the full, he slashes at a bouncing length delivery, Starc moves quickly to his right at third man and takes the catch"}, {"ball": 3.4, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$c$$ $$Starc$$ $$b$$ $$Dinda$$ $$13$$ $$(15m$$ $$12b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$108.33$$"}, {"ball": 3.5, "isHighlight": false, "text": "Dinda to Uthappa,no run,tries to drive this length ball on the up but checks his shot to the bowler as he cannot time it"}, {"ball": 3.6, "isHighlight": false, "text": "Dinda to Uthappa,5 runs,another mistimed shot, and this could have been dangerous, Uthappa came forward to try the drive again but it seemed to stop on him, and he ended up popping it towards mid off, fell well short, and Kohli had a go at the non-striker's stumps with no chance of catching Uthappa short, concedes four overthrows"}, {"ball": 3.6, "isHighlight": false, "text": "Abu Nechim to bowl"}, {"ball": 4.1, "isHighlight": false, "text": "Ahmed to Uthappa,1 leg bye,could have been close as Uthappa is hit on the pad as he shuffles across just outside the crease, Nechim moves it in to beat the bat, but that hit the pad quite high, well above the knee roll"}, {"ball": 4.2, "isHighlight": false, "text": "Ahmed to Pathan, $$FOUR$$ ,Yusuf is away first ball as he lifts this length delivery off his pad in front of square leg"}, {"ball": 4.3, "isHighlight": false, "text": "Ahmed to Pathan,no run,plays out a length ball towards point"}, {"ball": 4.4, "isHighlight": false, "text": "Ahmed to Pathan,no run,nudges this back of a length ball to midwicket, Uthappa wants the single and is halfway up the pitch before he turns back"}, {"ball": 4.5, "isHighlight": false, "text": "Ahmed to Pathan,1 run,arches back a bit and steers a length ball outside off to third man"}, {"ball": 4.6, "isHighlight": false, "text": "Ahmed to Uthappa,1 run,comes forward and across and pushes a length length ball to the right of mid on for one"}, {"ball": 4.6, "isHighlight": false, "text": "Milind: \"Not a good move to send Yusuf at No. 4. He is death over specialist. Right now they needed a player like Shakib who can rotate strike, build partnership . A wicket at this stage would make it worse for KKR\""}, {"ball": 4.6, "isHighlight": false, "text": "Muralitharan to bowl"}, {"ball": 5.1, "isHighlight": false, "text": "Muralitharan to Uthappa,1 run,gets away with a tossed up ball down the leg side as Uthappa sweeps straight to short fine leg"}, {"ball": 5.2, "isHighlight": false, "text": "Muralitharan to Pathan,1 run,comes across and works a flat good length offbreak to square leg"}, {"ball": 5.3, "isHighlight": false, "text": "Muralitharan to Uthappa,1 wide,tosses it up well down the leg side, Uthappa misses as he tries to nudge it fine"}, {"ball": 5.3, "isHighlight": false, "text": "Muralitharan to Uthappa,1 run,Uthappa survives, he skips out and chips a flighted ball towards mid off, Dinda runs forward to his right and dives, but it falls just short"}, {"ball": 5.4, "isHighlight": false, "text": "Muralitharan to Pathan,no run,defended off the front foot to the bowler"}, {"ball": 5.5, "isHighlight": false, "text": "Muralitharan to Pathan, $$SIX$$ ,tosses it up full on the pad, Yusuf lunges forward, gets down and sweeps it just over the deep backward square leg rope"}, {"ball": 5.6, "isHighlight": false, "text": "Muralitharan to Pathan,no run,beats him now with one that does not turn as it goes across the right-hander, who pushes forward expecting spin"}, {"ball": 5.6, "isHighlight": false, "text": "Time out"}, {"ball": 5.6, "isHighlight": false, "text": "Swamy: \"Pitch seems to be on slower side, KKR should have gone with Chawla.\""}, {"ball": 5.6, "isHighlight": false, "text": "Sameer: \"I think Yusuf should play as he has always played. A 20-25 ball 50 here would place kkr at good stage at half-way. From there Shakib can play till the end and other players, Uthappa, Ryan can do hitting..\""}, {"ball": 5.6, "isHighlight": false, "text": "Yuvraj comes on"}, {"ball": 6.1, "isHighlight": false, "text": "Yuvraj Singh to Uthappa,1 run,tosses it up, just outside off, Uthappa pushes forward and eases it to cover"}, {"ball": 6.2, "isHighlight": false, "text": "Yuvraj Singh to Pathan, $$SIX$$ ,flights it again outside off, Yusuf reaches it with a big forward stride and slams it into the straight boundary"}, {"ball": 6.3, "isHighlight": false, "text": "Yuvraj Singh to Pathan,2 runs,Yuvraj goes flat and angles it in next ball, Yusuf pushes it softly to vacant midwicket and they have time to take two"}, {"ball": 6.4, "isHighlight": false, "text": "Yuvraj Singh to Pathan,no run,tries to whip it to midwicket again, but almost pops it back to the bower"}, {"ball": 6.5, "isHighlight": false, "text": "Yuvraj Singh to Pathan,2 runs,taps it to short third man, there is a direct hit, and they take one more off the ricochet"}, {"ball": 6.6, "isHighlight": false, "text": "Yuvraj Singh to Pathan, $$OUT$$ ,Yusuf's gifted his wicket away, he pushed to cover and set off for a non-existent single, Kohli ran in and lobbed the ball to the keeper, Yusuf dived back and should have made it, but his bat was in the air as the keeper took the bails off"}, {"ball": 6.6, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$run$$ $$out$$ $$22$$ $$(17m$$ $$13b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$169.23$$"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Uthappa, $$FOUR$$ ,a low full toss, Uthappa chips it over the bowler and times it well enough to beat long off running across"}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Uthappa,1 run,full outside leg stump, Uthappa clips it to deep midwicket"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,1 run,makes some room to a flat legbreak on middle and guides it square on the off side"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Uthappa,no run,lunges forward to a bouncing legbreak and pushes it behind point"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Uthappa,no run,gets forward again, opens the face but cannot get the single as backward point reaches the ball"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Uthappa,1 run,finally succeeds in getting the single as he opens the face and guides it to short third man"}, {"ball": 8.1, "isHighlight": false, "text": "Yuvraj Singh to Uthappa, $$FOUR$$ ,shot, Uthappa moves back leg to the on side and drives a full delivery in the air, just past extra cover and into the gap to the left of long off"}, {"ball": 8.2, "isHighlight": false, "text": "Yuvraj Singh to Uthappa,1 run,drives along the ground to wide long off now"}, {"ball": 8.3, "isHighlight": false, "text": "Yuvraj Singh to Shakib Al Hasan,no run,Shakib works this close to the pitch on the leg side and sets off, but Uthappa rightly sends him back as Yuvraj gets to the ball"}, {"ball": 8.4, "isHighlight": false, "text": "Yuvraj Singh to Shakib Al Hasan,2 runs,slides it across the left-hander and Shakib cuts it in typical style behind point, work for the sweeper"}, {"ball": 8.5, "isHighlight": false, "text": "Yuvraj Singh to Shakib Al Hasan,2 runs,tries to drag a flat one through midwicket, but the thick inside edge goes fine on the leg side instead"}, {"ball": 8.6, "isHighlight": false, "text": "Yuvraj Singh to Shakib Al Hasan,1 run,moves outside the crease, gets too close to the pitch of the ball, and squeezes it down the ground for one"}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,1 run,Shakib steps out and opens the face to chip a googly in the air to wide long off"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Uthappa, $$SIX$$ ,Uthappa shows off his touch once more, he skips to the pitch of the ball and lifts it dead straight with a straight followthrough over the boundary"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Uthappa,1 run"}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,1 run,comes down the track and turns it to long on for a single"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Uthappa,no run,beaten as he pushes at a legbreak outside off"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Uthappa, $$FOUR$$ ,he brings out the reverse sweep to a full one just outside off, and beats short third man's dive with a crisp connection"}, {"ball": 10.1, "isHighlight": false, "text": "Muralitharan to Shakib Al Hasan,no run,nicely bowled, he plays back to a tossed up offbreak that leaves him just outside off to beat the outside edge"}, {"ball": 10.2, "isHighlight": false, "text": "Muralitharan to Shakib Al Hasan,1 run,sweeps a full one behind square leg for one"}, {"ball": 10.3, "isHighlight": false, "text": "Muralitharan to Uthappa,2 runs,turned softly and square on the leg side for a couple"}, {"ball": 10.3, "isHighlight": false, "text": "Chinna: \"Uthappa is making a strong statement for the tour of Bangladesh. In Dhoni's absence he can don the gloves as well.. Go Robbie!!!!!!!\""}, {"ball": 10.4, "isHighlight": false, "text": "Muralitharan to Uthappa, $$FOUR$$ ,flighted. but down the leg side, and Uthappa's sweep is well to the left of Gayle at short fine leg, that is enough"}, {"ball": 10.5, "isHighlight": false, "text": "Muralitharan to Uthappa,1 run,worked to deep midwicket for a single"}, {"ball": 10.6, "isHighlight": false, "text": "Muralitharan to Shakib Al Hasan,1 run,angled in full towards middle and leg, Shakib works it square"}, {"ball": 10.6, "isHighlight": false, "text": "sathish2888: \"Boundary every over followed by easy singles.. No better way to build a platform for final assault.. KKR doing it easily here.\""}, {"ball": 11.1, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan, $$FOUR$$ ,length ball on the pad, Shakib waits and whips this hard past midwicket, Starc runs from deep square leg and dives, but it's already hit the rope by then"}, {"ball": 11.1, "isHighlight": false, "text": "round the stumps"}, {"ball": 11.2, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,no run,walks out and has a heave at one angled in, mishits it to midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,no run,has width on this length ball outside off, but is disappointed he cannot connect with the late cut"}, {"ball": 11.4, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,1 run,pitched up but angled too much, into the pad, he gets away as Shakib swipes it to deep square leg"}, {"ball": 11.5, "isHighlight": false, "text": "Ahmed to Uthappa, $$FOUR$$ ,Uthappa goes past Maxwell as the leading run-getter this season with a deft steer to the fine third man boundary off this back of a length ball"}, {"ball": 11.6, "isHighlight": false, "text": "Ahmed to Uthappa,1 run,opens the face again to a wider one, but this travels squarer to third man"}, {"ball": 11.6, "isHighlight": false, "text": "Ashish Kumar Mi: \"Man! what form he is in. Robbie what are you getting these days for breakfast? 8th consecutive 40. Maxwell needs to try harder now to save his Orange cap.\""}, {"ball": 12.1, "isHighlight": false, "text": "Chahal to Uthappa,no run,goes back to a tossed up fullish ball, and punches it back to the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Chahal to Uthappa,no run,lunges forward, this one does not turn as much as he expects, he adjusts to block"}, {"ball": 12.3, "isHighlight": false, "text": "Chahal to Uthappa,no run,slight appeal for leg before as Uthappa misses the sweep but this was turning away and missing off stump"}, {"ball": 12.4, "isHighlight": false, "text": "Chahal to Uthappa,1 run,angled in fullish this time and he works it through midwicket"}, {"ball": 12.5, "isHighlight": false, "text": "Chahal to Shakib Al Hasan, $$FOUR$$ ,Shakib charges out to a wide one, he hasn't middled it, but done enough to pick up a one-bounce four into the straight boundary"}, {"ball": 12.6, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,1 run,taken from outside off and slogged down to long on"}, {"ball": 12.6, "isHighlight": false, "text": "Aditya: \"Really hard to tell whether it's opening the batting or playing in India that's made Uthappa unstoppable - both happened at the same time!\""}, {"ball": 12.6, "isHighlight": false, "text": "Dinda back"}, {"ball": 13.1, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,no run,walks a long way outside off and tries to lift this length ball to fine leg, but it is a slower one and he misses"}, {"ball": 13.2, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,no run,another slower one cutting wide across the left-hander, Shakib swings and misses"}, {"ball": 13.3, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 run,full on the stumps now at 136.5 kph, slight swing in to Shakib, who turns it square on the leg side"}, {"ball": 13.4, "isHighlight": false, "text": "Dinda to Uthappa,1 run,a loopy full slower ball outside off from the back of the hand, Uthappa reaches his fifth fifty of the season with a drive to long off"}, {"ball": 13.5, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 run,Shakib steps out to a pitched up ball going across him, but he cannot time it as he tries to smash it through the off side, sweeper fields"}, {"ball": 13.6, "isHighlight": false, "text": "Dinda to Uthappa,(no ball) 1 run,inches short of AB at long on as Uthappa lofts a full ball, but even if he had caught it, it would have made no difference as no-ball had already been called"}, {"ball": 13.6, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 run,a yorker outside off, Shakib guides it behind square but cannot beat third man"}, {"ball": 14.1, "isHighlight": false, "text": "Chahal to Shakib Al Hasan, $$FOUR$$ ,Shakib's cranked up and smeared this flat legbreak straight past the bowler"}, {"ball": 14.2, "isHighlight": false, "text": "Chahal to Shakib Al Hasan, $$SIX$$ ,another boundary, now Shakib steps out, reaches the pitch and sends it soaring into the crowd beyond the long on boundary, that went 97 metres"}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,2 runs,shortens the length as Shakib comes out again, he dabs it wide of the sweeper for two more"}, {"ball": 14.4, "isHighlight": false, "text": "Chahal to Shakib Al Hasan, $$SIX$$ ,he sees him coming and bowls it into the pad but Shakib is still able to generate plenty of momentum on the swing and lifts it clean over deep midwicket, 89 metres this one, big sixes these"}, {"ball": 14.5, "isHighlight": false, "text": "Chahal to Shakib Al Hasan,no run,leaves the crease once more and slogs a flat one straight to the bowler, it bursts through but he recovers to deny them the single"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Shakib Al Hasan, $$SIX$$ ,Shakib is hurting RCB big time, Chahal goes outside off to try and deny him, but Shakib picks it from there and slogs it over wide long on"}, {"ball": 15.1, "isHighlight": false, "text": "Ahmed to Uthappa, $$FOUR$$ ,four more, full and wide outside off, Uthappa reaches it and opens the face to drive it in the air well behind point, and also beats third man easily"}, {"ball": 15.2, "isHighlight": false, "text": "Ahmed to Uthappa,2 runs,in the blockhole on off, Uthappa turns it square, and it goes slowly enough to allow them room to come back for two"}, {"ball": 15.3, "isHighlight": false, "text": "Ahmed to Uthappa,2 runs,full length on off stump, Uthappa times the clip superbly through midwicket and AB has to dive at wide long on to save the boundary"}, {"ball": 15.4, "isHighlight": false, "text": "Ahmed to Uthappa,1 run,swings in a tad in the blockhole on off, Uthappa digs it out to long off"}, {"ball": 15.4, "isHighlight": false, "text": "Subhasis: \"Is KKR the new KXIP?\""}, {"ball": 15.5, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,no run,that was a boundary had it beaten cover, a full and wide one and Shakib reaches it to smash a powerful drive"}, {"ball": 15.6, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,no run,waits on this one outside off a tad as he tries to find the gap but fails to beat cover again"}, {"ball": 15.6, "isHighlight": false, "text": "Time out"}, {"ball": 15.6, "isHighlight": false, "text": "Starc is back, from round the stumps"}, {"ball": 15.6, "isHighlight": false, "text": "john: \"great to see shakib making the most of his chance. i've always felt between kallis and shakib, shakib is the better t20 allrounder\""}, {"ball": 15.6, "isHighlight": false, "text": "Naveen: \"KKR batsmen are hitting peak form at exactly the right time! The ominous thing is that almost everyone seems to be in form...\""}, {"ball": 16.1, "isHighlight": false, "text": "Starc to Uthappa,1 run,and first ball Uthappa tries to drive on the up through the off side but mistimes the length ball towards cover"}, {"ball": 16.2, "isHighlight": false, "text": "Starc to Shakib Al Hasan,1 run,comes down the track to a slow, full delivery and can only squeeze it out to cover"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to Uthappa,1 run,a low full toss, Uthappa opens the face but he cannot place it past backward point"}, {"ball": 16.4, "isHighlight": false, "text": "Starc to Shakib Al Hasan,1 run,slow and full on middle and leg, Shakib is outside off to try and go to short fine leg, but it hits the toe end and rolls square on the leg side"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to Uthappa,no run,141.6 kph full outside off, Uthappa goes hard at it, and mistimes it to the bowler"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Uthappa,1 wide,digs it in shortish but the angle takes it down the leg side, even as Uthappa swings and misses"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Uthappa, $$FOUR$$ ,superb placement, Starc goes full outside off, Uthappa leans forward and opens the face to send it racing to the right of cover"}, {"ball": 17.1, "isHighlight": false, "text": "Dinda to Shakib Al Hasan, $$FOUR$$ ,boundary first ball of the over as Shakib reaches fifty of 32, his first half-century in the IPL we are told on air, a full and wide one from Dinda and Shakib smears it through extra cover"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 wide,goes way outside off stump with the angle across the left hander"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Shakib Al Hasan, $$FOUR$$ ,four more, he walks outside off stump expecting it wide from Dinda, it arrives there on a length and Shakib hammers it to the deep point boundary"}, {"ball": 17.3, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 run,closer to off stump on this full delivery, Shakib drills it hard past the bowler, long on tumbles over the rope as he keeps the ball in, long off is around to throw it back"}, {"ball": 17.4, "isHighlight": false, "text": "Dinda to Uthappa,1 run,full just outside off to the right hander, Uthapp cannot get underneath it and squeezes it towards long on"}, {"ball": 17.5, "isHighlight": false, "text": "Dinda to Shakib Al Hasan,1 run,moves across and tries to flay this pitched up ball through midwicket but cannot manage much of a connection"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda to Uthappa, $$FOUR$$ ,Uthappa does not need to slog at anything, this is full and wide, he moves forward and drives in the air through extra cover, that rockets to the boundary"}, {"ball": 17.6, "isHighlight": false, "text": "Nechim, round the stumps"}, {"ball": 18.1, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,1 run,walks across to a full one around off and works it through midwicket"}, {"ball": 18.1, "isHighlight": false, "text": "Over the stumps"}, {"ball": 18.2, "isHighlight": false, "text": "Ahmed to Uthappa,1 run,full toss just outside off, swung along the ground to long on"}, {"ball": 18.2, "isHighlight": false, "text": "back round the stumps to Shakib"}, {"ball": 18.3, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan,no run,tries to scoop it to fine leg as he walks outside off but misses this wide full toss"}, {"ball": 18.4, "isHighlight": false, "text": "Ahmed to Shakib Al Hasan, $$OUT$$ ,tries the same stroke again, he is a long way outside off, the length ball is angled in, Shakib tries to reach fine leg again, misses and the off stump is rattled"}, {"ball": 18.4, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$b$$ $$Ahmed$$ $$60$$ $$(53m$$ $$38b$$ $$5x4$$ $$3x6)$$ $$SR:$$ $$157.89$$"}, {"ball": 18.5, "isHighlight": false, "text": "Ahmed to ten Doeschate,no run,Tendo square-drives crisply but straight to cover, Uthappa is a long way up and seems to have no chance of returning, the throw comes to the bowler, he tries to lob it into the stumps, but misses, Uthappa smiles"}, {"ball": 18.6, "isHighlight": false, "text": "Ahmed to ten Doeschate, $$SIX$$ ,goes full, outside off, under the bat, and Tendo smashes it over wide long on with a fearsome connection"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Uthappa,2 runs,low full toss outside off placed through extra cover for two more"}, {"ball": 19.1, "isHighlight": false, "text": "Starc pulls out of delivery stride as he sees non-striker backing up, tells him to go back to his crease"}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Uthappa,1 run,heaves at a length ball outside off, thick inside edge rolls left of the keeper"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to ten Doeschate,1 bye,a sharp short ball angled in to the right-hander, who cannot connect on the hook, they take the bye"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Uthappa,no run,Uthappa pushes a low full toss to Starc, he half-stops it with his boot, Uthappa wants the single but Tendo sends him back as Starc rushes towards the ball"}, {"ball": 19.5, "isHighlight": false, "text": "Starc to Uthappa, $$FOUR$$ ,slices a slow pitched up ball over point, Yuvraj gives up the chase as Chahal sprints across from sweeper cover, he gets to it with a dive, but it touches him after he falls onto the rope"}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Uthappa, $$FOUR$$ ,Uthappa ends the innings the way he's played this season, lofts a full toss with a straight bat high over the bowler"}, {"ball": 19.6, "isHighlight": false, "text": "KKR were 56 for 3. Shakib joined Uthappa, and the 121-run partnership has taken KKR close to 200. Uthappa's last eight innings have been 40 or more. Some form"}, {"ball": 19.6, "isHighlight": false, "text": "Slightly difficult wicket to bat on, says Uthappa, and dedicates the Orange Cap to his coach and former India batsman Pravin Amre"}, {"ball": 19.6, "isHighlight": false, "text": "Ashish: \"Finally.. it all comes down to RCB's batting. All the super stars, all the $$$ have to make themselves count. Else its packup time..\""}, {"ball": 19.6, "isHighlight": false, "text": "Kapil: \"Whatever happens in the next hour and a half, KKR have shown tremendous mental strength and both Shakib and Uthappa didn't throw it away after they were 56/3. BLR should be able to get close as the pitch is good but do they have the mental strength to over come a side in their prime? Lets see..\""}], "name": "Kolkata Knight Riders v Royal Challengers Bangalore", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734027.html?innings=1;view=commentary", "match_num": 49}