{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase. Gayle and Takawale will open. Morne Morkel has the new ball. One slip"}, {"ball": 0.1, "isHighlight": false, "text": "Morkel to Gayle,no run,beaten first ball with a 144 kph short of a length ball that jags away past the outside edge by some distance"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Gayle,no run,and again, pushes well inside the line as a similar back of a length ball leaves him close to off"}, {"ball": 0.3, "isHighlight": false, "text": "Morkel to Gayle,no run,pitches it up this time, 147 kph, Gayle lets it go outside off with the angle"}, {"ball": 0.4, "isHighlight": false, "text": "Morkel to Gayle,no run,short of a length into the body now, Gayle carefully nudges it to square leg"}, {"ball": 0.4, "isHighlight": false, "text": "Pulls out of delivery stride at the last instant and immediately raises his hand in apology towards the batsman"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Gayle,1 run,length ball on the pads, Gayle turns it to fine leg"}, {"ball": 0.5, "isHighlight": false, "text": "JP: \"Gayle cant take too many balls to settle down.. he needs to fire or get out so that the other batsmen get some time to settle\""}, {"ball": 0.6, "isHighlight": false, "text": "Morkel to Takawale,no run,climbs steeply and moves away from back of a length outside off, left alone"}, {"ball": 0.6, "isHighlight": false, "text": "Umesh Yadav"}, {"ball": 1.1, "isHighlight": false, "text": "UT Yadav to Gayle,1 run,short of a length and moving into Gayle, he jabs it square on the leg side for one"}, {"ball": 1.1, "isHighlight": false, "text": "aditya b: \"Gayle never ever scores when needed. Unfortunately not expecting much from him\""}, {"ball": 1.2, "isHighlight": false, "text": "UT Yadav to Takawale,no run,good length ball swings away and bounces, he half-prods at it, well inside the line"}, {"ball": 1.3, "isHighlight": false, "text": "UT Yadav to Takawale,1 run,moving away again, steered to third man for a single"}, {"ball": 1.4, "isHighlight": false, "text": "UT Yadav to Gayle,no run,nice line, a length ball ending around off stump, Gayle defends from the crease"}, {"ball": 1.5, "isHighlight": false, "text": "UT Yadav to Gayle, $$FOUR$$ ,short of a length now, and Gayle whips, one leg high in the air, in front of square, and beats deep square leg"}, {"ball": 1.6, "isHighlight": false, "text": "UT Yadav to Gayle, $$OUT$$ ,Umesh has got the big wicket in his first over, the umpire takes his time before slowly raising the finger, length ball, pitching middle, moving in a bit and hitting him dead in front around the knee roll as Gayle is caught heavy-footed on the crease"}, {"ball": 1.6, "isHighlight": false, "text": "$$CH$$ $$Gayle$$ $$lbw$$ $$b$$ $$UT$$ $$Yadav$$ $$6$$ $$(9m$$ $$9b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 1.6, "isHighlight": false, "text": "Virat Kohli is in"}, {"ball": 2.1, "isHighlight": false, "text": "Morkel to Takawale,1 run,just back of a length, he defends towards extra cover and starts early for the single, nicely judged"}, {"ball": 2.2, "isHighlight": false, "text": "Morkel to Kohli,no run,wide one from short of a length, Kohli tries to place it past backward point, but cannot beat the man"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Kohli,1 run,that comes in, is climbing too, Kohli handles it well, softly turning it square"}, {"ball": 2.3, "isHighlight": false, "text": "Nishad: \"As usual Gayle goes without troubling the scorers in a big match!!! what a pity for RCB!!!\""}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Takawale,no run,width on offer, but it is a slower one at 129 kph, and Takawale cannot connect on the cut"}, {"ball": 2.5, "isHighlight": false, "text": "Morkel to Takawale,no run,steepler just outside off at 141.5 kph, Takawale tries to guide it over the keeper, but misses again"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Takawale,no run,pitches it up now, nearly 148 kph, Takawale probably not expecting the fuller length and pops it in the air, but no harm done as it rolls to mid on"}, {"ball": 2.6, "isHighlight": false, "text": "Adam Alves: \"If Chris Gayle's name wasn't Chris Gayle he would have been dropped 4 games ago and RCB would have been better off in this IPL.\""}, {"ball": 3.1, "isHighlight": false, "text": "UT Yadav to Kohli,no run,late away swing as Umesh pitches it up at 136.5 kph, Kohli covers for that, and drives to mid off"}, {"ball": 3.2, "isHighlight": false, "text": "UT Yadav to Kohli,2 runs,Kohli escapes, he saw this angled in full into the pad and tried to clip it square, got a leading edge, right in the gap between cover and extra cover"}, {"ball": 3.3, "isHighlight": false, "text": "UT Yadav to Kohli,1 run,short of a length at 137.9 kph, Kohli tucks it to long leg"}, {"ball": 3.4, "isHighlight": false, "text": "UT Yadav to Takawale,1 run,another shout for lbw as Takawale is pinned on the crease against this length ball that moves in further after pitching, but he's managed a thick inside edge before"}, {"ball": 3.5, "isHighlight": false, "text": "UT Yadav to Kohli, $$FOUR$$ ,Kohli takes charge this time, this is overpitched at 140.8 kph, and he swats it straight over the bowler, for a one-bounce four"}, {"ball": 3.6, "isHighlight": false, "text": "UT Yadav to Kohli,no run,a length ball just outside off to end the over, Kohli pushes to covers"}, {"ball": 3.6, "isHighlight": false, "text": "Vinay: \"Feels bad when players like Gayle are struggling to make runs! Not good for T20s.\""}, {"ball": 4.1, "isHighlight": false, "text": "Morkel to Takawale,no run,comes down the track, has a heave and misses this 145.5 kph back of a length ball slanted in to him"}, {"ball": 4.2, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,he connects this time, Morkel pitches it up outside off, and Takawale clears mid off by some distance"}, {"ball": 4.3, "isHighlight": false, "text": "Morkel to Takawale,no run,defends a 147 kph good length delivery to covers"}, {"ball": 4.3, "isHighlight": false, "text": "Third man is up"}, {"ball": 4.4, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,Tendo and Pandey are running back after this skier from covers as Takawale slogs at a pitched up delivery, but they dash into each other, and the ball rolls away into the rope"}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Takawale, $$FOUR$$ ,four more, Morkel goes short this time, Takawale arches back and guides it over slip"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Takawale,1 leg bye,short of a length into the pad, pops up to short fine leg"}, {"ball": 4.6, "isHighlight": false, "text": "Mehul: \"IPL needs players like Gayle for sheer entertainment, I'm glad Maxwell has taken over that department this year and hopefully Gayle will bounce back next year\""}, {"ball": 4.6, "isHighlight": false, "text": "Sunil Narine"}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Takawale, $$FOUR$$ ,sends it way down the leg side first up and Takawale gets some bat on it to send it fine"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Takawale,no run,straighter one jabbed behind point, he is not getting the single"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Takawale,1 run,another carom ball, outside off, turned to midwicket"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Kohli,no run,hit on the pad with a full delivery as he misses while trying to turn it to midwicket"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Kohli,1 run,holds the line on a good length, around off stump, worked in front of square on the leg side"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Takawale,no run,quick and straight on middle at 99 kph, defended back"}, {"ball": 5.6, "isHighlight": false, "text": "Faraz: \"Yogesh Takawale over Parthiv Patel is a questionable decision. I'm not a huge Parthiv fan, but he surely has worked on his attacking game. \""}, {"ball": 6.1, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,is confused by this slower one that cuts in from short of a length, but takes the single as the ball rolls close to the pitch on off"}, {"ball": 6.2, "isHighlight": false, "text": "Vinay Kumar to Takawale,2 runs,wide length ball dabbed to the right of third man, Umesh clumsily stops it with a dive"}, {"ball": 6.3, "isHighlight": false, "text": "Vinay Kumar to Takawale,1 run,just short of a length, moving away, tapped in front of backward point for a single"}, {"ball": 6.4, "isHighlight": false, "text": "Vinay Kumar to Kohli, $$FOUR$$ ,sends it full into the pads, and Kohli happily clips it in front of square, it races to the rope, easily beating deep midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,short of a length just outside off, dabbed to third man"}, {"ball": 6.6, "isHighlight": false, "text": "Vinay Kumar to Takawale,1 run,skips down the track, Vinay shortens the length, Takawale stops and steers it to third man"}, {"ball": 6.6, "isHighlight": false, "text": "Shakib to bowl"}, {"ball": 7.1, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,1 run,tosses up slowly just outside off, he opens the face to turn it to third man"}, {"ball": 7.2, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,no run,goes back as he sees this pitching on a length, it does not turn and hurries in, Kohli keeps it out in time"}, {"ball": 7.3, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,fired into the pad, turned square"}, {"ball": 7.4, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,no run,walks down the track and is hit on the pad with another one angled in"}, {"ball": 7.5, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,1 run,leaves the crease again and nudges it with the angle behind square"}, {"ball": 7.6, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,Kohli comes out, but cannot place the drive through extra cover as he gets too close to the pitch, takes the single to long off"}, {"ball": 7.6, "isHighlight": false, "text": "chibi: \"Why do i get a feeling that everyone has ruled out RCB after gayle got out? Guys, Kohli is in the middle.. Chasing high scores is his bread and butter. I am rooting for Kohli to get this take this home.\""}, {"ball": 8.1, "isHighlight": false, "text": "Vinay Kumar to Kohli, $$FOUR$$ ,charges out first ball of the over and flays the length ball through the covers, too fast for the sweeper"}, {"ball": 8.2, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,length ball just outside off, he stays back and pushes it to the leg side, Vinay cannot cut it off and they take the single"}, {"ball": 8.3, "isHighlight": false, "text": "Vinay Kumar to Takawale, $$SIX$$ ,Vinay goes for more runs, this is wide outside off, and Takawale hops as he slashes it over point, all the way over the boundary"}, {"ball": 8.4, "isHighlight": false, "text": "Vinay Kumar to Takawale, $$FOUR$$ ,more width, more runs, Takawale stays in the crease and cuts in the air to the backward point boundary"}, {"ball": 8.5, "isHighlight": false, "text": "Vinay Kumar to Takawale,1 leg bye,full and into the pad, rolls away behind square leg as Takawale misses"}, {"ball": 8.6, "isHighlight": false, "text": "Vinay Kumar to Kohli,1 run,takes a step out and pushes a length ball to the off side for a single"}, {"ball": 8.6, "isHighlight": false, "text": "Time out"}, {"ball": 8.6, "isHighlight": false, "text": "Siddharth: \"Usually, one would say this is a tough chase for RCB with 4 overs from Narine to face. But then KKR have also picked Vinay Kumar to negate the Narine effect! Seriously don't see the point in picking Vinay. Chawla, in the form he has shown this season, would still bowl much better than Vinay Kumar, even on a wicket that assists the pace bowlers.\""}, {"ball": 9.1, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,skips out and moves to the leg side trying to go over extra cover, but is too close to the pitch to be able to find any timing on it, jabs it past the bowler in the end"}, {"ball": 9.2, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,1 run,full and quick just outside off, he heaves, the ball rolls square on the leg side"}, {"ball": 9.3, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,no run,slides in to Kohli who hits it to point"}, {"ball": 9.4, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,full and angled down the pads, Kohli cannot get it away once more"}, {"ball": 9.5, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,1 run,takes it on the full to push down to long off for one"}, {"ball": 9.6, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,leaves the crease once more, turns it to deep midwicket"}, {"ball": 10.1, "isHighlight": false, "text": "Narine to Kohli,1 leg bye,sharp offbreak spins in and hits him on the pad outside leg stump as he misses the whip"}, {"ball": 10.2, "isHighlight": false, "text": "Narine to Takawale,1 run,straighter length ball turned to midwicket for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Narine to Kohli,1 run,offbreak comes in from outside off, worked with the turn to deep midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Narine to Takawale,1 run,he dabs the straighter one to Morne's right at short third man, the fast bowler puts in the dive and stops the ball"}, {"ball": 10.5, "isHighlight": false, "text": "Narine to Kohli,1 run,cuts another carom ball but cannot time it past backward point"}, {"ball": 10.6, "isHighlight": false, "text": "Narine to Takawale,2 runs,slogs and top-edges over midwicket, but it falls in vacant space just in front of two deep fielders running in"}, {"ball": 11.1, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,Kohli charges out, takes it on the full but all the angle on the ball takes it to deep midwicket after batsman swipes"}, {"ball": 11.2, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,1 run"}, {"ball": 11.3, "isHighlight": false, "text": "Shakib Al Hasan to Kohli, $$SIX$$ ,finally Kohli gets Shakib away, over the deep midwicket boundary, as he moves to the leg side and slogs a full delivery, 94 metres that"}, {"ball": 11.3, "isHighlight": false, "text": "goes over the stumps"}, {"ball": 11.4, "isHighlight": false, "text": "Shakib Al Hasan to Kohli,1 run,skips out, takes it on the full, swats it down the track, bowler cannot stop it"}, {"ball": 11.5, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,no run,sees him making room early, and bowls it full and wide outside off, Takawale can't do anything with it"}, {"ball": 11.6, "isHighlight": false, "text": "Shakib Al Hasan to Takawale,2 runs,full delivery squeezed to the left of the sweeper for two"}, {"ball": 12.1, "isHighlight": false, "text": "Narine to Kohli,2 runs,full delivery on the pad, worked wide of deep midwicket for two more"}, {"ball": 12.2, "isHighlight": false, "text": "Narine to Kohli,no run,how did that miss off stump, carom ball spins away from Kohli, opens him up, past the outside edge, clips the thigh pad, left him absolutely clueless"}, {"ball": 12.3, "isHighlight": false, "text": "Narine to Kohli, $$OUT$$ ,Narine strikes, Kohli cuts hard, but this is not wide enough and is bouncing too, Morne tumbles to his left at short third man to take it"}, {"ball": 12.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Morkel$$ $$b$$ $$Narine$$ $$38$$ $$(41m$$ $$31b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$122.58$$"}, {"ball": 12.3, "isHighlight": false, "text": "Yuvraj Singh"}, {"ball": 12.3, "isHighlight": false, "text": "Asking rate galloping now. Nearly 14"}, {"ball": 12.4, "isHighlight": false, "text": "Narine to Yuvraj Singh,no run,and beaten first ball as he pushes forward at a sharp offbreak"}, {"ball": 12.4, "isHighlight": false, "text": "Two slips"}, {"ball": 12.5, "isHighlight": false, "text": "Narine to Yuvraj Singh,1 run,length delivery punched down to long off"}, {"ball": 12.6, "isHighlight": false, "text": "Narine to Takawale, $$OUT$$ ,Narine makes another dent., offbreak spins in sharply from outside off, Takawale still tries to cut, chops it on"}, {"ball": 12.6, "isHighlight": false, "text": "$$YV$$ $$Takawale$$ $$b$$ $$Narine$$ $$45$$ $$(55m$$ $$36b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 12.6, "isHighlight": false, "text": "Rakesh Jain: \"The difference between these two teams is simple : Narine , KKR has the edge\""}, {"ball": 12.6, "isHighlight": false, "text": "AB D is the new man in"}, {"ball": 13.1, "isHighlight": false, "text": "Shakib Al Hasan to Yuvraj Singh,1 run,full in the blockhole outside off, jabbed square"}, {"ball": 13.1, "isHighlight": false, "text": "KKRFan: \"Time to kill an over from Vinay Kumar...\""}, {"ball": 13.2, "isHighlight": false, "text": "Shakib Al Hasan to de Villiers,2 runs,makes room outside leg stump and sweeps a low full toss, Tendo runs to his right from deep midwicket to stop it with a slide"}, {"ball": 13.3, "isHighlight": false, "text": "Shakib Al Hasan to de Villiers,1 run,backs away again and flashes it through the off side to the sweeper now"}, {"ball": 13.4, "isHighlight": false, "text": "Shakib Al Hasan to Yuvraj Singh,1 wide,hurls it full and way down the leg side from over the stumps"}, {"ball": 13.4, "isHighlight": false, "text": "Shakib Al Hasan to Yuvraj Singh,1 run,heaves at a full one outside off, hits it along the ground to long on"}, {"ball": 13.5, "isHighlight": false, "text": "Shakib Al Hasan to de Villiers,no run,AB goes a long way outside leg, Shakib goes in the blockhole , AB drags it out"}, {"ball": 13.6, "isHighlight": false, "text": "Shakib Al Hasan to de Villiers,1 run,top spell from Shakib comes to an end, AB cannot get under this full delivery and drags it to long on"}, {"ball": 13.6, "isHighlight": false, "text": "Morkel is back"}, {"ball": 14.1, "isHighlight": false, "text": "Morkel to de Villiers,no run,shuffles across to off, and has a go at this length ball, mishits it hard into the pitch"}, {"ball": 14.1, "isHighlight": false, "text": "Siddharth: \"If you are asked to place your bet on one player who can get you 96 runs in 6 Overs !! Its Only AB Superman Batting\""}, {"ball": 14.2, "isHighlight": false, "text": "Morkel to de Villiers,1 run,another length ball, hits it hard along the ground to long on"}, {"ball": 14.3, "isHighlight": false, "text": "Morkel to Yuvraj Singh,1 run, $$dropped$$ , by the bowler as he stretches out his left hand after Yuvraj flays a wide one straight back"}, {"ball": 14.4, "isHighlight": false, "text": "Morkel to de Villiers,no run,walks across and tries to slog-sweep, Morne bowls the offcutter and beats him"}, {"ball": 14.5, "isHighlight": false, "text": "Morkel to de Villiers,no run,moves outside off this time, but swings and misses again as Morne finds some away shape on the full deliveyr"}, {"ball": 14.6, "isHighlight": false, "text": "Morkel to de Villiers, $$FOUR$$ ,can't finish well, bowls a full toss into the pad, and AB bends back leg and gets it away to the fine leg boundary"}, {"ball": 14.6, "isHighlight": false, "text": "90 off 30. Shakib and Morne have bowled out, Narine has only one left. Umesh Yadav is back"}, {"ball": 14.6, "isHighlight": false, "text": "Lakshmi: \"Forget Superman, even Spiderman can't win this game for RCB!!\""}, {"ball": 15.1, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh, $$SIX$$ ,six first ball, short of a length sitting up on the pads at 121 kph, Yuvraj sends it soaring effortlessly over deep square leg"}, {"ball": 15.2, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,4 leg byes,four more, Yuvraj shuffles across, Umesh bowls it full outside leg stump, and it hits the pad to race fine"}, {"ball": 15.2, "isHighlight": false, "text": "Round the stumps"}, {"ball": 15.3, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh, $$SIX$$ ,six more, Umesh angles it in on a length, and Yuvraj uses that to pick it flat over deep backward  square leg, superb timing"}, {"ball": 15.4, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,no run,goes full and wide outside off, and Yuvraj misses this time"}, {"ball": 15.5, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh, $$FOUR$$ ,and another boundary, full and wide once more, but Yuvraj reaches it this time, and jabs it fine past the keeper"}, {"ball": 15.6, "isHighlight": false, "text": "UT Yadav to Yuvraj Singh,2 runs,loses his shape as he tries to hit this low full toss outside off, it goes through midwicket"}, {"ball": 15.6, "isHighlight": false, "text": "Couple more of these meltdowns from KKR and RCB might still win this"}, {"ball": 16.1, "isHighlight": false, "text": "Narine to de Villiers,1 run,stands outside off before the ball is delivered, drags the straighter one to long on"}, {"ball": 16.2, "isHighlight": false, "text": "Narine to Yuvraj Singh, $$OUT$$ ,Narine delivers yet again, Yuvraj tees off on this full delivery, but picks out Vinay at the long on boundary"}, {"ball": 16.2, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Vinay$$ $$Kumar$$ $$b$$ $$Narine$$ $$22$$ $$(21m$$ $$12b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$183.33$$"}, {"ball": 16.3, "isHighlight": false, "text": "Narine to de Villiers,1 run,backs away to leg and flashes this length ball to wide long off"}, {"ball": 16.4, "isHighlight": false, "text": "Narine to Rana,1 run,straighter one bounces on off, is pushed to backward point for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Narine to de Villiers,2 runs,AB jumps out, but it only pops up in front of square as he swings hard, got too close to it"}, {"ball": 16.6, "isHighlight": false, "text": "Narine to de Villiers, $$OUT$$ ,that should be game, set and match, Sunil Narine takes his fourth wicket, AB bends down for the sweep, the ball pitches good length and carries on straight past the bat-swing to hit off stump"}, {"ball": 16.6, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Narine$$ $$13$$ $$(20m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 16.6, "isHighlight": false, "text": "What a weapon to have in your attack"}, {"ball": 16.6, "isHighlight": false, "text": "Vinay Kumar can breathe easy now. Here he comes"}, {"ball": 17.1, "isHighlight": false, "text": "Vinay Kumar to Rana,no run,full outside off, driven to extra cover"}, {"ball": 17.2, "isHighlight": false, "text": "Vinay Kumar to Rana,2 runs,full toss smeared down the ground for a couple"}, {"ball": 17.2, "isHighlight": false, "text": "vijay: \"narine is the real (some superhero) here..\""}, {"ball": 17.3, "isHighlight": false, "text": "Vinay Kumar to Rana, $$FOUR$$ ,heaves and edges it over and in the gap between short third man and backward point"}, {"ball": 17.4, "isHighlight": false, "text": "Vinay Kumar to Rana,1 run, $$dropped$$  as Rana flashes a full and wide one to the bowler's left, Vinay stretches but can't hold on"}, {"ball": 17.5, "isHighlight": false, "text": "Vinay Kumar to Starc,1 leg bye,length ball angled in to the left hander from round the stumps, Starc misses"}, {"ball": 17.6, "isHighlight": false, "text": "Vinay Kumar to Rana,1 run,full around off, driven to long off"}, {"ball": 17.6, "isHighlight": false, "text": "Andrew: \"I don't care how well Uthappa or Shakib played but there is only one MoM for me. Narine has just ripped out RCB's middle order in the most emphatic way possible.\""}, {"ball": 18.1, "isHighlight": false, "text": "UT Yadav to Rana,1 run,pitched up outside off, swung hard on the bounce to long off"}, {"ball": 18.1, "isHighlight": false, "text": "KKRfan: \"What a day for KKR!! - Uthappa getting orange cap and Narine getting purple cap!!!!\""}, {"ball": 18.2, "isHighlight": false, "text": "UT Yadav to Starc,2 runs,low full toss guided wide of the sweeper"}, {"ball": 18.3, "isHighlight": false, "text": "UT Yadav to Starc,1 run,full and outside off, thick inside edge goes square on the leg side as Starc looks to go off side"}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Rana,(no ball) 2 runs,very high full toss heaved wide of deep midwicket, it is a no-ball for height, there is an appeal for run-out, Uthappa does well to gather the wide throw one-handed and whip the bails off, but batsman has  $$just$$  made it"}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Rana, $$FOUR$$ ,over short fine leg, walks outside off and lifts a full ball over the man in the ring"}, {"ball": 18.5, "isHighlight": false, "text": "UT Yadav to Rana,2 runs,full one outside off flashed to extra cover, who cannot stop it"}, {"ball": 18.6, "isHighlight": false, "text": "UT Yadav to Rana,no run,very full just outside off stump, smashed straight back to the bowler"}, {"ball": 18.6, "isHighlight": false, "text": "Clint: \"Its amazing how Narine has continued to baffle the best batsmen around even in today's world with the best reviews and technology\""}, {"ball": 19.1, "isHighlight": false, "text": "Vinay Kumar to Starc,2 runs,makes room and lifts a full delivery that bounces just short of extra cover and goes past him"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to Starc, $$FOUR$$ ,cracks a pitched up ball powerfully to the right of long off for a boundary"}, {"ball": 19.3, "isHighlight": false, "text": "Vinay Kumar to Starc,2 runs,flicks off the pad wide of fine leg for two"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay Kumar to Starc,1 run,full around leg, driven straight down the ground"}, {"ball": 19.5, "isHighlight": false, "text": "Vinay Kumar to Rana,1 run,in the blockhole just outside off, hit hard into the pitch and bounces over the bowler"}, {"ball": 19.6, "isHighlight": false, "text": "Vinay Kumar to Starc,no run,Starc swings and misses a wide length ball, and that is the end for RCB"}, {"ball": 19.6, "isHighlight": false, "text": "That is all from this game. Good bye"}, {"ball": 19.6, "isHighlight": false, "text": "$$Robin$$ $$Uthappa$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ . Uthappa: \"It is a great wicket and I enjoy playing here. Feels good to be contributing. I have got my plans worked out as far as opening is concerned. It is like bread and butter for me. The pitch was stopping a bit more. Shots on the rise were not conducive. When Shakib came in, I knew if I rotated the strike, we could get big runs in the end. I did not look at the scoreboard, I just kept batting. Really glad to have Shakib at the other end. I knew I just needed to feed him the strike, he was going hammer and tongs at the spinners in the middle overs.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir$$ : \"The way Robin and Shakib set it up for us was brilliant. Chasing 195 on this pitch is always tough and we always knew we had the bowlers to defend. On this wicket, it gets tough with Sunil and Morne in our ranks.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Virat$$ $$Kohli$$ : \"When we were batting, the difference after 12 overs was only ten runs. But after that, they took off, they scored about 90 in the last eight. That is one area where we have been lacking in the past few games. That has cost us badly in this tournament. In T20, the side that bowls better ends up being on the right side of the result. Tonight was another case where KKR bowled better than us and you saw the result in the end. (Robin) is batting well but it is important to make him hit in the areas we want him to rather than just giving him balls to hit. It was more like he was given balls in the areas in which he wanted to hit rather than making him think about what he should do and the bowler being smarter than the batsman. All credit to him, he has been playing well and hitting the ball well. We have not been consistent in the crucial moments, I have said this before as well. Have not maintained our composure too much. in those crunch situations. It is up to the individuals to learn from that and come back stronger. But we have not been able to do that. We started off well today as well. 20-odd runs in four overs and two wickets and we just could not capitalise on it. We gave away the momentum again.\""}, {"ball": 19.6, "isHighlight": false, "text": "KKR march into the playoffs with a commanding win, their sixth on the trot, thanks to Uthappa, Shakib and Narine. RCB are out of the race. Only one spot up for grabs now, and RR, MI and SRH will compete for it. Sunrisers go up against CSK now, and will be out too if they lose. You can follow that match  $$here$$"}, {"ball": 19.6, "isHighlight": false, "text": "Vee: \"When you're playing a T20 against a side with Narine in the line-up, your allotted overs is really 16. \""}, {"ball": 19.6, "isHighlight": false, "text": "Grandmaster: \"Narine was the queen on a chessboard today. Took out the queen, a couple of rooks and the knight of the opposition today.\""}, {"ball": 19.6, "isHighlight": false, "text": "Varun Anand: \"Now when I look back, KKR have played good cricket throughout this IPL, not just the last 6 games. Had one or two results turned in KKR's favour, they would have been 1 or 2 on the table.\""}], "name": "Kolkata Knight Riders v Royal Challengers Bangalore", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734027.html?innings=2;view=commentary", "match_num": 49}