{"commentary": [{"ball": 0, "isHighlight": false, "text": "All good to go. RCB are in a huddle. Mumbai Indians openers, Michael Hussey and Aditya Tare, are out in the middle. This is Sidharth Monga calling the game"}, {"ball": 0, "isHighlight": false, "text": "$$3.50pm$$  \"Rohit doesn't have to prove anything for indian team's captainship..Kohli has proven enough\" VJ and Apoorv, proving India captaincy credentials in IPL? You must be kidding me"}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$  Bangalore will have a bowl, says Kohli"}, {"ball": 0, "isHighlight": false, "text": "Bangalore are unchanged"}, {"ball": 0, "isHighlight": false, "text": "CM Gautam is out and Jasprit Bumrah is in for Mumbai"}, {"ball": 0, "isHighlight": false, "text": "Chris Gayle is still recovering from a sore back, Kohli says, and will not be playing today"}, {"ball": 0, "isHighlight": false, "text": "Apoorv : \"Two candidates for India's captain post. This will be a match where they prove themselves. \""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$1.45pm$$  Hello and welcome to the first of the big Saturday double header, between defending champions Mumbai Indians and Royal Challengers Bangalore. Will Chris Gayle play today? We will know in 15 minutes"}, {"ball": 0, "isHighlight": false, "text": "**"}, {"ball": 0, "isHighlight": false, "text": "How many times has Australia been white-washed in an Ashes series? Which are the only Test playing countries against which Tendulkar didn't make 1000 Test runs? Which Australian cricketer was jokingly nick-named 'Oswald' because his name figured after Lee and Harvey in the batting line-up?"}, {"ball": 0, "isHighlight": false, "text": "Think you have all the cricket answers? We have the questions. Have you tried your luck at   $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ ?"}, {"ball": 0.1, "isHighlight": false, "text": "Starc to Hussey,1 run,short of a length, angling in, Hussey gets off the strike with a bunted single to leg"}, {"ball": 0.1, "isHighlight": false, "text": "Twp slips in place"}, {"ball": 0.2, "isHighlight": false, "text": "Starc to Tare,1 run,short of a length, tucked away off the hip"}, {"ball": 0.3, "isHighlight": false, "text": "Starc to Hussey,2 runs, $$Hussey$$ $$keeps$$ $$getting$$ $$lives$$ . Last year he was dropped three times by Pollard last year. This time he drives straight to Chahal at point. This is an action replay of those drops. A sitter really. No wonder Hussey loves IPL"}, {"ball": 0.4, "isHighlight": false, "text": "Starc to Hussey,no run,left alone outside off"}, {"ball": 0.5, "isHighlight": false, "text": "Starc to Hussey, $$FOUR$$ ,short and wide, outside off, Hussey must think it is his birthday. Two gifts in an over. Cut away for four"}, {"ball": 0.6, "isHighlight": false, "text": "Starc to Hussey,no run,swinging, on off, really full, dug out"}, {"ball": 0.6, "isHighlight": false, "text": "Albie Morkel to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Morkel to Tare,no run,short, wide, no feet from Tare. Beaten on the cut as the ball shapes away a touch"}, {"ball": 1.2, "isHighlight": false, "text": "Morkel to Tare,no run, $$another$$ $$drop$$ . IPL living up to its abysmal fielding standards. Tare plays a loose push at a wide length ball. Gets the edge. Maddinson at first slip drops a knee-height dolly"}, {"ball": 1.3, "isHighlight": false, "text": "Morkel to Tare,1 run,pushed wide of mid-off for one"}, {"ball": 1.4, "isHighlight": false, "text": "Morkel to Hussey,no run,short of a length, on off, seams away, beats the bat as he pushes at it"}, {"ball": 1.5, "isHighlight": false, "text": "Morkel to Hussey,no run,length ball, on the pads, pushed to leg but not far enough to get a single"}, {"ball": 1.6, "isHighlight": false, "text": "Morkel to Hussey,1 run,full, outside off, driven wide of mid-off for one"}, {"ball": 2.1, "isHighlight": false, "text": "Starc to Hussey,no run,Hussey gives Starc the charge, and is beaten by the swing from just outside off"}, {"ball": 2.2, "isHighlight": false, "text": "Starc to Hussey, $$FOUR$$ ,lovely square push drive. Full outside off, Hussey presses forward, covers the swing, and meets it with an open face. Bisects square cover and cover"}, {"ball": 2.3, "isHighlight": false, "text": "Starc to Hussey,2 runs,too straight this time, clipped away past square leg for two"}, {"ball": 2.4, "isHighlight": false, "text": "Starc to Hussey,1 run,too full, too straight, clipped away for a single"}, {"ball": 2.5, "isHighlight": false, "text": "Starc to Tare,no run,full, outside off, doesn't swing back, beats Tare's extravagant drive on the outside edge"}, {"ball": 2.6, "isHighlight": false, "text": "Starc to Tare,no run,sharp bouncer through Tare even before he can come around to pull. And it is followed by a mouthful from the bowler"}, {"ball": 2.6, "isHighlight": false, "text": "AK: \"That's two drops by Maddinson in as many matches and it's just the beginning of the tournament. \""}, {"ball": 3.1, "isHighlight": false, "text": "Morkel to Hussey,1 run,on a length, outside off, Hussey goes back to steer this to third man"}, {"ball": 3.1, "isHighlight": false, "text": "sam: \"RCB look like they watched the last game and know if don't get 6 wickets then they won't need to see mumbais two most aggressive batsmen.\""}, {"ball": 3.2, "isHighlight": false, "text": "Morkel to Tare,no run,short of a length, jags back in from just outside off, and cuts him into two. Tare looking out of depth"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Tare,1 no ball,short, wide, no-ball too, and Tare fails to put this away, finding the cover-point. This is no-ball because Morkel has knocked the bail off while bowling"}, {"ball": 3.3, "isHighlight": false, "text": "Great scenes. Hussey was out of his crease when the bail was off. RCB don't appeal. Maybe they haven't even realised, but I doubt if this would have been out mankaded because you have to intend to run the batsman out to get the mankad appeal go your way"}, {"ball": 3.3, "isHighlight": false, "text": "Morkel to Tare,1 leg bye,Tare is beaten on the pull by the slower Morkel too. Gets a leg-bye too"}, {"ball": 3.4, "isHighlight": false, "text": "Morkel to Hussey,no run,jumps out of the crease, gives this a wild heave, and is beaten by the slower one"}, {"ball": 3.5, "isHighlight": false, "text": "Morkel to Hussey, $$OUT$$ ,Chahal makes up for the earlier drop. And RCB haven't paid much for it. Hussey has only wasted deliveries. He is hurried into this shovel-pull. Mostly because the ball is not short enough, and he ends up slicing it to square leg"}, {"ball": 3.5, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$c$$ $$Chahal$$ $$b$$ $$Morkel$$ $$16$$ $$(18m$$ $$15b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$106.66$$"}, {"ball": 3.5, "isHighlight": false, "text": "Two prospective wicketkeepers in the middle. Rayudu is the new man in"}, {"ball": 3.6, "isHighlight": false, "text": "Morkel to Rayudu,1 run,short of a length, angling in, gets an inside edge onto the pad for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Pradyot: \"A total of 14 catches had been dropped so far in this tournament.Awful fielding standard.\""}, {"ball": 3.6, "isHighlight": false, "text": "Varun Aaron into the attack now"}, {"ball": 4.1, "isHighlight": false, "text": "Aaron to Rayudu,1 run,short of a length, just outside off, dropped towards cover for one"}, {"ball": 4.2, "isHighlight": false, "text": "Aaron to Tare,1 wide,short of a length, wide, moves further away. Called a wide"}, {"ball": 4.2, "isHighlight": false, "text": "Aaron to Tare,1 run,short of a length, outside off, punched away, Chahal makes a diving save at cover-point to save three runs"}, {"ball": 4.3, "isHighlight": false, "text": "Aaron to Rayudu,1 run,short of a length, holds its line in front of middle and leg, bunted to leg for one"}, {"ball": 4.4, "isHighlight": false, "text": "Aaron to Tare,2 runs,this bouncer has got big on him, Tare looks to drag it from outside off, and gets a top edge that clears mid-on"}, {"ball": 4.5, "isHighlight": false, "text": "Aaron to Tare,3 runs,Chahal might have got a run out here. Tare continues to be edge, jumps out of the crease, gets a thick edge. it flies over cover, Chahal chases it down well, keeps it in, relays it to a fielder, who slips and relays it to another, who spears the throw in, and Parthiv Patel messes the run-out up by flicking the bails without collecting the ball"}, {"ball": 4.6, "isHighlight": false, "text": "Aaron to Rayudu,1 run"}, {"ball": 5.1, "isHighlight": false, "text": "Morkel to Rayudu, $$FOUR$$ ,down the wicket, takes a length ball, swipes it through midwicket for four"}, {"ball": 5.2, "isHighlight": false, "text": "Morkel to Rayudu,1 run,short of a length, angling in, worked to leg for one"}, {"ball": 5.3, "isHighlight": false, "text": "Morkel to Tare, $$FOUR$$ ,gentle bouncer, no sting behind it, and he has been dismissed through midwicket region. This is a slower bouncer. Tare has been struggling with bouncers bowled at conventional pace"}, {"ball": 5.4, "isHighlight": false, "text": "Morkel to Tare, $$FOUR$$ ,one over too many for Morkel? No energy behind this bowling. Gentle, on a length, wide, and Tare crashes it over cover for four"}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Tare,5 wides,The Morkel Meltdown. Wild wide slower one. Parthiv Patel is a short man. Can't reach this down the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Morkel to Tare,no run,this is a better short ball. Just outside off, nips in a little, beats Tare's attempt at the ramp"}, {"ball": 5.5, "isHighlight": false, "text": "Nandakiran N: \"Why on earth, did Parthiv patel appeal in the first place? Even Kamran would not have appealed for this.\""}, {"ball": 5.6, "isHighlight": false, "text": "Morkel to Tare,no run,on a length, just outside off, another wild attempt at a drive. Beaten. An error-filled - from both sides - and ordinary Powerplay comes to an end"}, {"ball": 6.1, "isHighlight": false, "text": "Aaron to Rayudu,no run,on a length, outside off, good bounce for Aaron. Beats the edge"}, {"ball": 6.2, "isHighlight": false, "text": "Aaron to Rayudu,1 run,short of a length, outside off, steered to third man for one"}, {"ball": 6.3, "isHighlight": false, "text": "Aaron to Tare,1 run,on a length, outside off, driven to deep cover"}, {"ball": 6.4, "isHighlight": false, "text": "Aaron to Rayudu,1 bye,third mistake from Parthiv behind the stumps. Fumbles a take on the bouncer. What should have been a dot is a bye"}, {"ball": 6.5, "isHighlight": false, "text": "Aaron to Tare, $$OUT$$ ,Tare's torture ends. This has been a painful innings from Tare. And he has looked completely at sea against the short ball. Aaraon gives him another bouncer, and he top-edges it to Maddinson in the deep on the leg side. Like Chahal, Maddinson also gets the man he reprieved"}, {"ball": 6.5, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$Maddinson$$ $$b$$ $$Aaron$$ $$17$$ $$(35m$$ $$18b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$94.44$$"}, {"ball": 6.5, "isHighlight": false, "text": "Time for a time-out"}, {"ball": 6.5, "isHighlight": false, "text": "Sam Richards: \"i think AB has to be the keeper as RCB finally having some quality pacers who are bowling short balls pretty often\""}, {"ball": 6.6, "isHighlight": false, "text": "Aaron to Rayudu,1 run,down the wicket, more in hope than conviction, gets a thick outside edge for one"}, {"ball": 6.6, "isHighlight": false, "text": "Rohit Sharma is the new batsman in"}, {"ball": 7.1, "isHighlight": false, "text": "Chahal to Rayudu,no run,straight length ball, defended"}, {"ball": 7.1, "isHighlight": false, "text": "Hitesh: \"Chahal got a second go at Hussey, Maddinson at Tare, Parthiv to run Rayudu out?\""}, {"ball": 7.2, "isHighlight": false, "text": "Chahal to Rayudu,1 run,down the wicket to drill this down straight of long-off, and the flying AB saves three runs there with the dive and a quick throw"}, {"ball": 7.3, "isHighlight": false, "text": "Chahal to Sharma,1 run,short of a length, on the pads, worked to leg for one"}, {"ball": 7.4, "isHighlight": false, "text": "Chahal to Rayudu,no run,appeal for lbw as he looks to work this to leg. This wrong'un has turned too far, though"}, {"ball": 7.5, "isHighlight": false, "text": "Chahal to Rayudu,2 runs,pushed wide of long-on this time, and the come back for the second"}, {"ball": 7.6, "isHighlight": false, "text": "Chahal to Rayudu,1 run,down the wicket to drive this to long-on for one"}, {"ball": 7.6, "isHighlight": false, "text": "Ashok Dinda into the attack"}, {"ball": 8.1, "isHighlight": false, "text": "Dinda to Rayudu,1 run,short, wide, Rayudu goes after it without feet, and edges it over point for one"}, {"ball": 8.1, "isHighlight": false, "text": "Kohli moves to first slip"}, {"ball": 8.2, "isHighlight": false, "text": "Dinda to Sharma,no run,Dinda stays short and wide, the batsman's feet stay stuck, and and the edge is beaten"}, {"ball": 8.3, "isHighlight": false, "text": "Dinda to Sharma,no run,fuller, outside off, move away. Left alone"}, {"ball": 8.4, "isHighlight": false, "text": "Dinda to Sharma,1 run,short of a length, pretty straight, bunted to leg for one. Dinda barges into Rayudu as he dashes across to field. No unpleasantness between the two. They are both doing their job"}, {"ball": 8.5, "isHighlight": false, "text": "Dinda to Rayudu,no run,short of a length, outside off, pushed towards point where an alert Kohli denies them a run"}, {"ball": 8.6, "isHighlight": false, "text": "Dinda to Rayudu,no run,slower ball, Rayudu is beaten as he gives charge and swings wildly"}, {"ball": 9.1, "isHighlight": false, "text": "Chahal to Sharma, $$OUT$$ ,Chahl's day has turned. it began with a dolly dropped, but he has come back with a catch, a near run-out and now the big wicket. Wrong'un from Chahl, on a length, just outside off, Sharma lazily drives into it. Makes no attempt to keep it down, nor is he trying to hit it out of the ground. Provides long-off a sitter. And AB won't be dropping any"}, {"ball": 9.1, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Chahal$$ $$2$$ $$(9m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$40.00$$"}, {"ball": 9.1, "isHighlight": false, "text": "Kieron Pollard comes in. And so does a slip"}, {"ball": 9.2, "isHighlight": false, "text": "Chahal to Pollard,no run,flighted on off, defended back to him"}, {"ball": 9.3, "isHighlight": false, "text": "Chahal to Pollard,1 run,another flighted delivery, pushed into the leg side for one"}, {"ball": 9.4, "isHighlight": false, "text": "Chahal to Rayudu,1 run,short of a length, middle and leg, worked into the leg side for another single"}, {"ball": 9.5, "isHighlight": false, "text": "Chahal to Pollard,no run,nice flight on this one, but not turn from middle and leg. Hits the inside edge"}, {"ball": 9.6, "isHighlight": false, "text": "Chahal to Pollard,1 run,slow through the air again, clipped away for a single to leg"}, {"ball": 10.1, "isHighlight": false, "text": "Dinda to Pollard,no run,short of a length, gets this to rise towards the chest, fended to cover"}, {"ball": 10.2, "isHighlight": false, "text": "Dinda to Pollard,1 run,short again, into the ribs, tucked away for one"}, {"ball": 10.3, "isHighlight": false, "text": "Dinda to Rayudu,2 runs,short of a length, wide, cut away in front of third man for two"}, {"ball": 10.4, "isHighlight": false, "text": "Dinda to Rayudu,no run,full, outside off, slight shape away, beats the drive. Proper outswinger"}, {"ball": 10.5, "isHighlight": false, "text": "Dinda to Rayudu,2 runs,short of a length, outside off, punched away in front of deep cover. Starc dives to keep it to two"}, {"ball": 10.6, "isHighlight": false, "text": "Dinda to Rayudu,1 run,drilled to long-on as he pitches this up"}, {"ball": 10.6, "isHighlight": false, "text": "Chahal continuing"}, {"ball": 11.1, "isHighlight": false, "text": "Chahal to Rayudu,1 run,short of a length, outside off, cut away for one"}, {"ball": 11.2, "isHighlight": false, "text": "Chahal to Pollard, $$OUT$$ ,Chahal is on a roll. This is an all-Haryana wicket. Chahal, a former Mumbai Indians legspinner who never got any chances with them, is running through them here. He continues to give the ball air, pitches this up on middle and leg, drilled to long-on where Sachin Rana times his leap to perfection to take this overhead"}, {"ball": 11.2, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$c$$ $$Rana$$ $$b$$ $$Chahal$$ $$3$$ $$(8m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$42.85$$"}, {"ball": 11.2, "isHighlight": false, "text": "Corey Anderson is the new batsman in. Watch out for wrong'uns from the leggie, Corey. A slip comes in"}, {"ball": 11.3, "isHighlight": false, "text": "Chahal to Anderson,1 run,full and straight, pushes this low full toss to long-on"}, {"ball": 11.4, "isHighlight": false, "text": "Chahal to Rayudu,1 run,flighted outside off, pushed to long-off"}, {"ball": 11.5, "isHighlight": false, "text": "Chahal to Anderson,no run,flighted on off, pushed to short straight cover"}, {"ball": 11.6, "isHighlight": false, "text": "Chahal to Anderson,no run,and there is the wrong'un, Anderson hasn't read it, but he has played it with soft hands so the edge doesn't carry to slip"}, {"ball": 11.6, "isHighlight": false, "text": "Yuvraj Singh, so under-utilised by India nowadays, to bowl now"}, {"ball": 12.1, "isHighlight": false, "text": "Yuvraj Singh to Rayudu,1 run,short of a length, slow, pushed to long-off"}, {"ball": 12.1, "isHighlight": false, "text": "Stays round the wicket for Anderson"}, {"ball": 12.2, "isHighlight": false, "text": "Yuvraj Singh to Anderson,1 run,long hop, pulled away to deep midwicket for one"}, {"ball": 12.3, "isHighlight": false, "text": "Yuvraj Singh to Rayudu,1 run,stays slow, on a length, outside off, pushed to long-off for one"}, {"ball": 12.4, "isHighlight": false, "text": "Yuvraj Singh to Anderson,no run,pushes one through, at 99ks, across Anderson, beats his edge on the cut"}, {"ball": 12.5, "isHighlight": false, "text": "Yuvraj Singh to Anderson,1 wide,slows this one down, but bowls it outside leg, and is wided"}, {"ball": 12.5, "isHighlight": false, "text": "Yuvraj Singh to Anderson,1 run,short of a length, on the pads, gets a single to long-on"}, {"ball": 12.6, "isHighlight": false, "text": "Yuvraj Singh to Rayudu,1 run,short of a length, outside off, punched to deep cover for the sixth run of the over"}, {"ball": 12.6, "isHighlight": false, "text": "Aaron is back into the attack"}, {"ball": 13.1, "isHighlight": false, "text": "Aaron to Rayudu,1 run,Rayudu gives him the charge, the ball is shorter than ideal for such a shot, and he pushes it towards point for one. Kohli swoops in, underarms this towards the stumps, and he would have had Anderson had he hit. Good effort, though"}, {"ball": 13.1, "isHighlight": false, "text": "Round the wicket for Anderson"}, {"ball": 13.2, "isHighlight": false, "text": "Aaron to Anderson,no run,short of a length, wide, crunched away, but can't beat backward point"}, {"ball": 13.3, "isHighlight": false, "text": "Aaron to Anderson, $$FOUR$$ ,mis-hit falls safe. Another good bouncer from Aaron, Anderson looks to pull, ends up to-ending it, and the edge lands smack in between long-on and long-off"}, {"ball": 13.3, "isHighlight": false, "text": "Goes back over the wicket"}, {"ball": 13.4, "isHighlight": false, "text": "Aaron to Anderson,no run,another short ball, 142ks, quite aggressive, Anderson has to sway out of this"}, {"ball": 13.5, "isHighlight": false, "text": "Aaron to Anderson, $$FOUR$$ ,another short ball, 142ks again, Anderson is late into the pull again, and this time the top edge evades fine leg. Story of Mumbai's innings"}, {"ball": 13.6, "isHighlight": false, "text": "Aaron to Anderson,no run,slower ball, on a length, on off, beats his attempt to drive"}, {"ball": 13.6, "isHighlight": false, "text": "Dinda is back"}, {"ball": 14.1, "isHighlight": false, "text": "Dinda to Rayudu,1 run,low full toss just outside off, dug out to cover for one"}, {"ball": 14.2, "isHighlight": false, "text": "Dinda to Anderson,1 run,full outside off, driven to long-off for one"}, {"ball": 14.3, "isHighlight": false, "text": "Dinda to Rayudu,no run,short of a length, on off, looks to cut, but can't beat point"}, {"ball": 14.4, "isHighlight": false, "text": "Dinda to Rayudu,1 run,down the wicket, almost yorks himself up, but Kohli is  $$sensational$$ $$at$$ $$cover$$ . Charges to his right, swoops, collects it one-handed, is off balance, and still releases it fast and accurately. Nearly the run-out"}, {"ball": 14.5, "isHighlight": false, "text": "Dinda to Anderson,1 run,drilled to long-off for one"}, {"ball": 14.6, "isHighlight": false, "text": "Dinda to Rayudu,1 run,slower ball, nearly a return catch for Dinda, as this mis-hit goes past his right hand as dives against the momentum of his follow-through"}, {"ball": 14.6, "isHighlight": false, "text": "Time for time-out"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to bowl out now"}, {"ball": 15.1, "isHighlight": false, "text": "Chahal to Rayudu,1 run,short of a length, pulled to deep midwicket for one"}, {"ball": 15.2, "isHighlight": false, "text": "Chahal to Anderson,no run,wrong'un again, a touch too short, but can't beat cover"}, {"ball": 15.3, "isHighlight": false, "text": "Chahal to Anderson,2 runs,another wrong'un, a touch too short, punched away between two men deep on the off side"}, {"ball": 15.4, "isHighlight": false, "text": "Chahal to Anderson,1 run,only wrong'uns he is bowling, punched to long-off for one"}, {"ball": 15.5, "isHighlight": false, "text": "Chahal to Rayudu,1 run,down the wicket, beaten in the flight, the mis-hit doesn't carry to long-on"}, {"ball": 15.6, "isHighlight": false, "text": "Chahal to Anderson,1 run, $$nearly$$ $$bowled$$ $$him$$ . Another wrong'un, Anderson gets a bottom edge on the slog sweep, but it misses the stumps. Chahal ends his four overs without conceding a boundary"}, {"ball": 15.6, "isHighlight": false, "text": "Starc comes back. Has two overs up his sleeve"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to Anderson,1 run,Anderson slogs at a length ball, gets an inside edge for one"}, {"ball": 16.1, "isHighlight": false, "text": "Round the wicket to Rayudu"}, {"ball": 16.2, "isHighlight": false, "text": "Starc to Rayudu,2 runs,on a length, angling in, mis-hit wide of long-on, where Rana does well again to save two runs"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to Rayudu, $$OUT$$ ,another catch for AB. What ground speed to make it look easy. This is a slower-ball length ball hit wide of long-off, but AB makes so much ground he doesn't even have to dive. A scratchy innings from Rayudu"}, {"ball": 16.3, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Starc$$ $$35$$ $$(63m$$ $$37b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$94.59$$"}, {"ball": 16.3, "isHighlight": false, "text": "Harbhajan Singh is the new man in, but Anderson is on strike"}, {"ball": 16.4, "isHighlight": false, "text": "Starc to Anderson, $$OUT$$ ,Starc is on a hat-trick. Too much pressure put on Anderson by the top order. Anderson gets a touch too under a length ball, lofts this towards long-off where Kohli takes it overhead"}, {"ball": 16.4, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$Kohli$$ $$b$$ $$Starc$$ $$18$$ $$(27m$$ $$19b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$94.73$$"}, {"ball": 16.4, "isHighlight": false, "text": "Harbhajan and Zaheer comes together. Neither has faced a ball. Harbhajan to face the hat-trick ball with a slip in"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to Harbhajan Singh,no run, $$Starc$$ $$gets$$ $$the$$ $$edge$$  on the hat-trick ball, but it doesn't carry to Parthiv Patel"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Harbhajan Singh,no run,bouncer from round the stumps, Harbhajan ducks it. An excellent over from Starc"}, {"ball": 17.1, "isHighlight": false, "text": "Dinda to Khan,no run,short ball, gets stuck in the surface, Zaheer has to wait for it to arrive, and can't place it anywhere"}, {"ball": 17.2, "isHighlight": false, "text": "Dinda to Khan, $$OUT$$ ,and another hole-out. This is too easy for RCB. Quicksand for Mumbai. Nothing behind this shot. Caught at long-on"}, {"ball": 17.2, "isHighlight": false, "text": "$$Z$$ $$Khan$$ $$c$$ $$Rana$$ $$b$$ $$Dinda$$ $$0$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Dinda to Harbhajan Singh,no run,bouncer, Harbhajan ducks under it again"}, {"ball": 17.4, "isHighlight": false, "text": "Dinda to Harbhajan Singh,1 run,full, on off, driven to long-off for one"}, {"ball": 17.5, "isHighlight": false, "text": "Dinda to Malinga,no run,outswinger, outside off, Malinga swings inside the line"}, {"ball": 17.6, "isHighlight": false, "text": "Dinda to Malinga,no run,on a length, outside off, Malinga again ends up swinging inside the line"}, {"ball": 17.6, "isHighlight": false, "text": "Aaron to bowl the 19th"}, {"ball": 18.1, "isHighlight": false, "text": "Aaron to Harbhajan Singh, $$FOUR$$ ,bangs the first ball in short, Harbhajan forehands it over mid-off for four. Not clean connection, but the man is up in the circle"}, {"ball": 18.2, "isHighlight": false, "text": "Aaron to Harbhajan Singh,1 run,another two-handed forehand from Harbhajan. Gets a single to long-on"}, {"ball": 18.3, "isHighlight": false, "text": "Aaron to Malinga,1 run,on a length, pushed to cover to bring Bhajan back to strike"}, {"ball": 18.4, "isHighlight": false, "text": "Aaron to Harbhajan Singh,2 runs,Harbhajan backs away to try to open the off-side field, gets a thick edge over extra cover for two"}, {"ball": 18.5, "isHighlight": false, "text": "Aaron to Harbhajan Singh, $$OUT$$ ,Aaron telegraphs the slower ball with a change of action. Harbhajan slogs across the line of this offcutter, and has his leg stump pegged back. The speed gun still says 142ks. Like I believe ya, speed gun"}, {"ball": 18.5, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$b$$ $$Aaron$$ $$8$$ $$(13m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 18.5, "isHighlight": false, "text": "Ojha is the new man in"}, {"ball": 18.6, "isHighlight": false, "text": "Aaron to Ojha,1 leg bye,full, on the pads, the leg-bye means Ojha keeps strike"}, {"ball": 18.6, "isHighlight": false, "text": "Starc to finish off"}, {"ball": 19.1, "isHighlight": false, "text": "Starc to Ojha,1 run,Ojha drops this towards point, wants a single, Malinga has given up, but Yuvraj's throw misses"}, {"ball": 19.1, "isHighlight": false, "text": "rssampat: \"\"Too much pressure put on Anderson by the top order.\" What Top order??? Whoever planned the MI batting purchases was nuts. They let go of D.Smith at the top, on of the most dangerous batsmen, terrific feilder and a handy bowler and they don't have a single explosive batsman at the top or middle. The like of Tare, Hussey, Rayadu, inspire no fear or dread among bowler's. Rohit at 4 is just about ok and Pollard at 5 & anderson at 6 is plain silly middle order without any solidity. The tail really starts at No:5 for MI\""}, {"ball": 19.2, "isHighlight": false, "text": "Starc to Malinga,1 run,full, crunched away to long-off for one. It is wide of long-off, but with AB you can't chance the second"}, {"ball": 19.3, "isHighlight": false, "text": "Starc to Ojha,no run,short of a length, outside off, he looks to run this down to third man, and is beaten"}, {"ball": 19.4, "isHighlight": false, "text": "Starc to Ojha, $$OUT$$ ,fuller, quicker, wants the leg-bye to point, but there is no run here. Malinga has given up, and this time Yuvraj doesn't miss"}, {"ball": 19.4, "isHighlight": false, "text": "$$SL$$ $$Malinga$$ $$run$$ $$out$$ $$2$$ $$(9m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "Bumrah is the last man in. And he has a slip"}, {"ball": 19.5, "isHighlight": false, "text": "Starc to Bumrah,1 run,yorker, dug out to point, they jog through for one. Chahal misses with an attempt at a direct-hit"}, {"ball": 19.6, "isHighlight": false, "text": "Starc to Ojha,1 leg bye,yorker, angling in, hits him on the toe, concedes a leg-bye"}, {"ball": 19.6, "isHighlight": false, "text": "Superb for RCB. Poor for Mumbai. That batting never looked like going anywhere. And you can't have Pollard batting at No. 6. This is an IPL, it seems, Mumbai gave up at the auction table. Great day for Chahal who began with a drop, but came back with a catch, a near run-out, and two wickets. And again, he has bowled his quote without conceding a boundary. Eight overs so far this IPL, and no boundary conceded"}], "name": "Royal Challengers Bangalore v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729287.html?innings=1;view=commentary", "match_num": 5}