{"commentary": [{"ball": 0, "isHighlight": false, "text": "Welcome back. Parthiv Patel and Nic Maddinson to open for RCB. Zaheer Khan to bowl"}, {"ball": 0.1, "isHighlight": false, "text": "Khan to Maddinson,no run,short of a length, outside off, stays low, beats the punch"}, {"ball": 0.2, "isHighlight": false, "text": "Khan to Maddinson, $$FOUR$$ ,short of a length, wide, he throws his bat it, gets a thick edge over point for four"}, {"ball": 0.2, "isHighlight": false, "text": "Amogh: \"These bad performances of MI have to be taken blame by the players as well the OWNERS!!! They had a great team last year which is why they won IPL. The owners clearly did not think about the next 3 years and made some bluders like not retaining maxwell johnson smith etc. they even did not give chances to chahal. Sad to see the champions perform badly\""}, {"ball": 0.3, "isHighlight": false, "text": "Khan to Maddinson,1 run,slight swing back in, beats the inside edge, concedes a leg-bye"}, {"ball": 0.4, "isHighlight": false, "text": "Khan to Patel,2 runs,overpitched, angling in, clipped away past midwicket"}, {"ball": 0.4, "isHighlight": false, "text": "RCB should aim for a major run-rate boost here"}, {"ball": 0.5, "isHighlight": false, "text": "Khan to Patel,no run,nice movement away from the left-hand batsman, beats Parthiv as he pushes at it without conviction"}, {"ball": 0.6, "isHighlight": false, "text": "Khan to Patel,no run,full, on off, driven to mid-off"}, {"ball": 0.6, "isHighlight": false, "text": "ram: \"One positive thing MI can take away from this match. Like a practice match, everyone's got a chance to bat.\""}, {"ball": 0.6, "isHighlight": false, "text": "Harbhajan to open the bowling"}, {"ball": 1.1, "isHighlight": false, "text": "Harbhajan Singh to Maddinson,3 runs,starts with the doosra from round the wicket, but Maddinson recovers well, and opens the face past slip for three. Zaheer has to trundle all the way from short third"}, {"ball": 1.2, "isHighlight": false, "text": "Harbhajan Singh to Patel,no run,short of a length, looks to pull, mis-hits it to mid-on"}, {"ball": 1.3, "isHighlight": false, "text": "Harbhajan Singh to Patel,no run,full, on the pads, defended to leg"}, {"ball": 1.4, "isHighlight": false, "text": "Harbhajan Singh to Patel,no run,moves across to try to sweep this, is beaten, but has got outside the line to rule out the lbw"}, {"ball": 1.5, "isHighlight": false, "text": "Harbhajan Singh to Patel,no run,short, PP goes back and cuts, but can't beat point"}, {"ball": 1.6, "isHighlight": false, "text": "Harbhajan Singh to Patel,1 run,short again, slapped away, between cover-point and extra cover for one"}, {"ball": 1.6, "isHighlight": false, "text": "samyak daga: \"Completely agree with all the team selection hazards of MI everybody's been saying. The owners have got better players in the support staff rather than the team.! :P\""}, {"ball": 1.6, "isHighlight": false, "text": "Malinga into the attack now. One slip in place"}, {"ball": 2.1, "isHighlight": false, "text": "Malinga to Patel,no run,full, nearly a yorker, thuds low into the pad. Missing leg, though"}, {"ball": 2.2, "isHighlight": false, "text": "Malinga to Patel,1 run,low full toss this time, pushed to mid-off to get off the strike"}, {"ball": 2.3, "isHighlight": false, "text": "Malinga to Maddinson,no run,slower yorker, right on the crease, dug out by Maddinson"}, {"ball": 2.4, "isHighlight": false, "text": "Malinga to Maddinson,no run,full, on off, driven with an open face, can't beat cover"}, {"ball": 2.5, "isHighlight": false, "text": "Malinga to Maddinson, $$FOUR$$ ,slower yorker, this time Maddinson sees it, opens the face on it, gets a thick edge fine of third man for four"}, {"ball": 2.6, "isHighlight": false, "text": "Malinga to Maddinson, $$OUT$$ ,the quicker yorker this time. Squeezes under Maddinson's bat. Vintage Malinga. His 50th bowled victim in the IPL. Too good from Malinga"}, {"ball": 2.6, "isHighlight": false, "text": "$$NJ$$ $$Maddinson$$ $$b$$ $$Malinga$$ $$12$$ $$(12m$$ $$8b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 2.6, "isHighlight": false, "text": "The master chaser, Virat Kohli, is in, but he is not on strike"}, {"ball": 3.1, "isHighlight": false, "text": "Khan to Patel,1 run,short of a length, wide, slashed away to third man for one"}, {"ball": 3.2, "isHighlight": false, "text": "Khan to Kohli,no run,short of a length, Kohli moves across to work this to square leg. PP wants one, but Kohli doesn't. PP has to dive back in"}, {"ball": 3.3, "isHighlight": false, "text": "Khan to Kohli, $$OUT$$ ,Oh Kohli. What an un-Kohli-like dismissal. This is as soft as Kohli will ever get. Steers a short-of-a-length delivery straight to slip. Had he responded to PP's call last ball, Kohli wouldn't even have been on strike to do this"}, {"ball": 3.3, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$c$$ $$Harbhajan$$ $$Singh$$ $$b$$ $$Khan$$ $$0$$ $$(2m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 3.3, "isHighlight": false, "text": "Yuvraj Singh is the new man in"}, {"ball": 3.4, "isHighlight": false, "text": "Khan to Yuvraj Singh,no run, $$poor$$ $$cricket$$ $$all$$ $$around$$ . Yuvraj tries the same steer as Kohli, knowing well that there is a slip in place. Gets a faint edge to the keeper but Tare drops a sitter. He batted poorly, and is not proving to be great guns with the bigger gloves"}, {"ball": 3.5, "isHighlight": false, "text": "Khan to Yuvraj Singh, $$OUT$$ ,Tare won't pay for that slip. The wilyold Zaheer has produced a beauty. The last delivery shaped away from Yuvraj, but this time he slips in a quick delivery - at 139ks, the fastest you are likely to see Zaheer bowl - that skids through after pitching short of a length outside off. The beauty is that it seams back in, and catches the cement-footed Yuvraj plumb"}, {"ball": 3.5, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$lbw$$ $$b$$ $$Khan$$ $$0$$ $$(2m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 3.5, "isHighlight": false, "text": "AB is the new batsman. This game has come alive. Two slips in place"}, {"ball": 3.6, "isHighlight": false, "text": "Khan to de Villiers,no run,squares AB up as this shortish delivery jags away a touch. AB' soft hands mean the edge doesn't carry to second slip"}, {"ball": 4.1, "isHighlight": false, "text": "Malinga to Patel,no run,lovely yorker, on the crease, on off, takes the bottom inner half of the bat"}, {"ball": 4.2, "isHighlight": false, "text": "Malinga to Patel,1 run,this yorker has gone slightly wrong. The low full toss is steered to third man for one"}, {"ball": 4.3, "isHighlight": false, "text": "Malinga to de Villiers,no run,bowls short. AB rises with the bounce, fends with soft hands. He is definitely surprised that this is not a yorker"}, {"ball": 4.4, "isHighlight": false, "text": "Malinga to de Villiers,2 runs,slower length ball, 133ks, AB manages to clear point with this push gone wrong"}, {"ball": 4.4, "isHighlight": false, "text": "Jose: \"This looks a contest to decide which team is worse. The one which performs \"less badly\" --if it is an acceptable phrase -- will be the winner!\""}, {"ball": 4.5, "isHighlight": false, "text": "Malinga to de Villiers,no run,AB stays deep in the crease to convert this yorker into a full ball, and drives this back at Malinga who sticks his foot out to prevent any runs"}, {"ball": 4.6, "isHighlight": false, "text": "Malinga to de Villiers, $$FOUR$$ ,AB is too good. Slower ball, too full but not full enough to be a yorker, and AB meets it with a full face to drive it to the left of mid-on for four"}, {"ball": 4.6, "isHighlight": false, "text": "Zaheer to bowl his third over"}, {"ball": 5.1, "isHighlight": false, "text": "Khan to Patel,1 run,on a length, seams in, takes the inside edge, AB takes the single. Seems like PP is batting on a different strip to what has been rolled out for AB"}, {"ball": 5.2, "isHighlight": false, "text": "Khan to de Villiers,no run,slower ball, on a length, outside off, he leaves it be"}, {"ball": 5.3, "isHighlight": false, "text": "Khan to de Villiers,no run,short of a length, outside off, punched to cover"}, {"ball": 5.3, "isHighlight": false, "text": "Narbavi: \"People talk about MI's batting line up, but RCB's line up doesn't have depth either. Albie Morkel coming in at 6 and Rana at 7. Serious trouble whenever three quick wickets go down like now.\""}, {"ball": 5.4, "isHighlight": false, "text": "Khan to de Villiers,1 run,short and wide, cut away in front of square, Rohit Sharma's dive from cover saves three runs"}, {"ball": 5.5, "isHighlight": false, "text": "Khan to Patel, $$FOUR$$ ,short of a length, well down leg, with fine leg up, clipped away for four"}, {"ball": 5.6, "isHighlight": false, "text": "Khan to Patel,no run,on a length, just outside off, nicely pushed to mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "Bumrah into the attack. Will bowl from wide on the crease. Good batsmen will line him up and will know there will be now lbw possible, and will milk him"}, {"ball": 6.1, "isHighlight": false, "text": "Bumrah to de Villiers,2 runs,short, wide, cut away in front of third man for two"}, {"ball": 6.2, "isHighlight": false, "text": "Bumrah to de Villiers,1 run,short of a length, angling in, pushed to mid-on for one"}, {"ball": 6.3, "isHighlight": false, "text": "Bumrah to Patel,1 run,short, angling away, gets a thick edge on the cut, takes the single to third man"}, {"ball": 6.4, "isHighlight": false, "text": "Bumrah to de Villiers,1 run,slower ball, wide outside off, driven to deep cover"}, {"ball": 6.5, "isHighlight": false, "text": "Bumrah to Patel,no run,short of a length, on the pads, defended back to him"}, {"ball": 6.6, "isHighlight": false, "text": "Bumrah to Patel,1 run,slower ball, on off, pushed wide of cover for one"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan is back. No slip"}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Patel,1 run,short of a length, middle and off, punched to long-on for one"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,1 run,short of a length, offbreak, punched to wide long-on for one"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Patel,1 leg bye,gets outside the line even as he is beaten on the sweep. Takes the leg-bye"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,this one stays low. Just short of a length, outside off, stays low, squeezes under the toe of the bat. Misses the stump"}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,dances down the track, right to the pitch of the ball, and drills this back at Harbhajan"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,2 runs,plays the reverse-paddle this time, beats the keeper, gets two"}, {"ball": 7.6, "isHighlight": false, "text": "Time for time-out"}, {"ball": 7.6, "isHighlight": false, "text": "\"Well, the last time that Bumrah played against RCB, he got twqo LBWs.\" Kris, I remember them both. Poor umpiring decisions, both"}, {"ball": 7.6, "isHighlight": false, "text": "On comes Pragyan Ojha"}, {"ball": 8.1, "isHighlight": false, "text": "Ojha to Patel,3 runs,first ball is short and pushed through, Parthiv opens the face late, guides it past short third, and AB charges back for the third"}, {"ball": 8.2, "isHighlight": false, "text": "Ojha to de Villiers,1 run,tossed up, on off, pushed wide of cover for one"}, {"ball": 8.3, "isHighlight": false, "text": "Ojha to Patel,no run,short of a length, pretty straight, defended to leg"}, {"ball": 8.4, "isHighlight": false, "text": "Ojha to Patel,1 run,too short, pulled away to deep square leg for one"}, {"ball": 8.5, "isHighlight": false, "text": "Ojha to de Villiers,no run,slower, just short of a length, pushed to point"}, {"ball": 8.6, "isHighlight": false, "text": "Ojha to de Villiers,1 run,full, on off, driven to deep cover for one"}, {"ball": 9.1, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,toppie, AB is beaten in the flight as he charges down. Hit on the pad, but outside the line"}, {"ball": 9.2, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,slower through the air, no turn, not a half-volley, AB defends"}, {"ball": 9.3, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,tries the rare low-percentage shot, looks to heave this over leg, gets an inside edge to short fine leg"}, {"ball": 9.4, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,1 run,tries the reverse sweep against the turn. His body has got outside its line as the ball turns in appreciably. Still manages a single to short third"}, {"ball": 9.5, "isHighlight": false, "text": "Harbhajan Singh to Patel,1 run,pushed through, pulled to long-on for one"}, {"ball": 9.6, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,1 run,another reverse-sweep, makes a sweet connection this time, but can't beat Zaheer at short third man"}, {"ball": 10.1, "isHighlight": false, "text": "Ojha to de Villiers,no run, $$nearly$$ $$taken$$ . AB goes hard at the drive, fails to keep it down, but this falls just short of the diving extra cover"}, {"ball": 10.2, "isHighlight": false, "text": "Ojha to de Villiers, $$FOUR$$ ,not too short, but short enough for AB to rock back and pull this wide of deep midwicket for four. He punishes the slightest of errors"}, {"ball": 10.3, "isHighlight": false, "text": "Ojha to de Villiers,1 run,down the wicket, beaten in the flight, but takes a single off the inside edge"}, {"ball": 10.4, "isHighlight": false, "text": "Ojha to Patel,1 run,short, on off, slapped to long-off for one"}, {"ball": 10.5, "isHighlight": false, "text": "Ojha to de Villiers,no run,looks for the extra-cover drive, the ball holds up a little, hits the inside edge"}, {"ball": 10.6, "isHighlight": false, "text": "Ojha to de Villiers,1 run,looks to work this to leg from just outside off, gets a single off the leading edge"}, {"ball": 10.6, "isHighlight": false, "text": "Bumrah comes back"}, {"ball": 11.1, "isHighlight": false, "text": "Bumrah to de Villiers, $$SIX$$ ,unorthodox but predictable Burmah. Short, angling in, AB lines him up, covers the stumps, and goes boom. The first six of the match. Would you believe it?"}, {"ball": 11.2, "isHighlight": false, "text": "Bumrah to de Villiers,no run,on a length, angling in towards off, defended with an open face"}, {"ball": 11.3, "isHighlight": false, "text": "Bumrah to de Villiers,1 run,short of a length, angling in, pushed wide of point for one"}, {"ball": 11.4, "isHighlight": false, "text": "Bumrah to Patel,1 run,short of a length, steered away from just outside off for one"}, {"ball": 11.5, "isHighlight": false, "text": "Bumrah to de Villiers,no run,driven on the up, driven hard, but can't beat extra cover"}, {"ball": 11.6, "isHighlight": false, "text": "Bumrah to de Villiers,no run,full toss, lucky that AB has hit it straight to mid-off"}, {"ball": 11.6, "isHighlight": false, "text": "Malinga comes back for his third over. This is a big over"}, {"ball": 12.1, "isHighlight": false, "text": "Malinga to Patel,1 run,slower ball, on a length, middle and leg, Parthiv bunts him for one. AB runs with his helmet in his hand"}, {"ball": 12.2, "isHighlight": false, "text": "Malinga to de Villiers,1 run,short of a length, into the ribs, tucked away for a single that brings up fifty for the stand and brings the target under 50"}, {"ball": 12.3, "isHighlight": false, "text": "Malinga to Patel,no run,yorker, the slower one, 129ks, dug out by PP, but can't get a single"}, {"ball": 12.4, "isHighlight": false, "text": "Malinga to Patel, $$FOUR$$ ,one slower ball too many. Misses the yorker too. Turns out to be a half-volley on off, which PP scoops over cover for four"}, {"ball": 12.5, "isHighlight": false, "text": "Malinga to Patel, $$FOUR$$ ,bouncer, just outside off, 135ks, and PP rises with it, and ramps it over the keeper's head. Smart batting"}, {"ball": 12.6, "isHighlight": false, "text": "Malinga to Patel,no run,tries another ramp, but this ball is neither as high as the previous nor as wide. Beaten.  $$Actually$$ $$this$$ $$is$$ $$not$$ $$beaten$$ . He has edged it, but they don't even appeal"}, {"ball": 12.6, "isHighlight": false, "text": "Asking rate is under six now. Time for them to go after quicks runs and go for the net run rate?"}, {"ball": 12.6, "isHighlight": false, "text": "Zaheer is back"}, {"ball": 13.1, "isHighlight": false, "text": "Khan to de Villiers,2 runs,short of a length, shuffles across to place this into the leg side and scampers back for twp"}, {"ball": 13.2, "isHighlight": false, "text": "Khan to de Villiers,1 run,short of a length, driven powerfully to deep cover for one"}, {"ball": 13.3, "isHighlight": false, "text": "Khan to Patel,1 run,walks down the wicket to drive this to deep midwicket for one"}, {"ball": 13.4, "isHighlight": false, "text": "Khan to de Villiers,no run,short of a length, middle and leg, hit straight to midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Khan to de Villiers,1 run,down the wicket, drills this straight to mid-off, but he is so quick he has strolled through for one"}, {"ball": 13.6, "isHighlight": false, "text": "Khan to Patel,1 wide,wide down the leg side"}, {"ball": 13.6, "isHighlight": false, "text": "Khan to Patel,1 run,walks down again, takes this one the full, clips this to deep square for another single"}, {"ball": 13.6, "isHighlight": false, "text": "Zaheer is bowled out"}, {"ball": 13.6, "isHighlight": false, "text": "Ojha back on"}, {"ball": 14.1, "isHighlight": false, "text": "Ojha to Patel, $$FOUR$$ ,long hop outside leg with fine leg up. That's how you finish a match early. PP helps it along"}, {"ball": 14.2, "isHighlight": false, "text": "Ojha to Patel,1 run,another long hop, pulled to deep square this time for one"}, {"ball": 14.3, "isHighlight": false, "text": "Ojha to de Villiers,1 run,short of a length, on middle and leg, punched to deep cover for one"}, {"ball": 14.4, "isHighlight": false, "text": "Ojha to Patel,2 runs,short and wide, cut away towards deep cover, comes back for the second despite his short steps"}, {"ball": 14.5, "isHighlight": false, "text": "Ojha to Patel,1 run,mis-hits a pull this time, but this doesn't carry to long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Ojha to de Villiers,1 run,short again, punched to deep cover for one"}, {"ball": 14.6, "isHighlight": false, "text": "Time-out"}, {"ball": 15.1, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,tossed up, turning into the pads, pushed to midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,accurate and flighted again, defended back to him"}, {"ball": 15.3, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,no run,looks to reverse, Harbhajan fires this one in, AB misses, but he has got just outside the line"}, {"ball": 15.4, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,1 run,down the wicket, not quite to the pitch of the ball, but gets a single to long-on"}, {"ball": 15.5, "isHighlight": false, "text": "Harbhajan Singh to Patel,1 run,short of a length, punched away in the air, Rohit Sharma dives at extra cover, but can't quite hold on to it"}, {"ball": 15.6, "isHighlight": false, "text": "Harbhajan Singh to de Villiers,1 run,reverse-swept again, can't beat short third again. Takes the single. Tight spell from Harbhajan - 4-0-14-0"}, {"ball": 16.1, "isHighlight": false, "text": "Ojha to de Villiers,1 run,on a length, middle and leg, goes off the inside edge for one"}, {"ball": 16.2, "isHighlight": false, "text": "Ojha to Patel, $$FOUR$$ ,lovely shot. PP makes room, takes this on the half-volley, and drives it over mid-off for a smooth four"}, {"ball": 16.3, "isHighlight": false, "text": "Ojha to Patel, $$FOUR$$ ,PP is finishing this off in a hurry. Makes room again, takes this on the half-volley, and lobs this over mid-off again"}, {"ball": 16.4, "isHighlight": false, "text": "Ojha to Patel,1 run,there is the fifty for PP. Fighting knock but just what RCB needed. Opens the face, takes the single"}, {"ball": 16.5, "isHighlight": false, "text": "Ojha to de Villiers,no run,fired in shortish, punched to cover"}, {"ball": 16.6, "isHighlight": false, "text": "Ojha to de Villiers, $$FOUR$$ ,beautiful shot. Tossed up outside off, and he goes inside-out, chips it over extra cover"}, {"ball": 16.6, "isHighlight": false, "text": "Malinga comes back. This is not even a final throw of the dice"}, {"ball": 17.1, "isHighlight": false, "text": "Malinga to Patel,2 runs,full from round the stumps, steered away for a couple"}, {"ball": 17.2, "isHighlight": false, "text": "Malinga to Patel, $$FOUR$$ ,PP gets a length ball from Malinga with mid-off up, and he sends it over the fielder's head. Scores are level now"}, {"ball": 17.3, "isHighlight": false, "text": "Malinga to Patel,1 run,and RCB are there. PP opens the face on this slower ball, and runs away for a single, and pumps the air even before reaching the non-striker's end"}, {"ball": 17.3, "isHighlight": false, "text": "That's all we have from this match, but do switch the tab to the other one where the second of this double-header will be one"}, {"ball": 17.3, "isHighlight": false, "text": "\"It's a lovely feeling,\" says  $$Virat$$ $$Kohli$$ . \"Two-nil. There was a nervous moment or two there, but there were positives. AB getting in early and getting a hit, and PP batting well.\""}, {"ball": 17.3, "isHighlight": false, "text": "\"You can go and express yourself when you have a batting line-up like this,\" says  $$Parthiv$$ $$Patel$$ , the Man of the Match. \"Quite enjoying this format.\""}, {"ball": 17.3, "isHighlight": false, "text": "\"We were short on the runs,\" says  $$Rohit$$ $$Sharma$$ . \"Bowlers gave us some chance. We were in the game for first 8-9 overs, but they had a big partnership. We need to go back and see what we can do. Not to worry, things will fall in place. We have the ability and the potential. We should believe we have the team that can turn this around. I hope the batsmen put up a show in the coming few games.\""}, {"ball": 17.3, "isHighlight": false, "text": "RCB are there with 15 balls to spare. One-way traffic from the moment you saw Michael Hussey struggle at the start of the match. RCB were accurate with the ball, and Mumbai Indians were too weak with the bat. A few nervous moments in the chase kept the game alive, but AB and Parthiv Patel coolly finished this off"}], "name": "Royal Challengers Bangalore v Mumbai Indians", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729287.html?innings=2;view=commentary", "match_num": 5}