{"commentary": [{"ball": 0, "isHighlight": false, "text": "Five minutes to the start.."}, {"ball": 0, "isHighlight": false, "text": "JV: \"I was expecting Matt Henry to get a game. He bowled a superb spell in the India vs NZ ODI earlier this year.\""}, {"ball": 0, "isHighlight": false, "text": "Getting a few questions about McCullum. He has flown home for the birth of his child and won't be around for the next game as well. He will be back for the playoffs."}, {"ball": 0, "isHighlight": false, "text": "Barath: \"Not many people agree with me, but, it is good that Aparajith is not playing.He is not a T20 batsman.He has great technique and temperament which is better suited for test and middle overs of ODI. He can't make much impact even if he gets to play in T20 (unless he is in RR).And also CSK have enough spinners already. Ranji trophy is his stage. By the way, I was his team mate during his early days.so.....I know a thing or two about Aparajith AKA Sachin\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$ : Sunrisers will  $$bowl$$ $$first$$ . Sammy says the pitch seems a bit damp. Sunrisers are unchanged today."}, {"ball": 0, "isHighlight": false, "text": "MS Dhoni announced three changes. He said Brendon McCullum, Badree and Hilfenhaus are out. Not sure yet who the replacements are. Waiting to confirm that. Looks like Dhoni got a bit confused at the toss and he admitted so."}, {"ball": 0, "isHighlight": false, "text": "David Hussey and Pawan Negi come in."}, {"ball": 0, "isHighlight": false, "text": "Got the CSK team off Twitter: CSK XI: DR Smith, S Raina, D Hussey, F du Plessis, MS Dhoni, R Jadeja, M Manhas, R Ashwin, J Hastings, P Negi, M Sharma"}, {"ball": 0, "isHighlight": false, "text": "John Hastings the new name there. The fast bowler has played one Test for Australia."}, {"ball": 0, "isHighlight": false, "text": "Natarajan: \"I was expecting Dhoni will give a chance to Aparajith to open with Smith after McCullum gone back home. But again no place for the young talent...\""}, {"ball": 0, "isHighlight": false, "text": "SRH XI: S Dhawan, D Warner, N Ojha, A Finch, D Sammy, V Rao, I Pathan, K Sharma, P Rasool, D Steyn, B Kumar"}, {"ball": 0, "isHighlight": false, "text": "Welcome everyone to the coverage of game 50/60 of this IPL. A must-win game for Sunrisers Hyderabad tonight. Chennai Super Kings took their eye off the ball in the last few games, though they have already qualified for the playoffs."}, {"ball": 0, "isHighlight": false, "text": "Sammy to Pommy at the toss: \"Everytime I've spoken to you, we have won. So hopefully you can give us some luck.\""}, {"ball": 0, "isHighlight": false, "text": "RCB have been knocked out.  $$Click$$ $$here$$  to read the scenarios for the other teams in the race."}, {"ball": 0, "isHighlight": false, "text": "Four more days to make a splash at  $$CricIQ$$  and find your way to Lord's to watch India play England. It's now or never.  $$Go$$ $$for$$ $$it.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Smith,no run,lands it on a length outside off and softly pushed towards mid-off"}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Smith,no run,this was short and wide outside off and he reaches out and mistimes the cut to point"}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,had all the width he could ask for, moving away and he bends and reaches out and carves it over cover, easily done"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Smith,no run,good length on the pads and tucked towards mid-on"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,drilled firmly down the ground, hit hard wide of the bowler and Irfan was at long-on running to his left and he looked to have it covered, he didn't dive properly"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Smith, $$FOUR$$ ,poor opening over from Kumar, this was wide outside off and he square drives this wide if backward point"}, {"ball": 1.1, "isHighlight": false, "text": "Steyn to du Plessis,no run,fullish ball and he flicks it down to midwicket"}, {"ball": 1.2, "isHighlight": false, "text": "Steyn to du Plessis, $$FOUR$$ ,a bit too straight, pacy one on the pads and he flicks it away with ease in the air wide of square leg"}, {"ball": 1.3, "isHighlight": false, "text": "Steyn to du Plessis,no run,punches it to cover and tells Smith to stay back"}, {"ball": 1.4, "isHighlight": false, "text": "Steyn to du Plessis, $$FOUR$$ ,class! An effortless push by du Plessis, he used the pace by Steyn to play a forward push and the ball rocketed past mid-off, too full by Steyn"}, {"ball": 1.5, "isHighlight": false, "text": "Steyn to du Plessis,no run,stays back and pushes it to the off side"}, {"ball": 1.6, "isHighlight": false, "text": "Steyn to du Plessis, $$FOUR$$ ,another expensive over! Steyn too straight again and this time du Plessis effortlessly whips it over midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "All runs off boundaries"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Smith,1 run,finally a single, and this time a quiet one down to long-on"}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to du Plessis, $$FOUR$$ ,and normal service resumes, he takes a few paces down the track to a length ball and merely pushes it into the gap at mid-off and it races away"}, {"ball": 2.2, "isHighlight": false, "text": "Harish Varanasi: \"Damage control ! get the spinners !\""}, {"ball": 2.2, "isHighlight": false, "text": "Keeper up to the stumps"}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to du Plessis,no run,close call for Smith as he took off and Faf quickly sent him back, throw to the bowler's end was wide"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to du Plessis,1 run,he clips it to the on side"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Smith,1 run,mid-on is pushed back and it's another single down the ground"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to du Plessis,1 run,on the stumps and tucked away down to deep square leg, fielder was pushed back"}, {"ball": 3.1, "isHighlight": false, "text": "Sharma to du Plessis,1 run,Du Plessis gives the charge straightaway and checks his drive to mid-off"}, {"ball": 3.2, "isHighlight": false, "text": "Sharma to Smith,no run,struck him on the pads on the back foot and a stifled appeal, it was actually an inside edge"}, {"ball": 3.3, "isHighlight": false, "text": "Sharma to Smith, $$OUT$$ ,the stumps are cartwheeling! At the bowler's end though...very unfortunate way to get out, this was a full blooded straight drive in the air by Smith, du Plessis had  left his crease and Sharma got a finger to it before it struck the stumps and du Plessis walked off"}, {"ball": 3.3, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$run$$ $$out$$ $$19$$ $$(14m$$ $$11b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$172.72$$"}, {"ball": 3.4, "isHighlight": false, "text": "Sharma to Smith,no run"}, {"ball": 3.5, "isHighlight": false, "text": "Sharma to Smith,no run,stays back and punches it to the on side"}, {"ball": 3.6, "isHighlight": false, "text": "Sharma to Smith,1 run,stays back and clips a googly down to midwicket"}, {"ball": 3.6, "isHighlight": false, "text": "Manoj: \"That was the best way to get DuPlessis out. In fact, it may be a new method since he has been dismissed that way already TWICE this IPL\""}, {"ball": 4.1, "isHighlight": false, "text": "Steyn to Smith,no run,mistimed by Smith, he had some width and chopped it to the off side"}, {"ball": 4.2, "isHighlight": false, "text": "Steyn to Smith,no run,goes right back at the crease and punches back to Steyn, Raina ensures he goes back to his crease"}, {"ball": 4.3, "isHighlight": false, "text": "Steyn to Smith,no run,big swing and a miss, Smith nowhere near the ball as he looked to pound this to the on side"}, {"ball": 4.4, "isHighlight": false, "text": "Steyn to Smith, $$FOUR$$ ,difficult chance at cover, Smith reaches out and drives in the air and Rao does well at cover to fling himself to his left but Smith's placement got the better of him"}, {"ball": 4.5, "isHighlight": false, "text": "Steyn to Smith,no run,skids onto him and he mistimes it to the on side"}, {"ball": 4.6, "isHighlight": false, "text": "Steyn to Smith,1 run,clips it down to mid-on and takes an easy single"}, {"ball": 4.6, "isHighlight": false, "text": "CSK: \"One more score for the fair play, other teams just look at the way CSK players play the game, didn't even wait for the umpires decision\""}, {"ball": 5.1, "isHighlight": false, "text": "Parvez Rasool to Smith, $$SIX$$ ,down the ground! Tossed up and Smith doesn't leave the crease at all, comes forward and lofts him down to the sight screen"}, {"ball": 5.2, "isHighlight": false, "text": "Parvez Rasool to Smith, $$SIX$$ ,over the on side! Tossed up on middle and he gets forward and chips this over deep midwicket"}, {"ball": 5.3, "isHighlight": false, "text": "Parvez Rasool to Smith, $$SIX$$ ,three out of three! This was higher in the air, he came forward and lofted it down to the sight screen, didn't look in control initially but good enough"}, {"ball": 5.4, "isHighlight": false, "text": "Parvez Rasool to Smith,1 run,plays the reverse sweep but mistimes it to short third man"}, {"ball": 5.5, "isHighlight": false, "text": "Parvez Rasool to Raina,1 run,gets off the mark with a clip down to midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Parvez Rasool to Smith,1 run,whams this one flat down to long-on, fielder is back there, expensive over by Rasool"}, {"ball": 6.1, "isHighlight": false, "text": "Sharma to Smith,1 run,he stays back and punches it down to long-on"}, {"ball": 6.2, "isHighlight": false, "text": "Sharma to Raina,1 run,flatter one on the pads and worked down to deep square leg"}, {"ball": 6.3, "isHighlight": false, "text": "Sharma to Smith, $$SIX$$ ,Smith's making this look very easy, tossed up on middle and leg and he chips this one goes flat over long-on"}, {"ball": 6.4, "isHighlight": false, "text": "Sharma to Smith,no run,gets an inside edge to the pads and it lobs up and Ojha runs to his left and dives but can't get to it"}, {"ball": 6.5, "isHighlight": false, "text": "Sharma to Smith, $$OUT$$ ,trapped on the back foot and quite plumb, this should come as a huge relief for SRH, this was the googly which Smith failed to read, he went on the back foot and looked to whip it away, didn't read the turn and was trapped"}, {"ball": 6.5, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$lbw$$ $$b$$ $$Sharma$$ $$47$$ $$(27m$$ $$28b$$ $$4x4$$ $$4x6)$$ $$SR:$$ $$167.85$$"}, {"ball": 6.5, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 6.6, "isHighlight": false, "text": "Sharma to Hussey,no run,Hussey plays it safe first ball as he shoulders arms to Karn"}, {"ball": 6.6, "isHighlight": false, "text": "Srinivas Goud: \"Smith got 40 runs from 8 balls and played 20 deliveries for other 7! T20 is rapidly becoming \"big hits only\" game!\""}, {"ball": 7.1, "isHighlight": false, "text": "Parvez Rasool to Raina,1 run,waits for the turn and punches it off the back foot to long-on"}, {"ball": 7.2, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,stays back and punches with the turn to long-on"}, {"ball": 7.3, "isHighlight": false, "text": "Parvez Rasool to Raina,no run,tries to slice it but can't beat backward point"}, {"ball": 7.4, "isHighlight": false, "text": "Parvez Rasool to Raina,1 run,drifts back in and he tucks it to the leg side"}, {"ball": 7.5, "isHighlight": false, "text": "Parvez Rasool to Hussey,no run,turned straight to short midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,flatter and shorter and he pulls along the ground to fine leg"}, {"ball": 8.1, "isHighlight": false, "text": "Sharma to Hussey,no run,gets forward and pushes it down to mid-off"}, {"ball": 8.2, "isHighlight": false, "text": "Sharma to Hussey,1 run,punched towards point and B Kumar does well to dive and stop it"}, {"ball": 8.3, "isHighlight": false, "text": "Sharma to Raina,4 leg byes,makes the mistake of bowling to the pads, Raina gets down to sweep and the ball clips his pads and beats short fine leg"}, {"ball": 8.4, "isHighlight": false, "text": "Sharma to Raina, $$OUT$$ ,Raina perishes to the big shot early in his innings, it was a top spinner from Karn and Raina was down the track and looked to loft it over the sight screen, didn't get the distance, Finch jogged to his left from long-off and held it"}, {"ball": 8.4, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Finch$$ $$b$$ $$Sharma$$ $$4$$ $$(21m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$57.14$$"}, {"ball": 8.4, "isHighlight": false, "text": "The Dhoni chants are in full flow"}, {"ball": 8.5, "isHighlight": false, "text": "Sharma to Dhoni,no run,lunges forward and pushes it to the off side"}, {"ball": 8.6, "isHighlight": false, "text": "Sharma to Dhoni,no run,gets forward and mistimes it back to the bowler"}, {"ball": 9.1, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,makes room and drives this one to long-off"}, {"ball": 9.2, "isHighlight": false, "text": "Parvez Rasool to Dhoni,no run,flatter one and clipped to mid-on"}, {"ball": 9.2, "isHighlight": false, "text": "Franklin: \"@Srinivas Goud. I disagree to that. You need to have a mixture of everything in a team. A couple of big hitters, couple of who can steady an innings and a quality bowler who can take wickets and one can control the run flow.. and now a days you also need someone who can take catches at the boundary.. Thats what ipl2014 has shown.\""}, {"ball": 9.3, "isHighlight": false, "text": "Parvez Rasool to Dhoni,1 run,looks to paddle and the ball deflects off Ojha's pads"}, {"ball": 9.4, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,flatter one and he drills this down to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Parvez Rasool to Dhoni,no run,checks his drive down to cover"}, {"ball": 9.6, "isHighlight": false, "text": "Parvez Rasool to Dhoni,1 run,round the wicket this time to Dhoni as he clips this one down to long-on"}, {"ball": 10.1, "isHighlight": false, "text": "Sharma to Dhoni,1 run,fuller and flatter and he works it down to long-on"}, {"ball": 10.2, "isHighlight": false, "text": "Sharma to Hussey, $$FOUR$$ ,Karn errs by dropping it a bit short of a length and giving him width, made a bit of room himself before cutting him hard past backward point"}, {"ball": 10.3, "isHighlight": false, "text": "Sharma to Hussey,1 run,drops it flat and short and he pulls it down to fine leg"}, {"ball": 10.4, "isHighlight": false, "text": "Sharma to Dhoni,1 run,tossed up and he comes down the track and pushes it to long-off"}, {"ball": 10.5, "isHighlight": false, "text": "Sharma to Hussey,no run,flatter one and he softly pushes it back to the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "Sharma to Hussey,1 run,fullish on the pads and he works it down to long-on"}, {"ball": 11.1, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,he stays back and works it to square leg"}, {"ball": 11.2, "isHighlight": false, "text": "Parvez Rasool to Dhoni,2 runs,round the wicket and Dhoni gives the charge and looks to slam it over the on side, didn't control it and he chipped it towards deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Parvez Rasool to Dhoni,no run,flatter one and he pushes it to the bowler"}, {"ball": 11.4, "isHighlight": false, "text": "Parvez Rasool to Dhoni,1 run,he stays back and punches it to long-off"}, {"ball": 11.5, "isHighlight": false, "text": "Parvez Rasool to Hussey,1 run,drops it a bit short and he pulls him to deep square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Parvez Rasool to Dhoni,1 run,full and driven really hard down to long-off"}, {"ball": 11.6, "isHighlight": false, "text": "Adit: \"There has not been a single game this season where Irfan has been allowed to complete his 4 over quota. This season, he is probably the most under-exploited resource. Where previous to last season, he spear headed Delhi's success, this season he has completely been side-lined. What a pity for a bowler who had been touted as India's shimmering light \""}, {"ball": 11.6, "isHighlight": false, "text": "Chets88: \"Mithun Manhas should have been given an opportunity to bat here!!! he has been unused the entire tournament... Wud have been a great match practice before the playoff\""}, {"ball": 12.1, "isHighlight": false, "text": "Pathan to Dhoni,1 run,he stays back and punches him to mid-off"}, {"ball": 12.2, "isHighlight": false, "text": "Pathan to Hussey,1 run,makes room and cuts towards point"}, {"ball": 12.2, "isHighlight": false, "text": "EPM: \"@Adit: Delhi's success? When was the last time they were succesful?\""}, {"ball": 12.3, "isHighlight": false, "text": "Pathan to Dhoni,1 run,he has some room to cut and he cuts to cover"}, {"ball": 12.4, "isHighlight": false, "text": "Pathan to Hussey,no run,makes room and punches it to point, quiet over"}, {"ball": 12.5, "isHighlight": false, "text": "Pathan to Hussey,no run,keeping the runs down, he makes room and cuts hard but straight to point"}, {"ball": 12.6, "isHighlight": false, "text": "Pathan to Hussey,no run,Hussey struggling there as he is cramped for room, he gets an inside edge to the pads"}, {"ball": 12.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 12.6, "isHighlight": false, "text": "Kushal: \"Adit might still be stuck in 2003. Irfan has lost his mojo a while back :) Granted he should be given fair opportunities, but I think we need to move on from calling him India's shimmering whatever.\""}, {"ball": 13.1, "isHighlight": false, "text": "Steyn to Dhoni,no run,he stays back and punches it down to cover"}, {"ball": 13.1, "isHighlight": false, "text": "Avi: \"Bravo is sorely missed in this CSK lineup. Dhoni and Huss have to slow down here because there is only one big hitter in Jadeja after this and they can't afford to lose wickets in a bunch. Expect another sub par score from CSK today.\""}, {"ball": 13.2, "isHighlight": false, "text": "Steyn to Dhoni,no run,Steyn does well to cramp him up for room again, all he can do is stay back and defend"}, {"ball": 13.3, "isHighlight": false, "text": "Steyn to Dhoni,no run,and this time Steyn gets away with width, loose ball but Dhoni slashes and misses"}, {"ball": 13.4, "isHighlight": false, "text": "Steyn to Dhoni,no run,turning out to be a good over, this was fuller and Dhoni was going for the drive outside off and misses"}, {"ball": 13.5, "isHighlight": false, "text": "Steyn to Dhoni,1 run,he stays back to a length ball and punches it to the off side"}, {"ball": 13.5, "isHighlight": false, "text": "Pritpal Pabla: \"All these years I saw some of the talents are being ingnored under CSK like Saha before and now Manhas, Baba aparajith.. Thank god Saha is picked up by Punjab and he is making his selection count there..\""}, {"ball": 13.6, "isHighlight": false, "text": "Steyn to Hussey,1 run,this time Steyn cranks up the pace and bowls it shorter and he plays high on the bat and steers it to third man, good over"}, {"ball": 14.1, "isHighlight": false, "text": "Pathan to Hussey, $$FOUR$$ ,a boundary finally, the keeper was up to the stumps, Hussey makes room to a length ball and carves it over point, vacant spaces there"}, {"ball": 14.2, "isHighlight": false, "text": "Pathan to Hussey,1 run,chance for a run out! He made room and pushed it to mid-off and challenged Sammy who took aim and missed at the bowler's end, Hussey was struggling"}, {"ball": 14.3, "isHighlight": false, "text": "Pathan to Dhoni, $$SIX$$ ,he has woken up! This was a bit too short from Pathan, he pulled it in front of square and went flat over long-on"}, {"ball": 14.4, "isHighlight": false, "text": "Pathan to Dhoni,1 run,driven firmly but well stopped by Sammy at mid-off"}, {"ball": 14.5, "isHighlight": false, "text": "Pathan to Hussey, $$FOUR$$ ,excellent placement by Hussey, this was the slower ball and he gives him width, Hussey knew there was a gap at third man and placed it well wide of the fielder in the circle"}, {"ball": 14.6, "isHighlight": false, "text": "Pathan to Hussey,1 run,a bit short and he mistimes the pull to long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Saravana: \"CSK is Badriying Manhas this season.\""}, {"ball": 15.1, "isHighlight": false, "text": "Sammy to Hussey, $$FOUR$$ ,placement again by Hussey! This was a length ball by Sammy from round the wicket, pick-up shot over the leg side, the deep square leg fielder couldn't stop it"}, {"ball": 15.2, "isHighlight": false, "text": "Sammy to Hussey,1 run,he drills it down to long-off"}, {"ball": 15.3, "isHighlight": false, "text": "Sammy to Dhoni,no run,looked to scoop it down to fine leg, the ball hits his shoulder and lobs up and drops in front of the crease, he then looks to obstruct the ball going towards the stumps and Ojha takes it on the bounce"}, {"ball": 15.3, "isHighlight": false, "text": "One of the commentators was suggesting that Dhoni may have been obstructing the field but SRH didn't appeal. That would have been interesting"}, {"ball": 15.4, "isHighlight": false, "text": "Sammy to Dhoni,2 leg byes"}, {"ball": 15.5, "isHighlight": false, "text": "Sammy to Dhoni,1 wide,fires it down the leg side and well taken by Ojha, he breaks the stumps too but Dhoni's home"}, {"ball": 15.5, "isHighlight": false, "text": "Sammy to Dhoni,1 run,he looks to play the reverse sweep but can't get it past Bhuvneshwar at short third man"}, {"ball": 15.6, "isHighlight": false, "text": "Sammy to Hussey, $$FOUR$$ ,length ball again and he gets forward and sweeps him behind square leg, he placed it well and the boundary rider couldn't dive and stop it"}, {"ball": 16.1, "isHighlight": false, "text": "Kumar to Dhoni,no run,keeper up to the stumps and Dhoni goes for a big swing and misses it completely"}, {"ball": 16.2, "isHighlight": false, "text": "Kumar to Dhoni, $$SIX$$ ,close call for Dhini but it goes off Finch's palms! This was a length ball which he pulls firmly to long-on, Finch leaps at the edge of the rope but parries it over the rope"}, {"ball": 16.3, "isHighlight": false, "text": "Kumar to Dhoni,2 runs,he drills this full ball down to long-off who dives but it still costs two"}, {"ball": 16.4, "isHighlight": false, "text": "Kumar to Dhoni,no run,hammers it down the track and well stopped by the bowler"}, {"ball": 16.4, "isHighlight": false, "text": "rajasahadevan: \"Dil scoop, reverse sweep, what are you doing MS?! Come on, Lets have some Helicopter!! We better off with it! :)\""}, {"ball": 16.5, "isHighlight": false, "text": "Kumar to Dhoni,1 run,low full toss and he clips it firmly down to deep midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Kumar to Hussey,1 run,fullish outside off and driven down to long-off"}, {"ball": 16.6, "isHighlight": false, "text": "DM: \"Dhoni's been having a dig at the commentators in the past few matches. Wonder what he will have to say tonight? Especially if David Hussey plays the match winner...\""}, {"ball": 17.1, "isHighlight": false, "text": "Pathan to Hussey, $$SIX$$ ,Irfan bowls the slower ball but back fires as Hussey makes room and slams it over long-off, had to put more power behind that"}, {"ball": 17.2, "isHighlight": false, "text": "Pathan to Hussey,1 run,fullish on middle and leg and swept down to deep midwicket"}, {"ball": 17.3, "isHighlight": false, "text": "Pathan to Dhoni,no run,that was the slower bouncer that foxed Dhoni too, it was rising up and he very half heartedly looked to play the upper cut, neither here nor there and he made no contact"}, {"ball": 17.4, "isHighlight": false, "text": "Pathan to Dhoni,no run,looked to slam that over the on side and missed and Ojha belted out an appeal, he was up to the stumps and Irfan joined in too but the umpire wasn't interested"}, {"ball": 17.5, "isHighlight": false, "text": "Pathan to Dhoni,1 run,on the pads and chipped uppishly to long-on"}, {"ball": 17.6, "isHighlight": false, "text": "Pathan to Hussey, $$SIX$$ ,Hussey approaching a fifty here, this was a length ball on the pads and he pulls in front of square and sends it a few rows over deep midwicket"}, {"ball": 18.1, "isHighlight": false, "text": "Kumar to Dhoni,3 runs,it's a misfield at cover and Irfan's the culprit, Dhoni drilled a full ball hard at him and he let it slip and as a result Warner had to do a lot of mopping up near the rope"}, {"ball": 18.2, "isHighlight": false, "text": "Kumar to Hussey,no run,low full toss and he drills it back to the bowler, a dot ball here"}, {"ball": 18.3, "isHighlight": false, "text": "Kumar to Hussey,1 run,yorker outside off which he squirts down to third man"}, {"ball": 18.4, "isHighlight": false, "text": "Kumar to Dhoni,1 leg bye,just one, Dhoni shuffled across his stumps to sweep that and it was a good yorker, hits his pads and rolls away"}, {"ball": 18.5, "isHighlight": false, "text": "Kumar to Hussey,1 run,slams a full ball on the bounce down to long-off and that's Hussey's fifty!"}, {"ball": 18.6, "isHighlight": false, "text": "Kumar to Dhoni,1 run,missed out there, a low full toss and he mistimes it to long-off and he seems to have damaged the bat"}, {"ball": 19.1, "isHighlight": false, "text": "Steyn to Dhoni, $$SIX$$ ,nothing wrong with the new bat there! Steyn bowls it full on middle and leg and he scoops it high and over deep midwicket"}, {"ball": 19.2, "isHighlight": false, "text": "Steyn to Dhoni, $$FOUR$$ ,raw power! This was fuller and he put a lot of bottom hand behind that biff down to long-on, there was a fielder and he too couldn't get there"}, {"ball": 19.3, "isHighlight": false, "text": "Steyn to Dhoni,2 runs,mistimes this one towards long-on and they scamper for a couple"}, {"ball": 19.4, "isHighlight": false, "text": "Steyn to Dhoni, $$SIX$$ ,Steyn's nightmare continues against MSD, he fires this one full and Dhoni launches this one over long-off, goes a few rows back and it's his fifty as well!"}, {"ball": 19.5, "isHighlight": false, "text": "Steyn to Dhoni,2 runs,he forces this one down to deep midwicket for a couple"}, {"ball": 19.6, "isHighlight": false, "text": "Steyn to Dhoni, $$FOUR$$ ,24 off that Steyn over! Steyn bowls length and Dhoni chips this over the on side and one bounce and four to deep midwicket"}, {"ball": 19.6, "isHighlight": false, "text": "So SRH leak 68 off the last five overs and they will be chasing an imposing 186. One of those days when it didn't work out for Steyn. Irfan began well but lost it in the last couple of overs. Karn's figures stand out. SRH will have to chase this down to keep their hopes alive or they're out."}, {"ball": 19.6, "isHighlight": false, "text": "Join us shortly."}], "name": "Chennai Super Kings v Sunrisers Hyderabad", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734029.html?innings=1;view=commentary", "match_num": 50}