{"commentary": [{"ball": 0, "isHighlight": false, "text": "Who will Sunrisers send to open today? The camera pans to the pitch, but it's too long a shot to decipher who it is. Chennai Super Kings calmly make their way out. 186 to get to stay alive. And yes, we have David Warner out there with Shikhar Dhawan"}, {"ball": 0.1, "isHighlight": false, "text": "Sharma to Warner,no run,right behind this short of a good length ball on off stump. Nice solid defensive"}, {"ball": 0.2, "isHighlight": false, "text": "Sharma to Warner,no run,goes a touch fuller, but Warner is happy to remain in his crease and punch into the covers"}, {"ball": 0.3, "isHighlight": false, "text": "Sharma to Warner, $$FOUR$$ ,this time he offers room and Warner places it wide of point. His timing has been pretty good throughout the season and this time it's no different"}, {"ball": 0.4, "isHighlight": false, "text": "Sharma to Warner,no run,sticks closer to off stump and Warner pushes to cover off the back foot"}, {"ball": 0.4, "isHighlight": false, "text": "The Dhoni deluge continues, but lets shift focus to Sunrisers now. Do you think keeping Warner up the order a good move?"}, {"ball": 0.5, "isHighlight": false, "text": "Sharma to Warner, $$FOUR$$ ,belted down the ground! Mohit invited the drive and Warner obliged with immense power. Guess that answers that"}, {"ball": 0.6, "isHighlight": false, "text": "Sharma to Warner,2 runs,switches around the wicket and bowls a little shortish on off stump, Warner opens the face towards point"}, {"ball": 0.6, "isHighlight": false, "text": "Ashwin from the other end, starts around the wicket. One slip in"}, {"ball": 1.1, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,drifting on the pads, Dhawan goes deep in his crease and works it behind square leg"}, {"ball": 1.1, "isHighlight": false, "text": "CSK: \"One thing I haven't seen this IPL, Ashwin pausing before releasing the delivery\""}, {"ball": 1.2, "isHighlight": false, "text": "Ashwin to Warner, $$SIX$$ ,just a little flight and Warner latches onto it. Plants his front leg down the line and hoists him into the sight screen. Had to reach for it, but he struck it powerfully"}, {"ball": 1.3, "isHighlight": false, "text": "Ashwin to Warner,no run,flattens his trajectory and Warner comes forward and blocks"}, {"ball": 1.4, "isHighlight": false, "text": "Ashwin to Warner,no run,trapped on the back foot. Not too much spin on offer and Warner was waiting for some. Adjusts and defends"}, {"ball": 1.5, "isHighlight": false, "text": "Ashwin to Warner, $$FOUR$$ ,angles it in on a fuller length and Warner slams it down to the long-on boundary. Very clean"}, {"ball": 1.6, "isHighlight": false, "text": "Ashwin to Warner,1 run,backs away and lashes the fuller delivery to mid-off"}, {"ball": 1.6, "isHighlight": false, "text": "Arshad Ansari: \"In order for Sunrisers to win this, Sammy or Parvez Rasool have to come up the order and try to hit. Leave Naman Ojha till the end so he can rescue the innings as he does for Madhya Pradesh in Ranji.\""}, {"ball": 2.1, "isHighlight": false, "text": "Sharma to Warner, $$FOUR$$ ,width and Warner tucks into it. Clears his front leg out of the way and mauls it over the head of point. Well over"}, {"ball": 2.2, "isHighlight": false, "text": "Sharma to Warner, $$FOUR$$ ,Mohit is not learning. He is allowing Warner to extend his arms. Perhaps the plan is to bowl beyond his reach on the off side, but it isn't working. belted over cover"}, {"ball": 2.3, "isHighlight": false, "text": "Sharma to Warner,1 run,spears it in on middle and leg, Warner whips it through midwicket"}, {"ball": 2.3, "isHighlight": false, "text": "Aditya: \"Warner has been their most prolific batsman scoring about 450 runs. Why is his batting position in question? He should be allowed to face as many balls as possible. Plus he is already default opener, him batting down the order is what is not normal for him.\""}, {"ball": 2.3, "isHighlight": false, "text": "Dhawan now. Has one run from one ball faced."}, {"ball": 2.4, "isHighlight": false, "text": "Sharma to Dhawan,2 runs,nudged behind square leg and that area is quite vacant"}, {"ball": 2.5, "isHighlight": false, "text": "Sharma to Dhawan,no run,just back of a good length and pushing in on off stump, Dhawan blocks"}, {"ball": 2.6, "isHighlight": false, "text": "Sharma to Dhawan,1 run,misfield at extra cover allows Dhawan to retain strike off a backfoot punch"}, {"ball": 2.6, "isHighlight": false, "text": "EddieBhai: \"@ArshadAnsari - I would not promote Sammy just yet. I think he is very good and dangerous in the middle to late overs. May be Irfan can play a good pinch hitter? To cricinfo's question, I do not believe SRH have the depth to tackle this score; so Warner up front is the right move to seize the initiative.\""}, {"ball": 3.1, "isHighlight": false, "text": "Hastings to Dhawan,no run,Hastings lands it on a length outside off and driven hard to cover"}, {"ball": 3.2, "isHighlight": false, "text": "Hastings to Dhawan,no run,keeps it straight and he can only punch it back to the bowler"}, {"ball": 3.3, "isHighlight": false, "text": "Hastings to Dhawan,1 run,this was fuller and pushed towards mid-off, good running by the pair as they put pressure on Manhas"}, {"ball": 3.4, "isHighlight": false, "text": "Hastings to Warner,no run,stays back and punches it towards cover and tells Warner to wait"}, {"ball": 3.5, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ ,Hastings makes the mistake of feeding a full ball on the pads, good use of the wrists as he finds the gap wide of mid-on"}, {"ball": 3.6, "isHighlight": false, "text": "Hastings to Warner,no run,driven hard but can't beat Manhas at mid-off"}, {"ball": 4.1, "isHighlight": false, "text": "Ashwin to Dhawan,no run,he comes down the track and pushes it straight to cover"}, {"ball": 4.2, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,down the track and drives on the up wide of the bowler to long-off"}, {"ball": 4.3, "isHighlight": false, "text": "Ashwin to Warner,1 run,makes room and punches it to mid-off who's a bit deep"}, {"ball": 4.4, "isHighlight": false, "text": "Ashwin to Dhawan,no run,tries to work it off his pads but can't beat short fine leg"}, {"ball": 4.5, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,drops it a bit short and he pulls him to square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Ashwin to Warner,1 run,punched to the off side and good stop at extra cover"}, {"ball": 4.6, "isHighlight": false, "text": "DM: \"Yes, Warner should be opening , but more importantly tonight, whether it comes from him or someone else or both, Hastings at his pace should be given a real pasting. Unless they are intending to really go after someone else. But in a 186 chase, you can't pick and smash, you just have to hit everyone, and absolutely smash one of them, and tonight it should rather be the one making IPL debut on a good batting pitch.\""}, {"ball": 5.1, "isHighlight": false, "text": "Hastings to Warner,no run,skids through and hits his pads as he looks to work it away"}, {"ball": 5.2, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ ,short fine leg is in place and he bowls on  the pads, easily worked away to fine leg by Warner"}, {"ball": 5.3, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ ,this time he bowls length and it's in the slot for Warner to loft him over the on side, down to wide long-on"}, {"ball": 5.4, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ ,it's a full toss and Warner makes room to heave it away and the ball drops short of midwicket who dives, the ball deflects off the fielder and rolls to long-on and the long-on fielder can't stop it"}, {"ball": 5.5, "isHighlight": false, "text": "Hastings to Warner,1 no ball,that's a massive front foot no ball, he drills this towards cover"}, {"ball": 5.5, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ , $$Free$$ $$Hit$$ : He gets a boundary off it, an attempted yorker and it's a low full toss which he clips wide of short fine leg and he gets his fifty too!"}, {"ball": 5.6, "isHighlight": false, "text": "Hastings to Warner, $$FOUR$$ ,finds the gap, length ball outside off and he makes room and crunches it wide of cover who dives in vain"}, {"ball": 6.1, "isHighlight": false, "text": "Jadeja to Dhawan,1 run,he drops it in front of cover and sets off"}, {"ball": 6.2, "isHighlight": false, "text": "Jadeja to Warner,1 run,length ball on the pads and worked to the leg side"}, {"ball": 6.3, "isHighlight": false, "text": "Jadeja to Dhawan,no run,looked to play the reverse sweep but the ball hits his pads outside the line, stifled appeal"}, {"ball": 6.4, "isHighlight": false, "text": "Jadeja to Dhawan,1 run,drives a fuller ball down to long-on"}, {"ball": 6.5, "isHighlight": false, "text": "Jadeja to Warner,2 runs,paddles it down to square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja to Warner,2 runs,fuller ball on the pads and he works it to deep square leg"}, {"ball": 6.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 6.6, "isHighlight": false, "text": "It's been Warner all along so far. CSK would give anything to get him out now"}, {"ball": 6.6, "isHighlight": false, "text": "Rohit: \"That last over is the perfect example to state why Hasting's has not made a mark at the International level. Very, very Oramesque bowling without as much of intimidating batting. \""}, {"ball": 6.6, "isHighlight": false, "text": "chirag: \"This chase is pretty much simliar to what we saw the last night. simmons/warner keeping most of the strike,and scoring most of the runs through 4's while the other hussey/dhawan just happy to give strike to the other partner.\""}, {"ball": 7.1, "isHighlight": false, "text": "Ashwin to Dhawan,no run,drops it a bit short and wide and he cuts to point"}, {"ball": 7.2, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,he goes back and punches it to mid-on"}, {"ball": 7.3, "isHighlight": false, "text": "Ashwin to Warner,1 run,bowls it shorter and he makes room and punches it wide of point"}, {"ball": 7.4, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,he comes down the track and checks the loft to long-off"}, {"ball": 7.5, "isHighlight": false, "text": "Ashwin to Warner,2 runs,down the track and clips it behind square towards fine leg"}, {"ball": 7.6, "isHighlight": false, "text": "Ashwin to Warner,no run,cramps him for room and he comes forward and blocks"}, {"ball": 7.6, "isHighlight": false, "text": "Raghu: \"Problems with most of the IPL teams is they learn there tactical mistakes nearly at the end of the tournament, like Sunrisers & Mumbai. It would be better if there are friendly matches or practices matches with Indian state teams before start of IPL.\""}, {"ball": 8.1, "isHighlight": false, "text": "Jadeja to Dhawan,1 run,comes down the track and drops it short on seeing him advance, he works it to deep square leg"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Warner,1 wide,he slides this one wide down the leg side"}, {"ball": 8.2, "isHighlight": false, "text": "Jadeja to Warner, $$FOUR$$ ,Hastings made a mess of it at short fine leg, it was down the leg side and paddled and Hastings turned to his right first and realised late he should have turned the other way"}, {"ball": 8.3, "isHighlight": false, "text": "Jadeja to Warner, $$SIX$$ ,that nearly carried to the second tier, that was a clean blow, tossed up and on his knee, slogged over deep midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Jadeja to Warner,1 run,forced away down to deep midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Dhawan,2 wides,good stop by Hastings this time, this was fired down the leg side and Hastings ran quickly to his left from short fine leg"}, {"ball": 8.5, "isHighlight": false, "text": "Jadeja to Warner,no run,he clips it to midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Jadeja to Warner,1 run,he clips it down to deep square leg"}, {"ball": 9.1, "isHighlight": false, "text": "Ashwin to Warner,1 run,fullish in length outside off and pushed to mid-off"}, {"ball": 9.2, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,good length on the pads and he works it to midwicket"}, {"ball": 9.3, "isHighlight": false, "text": "Ashwin to Warner,1 run,stays back, waits for the turn and clips it to midwicket"}, {"ball": 9.4, "isHighlight": false, "text": "Ashwin to Dhawan,2 runs,Ashwin drops it short and he swivels and pulls him to deep square leg"}, {"ball": 9.5, "isHighlight": false, "text": "Ashwin to Dhawan,1 run,very good running, Dhawan pushes it with soft hands towards cover and calls and Warner is quick to respond"}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin to Warner,2 runs,fetches it from outside off and pulls against the turn and places it well enough to pick up two"}, {"ball": 10.1, "isHighlight": false, "text": "Negi to Dhawan,1 run,Negi drops it short and he pushes it to long-on"}, {"ball": 10.2, "isHighlight": false, "text": "Negi to Warner, $$SIX$$ ,asking to be spanked, this was a half tracker and he goes back and pulls him over deep square leg"}, {"ball": 10.3, "isHighlight": false, "text": "Negi to Warner,1 run,he drops it short and he pulls him down to long-on"}, {"ball": 10.4, "isHighlight": false, "text": "Negi to Dhawan,1 run,he comes down the track and punches it towards long-on"}, {"ball": 10.5, "isHighlight": false, "text": "Negi to Warner,1 run,continues to bowl it short and he pulls to deep square leg"}, {"ball": 10.6, "isHighlight": false, "text": "Negi to Dhawan, $$FOUR$$ ,Dhawan into the act now, this was dropped a bit short and wide outside off, he saw the third man up and sliced it well wide of him"}, {"ball": 10.6, "isHighlight": false, "text": "LK: \"How on earth Dhoni is giving ball to left arm spinners with two left handers in the centre.. can someone go and tell to Dhoni to give the ball to Raina please?? Really stupid captaincy from Mr. cool\""}, {"ball": 11.1, "isHighlight": false, "text": "Hastings to Warner,2 runs,strange old shot, this was a slower ball bowled short down the leg side, fine leg was up but he played too early and tamely pulled it to the deep on the on side"}, {"ball": 11.2, "isHighlight": false, "text": "Hastings to Warner, $$OUT$$ ,Warner's dragged it on, but bizarrely it took Hastings a few seconds for that to register, Warner was at the crease looking to push it through the off side but got an inside edge to the leg stump, Dhawan set out from his crease and Hastings was actually gesturing to the fielder to throw the ball to him so he could effect a run out, no need for that"}, {"ball": 11.2, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$b$$ $$Hastings$$ $$90$$ $$(48m$$ $$45b$$ $$12x4$$ $$3x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 11.3, "isHighlight": false, "text": "Hastings to Ojha,no run,stays back and punches to the off side"}, {"ball": 11.4, "isHighlight": false, "text": "Hastings to Ojha,no run,well stopped by Raina near mid-on"}, {"ball": 11.5, "isHighlight": false, "text": "Hastings to Ojha,1 run,he opens the face and steers it down to third man"}, {"ball": 11.6, "isHighlight": false, "text": "Hastings to Dhawan,no run,punched that straight to cover, good comeback over by Hastings"}, {"ball": 12.1, "isHighlight": false, "text": "Negi to Ojha,1 run,drifts on the pads and he works it to fine leg"}, {"ball": 12.2, "isHighlight": false, "text": "Negi to Dhawan,2 runs,he drops it a bit short and cuts him to deep point"}, {"ball": 12.3, "isHighlight": false, "text": "Negi to Dhawan,1 run,comes down the track and checks the punch to long-on"}, {"ball": 12.4, "isHighlight": false, "text": "Negi to Ojha,no run,makes room and drives hard down the pitch but straight to the fielder"}, {"ball": 12.5, "isHighlight": false, "text": "Negi to Ojha,1 run,on the pads and he works it to square leg"}, {"ball": 12.6, "isHighlight": false, "text": "Negi to Dhawan,1 run,drops it a bit short and he pulls him down to long-on"}, {"ball": 12.6, "isHighlight": false, "text": "Karan: \"It is imperative that Ojha and Dhawan keep the tempo going. With Sammy and Finch's inconsistency, one can't rely entirely on them to finish it off \""}, {"ball": 13.1, "isHighlight": false, "text": "Jadeja to Dhawan, $$FOUR$$ ,that's a poor length and line by Jadeja, fine leg is up and he drops it short and wide down the leg side, pummeled to fine leg"}, {"ball": 13.2, "isHighlight": false, "text": "Jadeja to Dhawan, $$SIX$$ ,4 + 6! Tossed up by Jadeja and Dhawan gets on his knee early and slogs him high over deep square leg"}, {"ball": 13.3, "isHighlight": false, "text": "Jadeja to Dhawan,2 runs,flatter and quicker on the pads and he works it to deep square leg, Mohit has some work to do and they complete two"}, {"ball": 13.4, "isHighlight": false, "text": "Jadeja to Dhawan,1 run,he looks to slog him again but mistimes it to deep midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Jadeja to Ojha,no run,he makes room and punches it to the off side"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja to Ojha,1 run,stays back and punches it to long-off"}, {"ball": 14.1, "isHighlight": false, "text": "Negi to Ojha, $$SIX$$ ,over the second tier! That was launched downtown over the sight screen, gives Negi the charge and lofts cleanly"}, {"ball": 14.2, "isHighlight": false, "text": "Negi to Ojha,1 run,he stays back and punches it to the off side"}, {"ball": 14.3, "isHighlight": false, "text": "Negi to Dhawan,1 run,waits for it to turn and works it to deep midwicket"}, {"ball": 14.4, "isHighlight": false, "text": "Negi to Ojha,1 run,fullish on the pads and flicked to the leg side"}, {"ball": 14.5, "isHighlight": false, "text": "Negi to Dhawan,1 run,makes room and mistimes the punch to the off side"}, {"ball": 14.6, "isHighlight": false, "text": "Negi to Ojha,1 run,he comes down the track and works it just wide of the bowler"}, {"ball": 15.1, "isHighlight": false, "text": "Raina to Ojha,1 run,drops it short and he works it wide of midwicket"}, {"ball": 15.2, "isHighlight": false, "text": "Raina to Dhawan, $$SIX$$ ,Raina gets his length wrong as well, a half tracker waiting to be spanked, he makes room and clubs it over deep midwicket"}, {"ball": 15.3, "isHighlight": false, "text": "Raina to Dhawan,no run"}, {"ball": 15.4, "isHighlight": false, "text": "Raina to Dhawan,no run,looks to sweep and the ball rolls off the pads"}, {"ball": 15.5, "isHighlight": false, "text": "Raina to Dhawan,1 run,makes room to punch but can't beat point"}, {"ball": 15.6, "isHighlight": false, "text": "Raina to Ojha,1 run,he comes forward and pushes it down to long-on"}, {"ball": 15.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 16.1, "isHighlight": false, "text": "Sharma to Ojha,1 run,slower ball outside off and he punches it to Faf at point"}, {"ball": 16.2, "isHighlight": false, "text": "Sharma to Dhawan,no run,he comes down the track and looks to swish that away somewhere but ends up swishing at thin air"}, {"ball": 16.2, "isHighlight": false, "text": "Rameez: \"CSK losing 2- 3 matches is giving me a lot of headache...i wonder how Delhi fans are coping...\" They must have gotten used to it last year"}, {"ball": 16.3, "isHighlight": false, "text": "Sharma to Dhawan,2 runs,a bit too straight and he swivels and clips it to the deep to bring up his fifty!"}, {"ball": 16.4, "isHighlight": false, "text": "Sharma to Dhawan, $$FOUR$$ ,it's been that kind of evening for Super Kings, Dhawan gives the charge, he gets an inside edge that sneaks past the stumps and bisects the gap between the keeper and short fine leg"}, {"ball": 16.5, "isHighlight": false, "text": "Sharma to Dhawan,1 run,this is a low full toss which he punches towards mid-off, Negi dives"}, {"ball": 16.6, "isHighlight": false, "text": "Sharma to Ojha,3 runs,punches this one down to long-on"}, {"ball": 16.6, "isHighlight": false, "text": "An understated fifty by Dhawan. SRH coasting this"}, {"ball": 17.1, "isHighlight": false, "text": "Raina to Ojha,no run,softly clipped to the on side and Ojha wasn't actually ready"}, {"ball": 17.2, "isHighlight": false, "text": "Raina to Ojha, $$OUT$$ ,has it come too late for Sunrisers? Tossed up on the pads and he looks to clear deep square leg and Negi runs to his left and judges it well"}, {"ball": 17.2, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$c$$ $$Negi$$ $$b$$ $$Raina$$ $$19$$ $$(24m$$ $$18b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$105.55$$"}, {"ball": 17.3, "isHighlight": false, "text": "Raina to Dhawan,1 run"}, {"ball": 17.4, "isHighlight": false, "text": "Raina to Finch, $$SIX$$ ,no sighters for Finch, he dances down the track and lofts him clean over deep midwicket"}, {"ball": 17.5, "isHighlight": false, "text": "Raina to Finch,1 run,he makes room and delicately dabs him to short third man"}, {"ball": 17.6, "isHighlight": false, "text": "Raina to Dhawan,no run"}, {"ball": 18.1, "isHighlight": false, "text": "Negi to Finch, $$OUT$$ ,he;s been given out run out! Finch moved back and cuts it hard towards cover, misfield by Raina, he set off and the throw was to the bowler who broke the stumps, the umpire didn't ask for the third umpire"}, {"ball": 18.1, "isHighlight": false, "text": "$$AJ$$ $$Finch$$ $$run$$ $$out$$ $$7$$ $$(3m$$ $$3b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$233.33$$"}, {"ball": 18.2, "isHighlight": false, "text": "Negi to Dhawan,1 run"}, {"ball": 18.3, "isHighlight": false, "text": "Negi to Sammy,1 leg bye"}, {"ball": 18.4, "isHighlight": false, "text": "Negi to Dhawan, $$FOUR$$ ,Dhawan comes down the track and lofts it nicely over midwicket, picks the gap"}, {"ball": 18.5, "isHighlight": false, "text": "Negi to Dhawan,no run,Appeal for a stumping! Dhawan was reaching out outside off to drive and he was beaten and he just about managed to drag his back foot back, the third umpire takes a look"}, {"ball": 18.6, "isHighlight": false, "text": "Negi to Dhawan,2 runs"}, {"ball": 19.1, "isHighlight": false, "text": "Jadeja to Sammy,no run"}, {"ball": 19.2, "isHighlight": false, "text": "Jadeja to Sammy, $$OUT$$ ,Sammy has given it away here! This was dropped on a length and he was looking to muscle that over long-on and the fielder ran forward and took the catch"}, {"ball": 19.2, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Jadeja$$ $$0$$ $$(4m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 19.2, "isHighlight": false, "text": "SRH take another chase to the final over. The scorecard at the stadium has 184 and the TV showed 183. Confusion here. It has been corrected to 184 so two to win"}, {"ball": 19.3, "isHighlight": false, "text": "Jadeja to Dhawan,1 run,they scamper through for a single as Dhawan digs it out to point, Hastings' throw was all over the place"}, {"ball": 19.4, "isHighlight": false, "text": "Jadeja to Venugopal Rao, $$FOUR$$ ,the field was up and Rao decides to go airborne, tossed up and he lofts him one bounce down to long-on and it's a win with two balls to spare"}, {"ball": 19.4, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.4, "isHighlight": false, "text": "$$Sammy$$ : \"We have been rising to the challenge, looking to control what we can. Good thing we bowled first. Credit to Warner and Dhawan. After a few games you tend to look for ways to improve, and Warner has always been better up the order. We can just hope things go in our favour.\""}, {"ball": 19.4, "isHighlight": false, "text": "$$Warner$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ : \"(Didn't score a century) Importantly we won and credit to Shikhar for back to back fifties. I love batting at the top of the order and I also enjoyed batting in the middle order. I obviously like to hit as many over the boundary.\""}, {"ball": 19.4, "isHighlight": false, "text": "Dhoni: \"We have to address it (defeats). We have lost a few games very easily. The easier thing would be to chase in each and every game. I went in and ate up quite a few deliveries but 185 was a decent score but under par. I think we needed 230, our new ball bowlers are not getting wickets with the new ball.\""}, {"ball": 19.4, "isHighlight": false, "text": "That's it from us here tonight. Two more games tomorrow, as the race for the last two playoff spots gets more competitive. Thanks for your company. Good night!"}, {"ball": 19.4, "isHighlight": false, "text": "$$End$$ $$of$$ $$match$$ : Quite a clinical chase in the end by SRH despite the chase going into the final over. They hardly broke into a sweat. A few needless wickets but importantly, Dhawan was there from the start. SRH must be wondering why they didn't hit this form earlier in the tournament. They live to fight another day."}, {"ball": 19.4, "isHighlight": false, "text": "CSK were flat on the field."}, {"ball": 19.4, "isHighlight": false, "text": ""}, {"ball": 19.4, "isHighlight": false, "text": "So Dhoni reckons they needed to score 230. That's the level of confidence he has in his bowlers. That's a worrying sign ahead of the playoffs."}], "name": "Chennai Super Kings v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734029.html?innings=2;view=commentary", "match_num": 50}