{"commentary": [{"ball": 0, "isHighlight": false, "text": "Wayne Parnell to open the bowling for Delhi Daredevils. Simmons to face."}, {"ball": 0, "isHighlight": false, "text": "$$4.00$$ $$pm$$  Word is coming in that Mumbai Indians had picked Praveen Kumar in the starting XI but apparently he got injured after the toss and before the start of play. Mumbai want to replace him. The umpires and IPL COO Sundar Raman were having discussions with Delhi Daredevils captain Kevin Pietersen and Gary Kirsten."}, {"ball": 0, "isHighlight": false, "text": "Hussey and Simmons are helmeted and waiting just outside the boundary. The TV commentators are saying that Mumbai want to play Ojha instead of Praveen. That's a left-arm spinner for a seamer, and Mumbai are bowling second."}, {"ball": 0, "isHighlight": false, "text": "The umpires are finally walking on to the field. I'll let you know what has happened asap.  $$Mumbai$$ $$have$$ $$been$$ $$allowed$$ $$to$$ $$replace$$ $$Praveen$$ $$Kumar$$ $$with$$ $$Pragyan$$ $$Ojha$$ , who was not even among the four designated reserves for this game."}, {"ball": 0, "isHighlight": false, "text": "$$Toss,$$ $$3.30$$ $$pm$$  It's a scorcher of an afternoon in Mumbai. The Wankhede is understandably not at full capacity. Kevin Pietersen has won the toss and  $$Delhi$$ $$Daredevils$$ $$will$$ $$bowl$$ $$first$$ . He says it is hard to defend at the Wankhede. Rohit wanted to bowl first as well."}, {"ball": 0, "isHighlight": false, "text": "Mumbai have made two changes. They have left out Krishmar Santokie and Pragyan Ojha, and brought in Harbhajan Singh and Marchant de Lange, who is playing his first game of the season."}, {"ball": 0, "isHighlight": false, "text": "Delhi have also made two changes. I'll have them for you as soon as I confirm them. They have replaced Mayank Agarwal and Mohammad Shami with Shahbaz Nadeem and Siddarth Kaul."}, {"ball": 0, "isHighlight": false, "text": "Priyank: \"@rahul - third one does not matter much as long as we can still do the fourth one effectively. SRH at present have a poor NRR than MI, and we are looking at 2 wins for MI, which should definitely boost their NRR further.\""}, {"ball": 0, "isHighlight": false, "text": "Karan: \"Great to see de Lange making his debut. With his height and pace, he should be able to extract good bounce off the wicket.\""}, {"ball": 0, "isHighlight": false, "text": "Shan: \"Josh Hazlewood should've came in instead of de Lange. Josh has a far better t20 career plus on form. Good Luck MI!\""}, {"ball": 0, "isHighlight": false, "text": "Harish: \"One of most expected future indian bowler is not even in his franchise team. #Mohammad Shami\""}, {"ball": 0, "isHighlight": false, "text": "Sid: \"@James: Your views are true of KP as of today. However, it was DD's fault to appoint him as the captain inspite of him having proved time and again that he's not a good captain. Additionally, they've given him a sub-par bowling line-up who can't defend any score at all. Look at the sheet and you'll tend to agree..\""}, {"ball": 0, "isHighlight": false, "text": "$$3.20$$ $$pm$$  Good afternoon and welcome to ESPNcricinfo's ball-by-ball commentary of the game between Mumbai Indians and Delhi Daredevils at Wankhede Stadium. Mumbai need to win this game and then hope Royals lose later tonight to stay alive in the season; Delhi are playing for proverbial pride. I'm George Binoy, your commentator for the game."}, {"ball": 0, "isHighlight": false, "text": "Here's what  $$the$$ $$points$$ $$table$$  looks like at the moment."}, {"ball": 0, "isHighlight": false, "text": "Rahul: \"As a MI fan i have four games, in one of which my hopes will be shattered. First, we need to beat DD. Second, KXIP should beat RR. Third, hope that KKR defeats SRH. Last, eliminate RR with big win. Any of these games go bad, we are done with this ipl season. :( Fingers crossed\""}, {"ball": 0, "isHighlight": false, "text": "James: \"Having read  $$Paul$$ $$Downton's$$ $$comments$$  elsewhere on Cricinfo, it's probably fair to suggest that KP's form and contribution for DD this season has been the best advert for his views. Taking Mumbai to win this, even without the Slinga. Talking of the Slinga, anyone want to sign Chris Jordan?\""}, {"ball": 0, "isHighlight": false, "text": "**"}, {"ball": 0, "isHighlight": false, "text": "Three days left. Nine more shots at an all-expenses paid trip to London to watch India play England at Lord's.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ $$beckons.$$ $$Play$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Parnell to Simmons,no run,in the blockhole first up from over the wicket, Simmons stays in his crease and keeps it out"}, {"ball": 0.2, "isHighlight": false, "text": "Parnell to Simmons,no run,nearly in the blockhole once again, clipped off the pads towards mid-on"}, {"ball": 0.3, "isHighlight": false, "text": "Parnell to Simmons,1 run,strays on to the pads this time on a full length, Simmons is well balanced as he glances towards long leg"}, {"ball": 0.4, "isHighlight": false, "text": "Parnell to Hussey, $$FOUR$$ ,shot, Hussey gets going with a cracking drive, using the width on offer outside off stump to drive off the front foot through cover"}, {"ball": 0.4, "isHighlight": false, "text": "James: \"Replacement should surely be like for like. You can't change the balance of the attack after the toss.\""}, {"ball": 0.5, "isHighlight": false, "text": "Parnell to Hussey,no run,pushed to mid-on for a single, direct hit at the striker's end but Simmons is well home"}, {"ball": 0.5, "isHighlight": false, "text": "JC: \"With respect to replacing a player before the match has started, if its after the toss then with the current rules then tough. Also, if you do allow it then it has to be a like for like replacement otherwise it becomes tactical and you open up the field for teams to abuse the \"oh we lost the toss so we'll get in another spinner\".\""}, {"ball": 0.6, "isHighlight": false, "text": "Parnell to Hussey,1 run,stays in his crease and opens the face to steer to third man"}, {"ball": 0.6, "isHighlight": false, "text": "Harish: \"How was Pragyan Ojha picked, who was not even among the four designated reserves for this game. #disastrous.\""}, {"ball": 0.6, "isHighlight": false, "text": "Mukul: \"This is certainly unfair for DD. Like for a like in such a situation. Spin replacing pace sounds more like a tactical change after the toss, not a replacement.\""}, {"ball": 0.6, "isHighlight": false, "text": "shankar: \"I donno why something strange always happens with MI. I remember once they are allowed to play 5 foreign players now a player replacement before the start of play.\""}, {"ball": 1.1, "isHighlight": false, "text": "Kaul to Hussey,no run,a full ball on leg stump, Hussey tries to flick but misses and is hit on the pad"}, {"ball": 1.1, "isHighlight": false, "text": "EPM: \"@JC: I guess DD agreed cause they know the match doesn't really mean anything to them\""}, {"ball": 1.2, "isHighlight": false, "text": "Kaul to Hussey,no run,a full ball on the pads, this time Hussey makes good contact with the flick but places it to the fielder at midwicket"}, {"ball": 1.3, "isHighlight": false, "text": "Kaul to Hussey, $$FOUR$$ ,that's a poor ball, full length and down leg side, all Hussey needed to do was get enough bat on it to beat the fielder at short fine leg, well executed"}, {"ball": 1.4, "isHighlight": false, "text": "Kaul to Hussey,1 run,pushed from the crease into the leg side for a single"}, {"ball": 1.4, "isHighlight": false, "text": "Tarun Kaushik: \"Five foreign players? Really? When?\" During one of the previous Champions Leagues, in 2011 I think."}, {"ball": 1.5, "isHighlight": false, "text": "Kaul to Simmons,1 run,a length ball on a wicket to wicket line, played from the crease towards midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Kaul to Hussey,1 run,picks off a single by pushing the ball towards midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Krishmar Santokie was left out out today, though he  $$smashed$$ $$the$$ $$record$$  for fastest bowler to 100 T20 wickets in Mumbai's previous game."}, {"ball": 1.6, "isHighlight": false, "text": "Sarath: \"Just saw the complete Mumbai squad. There is no other fast bowler in the team to replace Praveen. So how could they replace Praveen kumar with a 'like' bowler?\""}, {"ball": 2.1, "isHighlight": false, "text": "Parnell to Hussey, $$FOUR$$ ,Hussey steps down the pitch and lofts a slower ball through the line, chipping it back over the bowler's head for four"}, {"ball": 2.2, "isHighlight": false, "text": "Parnell to Hussey,no run,turned off the pads to square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Parnell to Hussey,1 run,width outside off stump and Hussey cuts off the back foot to third man"}, {"ball": 2.4, "isHighlight": false, "text": "Parnell to Simmons,no run,in the blockhole once again, played back to the bowler"}, {"ball": 2.4, "isHighlight": false, "text": "Here's the story about  $$Mumbai$$ $$being$$ $$allowed$$ $$five$$ $$foreigners$$ ."}, {"ball": 2.5, "isHighlight": false, "text": "Parnell to Simmons, $$FOUR$$ ,Simmons gets on to the front foot, moves slightly towards the off, and slogs a short ball over midwicket for four"}, {"ball": 2.6, "isHighlight": false, "text": "Parnell to Simmons,2 runs,Simmons backs away outside leg stump and slugs a short of a length ball towards deep midwicket, he didn't time it so the ball plugs in the outfield"}, {"ball": 2.6, "isHighlight": false, "text": "Sowmen: \"@Sarath...That does not justify the decision of Mumbai to play Ojha. It is certainly against the spirit of the game. They should have picked up a player from their reserves. In first place the umpires should not have allowed it.\""}, {"ball": 3.1, "isHighlight": false, "text": "Unadkat to Hussey, $$FOUR$$ ,that's too short, Hussey's bread and butter, he picks it up from around off and pulls to the midwicket boundary"}, {"ball": 3.2, "isHighlight": false, "text": "Unadkat to Hussey,1 leg bye,a better length, pitching around off and angling into the left-hander, Hussey tries to glance but misses and is hit on the pad"}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Simmons,1 run,Simmons plays the ball towards point and sets off for a single"}, {"ball": 3.4, "isHighlight": false, "text": "Unadkat to Hussey, $$FOUR$$ ,just not that short really but Unadkat's pace is such that Hussey has enough time to swivel and pull to the square leg boundary"}, {"ball": 3.5, "isHighlight": false, "text": "Unadkat to Hussey,1 run,a fuller length on off and middle, Hussey flicks through midwicket"}, {"ball": 3.6, "isHighlight": false, "text": "Unadkat to Simmons,1 run,a close call at the bowler's end! Simmons would have been gone with a direct hit. He pushed the ball into the covers and ran though the fielder got to the ball really quickly. The under-arm throw missed at the non-striker's end though"}, {"ball": 4.1, "isHighlight": false, "text": "Kaul to Simmons,1 wide,banged in short and down leg side, Simmons advances and tries to pull but misses, that's a big wide"}, {"ball": 4.1, "isHighlight": false, "text": "Kaul to Simmons,4 leg byes,a huge appeal for lbw after Simmons misses the pull, the length was not short enough and the ball skidded through and hit the back thigh. The impact was too high. What's worse for Delhi is that the ball went off the thigh to the third man boundary"}, {"ball": 4.2, "isHighlight": false, "text": "Kaul to Simmons, $$FOUR$$ ,Delhi are bleeding here, Simmons opens the face to steer a length ball past the man at point, there's no one in the deep and this outfield is fast"}, {"ball": 4.3, "isHighlight": false, "text": "Kaul to Simmons,no run,Hussey dives at the bowler's end to make his crease; he had set off for a single after Simmons played the ball to square leg"}, {"ball": 4.4, "isHighlight": false, "text": "Kaul to Simmons,1 run,Simmons steps out of his crease but has to adjust because Kaul shortens his length and cramps him for room"}, {"ball": 4.5, "isHighlight": false, "text": "Kaul to Hussey, $$FOUR$$ ,shot! Mumbai bring up 50 in quick time. Hussey charges down the pitch and then cuts a length ball fiercely through point"}, {"ball": 4.6, "isHighlight": false, "text": "Kaul to Hussey, $$FOUR$$ ,how can you bowl that length with fine leg in the circle? Short and down leg side. Hussey swings around and pulls to the long leg boundary"}, {"ball": 4.6, "isHighlight": false, "text": "The left-arm spinner Shahbaz Nadeem from round the wicket ..."}, {"ball": 5.1, "isHighlight": false, "text": "Nadeem to Simmons,1 leg bye,fires it down leg side, the ball brushes Simmons' pad and runs down to fine leg"}, {"ball": 5.1, "isHighlight": false, "text": "Adway - MI Supp: \"I'm busy erasing my comments against Hussey from last month & half from all social media. #Lovingit\""}, {"ball": 5.2, "isHighlight": false, "text": "Nadeem to Hussey, $$SIX$$ ,you'll love this too! Hussey charges the spinner, gets to the pitch of the ball, and plays a flowing lofted drive, hitting through the line and sending the ball soaring over the straight boundary"}, {"ball": 5.3, "isHighlight": false, "text": "Nadeem to Hussey,1 run,nudged towards midwicket for a single"}, {"ball": 5.4, "isHighlight": false, "text": "Nadeem to Simmons,1 run,a quicker one skids into the right-hander, Simmons manages to push it towards square leg"}, {"ball": 5.5, "isHighlight": false, "text": "Nadeem to Hussey,1 run,flat and on leg stump, Hussey turns the ball off his pads through square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Nadeem to Simmons,1 run,fired down leg side, Simmons paddles straight to short fine leg and Hussey calls him through, Simmons has to run really hard to make it but the throw is poor"}, {"ball": 5.6, "isHighlight": false, "text": "Time to draw a line under the Praveen Kumar-Pragyan Ojha switch. If Kevin Pietersen had not allowed it, it would not have happened. Mumbai asked, KP said yes."}, {"ball": 5.6, "isHighlight": false, "text": "Now, how about this start for Mumbai?"}, {"ball": 5.6, "isHighlight": false, "text": "Vipin: \"KP's captaincy is one of the reason DD is at bottom .You don't throw the ball to a left arm spinner during power-plays against a left handed batsmen who is in red hot form.\""}, {"ball": 5.6, "isHighlight": false, "text": "JP Duminy to bowl the first over after the Powerplay."}, {"ball": 6.1, "isHighlight": false, "text": "Duminy to Simmons,2 runs,pushed off the back foot into the gap beyond extra cover, Hussey hustles the second"}, {"ball": 6.2, "isHighlight": false, "text": "Duminy to Simmons,1 run,he's mis-timed this, the slog across the line aimed for the stands beyond midwicket, the ball falls short of the fielders in the deep"}, {"ball": 6.3, "isHighlight": false, "text": "Duminy to Hussey,1 run,paddled behind square for a single"}, {"ball": 6.4, "isHighlight": false, "text": "Duminy to Simmons,no run,a full ball on off stump, Hussey drives to deep extra cover"}, {"ball": 6.5, "isHighlight": false, "text": "Duminy to Simmons,1 run,that's flat and short, luckily for Duminy, Simmons cut it straight to the fielder at short third man"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Hussey,1 run,Hussey leans forward and drives to long-on for one more"}, {"ball": 6.6, "isHighlight": false, "text": "Imran Tahir to bowl from over the wicket ..."}, {"ball": 7.1, "isHighlight": false, "text": "Imran Tahir to Hussey,1 run,bowled flat and straight, Hussey goes back and clips the ball through square leg"}, {"ball": 7.2, "isHighlight": false, "text": "Imran Tahir to Simmons, $$FOUR$$ ,he's pitched it too short and there's enough room outside off for Simmons to go back and lash the ball through point with a fearsome cut"}, {"ball": 7.3, "isHighlight": false, "text": "Imran Tahir to Simmons,1 wide,that's a poor call for wide I'm afraid, Simmons had backed away so far outside leg and to counter that Tahir fired the ball wide outside off, that was inside the wide line"}, {"ball": 7.3, "isHighlight": false, "text": "Imran Tahir to Simmons, $$FOUR$$ ,width offered outside off and though the length is fuller Simmons manages to play a superb square drive to the point boundary"}, {"ball": 7.4, "isHighlight": false, "text": "Imran Tahir to Simmons,2 runs,cut hard through point again, there's just too much width from Tahir, there's a fielder in the deep this time"}, {"ball": 7.5, "isHighlight": false, "text": "Imran Tahir to Simmons, $$FOUR$$ ,the fuller one and on a straighter line but it makes no difference, Simmons drills it down the ground and beats the fielder at long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Imran Tahir to Simmons, $$OUT$$ ,caught in the deep this time! Simmons tries to blast over the cover boundary but mis-times it, he ends up slicing it in the air and Parnell comes running in from the deep and take s a well-judged catch on the move. Tahir's celebrations are characteristically exuberant"}, {"ball": 7.6, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$c$$ $$Parnell$$ $$b$$ $$Imran$$ $$Tahir$$ $$35$$ $$(39m$$ $$25b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 8.1, "isHighlight": false, "text": "Duminy to Sharma,no run,defended back to the bowler on the front foot"}, {"ball": 8.2, "isHighlight": false, "text": "Duminy to Sharma,1 run,Rohit stepped out of his crease and aimed for deep midwicket, the ball went off the leading edge to long-on"}, {"ball": 8.3, "isHighlight": false, "text": "Duminy to Hussey,1 run,worked from outside off stump through the leg side for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Duminy to Sharma,1 run,a full ball around off stump, driven to long off for a single"}, {"ball": 8.5, "isHighlight": false, "text": "Duminy to Hussey,no run,Hussey tries to sweep but does not make proper contact"}, {"ball": 8.6, "isHighlight": false, "text": "Duminy to Hussey,no run,Hussey tries to drive through the off side but gets an inside edge on to the pad"}, {"ball": 8.6, "isHighlight": false, "text": "Vishnu Prasad: \"If only Mumbai would have persisted Hussey for some more matches, they would be in top of the table by this time.\""}, {"ball": 9.1, "isHighlight": false, "text": "Imran Tahir to Sharma,1 run,Rohit leans forward and drives the tossed up ball to long off"}, {"ball": 9.2, "isHighlight": false, "text": "Imran Tahir to Hussey,1 run,bowled full around off stump, Hussey stays in his crease and drives the ball through cover"}, {"ball": 9.3, "isHighlight": false, "text": "Imran Tahir to Sharma,1 run,pushed off the front foot to long on for another single"}, {"ball": 9.4, "isHighlight": false, "text": "Imran Tahir to Hussey, $$SIX$$ ,that's the googly and Hussey has sent it flat over extra cover for six to bring up his fifty. He got to the pitch of it on the front foot, read the delivery and drove it perfectly"}, {"ball": 9.5, "isHighlight": false, "text": "Imran Tahir to Hussey,no run,driven firmly, but straight to cover"}, {"ball": 9.6, "isHighlight": false, "text": "Imran Tahir to Hussey,1 run,nudged off the back foot on the leg side for a single that brings up Mumbai's 100, in ten over."}, {"ball": 10.1, "isHighlight": false, "text": "Duminy to Hussey,1 run,Hussey has mis-timed one! He steps out and slogs, he was probably looking for wide long-on but the ball went along the ground through midwicket"}, {"ball": 10.2, "isHighlight": false, "text": "Duminy to Sharma, $$FOUR$$ ,bowled flat and wide outside off stump, Rohit reaches for it and opens the face, dabbing it between the keeper and short third man for another boudnary"}, {"ball": 10.3, "isHighlight": false, "text": "Duminy to Sharma, $$FOUR$$ ,short, wide and rubbish. Rohit reaches out for it again and cuts the ball hard through point, no protection in the deep"}, {"ball": 10.4, "isHighlight": false, "text": "Duminy to Sharma,2 runs,a full toss on the pads, Rohit did not hit it too hard, just drove it firmly along the ground towards cow corner"}, {"ball": 10.5, "isHighlight": false, "text": "Duminy to Sharma,no run,another low full toss, Rohit drives to the man at cover"}, {"ball": 10.6, "isHighlight": false, "text": "Duminy to Sharma,1 run,wide outside off again, he cuts it to the man at deep point"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem comes back"}, {"ball": 11.1, "isHighlight": false, "text": "Nadeem to Sharma,1 run,full and on the stumps, Rohit leans forward and works it to long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Nadeem to Hussey,1 run,Hussey comes down the pitch and yorks himself somewhat, digs the ball out to long-off"}, {"ball": 11.3, "isHighlight": false, "text": "Nadeem to Sharma, $$FOUR$$ ,sweet. down the pitch, and he doesn't get to the pitch, bit he's hit it on the up to the left of a diving cover"}, {"ball": 11.4, "isHighlight": false, "text": "Nadeem to Sharma,1 run,shortish ball, Rohit backs away and chips it down to wide long-off. Didn't really get hold of it"}, {"ball": 11.5, "isHighlight": false, "text": "Nadeem to Hussey,1 run,full toss, driven to wide long-off"}, {"ball": 11.6, "isHighlight": false, "text": "Nadeem to Sharma, $$OUT$$ ,whoa. Why did they run for that? back of a length, Rohit waits, opens his face, and dabs it to Jadhav at point. He throws to the keeper's end, and DK has disturbed the stumps with Hussey short of the crease. The bails come off fully with his bat just short, almost on the line"}, {"ball": 11.6, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$run$$ $$out$$ $$56$$ $$(55m$$ $$33b$$ $$7x4$$ $$2x6)$$ $$SR:$$ $$169.69$$"}, {"ball": 11.6, "isHighlight": false, "text": "Kieron Pollard's walked out wearing a floppy hat."}, {"ball": 12.1, "isHighlight": false, "text": "Duminy to Sharma,2 runs,Rohit stays back and flicks the ball towards cow corner and his placement was almost perfect, the fielder had to dive to save the boundary"}, {"ball": 12.2, "isHighlight": false, "text": "Duminy to Sharma,no run,tries to drive a fuller ball without much footwork and is beaten"}, {"ball": 12.3, "isHighlight": false, "text": "Duminy to Sharma,1 run,full toss on the pads, nearly outside leg, flicked to deep midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Duminy to Pollard, $$SIX$$ ,Pollard doesn't waste any time! He simply lofts a full ball on the front foot far over the straight boundary. Sweet contact"}, {"ball": 12.4, "isHighlight": false, "text": "James: \"That run out might work for Mumbai, if it gives Pollard 8 overs against a fairly toothless Delhi attack.\""}, {"ball": 12.4, "isHighlight": false, "text": "Looks like the ball has been lost (or pocketed in the stands?). The replacement has been chosen."}, {"ball": 12.5, "isHighlight": false, "text": "Duminy to Pollard,no run,Pollard has a mighty swing at a flat, faster and wide ball outside off, he was beaten by a long way. Pollard wanted to launch it over cover"}, {"ball": 12.6, "isHighlight": false, "text": "Duminy to Pollard,1 run,nudged off the pads on the back foot towards square leg"}, {"ball": 13.1, "isHighlight": false, "text": "Nadeem to Pollard,1 run,Pollard steps out but isn't to the pitch of the ball against the left-arm spinner from round the wicket, pushed off the pads through midwicket"}, {"ball": 13.2, "isHighlight": false, "text": "Nadeem to Sharma,1 run,driven to long off for another single"}, {"ball": 13.3, "isHighlight": false, "text": "Nadeem to Pollard,1 run,that's a quicker ball angling into the right-hander, worked off the back foot towards long on"}, {"ball": 13.4, "isHighlight": false, "text": "Nadeem to Sharma,1 run,driven to the fielder on the extra cover boundary"}, {"ball": 13.5, "isHighlight": false, "text": "Nadeem to Pollard,no run,Pollard steps out again but has to adjust and defend after Nadeem fired the ball flat into the right-hander"}, {"ball": 13.6, "isHighlight": false, "text": "Nadeem to Pollard,2 runs,turned off the pads through midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Unadkat's back, from round the wicket ..."}, {"ball": 14.1, "isHighlight": false, "text": "Unadkat to Sharma, $$FOUR$$ ,he bangs it in short and the ball disappears, Rohit met it on the front foot and pulled hard into the gap on the midwicket boundary"}, {"ball": 14.2, "isHighlight": false, "text": "Unadkat to Sharma, $$OUT$$ ,bowled him! A poor choice of shot from Rohit. He backed away outside leg to cut a fuller ball that was following him and cramping him for room. He missed, and leg stump took a hit"}, {"ball": 14.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$b$$ $$Unadkat$$ $$30$$ $$(25m$$ $$21b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$142.85$$"}, {"ball": 14.2, "isHighlight": false, "text": "Ambati Rayudu is the new batsman."}, {"ball": 14.3, "isHighlight": false, "text": "Unadkat to Rayudu,1 run,good length around off stump, Rayudu stays in his crease, drops the ball close on the off side and runs"}, {"ball": 14.4, "isHighlight": false, "text": "Unadkat to Pollard, $$OUT$$ ,caught behind! Unadkat has jolted this innings out of the blue. Pollard cannot believe he has been given out, and I am not sure why he seems confused. Unadkat bowled full, in the blockhole outside off stump, Pollard tried to squeeze it out on the off side but his bat hit the ground first and then the ball went off the outside edge to the keeper"}, {"ball": 14.4, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$c$$ $$†Karthik$$ $$b$$ $$Unadkat$$ $$11$$ $$(12m$$ $$8b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$137.50$$"}, {"ball": 14.4, "isHighlight": false, "text": "Aditya Tare is the new batsman."}, {"ball": 14.5, "isHighlight": false, "text": "Unadkat to Tare, $$FOUR$$ ,that's a sensational drive, the ball was full outside off, Tare moves forward and drives on the up through cover, perfectly timed and placed"}, {"ball": 14.6, "isHighlight": false, "text": "Unadkat to Tare, $$FOUR$$ ,Tare's started in high gear! This ball is full and outside off, and Tare square drives it past point for successive boundaries"}, {"ball": 15.1, "isHighlight": false, "text": "Nadeem to Rayudu,1 run,punched from the crease through extra cover for a single"}, {"ball": 15.2, "isHighlight": false, "text": "Nadeem to Tare,no run,that pitched on middle and spun across the right-hander, Tare defended it it on the back foot, he was squared up a bit"}, {"ball": 15.3, "isHighlight": false, "text": "Nadeem to Tare,1 run,nudged on the leg side, towards midwicket for a single"}, {"ball": 15.4, "isHighlight": false, "text": "Nadeem to Rayudu, $$OUT$$ ,Rayudu steps out and lofts the ball straight to M Vijay at long-off. Vijay did not have to move at all and he took it really casually. Rayudu had not got to the pitch of the ball and ended up slicing it"}, {"ball": 15.4, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Vijay$$ $$b$$ $$Nadeem$$ $$2$$ $$(7m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 15.4, "isHighlight": false, "text": "Milind: \"MI knows its a do-or-die match now and they are playing like one. Even after losing 2 wickets in 3 deliveries, Tare doesn't hold himself back to defend, goes after the same bowler instantly!\""}, {"ball": 15.4, "isHighlight": false, "text": "Ravi: \"This is self destruction. Mumbai have to forget 200 now ....think of playing out 20 overs. Horrible batting in last 2 overs. \""}, {"ball": 15.5, "isHighlight": false, "text": "Nadeem to Harbhajan Singh,1 run,Harbhajan gets on the front foot and nurdles the ball towards point"}, {"ball": 15.6, "isHighlight": false, "text": "Nadeem to Tare,1 run,glanced off the pads towards short fine leg"}, {"ball": 16.1, "isHighlight": false, "text": "Imran Tahir to Tare,no run,Tahir fires it in flat and on a good length outside off, Tare is beaten on the cut"}, {"ball": 16.2, "isHighlight": false, "text": "Imran Tahir to Tare, $$FOUR$$ ,that's too short this time, Tare moves back in a flash and cuts the ball firmly, placing it well enough to beat the fielder's dive on the boundary"}, {"ball": 16.3, "isHighlight": false, "text": "Imran Tahir to Tare, $$OUT$$ ,what on earth are Mumbai doing? Tare moves forward, gets down on one knee and slog sweeps the ball straight to Kedar Jadhav at deep midwicket. Jadhav came forward and got down on his knees to take the catch. It was the googly that did Tare in"}, {"ball": 16.3, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$Jadhav$$ $$b$$ $$Imran$$ $$Tahir$$ $$14$$ $$(10m$$ $$8b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$175.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Imran Tahir to Gopal,1 run,pushed towards long on for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Imran Tahir to Harbhajan Singh,1 run,nudged off the front foot through point for a single, they think about the second but decide against it"}, {"ball": 16.6, "isHighlight": false, "text": "Imran Tahir to Gopal,1 run,bowled full and straight, driven from middle stump through cover"}, {"ball": 17.1, "isHighlight": false, "text": "Parnell to Gopal,1 run,good length on middle and off, stays in his crease and dabs in front of point for a single"}, {"ball": 17.2, "isHighlight": false, "text": "Parnell to Harbhajan Singh, $$OUT$$ ,Mumbai are giving Delhi catching practice. Harbhajan simply lofts a length ball through the line, hitting it straight to Vijay at long-off. This is some exceptionally ordinary batting"}, {"ball": 17.2, "isHighlight": false, "text": "$$Harbhajan$$ $$Singh$$ $$c$$ $$Vijay$$ $$b$$ $$Parnell$$ $$2$$ $$(9m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 17.2, "isHighlight": false, "text": "Marchant de Lange is the new batsman."}, {"ball": 17.3, "isHighlight": false, "text": "Parnell to de Lange,1 run,a full toss outside off stump, the batsman opens the face a little and the ball goes off the thick outside edge to beat the keeper on his right"}, {"ball": 17.4, "isHighlight": false, "text": "Parnell to Gopal,no run,Gopal moves back and across towards the off side to drive to point"}, {"ball": 17.5, "isHighlight": false, "text": "Parnell to Gopal, $$FOUR$$ ,short and wide outside off stump, poor delivery, Gopal stays back and cuts the ball superbly between the fielders at point and gully"}, {"ball": 17.6, "isHighlight": false, "text": "Parnell to Gopal,1 run,full and straight, Gopal stays steady in his crease and flicks the ball through midwicket"}, {"ball": 18.1, "isHighlight": false, "text": "Imran Tahir to Gopal,1 run,Gopal steps out of his crease and hits the ball towards long-on, gets to the fielder on the bounce"}, {"ball": 18.2, "isHighlight": false, "text": "Imran Tahir to de Lange, $$OUT$$ ,De Lange looks unhappy with the decision to give him out caught behind. He tried to reverse sweep a full ball outside off stump - how's that for shot selection in this position? - and missed. Not sure if he edged it into Karthik's gloves because the sound seemed to come from the bat hitting the ground. There might have been some glove on it"}, {"ball": 18.2, "isHighlight": false, "text": "$$M$$ $$de$$ $$Lange$$ $$c$$ $$†Karthik$$ $$b$$ $$Imran$$ $$Tahir$$ $$1$$ $$(4m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 18.2, "isHighlight": false, "text": "Pragyan Ojha, who wasn't supposed to play today, is the new batsman."}, {"ball": 18.3, "isHighlight": false, "text": "Imran Tahir to Ojha,1 run,played off the back foot towards the bowler, Tahir fumbles and concedes a single"}, {"ball": 18.4, "isHighlight": false, "text": "Imran Tahir to Gopal,1 run,swatted off the back foot to deep midwicket"}, {"ball": 18.5, "isHighlight": false, "text": "Imran Tahir to Ojha,1 run,punched off the back foot to cover for a quick single"}, {"ball": 18.6, "isHighlight": false, "text": "Imran Tahir to Gopal, $$OUT$$ ,it's all happening out there! Gopal charges down the pitch and slogs, the ball flies off the outside edge but falls short of Unadkat at short third man. The ball deflects off Unadkat towards Tiwary at point. The batsmen hesitate and the throw comes to the keeper quickly. Ojha is well short"}, {"ball": 18.6, "isHighlight": false, "text": "$$PP$$ $$Ojha$$ $$run$$ $$out$$ $$2$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.1, "isHighlight": false, "text": "Parnell to Gopal,1 run,driven to long on for a single"}, {"ball": 19.2, "isHighlight": false, "text": "Parnell to Bumrah,no run,banged in short and Bumrah is late on the hook and beaten"}, {"ball": 19.3, "isHighlight": false, "text": "Parnell to Bumrah,no run,short of a length and straight, Bumrah slogs across the line and misses"}, {"ball": 19.4, "isHighlight": false, "text": "Parnell to Bumrah,1 wide,  $$OUT$$ ,Mumbai's innings ends in shambles. Parnell bounces Bumrah, who tries to pull and is beaten. The square leg umpire begins to call the ball wide for height, but Gopal calls Bumrah through to try and get on strike by stealing a bye. Karthik hits the stumps and Gopal is not even in the frame"}, {"ball": 19.4, "isHighlight": false, "text": "$$S$$ $$Gopal$$ $$run$$ $$out$$ $$11$$ $$(17m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$110.00$$"}, {"ball": 19.4, "isHighlight": false, "text": "$$5.40$$ $$pm$$  Mumbai Indians looked like getting 200-220 at one stage. They have been dismissed for 173. They were 120 for 1 in 12 overs, before nine wickets collapsed for 53 runs."}, {"ball": 19.4, "isHighlight": false, "text": "rssampat: \"Gopal taking a single off the first ball of the last over, giving strike to No. 11 Bumrah and then after a couple of dot balls trying to regain it desperately shows the thinking capabilities of the MI think tank and their mental state.\""}, {"ball": 19.4, "isHighlight": false, "text": "Sam: \"It's still a decent score but there's something called momentum and DD will be the team taking it into the second innings. Its up to their batsmen now to make the momentum count. \""}, {"ball": 19.4, "isHighlight": false, "text": "mujtaba: \"Now where.is that guy who said hussey runout could be good for MI?\""}], "name": "Mumbai Indians v Delhi Daredevils", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734031.html?innings=1;view=commentary", "match_num": 51}