{"commentary": [{"ball": 0, "isHighlight": false, "text": "Three more days to book your seats on that plane to London, to watch India play England at Lord's this summer.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ $$-$$ $$Play$$ $$now$$ ."}, {"ball": 0, "isHighlight": false, "text": "Madhan: \"Can someone make me understand why S Gopal's run-out was referred to the third umpire? I think he was out by atleast 15 yards. Mystery!\""}, {"ball": 0, "isHighlight": false, "text": "M Vijay and Kevin Pietersen are opening the batting for Delhi. Bumrah to open the bowling for Mumbai."}, {"ball": 0.1, "isHighlight": false, "text": "Bumrah to Vijay,2 runs,slants into the pads with his first delivery, nudged from the crease through square leg"}, {"ball": 0.2, "isHighlight": false, "text": "Bumrah to Vijay,no run,a full ball around off stump, Vijay moves forward and across and drives to cover"}, {"ball": 0.3, "isHighlight": false, "text": "Bumrah to Vijay,1 leg bye,speared into the pads from wide of the crease, Vijay misses out while trying to whip it behind square, the ball goes off his pad"}, {"ball": 0.4, "isHighlight": false, "text": "Bumrah to Pietersen, $$FOUR$$ ,KP gets a freebie first up, it's short and really wide, KP uses his long reach and cuts the ball off the front foot through point"}, {"ball": 0.5, "isHighlight": false, "text": "Bumrah to Pietersen,no run,a fuller length closer to off stump, KP gets on to the front foot and plays to cover"}, {"ball": 0.6, "isHighlight": false, "text": "Bumrah to Pietersen,1 run,Hussey dives to his left at cover and brings down a speeding ball, KP had driven it hard off the front foot, three runs saved"}, {"ball": 0.6, "isHighlight": false, "text": "Marchant de Lange will bowl his first over of the season from over the wicket."}, {"ball": 1.1, "isHighlight": false, "text": "de Lange to Pietersen, $$FOUR$$ ,that's too full and too far on leg stump, KP leans across in his crease and glances to the fine-leg boundary"}, {"ball": 1.2, "isHighlight": false, "text": "de Lange to Pietersen,no run,a better line and length, around off stump, driven on the up to mid-off"}, {"ball": 1.3, "isHighlight": false, "text": "de Lange to Pietersen,1 run,KP stays in his crease and dabs the good length ball to midwicket and sets off for a quick single"}, {"ball": 1.4, "isHighlight": false, "text": "de Lange to Vijay,1 run,good length outside off stump, Vijay stays back and opens the face of his bat to steer the ball to third man"}, {"ball": 1.5, "isHighlight": false, "text": "de Lange to Pietersen, $$FOUR$$ ,that's short of a length and KP's hands are so quick, he gets into position in a flash and plays a short-arm pull to the backward square leg boundary"}, {"ball": 1.6, "isHighlight": false, "text": "de Lange to Pietersen, $$FOUR$$ ,a half-volley on the pads, too easy for KP, he picks it up lofts over midwicket for successive boundaries"}, {"ball": 1.6, "isHighlight": false, "text": "Pragyan Ojha, the man who wasn't supposed to be playing today, is going to bowl from round the wicket."}, {"ball": 2.1, "isHighlight": false, "text": "Ojha to Vijay,no run,defended on the back foot"}, {"ball": 2.2, "isHighlight": false, "text": "Ojha to Vijay,1 run,Vijay leans across and flicks with the angle into him through square leg"}, {"ball": 2.3, "isHighlight": false, "text": "Ojha to Pietersen,no run,KP plays the first ball from the left-arm spinner on the front foot and with a straight bat"}, {"ball": 2.4, "isHighlight": false, "text": "Ojha to Pietersen,no run,KP's been beaten and the bails are off! Was he out of his crease? Ojha flighted the ball nicely into the right-hander and spun it away from KP, beating the booming drive. KP dragged his back foot out but slid it back in time before the stumps were broken"}, {"ball": 2.5, "isHighlight": false, "text": "Ojha to Pietersen,1 run,that's the one that slides on with the arm, KP stays in his crease and defends watchfully on the leg side"}, {"ball": 2.6, "isHighlight": false, "text": "Ojha to Vijay,no run,blocked on the front foot on the off side"}, {"ball": 3.1, "isHighlight": false, "text": "Bumrah to Pietersen, $$SIX$$ ,a length ball outside off stump, and it has disappeared! KP meets it on the front foot and lofts on the up, though the line. Cleared long-off comfortably"}, {"ball": 3.2, "isHighlight": false, "text": "Bumrah to Pietersen,2 runs, $$Dropped$$ , by de Lange, but the chance was a really tough one. KP lofted a slower ball down the ground but mis-timed it. He hit it really high and de Lange had to run a long way back from mid-on, he got finger tips on it"}, {"ball": 3.3, "isHighlight": false, "text": "Bumrah to Pietersen,no run,tries to whip it on the leg side but misses and is hit on the pad"}, {"ball": 3.4, "isHighlight": false, "text": "Bumrah to Pietersen,no run,in the blockhole outside off stump, KP tries to squeeze it out behind point but is beaten"}, {"ball": 3.5, "isHighlight": false, "text": "Bumrah to Pietersen,no run,another slower ball wide outside off stump, KP drove away from his body on the front foot but played the shot way too early and was beaten"}, {"ball": 3.6, "isHighlight": false, "text": "Bumrah to Pietersen,1 run,a fast full toss on leg stump, KP leans across in his crease and works it to long on"}, {"ball": 3.6, "isHighlight": false, "text": "Left-arm spin v KP, round two. A slip in place."}, {"ball": 4.1, "isHighlight": false, "text": "Ojha to Pietersen,1 run,pushed off the front foot to mid-on"}, {"ball": 4.2, "isHighlight": false, "text": "Ojha to Vijay,1 run,Vijay goes back into his crease and works the ball through midwicket"}, {"ball": 4.3, "isHighlight": false, "text": "Ojha to Pietersen, $$FOUR$$ ,edged! But the ball flies fast and wide of Hussey at slip! KP backed away to make room and cut hard, the edge was a difficult one to take"}, {"ball": 4.4, "isHighlight": false, "text": "Ojha to Pietersen,1 run,nudged behind square for a single"}, {"ball": 4.5, "isHighlight": false, "text": "Ojha to Vijay,2 runs,Vijay steps out and chips over the bowler's head"}, {"ball": 4.6, "isHighlight": false, "text": "Ojha to Vijay,1 run,goes back and across to work the ball through midwicket"}, {"ball": 4.6, "isHighlight": false, "text": "Prateek Verma: \"My 4 year old nephew has the same expression going to school as KP has when playing a left arm spinner. \""}, {"ball": 4.6, "isHighlight": false, "text": "Gopal to bowl legspin from over the wicket."}, {"ball": 5.1, "isHighlight": false, "text": "Gopal to Vijay,no run,defended on the front foot back to the bowler"}, {"ball": 5.2, "isHighlight": false, "text": "Gopal to Vijay, $$OUT$$ ,Vijay's been stumped! A nothing shot from him. He got out of his crease but was no where near the pitch of the ball. It dipped on him, and he swung in desperation as the ball spun away and beat the outside edge. Tare had the bails off in a flash with Vijay's back foot out of the crease"}, {"ball": 5.2, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$st$$ $$†Tare$$ $$b$$ $$Gopal$$ $$8$$ $$(19m$$ $$12b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 5.2, "isHighlight": false, "text": "Karthik is the new batsman."}, {"ball": 5.3, "isHighlight": false, "text": "Gopal to Karthik,no run,driven on the front foot to mid-on, not timed well"}, {"ball": 5.4, "isHighlight": false, "text": "Gopal to Karthik,no run,punched to mid-off, this was timed better"}, {"ball": 5.5, "isHighlight": false, "text": "Gopal to Karthik,no run,pitched on a great length around off stump, Karthik has to come forward and defend"}, {"ball": 5.6, "isHighlight": false, "text": "Gopal to Karthik, $$FOUR$$ ,Karthik moves back to a short ball and ends up pulling it past the fielder at mid-on, I think he wanted to hit that through midwicket but he'll get four anyway"}, {"ball": 6.1, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,2 runs,tossed up outside off stump, KP lunges on the front foot and drives hard through extra cover, using his long reach. Hussey is the boundary rider and his throw to the bowler is good, Karthik is home though"}, {"ball": 6.2, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,no run,KP is beaten outside leg stump while playing the reverse sweep"}, {"ball": 6.3, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,no run,defended from the crease towards midwicket"}, {"ball": 6.4, "isHighlight": false, "text": "Harbhajan Singh to Pietersen, $$FOUR$$ ,KP waits for the full ball outside off stump, makes room and plays the lofted drive into the gap on the extra cover boundary"}, {"ball": 6.5, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,no run,backs away outside leg to cut but can't beat the fielder at short third man"}, {"ball": 6.6, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,1 run,nudged off the pads towards square leg"}, {"ball": 6.6, "isHighlight": false, "text": "3ven: \"M Vijay is best of the biggest flops this season averaging 18.81\""}, {"ball": 7.1, "isHighlight": false, "text": "Gopal to Pietersen,1 run,backs away outside leg and drives off the back foot through cover"}, {"ball": 7.2, "isHighlight": false, "text": "Gopal to Karthik,no run,pushed from the crease towards point"}, {"ball": 7.2, "isHighlight": false, "text": "Mun: \"Why so many franchises are obsessed with of blue uniforms?\" Question of the day."}, {"ball": 7.3, "isHighlight": false, "text": "Gopal to Karthik,no run,Karthik attempts a big slog sweep but is beaten outside off stump"}, {"ball": 7.4, "isHighlight": false, "text": "Gopal to Karthik,1 run,this time he connects with the slog sweep, but there is a fielder at deep midwicket"}, {"ball": 7.5, "isHighlight": false, "text": "Gopal to Pietersen,1 run,short ball, bowled flat outside off, KP cuts it as it begins to break away from him, towards deep point"}, {"ball": 7.6, "isHighlight": false, "text": "Gopal to Karthik,no run,Karthik steps out of his crease but then defends because he is not to the pitch of the legbreak"}, {"ball": 8.1, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,1 run,KP cuts as the ball slides across him and he gets a thick outside edge to short third man, he runs a risky single too"}, {"ball": 8.2, "isHighlight": false, "text": "Harbhajan Singh to Karthik,no run,Karthik tries to play the reverse paddle-sweep with the back of his bat but makes no contact"}, {"ball": 8.3, "isHighlight": false, "text": "Harbhajan Singh to Karthik,1 run,moves across his crease and nudges through midwicket"}, {"ball": 8.4, "isHighlight": false, "text": "Harbhajan Singh to Pietersen,no run,KP makes room and tries to hit the ball off the back foot through cover but can't find the gap"}, {"ball": 8.5, "isHighlight": false, "text": "Harbhajan Singh to Pietersen, $$OUT$$ ,KP's been bowled while trying to switch-hit! Harbhajan slowed it up and bowled straight. KP switched and swung too early, the ball dipped on him beat the bat and hit the stumps"}, {"ball": 8.5, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$44$$ $$(32m$$ $$31b$$ $$6x4$$ $$1x6)$$ $$SR:$$ $$141.93$$"}, {"ball": 8.5, "isHighlight": false, "text": "Manoj Tiwary is the new batsman."}, {"ball": 8.5, "isHighlight": false, "text": "JatinUSA: \"This is a good wicket for proper cricketing shots. I think where Mumbai got it wrong was to start hitting everything in the air rather than continue to milk the wicket the way they did in the first 12 overs.\""}, {"ball": 8.6, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,no run,nudged off the front foot to midwicket"}, {"ball": 8.6, "isHighlight": false, "text": "Marchant's back, from over the wicket."}, {"ball": 9.1, "isHighlight": false, "text": "de Lange to Karthik,no run,144.5 kph, short of a length and at Karthik's body, he defends with a straight bat on the back foot"}, {"ball": 9.1, "isHighlight": false, "text": "Manu: \"Considering value for money and expectations, KP has been the biggest flop of this year's IPL. He hasn't played even one match-winning knock and he's been pretty poor as a captain as well. \""}, {"ball": 9.2, "isHighlight": false, "text": "de Lange to Karthik,1 run,short ball and Karthik pulls to deep midwicket"}, {"ball": 9.3, "isHighlight": false, "text": "de Lange to Tiwary,1 run,good length around off stump, pushed off the front foot through cover"}, {"ball": 9.4, "isHighlight": false, "text": "de Lange to Karthik, $$OUT$$ ,When a tall fast bowler is delivering at 140 kph plus, moving across your stumps towards the off and exposing all of them while trying to scoop is probably not the best choice of shot. Karthik tried it and his middle and leg stumps took a hit"}, {"ball": 9.4, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$b$$ $$de$$ $$Lange$$ $$7$$ $$(18m$$ $$13b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$53.84$$"}, {"ball": 9.4, "isHighlight": false, "text": "JP Duminy is the new batsman."}, {"ball": 9.5, "isHighlight": false, "text": "de Lange to Duminy,no run,full and straight, nearly in the blockhole, Duminy keeps it out"}, {"ball": 9.6, "isHighlight": false, "text": "de Lange to Duminy,1 run,a full ball swinging away from Duminy, who pushes towards mid off and runs"}, {"ball": 9.6, "isHighlight": false, "text": "Amar: \"M Vijay was a flop last year as well. It was predictable that KP might not click. But my choice of biggest flop is Dinesh Karthik. He was a much better player last year.\""}, {"ball": 9.6, "isHighlight": false, "text": "A slip in place. Harbhajan from round the wicket."}, {"ball": 10.1, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,Duminy gets on to the front foot, gets down on one knee, and sweeps behind square"}, {"ball": 10.2, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,no run,Tiwary moves forward and across to nudge on the leg side"}, {"ball": 10.3, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,no run,Tiwary steps out but isn't to the pitch of the ball, ends up playing it towards the non-striker"}, {"ball": 10.4, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,no run,now Tiwary tries to reverse sweep and was nearly bowled after he was beaten close to leg stump"}, {"ball": 10.5, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,2 runs,he plays the paddle sweep this time, and Rohit from first slip runs after the ball"}, {"ball": 10.6, "isHighlight": false, "text": "Harbhajan Singh to Tiwary, $$FOUR$$ ,finally he gets the execution right, Tiwary gets down on one knee and paddles the ball fine past the keeper, times it well too"}, {"ball": 11.1, "isHighlight": false, "text": "Gopal to Duminy,no run,driven back towards the bowler, that was in the air for a bit but fell short"}, {"ball": 11.2, "isHighlight": false, "text": "Gopal to Duminy,1 run,Duminy attempts the big slog sweep but mis-times it through square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Gopal to Tiwary, $$FOUR$$ ,steps out of his crease to a flighted ball, gets to the pitch of it, and lofts over the bowler's head between long off and long on"}, {"ball": 11.4, "isHighlight": false, "text": "Gopal to Tiwary,1 run,played to backward point for a quick single"}, {"ball": 11.5, "isHighlight": false, "text": "Gopal to Duminy, $$SIX$$ ,that's too short from Gopal and Duminy goes back into his crease and pulls the ball high and far over deep midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Gopal to Duminy,1 run,a fuller length on middle and leg, Duminy stays back and nudges off his pads behind square"}, {"ball": 12.1, "isHighlight": false, "text": "de Lange to Duminy,1 run,Duminy waits for the length ball as it angles across him from over the wicket and opens the face to steer to third man"}, {"ball": 12.2, "isHighlight": false, "text": "de Lange to Tiwary,no run,a big appeal from the keeper Tare as the ball slants down leg side and the batsman tries to glance, might have brushed the body"}, {"ball": 12.3, "isHighlight": false, "text": "de Lange to Tiwary,1 wide,another extravagant appeal from Tare as the slower ball from de Lange strays down leg side, that was close to nothing, huge wide"}, {"ball": 12.3, "isHighlight": false, "text": "de Lange to Tiwary, $$FOUR$$ ,a full toss on the pads, Tiwary flicks and places it into the gap on the square leg boundary"}, {"ball": 12.4, "isHighlight": false, "text": "de Lange to Tiwary,1 run,short of a length outside off stump, Tiwary bunts it behind point for a single"}, {"ball": 12.5, "isHighlight": false, "text": "de Lange to Duminy,1 run,full and straight, driven to long on for a single"}, {"ball": 12.6, "isHighlight": false, "text": "de Lange to Tiwary,1 leg bye,a full toss on the pads, Tiwary misses the glance and is hit on the pad for leg byes behind square leg"}, {"ball": 12.6, "isHighlight": false, "text": "Anil: \"Uthappa has shown this year that you don't have to be unorthodox to consistently keep scoring. I don't understand why most batsman try risky shots when they can score well with proper cricket shots. Over to Dravid for more on this.\""}, {"ball": 13.1, "isHighlight": false, "text": "Ojha to Tiwary, $$SIX$$ ,Tiwary leaps out of his crease, lunges for the ball because he isn't to the pitch of it, but makes great connection with the slog sweep to clear the midwicket boundary"}, {"ball": 13.2, "isHighlight": false, "text": "Ojha to Tiwary,no run,defended on the off side"}, {"ball": 13.3, "isHighlight": false, "text": "Ojha to Tiwary,no run,steps out again but defends to the bowler because he is beaten in the flight"}, {"ball": 13.4, "isHighlight": false, "text": "Ojha to Tiwary,1 run,goes back into his crease and pushes the ball towards long-on"}, {"ball": 13.5, "isHighlight": false, "text": "Ojha to Duminy,1 wide,that's pitched outside leg stump and spinning further away down leg side"}, {"ball": 13.5, "isHighlight": false, "text": "Ojha to Duminy,1 run,goes back and across in his crease and works the ball through square"}, {"ball": 13.6, "isHighlight": false, "text": "Ojha to Tiwary,1 run,pushed on the back foot towards cover"}, {"ball": 13.6, "isHighlight": false, "text": "Pollard's going to bowl."}, {"ball": 13.6, "isHighlight": false, "text": "Teddy: \"I look at this match and I can see why these 2 teams have struggled. KKR, for example, have 4 overseas men [in the regular XI], and with the exception of Narine, none of them are world beaters. However they all know their place in the team and it's a solid foundation. With MI and DD, it's simply a group of individuals.\""}, {"ball": 14.1, "isHighlight": false, "text": "Pollard to Tiwary,1 run,steered to short third man and they steal a single"}, {"ball": 14.2, "isHighlight": false, "text": "Pollard to Duminy,1 run,dabbed off the back foot straight to short third man for a single"}, {"ball": 14.3, "isHighlight": false, "text": "Pollard to Tiwary,1 run,once again they tap it straight to the fielder at short third man and run, Pollard is not happy"}, {"ball": 14.4, "isHighlight": false, "text": "Pollard to Duminy,no run,banged in short and beats Duminy on the back-foot pull, Duminy swung too early"}, {"ball": 14.5, "isHighlight": false, "text": "Pollard to Duminy,no run,Tare appeals again for a caught behind but no one else does, Duminy tried to pull once again but was beaten outside off"}, {"ball": 14.6, "isHighlight": false, "text": "Pollard to Duminy,1 run,swung away to deep midwicket on the front foot, he did not time that well"}, {"ball": 15.1, "isHighlight": false, "text": "Ojha to Duminy,1 run,Duminy steps out of the crease but is not to the pitch of the ball, he nudges on the leg side"}, {"ball": 15.2, "isHighlight": false, "text": "Ojha to Tiwary,1 run,goes on the back foot and pulls to cow corner"}, {"ball": 15.2, "isHighlight": false, "text": "Kapil: \"I am not sure what Duminy is waiting for? They have to go for it now.. 70 odd off 30 odd does not require an invitation.\""}, {"ball": 15.3, "isHighlight": false, "text": "Ojha to Duminy, $$SIX$$ ,Duminy's not waiting anymore. He gets down on one knee and blitzes the ball over cow corner with a powerful slog sweep"}, {"ball": 15.4, "isHighlight": false, "text": "Ojha to Duminy,1 run,a full toss but Duminy only drives it to long-on for a single"}, {"ball": 15.5, "isHighlight": false, "text": "Ojha to Tiwary,1 run,Tiwary steps out and dabs the ball into the covers for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Ojha to Duminy,1 run,bowled full and outside off, Duminy drives to long off for a single"}, {"ball": 16.1, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,bowled flat and straight, Duminy has no room to work with and he cuts through point"}, {"ball": 16.2, "isHighlight": false, "text": "Harbhajan Singh to Tiwary, $$FOUR$$ ,Rayudu sprints to his right on the deep midwicket boundary and leaps to try and catch a pull from Tiwary, he gets a hand on it but then he falls to the ground and the ball goes over the boundary"}, {"ball": 16.3, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,1 run,pushed close on the off side"}, {"ball": 16.4, "isHighlight": false, "text": "Harbhajan Singh to Duminy,1 run,short ball and he's pulled it off the back foot to deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "Harbhajan Singh to Tiwary,1 run,Tiwary moves back and swats the ball from outside off over the in-field at midwicket"}, {"ball": 16.6, "isHighlight": false, "text": "Harbhajan Singh to Duminy, $$SIX$$ ,that's a rubbish full toss and Duminy pulls it over the deep midwicket boundary. Harbhajan was furious with himself after that ball, lots of unprintable material"}, {"ball": 17.1, "isHighlight": false, "text": "Bumrah to Tiwary,no run,the bouncer outside off stump, Tiwary slogs in vain, he was in no position to play that shot"}, {"ball": 17.2, "isHighlight": false, "text": "Bumrah to Tiwary,1 run,full and straight, driven to long on for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Bumrah to Duminy, $$SIX$$ ,he's slaughtered this, he gets down low and slog sweeps the seamer far over the midwicket boundary. Duminy cleared his front leg to create hitting space"}, {"ball": 17.4, "isHighlight": false, "text": "Bumrah to Duminy,1 run,a really low full toss, Duminy drives to long on for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Bumrah to Tiwary,no run,in the blockhole outside off stump, he can't do much but dig it out to the bowler"}, {"ball": 17.6, "isHighlight": false, "text": "Bumrah to Tiwary, $$FOUR$$ ,superb shot! He gets under a half-volley and plays the lofted drive to the extra cover boundary, one-bounce four"}, {"ball": 17.6, "isHighlight": false, "text": "Marchant de Lange is going to bowl the penultimate over."}, {"ball": 18.1, "isHighlight": false, "text": "de Lange to Duminy,(no ball) 1 run,that's a high full toss, that's a no-ball, and Duminy's pulled it straight to Hussey at deep midwicket, the catch has been taken but Hussey throws it back quickly"}, {"ball": 18.1, "isHighlight": false, "text": "de Lange to Tiwary,1 run,short ball and Tiwary pulls to deep square leg ..."}, {"ball": 18.2, "isHighlight": false, "text": "de Lange to Duminy,1 run,in the blockhole on leg stump, Duminy digs it out and plays it through square leg, just the single"}, {"ball": 18.3, "isHighlight": false, "text": "de Lange to Tiwary, $$OUT$$ ,he's skied this, it's swirling in the evening sky and when the ball comes down Michael Hussey is right under it ... Tiwary had cleared his front foot to slog and ended up slicing the good length ball"}, {"ball": 18.3, "isHighlight": false, "text": "$$MK$$ $$Tiwary$$ $$c$$ $$Hussey$$ $$b$$ $$de$$ $$Lange$$ $$41$$ $$(45m$$ $$31b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$132.25$$"}, {"ball": 18.4, "isHighlight": false, "text": "de Lange to Duminy,1 run,Duminy slogs across the line but gets a thick inside edge behind square"}, {"ball": 18.5, "isHighlight": false, "text": "de Lange to Jadhav,no run,in the blockhole outside off stump, Jadhav is beaten"}, {"ball": 18.6, "isHighlight": false, "text": "de Lange to Jadhav,2 runs,in the blockhole once again, Jadhav swings across the line and manages to play it through square, they come back for the second but Marchant has completed a terrific over and all but killed the game"}, {"ball": 18.6, "isHighlight": false, "text": "Bumrah to bowl the final over ..."}, {"ball": 19.1, "isHighlight": false, "text": "Bumrah to Duminy,1 run,full and straight, Duminy makes room and hits it along the ground to long-off"}, {"ball": 19.2, "isHighlight": false, "text": "Bumrah to Jadhav,1 run,in the blockhole once again, nothing much a batsman can do with that, Jadhav hits it through midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Bumrah to Duminy,1 run,another blockhole delivery, excellent death bowling, Duminy can't get under it and so he drives it to long off"}, {"ball": 19.4, "isHighlight": false, "text": "Bumrah to Jadhav, $$FOUR$$ ,backs away outside leg and throws his bat at it, carving the ball over the fielder at short third man"}, {"ball": 19.5, "isHighlight": false, "text": "Bumrah to Jadhav,1 leg bye,a blockhole delivery speared into the pads, Jadhav can't make contact"}, {"ball": 19.6, "isHighlight": false, "text": "Bumrah to Duminy,1 run,hit down the ground to long off for a single, exceptional execution of blockhole-bowling by Bumrah ... Mumbai take the game by 15 runs and are surging up the table."}, {"ball": 19.6, "isHighlight": false, "text": "$$7.20$$ $$pm$$  Mumbai stay alive. They have moved on to 12 points and will watch tonight's game between Kings XI and Royals with great interest. If Kings XI win, Mumbai's campaign will still have life. If Royals win, Mumbai are out."}, {"ball": 19.6, "isHighlight": false, "text": "Kevin Pietersen: \"The frustrating thing is that we can get so close but can't get over the finish line ...  when we keep losing and get so close, we form bad habits. But we're going to fight till the death, all the way through and then we'll see where we go next season. Credit to Gary and the backroom staff, you wouldn't believe we've only won two games ... it's been a fun environment ... if we're losing and the boys can be as happy as this, when we're winning we're going to be a very strong unit.\""}, {"ball": 19.6, "isHighlight": false, "text": "James: \"Had their batting not collapsed towards the end, Mumbai might have won that more easily, and improved their NRR. Could be crucial.\""}, {"ball": 19.6, "isHighlight": false, "text": "Rohit Sharma: \"I thought we played brilliant cricket although we should have played better with the bat .. the kind of start we got ...if not 200 then close to 200. To come out and defend like that, we knew it wouldn't be easy but the bowlers executed their plans. We had quality spinners and fast bowlers so we knew we could defend it ... the five games in Dubai are definitely hurting us, we could have qualified by now. We'll go back to the hotel and watch Rajasthan v Punjab carefully. Whole of Mumbai will be backing Kings XI in that game ... but it's not in our control.\""}, {"ball": 19.6, "isHighlight": false, "text": "Michael Hussey is the Man of the Match. Bat up, Huss!"}, {"ball": 19.6, "isHighlight": false, "text": "Hussey: \"This is probably one of my favourite grounds in the world, the atmosphere is phenomenal. Was very fortunate to get a game here. It was a good pitch ... we've had a good trip on the road and coming back here, Mumbai has always played here. We just need Kings XI to win tonight.\""}, {"ball": 19.6, "isHighlight": false, "text": "That's all I've got for you from this game. Kings XI v Rajasthan, beginning shortly. Don't miss it. Thank you for all your emails. Cheers!"}], "name": "Mumbai Indians v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734031.html?innings=2;view=commentary", "match_num": 51}