{"commentary": [{"ball": 0, "isHighlight": false, "text": "It's game time in Mohali. The Royals huddle on the outfield and the Kings XI openers follow. Manan Vohra to face Vikramjeet Malik, bowling from over the wicket."}, {"ball": 0, "isHighlight": false, "text": "$$7.55$$ $$pm$$  MIFan: \"No Maxwell?? Gutted!! #disappointingBailey\""}, {"ball": 0, "isHighlight": false, "text": "Arijit: \"Glenn Maxwell rested? Robin Utthappa won't mind!\""}, {"ball": 0, "isHighlight": false, "text": "Harish: \"Why why Glenn Maxwell has been rested?????? He was not in the form in the last couple of matches..!! When playoff is near why need to take this risk. KXIP is not even confirmed for the top two.\""}, {"ball": 0, "isHighlight": false, "text": "Jasnesh: \"that moment when glenn maxwell has also been rested came up. MI and SRH fans' hearts might be shattered now.\""}, {"ball": 0, "isHighlight": false, "text": "Sam: \"Brilliant game of mental chess by Bailey. Watson fills his side with leggies and Bailey removes Maxwell from his side. Bailey1-0 Watson\""}, {"ball": 0, "isHighlight": false, "text": "$$7.45$$ $$pm$$  Rohan: \"MI fans will be rooting for KXIP more than their home fans today! Expecting a full strength KXIP today.\" So will Sunrisers Hyderabad"}, {"ball": 0, "isHighlight": false, "text": "Nitin: \"2 leggies in the XI. Has it got to do with Maxwell's weakness against leggies recently. Bet on Dravid to notice that chink\" I wouldn't say \"weakness\". It's pretty much the same narrative of KP v left-arm spin. He belts them, but somehow gets out to them as well."}, {"ball": 0, "isHighlight": false, "text": "Siddharth: \"I think Kings XI Punjab are wasting their 4th foreign player spot by playing either Mitch or Beuran !!they both were thrashed in almost all matches. I think they should include Marsh too along with Maxy, Miller and Bailey and make their batting even more stronger. \""}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$ $$Rajasthan$$ $$Royals$$ $$win$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bowl$$ . They have four changes: Rahane and Tambe are back. So is young legspinner Rahul Tewatia. Vikramjeet Malik is a surprise selection, Rajat Bhatia is on the bench.  \"Last five overs are especially challenging, with the kind of batsmen in the IPL,\" says Shane Watson. He is unconcerned about the grass covering on the pitch saying Mohali is always a brilliant batting deck."}, {"ball": 0, "isHighlight": false, "text": "George Bailey says he might well turn his arm over in the later stages, but probably not tonight. \"Always good to have a few tricks up your sleeve,\" he says with his trademark grin. David Miller and L Balaji are back in the XI. Karanveer Singh is making his IPL debut for Kings XI.  $$Glenn$$ $$Maxwell$$ $$has$$ $$also$$ $$been$$ $$rested.$$"}, {"ball": 0, "isHighlight": false, "text": "$$7.20$$ $$pm$$  Rajasthan Royals need a win to confirm their spot in the playoffs. And should they pull it off, all four teams that progress will be ascertained. They had confessed Ahmedabad was not as much of a fortress as Jaipur had been, but will hope for a change of fortune with Kings XI Punjab in their path. Here is the  $$preview$$"}, {"ball": 0, "isHighlight": false, "text": "--------------------"}, {"ball": 0, "isHighlight": false, "text": "Three days left. Nine more shots at an all-expenses paid trip to London to watch India play England at Lord's.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$ $$beckons.$$ $$Play$$ $$now.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Malik to Sehwag,no run,a length ball outside off stump, Sehwag punches from the crease, timing it superbly but not finding the gap at cover"}, {"ball": 0.2, "isHighlight": false, "text": "Malik to Sehwag,1 wide,banged in short but the line is down leg side"}, {"ball": 0.2, "isHighlight": false, "text": "Malik to Sehwag,no run,good length just outside off, the ball holds its line and keeps a bit low too, Sehwag stays in his crease and prods but is beaten"}, {"ball": 0.3, "isHighlight": false, "text": "Malik to Sehwag,no run,Sehwag tries to punch on the up through cover but is beaten by the movement away from him"}, {"ball": 0.4, "isHighlight": false, "text": "Malik to Sehwag, $$FOUR$$ ,a length ball outside off stump, Sehwag moves forward and lofts the ball on the up and through the line, one-bounce four to wide long off"}, {"ball": 0.5, "isHighlight": false, "text": "Malik to Sehwag, $$FOUR$$ ,short and wide outside off, Sehwag loves it there, he does! He goes after the ball with a hard slash and the ball bounces inches short of the third man boundary"}, {"ball": 0.6, "isHighlight": false, "text": "Malik to Sehwag, $$SIX$$ ,length delivery outside off, Sehwag gets on the front foot and throws his bat at it, carving the ball over the backward point boundary"}, {"ball": 1.1, "isHighlight": false, "text": "Watson to Vohra,no run,good length and straight from Watson, defended with a straight bat back to the bowler"}, {"ball": 1.2, "isHighlight": false, "text": "Watson to Vohra, $$FOUR$$ ,a half-volley outside off stump, Vohra gets down on one knee and drives through cover point, superbly timed"}, {"ball": 1.3, "isHighlight": false, "text": "Watson to Vohra,1 wide,Samson leaps to his left to collect a wayward ball down leg side"}, {"ball": 1.3, "isHighlight": false, "text": "Watson to Vohra,no run,the ball rises from a good length outside off and Vohra is beaten as he tries to chip it towards third man"}, {"ball": 1.4, "isHighlight": false, "text": "Watson to Vohra,no run,banged in short once again, Vohra tries to pull but is beaten"}, {"ball": 1.5, "isHighlight": false, "text": "Watson to Vohra,no run,Watson gets the ball to lift from a good length and straighten too after pitching around off stump, Vohra prods from his crease and is beaten"}, {"ball": 1.6, "isHighlight": false, "text": "Watson to Vohra,no run,Vohra wafts at a short of a length ball outside off and is beaten by the bounce and movement away from him"}, {"ball": 2.1, "isHighlight": false, "text": "Faulkner to Sehwag, $$FOUR$$ ,a half volley on the off stump and Sehwag gets a big stride forward and drilled down to long-on"}, {"ball": 2.2, "isHighlight": false, "text": "Faulkner to Sehwag, $$OUT$$ ,that's a soft dismissal! Sehwag was looking to whip that away down to the leg side, played a bit too early and he ends up getting a tame top edge to mid-on, very easy catch for the fielder"}, {"ball": 2.2, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$Malik$$ $$b$$ $$Faulkner$$ $$18$$ $$(11m$$ $$8b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$225.00$$"}, {"ball": 2.3, "isHighlight": false, "text": "Faulkner to Marsh,no run"}, {"ball": 2.4, "isHighlight": false, "text": "Faulkner to Marsh,no run"}, {"ball": 2.5, "isHighlight": false, "text": "Faulkner to Marsh,1 run,and he gets off the mark with a dab down to third man"}, {"ball": 2.6, "isHighlight": false, "text": "Faulkner to Vohra,1 run,good length on the stumps and he shuffles and clips him to midwicket"}, {"ball": 2.6, "isHighlight": false, "text": "Apologies. I forgot that Marsh played the previous game. My bad"}, {"ball": 3.1, "isHighlight": false, "text": "Watson to Vohra, $$FOUR$$ ,a bit too straight on the pads, he uses his wrists well and whips it away towards square leg"}, {"ball": 3.2, "isHighlight": false, "text": "Watson to Vohra, $$SIX$$ ,that was quite effortless! We have seen this from Vohra before, this was a length ball on the pads and he plays the pick up shot and chips it a few rows over deep midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Watson to Vohra,no run,he makes a bit of room and punches it towards mid-off"}, {"ball": 3.4, "isHighlight": false, "text": "Watson to Vohra,no run,gets across the line and punches it towards point"}, {"ball": 3.4, "isHighlight": false, "text": "Arvind: \"Thats been the story of Sehwag this season, Couple of 'sehwagesque' (brilliant) shots and then a 'sehwagesque' (soft) dismissal. \" One more entry to the dictionary?"}, {"ball": 3.5, "isHighlight": false, "text": "Watson to Vohra,no run,this was a bouncer down the leg side, Vohra looks to hook and nearly gets some bat on it"}, {"ball": 3.6, "isHighlight": false, "text": "Watson to Vohra,1 run,punches it down the ground to long-on"}, {"ball": 4.1, "isHighlight": false, "text": "Malik to Vohra,1 run"}, {"ball": 4.2, "isHighlight": false, "text": "Malik to Marsh,no run,length ball and he stays back and defends this one"}, {"ball": 4.3, "isHighlight": false, "text": "Malik to Marsh, $$FOUR$$ ,all timing on that one, this was a length ball shaping away and he went forward, shows the full face of the bat and it races to long-off"}, {"ball": 4.4, "isHighlight": false, "text": "Malik to Marsh,no run,he gets across his stumps and punches it to the off side"}, {"ball": 4.5, "isHighlight": false, "text": "Malik to Marsh,no run,good length angling across and he punches it to the off side"}, {"ball": 4.6, "isHighlight": false, "text": "Malik to Marsh, $$FOUR$$ ,this was short and wide outside off and asking to be hit, Marsh slashes this over backward point, in the air but safe"}, {"ball": 5.1, "isHighlight": false, "text": "Cooper to Vohra,2 runs,not in control of this one, this was short and he went for the pull but miscued it over square leg"}, {"ball": 5.2, "isHighlight": false, "text": "Cooper to Vohra, $$FOUR$$ ,he was fully in control of this, this was a half volley wide outside off, leans forward and drives wide of cover and doesn't look to push at it too hard, relied on timing"}, {"ball": 5.3, "isHighlight": false, "text": "Cooper to Vohra,1 run"}, {"ball": 5.4, "isHighlight": false, "text": "Cooper to Marsh,no run,he drifts on the pads with the fine leg up and the ball clips his pads, Samson dives and stops"}, {"ball": 5.5, "isHighlight": false, "text": "Cooper to Marsh,no run,good length on the off stump and he defends down the track"}, {"ball": 5.6, "isHighlight": false, "text": "Cooper to Marsh,no run,that's a good slower ball, Marsh didn't read it very well, stabbed it to the off side"}, {"ball": 5.6, "isHighlight": false, "text": "It's also the Time Out"}, {"ball": 5.6, "isHighlight": false, "text": "missing: \"sorry, where has Paul Valthaty disappeared?\""}, {"ball": 5.6, "isHighlight": false, "text": "arnav dhamija: \"This is good thinking from Bailey. Marsh has always been a reliable choice for KXIP and it will probably let the middle order test themselves a bit more. That said, KXIP's run in defending even 180+ scores isn't very commendable this IPL.\""}, {"ball": 6.1, "isHighlight": false, "text": "Tewatia to Vohra,no run,he stays back and gets an inside edge to the pads"}, {"ball": 6.2, "isHighlight": false, "text": "Tewatia to Vohra,no run,drifts in towards the pads and Vohra didn't pick him and the ball clips the pads"}, {"ball": 6.3, "isHighlight": false, "text": "Tewatia to Vohra,1 run,  $$OUT$$ ,there's an appeal for an lbw and Vohra fails to ground the bat! The ball didn't turn and Vohra clipped it towards midwicket and he was getting back for the second and Binny's throw to the striker's end was accurate, Vohra was very casual in getting back and that's a schoolboy error"}, {"ball": 6.3, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$run$$ $$out$$ $$25$$ $$(32m$$ $$20b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 6.4, "isHighlight": false, "text": "Tewatia to Saha,1 run,clips it down to long-on to get off the mark"}, {"ball": 6.5, "isHighlight": false, "text": "Tewatia to Marsh,no run,works it to the on side"}, {"ball": 6.6, "isHighlight": false, "text": "Tewatia to Marsh,1 run,gets forward and drills this down to long-off"}, {"ball": 6.6, "isHighlight": false, "text": "Vohra was finding his rhythm and he had to give it away like that"}, {"ball": 7.1, "isHighlight": false, "text": "Tambe to Marsh,1 run,fuller ball on the off stump and driven down to long-on"}, {"ball": 7.2, "isHighlight": false, "text": "Tambe to Saha,no run,bowls it flatter and he makes room and cuts him to point"}, {"ball": 7.3, "isHighlight": false, "text": "Tambe to Saha, $$FOUR$$ ,punishes the length, he drops it short and he swivels and pulls firmly wide of square leg"}, {"ball": 7.4, "isHighlight": false, "text": "Tambe to Saha, $$FOUR$$ ,less power, same result, this was drifting down the leg side and Saha went down and gently paddled it to fine leg"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to Saha,1 run,shuffles and clips him down to square leg"}, {"ball": 7.5, "isHighlight": false, "text": "Siddharth: \"Not a schoolboy error. Given how much international cricket is watched these days, I don't think even schoolboys make an error like this!\""}, {"ball": 7.6, "isHighlight": false, "text": "Tambe to Marsh,1 run,fuller on the stumps and softly pushed towards long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Anand: \"Is Vohra the new Sehwag - with his Sehwagesque shots and Sehwagesque run outs\""}, {"ball": 8.1, "isHighlight": false, "text": "Tewatia to Marsh,1 run,flatter and wider outside the off stump and cut down to point"}, {"ball": 8.2, "isHighlight": false, "text": "Tewatia to Saha,1 run,tossed up and he pushes it to the off side"}, {"ball": 8.3, "isHighlight": false, "text": "Tewatia to Marsh,no run,that was well bowled by Tewatia, the googly and Marsh was down the pitch and got an outside edge that dropped short of Watson at slip"}, {"ball": 8.4, "isHighlight": false, "text": "Tewatia to Marsh, $$FOUR$$ ,that was delicately played, he had some width and gently dabbed it well wide of first slip, he picked his spot well"}, {"ball": 8.5, "isHighlight": false, "text": "Tewatia to Marsh,1 run,goes back and cuts to sweeper cover"}, {"ball": 8.6, "isHighlight": false, "text": "Tewatia to Saha,1 run,comes to the pitch of the ball and drills it to long-on"}, {"ball": 9.1, "isHighlight": false, "text": "Tambe to Saha,1 run,drops it short and he goes back and pulls to square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Tambe to Marsh, $$FOUR$$ ,that was raw power, tossed up and Marsh was a few paces down the track and lofts dead straight down to the sight screen"}, {"ball": 9.3, "isHighlight": false, "text": "Tambe to Marsh,no run,he goes back and cuts to the off side"}, {"ball": 9.4, "isHighlight": false, "text": "Tambe to Marsh,no run,close call for Marsh as he looks to cut but is beaten"}, {"ball": 9.5, "isHighlight": false, "text": "Tambe to Marsh,2 leg byes,low full toss on the pads and he misses out, clips the pads and rolls away"}, {"ball": 9.6, "isHighlight": false, "text": "Tambe to Marsh,1 run,drops it short and he goes back and pulls to deep midwicket"}, {"ball": 9.6, "isHighlight": false, "text": "Zuch: \"Marsh seems to have so much time to play his shots. Its because of his very stable and non-committal initial stance. Something not seen in many players now a days.\""}, {"ball": 10.1, "isHighlight": false, "text": "Tewatia to Marsh,no run,comes down the track and drills it down the track and the bowler slides and stops it"}, {"ball": 10.2, "isHighlight": false, "text": "Tewatia to Marsh,1 run,tossed up and he rocks back and cuts him hard down to point"}, {"ball": 10.3, "isHighlight": false, "text": "Tewatia to Saha,1 run,gets to the pitch of the ball and he works it to long-on"}, {"ball": 10.4, "isHighlight": false, "text": "Tewatia to Marsh,2 runs,he gives him width and cuts him to deep point"}, {"ball": 10.5, "isHighlight": false, "text": "Tewatia to Marsh, $$SIX$$ ,heads up! Tossed up on the off stump and Marsh took a couple of paces down and slogs him against the spin, it was a googly, sends it a few rows over deep midwicket"}, {"ball": 10.6, "isHighlight": false, "text": "Tewatia to Marsh,1 wide,this was too wide outside off"}, {"ball": 10.6, "isHighlight": false, "text": "Tewatia to Marsh,no run,this was a bit wide too and he punches it to cover"}, {"ball": 10.6, "isHighlight": false, "text": "Aditya Mantry: \"I see no point in the decision of RR dropping Smith. The young lad not just scores runs but is probably their best fielder. \""}, {"ball": 11.1, "isHighlight": false, "text": "Cooper to Saha,1 run,this was short of a length outside off and he stays back and dabs it down to third man"}, {"ball": 11.2, "isHighlight": false, "text": "Cooper to Marsh,no run,beaten this time, hasn't happened too often, full and moving away and he chases it but misses"}, {"ball": 11.3, "isHighlight": false, "text": "Cooper to Marsh, $$FOUR$$ ,super placement from Marsh, this was a half volley outside off and moving away, he leans forward and places it wide of sweeper cover"}, {"ball": 11.4, "isHighlight": false, "text": "Cooper to Marsh,2 runs,on the pads and he turns it behind square on the on side for a couple"}, {"ball": 11.5, "isHighlight": false, "text": "Cooper to Marsh,1 run,gives him a lot of width this time and he dabs it down to third man"}, {"ball": 11.6, "isHighlight": false, "text": "Cooper to Saha,1 run,gets forward and pulls him down to fine leg"}, {"ball": 12.1, "isHighlight": false, "text": "Faulkner to Saha,1 run,Faulkner round the wicket and he gets forward and across and pushes it towards point"}, {"ball": 12.2, "isHighlight": false, "text": "Faulkner to Marsh,1 run,good length outside the off stump and he punches it towards cover"}, {"ball": 12.3, "isHighlight": false, "text": "Faulkner to Saha,no run,close call for Saha as he pokes at one moving away and nearly edges it"}, {"ball": 12.4, "isHighlight": false, "text": "Faulkner to Saha,no run,this was a quicker bouncer and he looks to hook and misses"}, {"ball": 12.5, "isHighlight": false, "text": "Faulkner to Saha, $$FOUR$$ ,that was smashed past backward point, Faulkner makes the mistake by giving him width outside off, bends slightly, gets beside the line and thrashes it"}, {"ball": 12.6, "isHighlight": false, "text": "Faulkner to Saha, $$FOUR$$ ,another poor ball put away, short ball down the leg side, swivels and pulls one bounce to fine leg"}, {"ball": 13.1, "isHighlight": false, "text": "Malik to Marsh, $$OUT$$ ,Marsh perishes going for the big hit, it was a slower ball from Malik round the wicket, Marsh doesn't get the power behind it to take it over the rope, it goes flat to long-on and Rahane jogs to his right and catches it"}, {"ball": 13.1, "isHighlight": false, "text": "$$SE$$ $$Marsh$$ $$c$$ $$Rahane$$ $$b$$ $$Malik$$ $$40$$ $$(47m$$ $$35b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$114.28$$"}, {"ball": 13.1, "isHighlight": false, "text": "$$9.10pm$$ : Good news. The covers are coming off. The rains stopped by to visit. No overs docked. It's still 20 overs"}, {"ball": 13.1, "isHighlight": false, "text": "$$9pm$$ : Bad news here. The covers are out and the drizzle has picked up. Barely noticed that it was drizzling. Fingers crossed. More covers are coming out."}, {"ball": 13.1, "isHighlight": false, "text": "The rain is bad new for some, but it could be good news for your  $$CricIQ$$  prospects. Play your shots and stay in contention for a trip to London this summer to watch India play at Lord's."}, {"ball": 13.1, "isHighlight": false, "text": ""}, {"ball": 13.1, "isHighlight": false, "text": "Going by some of the feedback, it isn't raining in the surrounding areas so that's a good sign. Commentators say the rain has lessened a bit."}, {"ball": 13.1, "isHighlight": false, "text": "prince poddar: \"This would be a pretty bad way for Mumbai and Hyderabad to go out of tournament. Rain rain go away, come back on IPL rest day.\""}, {"ball": 13.1, "isHighlight": false, "text": "Saha is joined by David Miller"}, {"ball": 13.2, "isHighlight": false, "text": "Malik to Miller,1 run,good length on the stumps and he gets an outside edge towards cover"}, {"ball": 13.2, "isHighlight": false, "text": "Vinod Mhase: \"WorkFromAtlanta: This is the disadvatage of Marsh staying at the crease for long time.. Now complete ground becomes marshy!!\""}, {"ball": 13.3, "isHighlight": false, "text": "Malik to Saha,1 run,the placement wasn't bad at all... it was a top edge that dropped short as two fielders converged, it was short and he was looking to hook, Faulkner and Watson ran forward and hard luck for Royals"}, {"ball": 13.4, "isHighlight": false, "text": "Malik to Miller,1 run,good length outside off and he punches it to the off side"}, {"ball": 13.5, "isHighlight": false, "text": "Malik to Saha,1 run,he shuffles and works it behind square on the on side"}, {"ball": 13.6, "isHighlight": false, "text": "Malik to Miller,1 run,gets forward and across and plays it towards third man"}, {"ball": 13.6, "isHighlight": false, "text": "Varun: \"What is the point of Kevon Cooper? Below par batsman and below par bowler. How about getting Smith in for Cooper, and drop Binny for Bhatia. Or simply get Southee/Richardson for Cooper. They get wickets at least.\""}, {"ball": 14.1, "isHighlight": false, "text": "Tewatia to Miller,no run,tossed up on the stumps and he drives him to cover"}, {"ball": 14.2, "isHighlight": false, "text": "Tewatia to Miller,1 run,this was tossed up and full and he drills it down to long-off"}, {"ball": 14.3, "isHighlight": false, "text": "Tewatia to Saha,no run,this was tossed up slower  and he drives it to the off side"}, {"ball": 14.4, "isHighlight": false, "text": "Tewatia to Saha, $$OUT$$ ,well judged by Rahane in the deep, tossed up and Saha gives the charge and looks to clear long-on, he hits it flat and Rahane jogs to his left and takes it"}, {"ball": 14.4, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$c$$ $$Rahane$$ $$b$$ $$Tewatia$$ $$27$$ $$(32m$$ $$20b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$135.00$$"}, {"ball": 14.5, "isHighlight": false, "text": "Tewatia to Miller,1 run,tossed up a but more and he drives on the up to long-on"}, {"ball": 14.6, "isHighlight": false, "text": "Tewatia to Bailey,no run,tossed up and he comes down the track and the ball hits his pads and rolls away"}, {"ball": 15.1, "isHighlight": false, "text": "Tambe to Miller,1 run,full on the pads and he drives it to long-on"}, {"ball": 15.2, "isHighlight": false, "text": "Tambe to Bailey,2 runs,he drops it a bit short and he makes room and cuts"}, {"ball": 15.3, "isHighlight": false, "text": "Tambe to Bailey,no run,down the track and driven down to cover"}, {"ball": 15.4, "isHighlight": false, "text": "Tambe to Bailey,1 run,he makes a bit of room and chops it to the off side"}, {"ball": 15.5, "isHighlight": false, "text": "Tambe to Miller,1 run,flatter delivery and he drills it down towards long-on"}, {"ball": 15.6, "isHighlight": false, "text": "Tambe to Bailey,1 run,he uses his feet and comes down the track and works it to the leg side"}, {"ball": 15.6, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 15.6, "isHighlight": false, "text": "Lokesh Devan: \"I find it difficult to understand Bhatia being dropped for Binny. Bhatia has been very effective with the ball throughout this season for RR.\""}, {"ball": 16.1, "isHighlight": false, "text": "Cooper to Bailey,2 runs,this was a length ball on the pads and he tucks it towards long-on and does well to push for the second"}, {"ball": 16.1, "isHighlight": false, "text": "Anil: \"what's the point of a time-out after a rain interruption?? \" Good point"}, {"ball": 16.2, "isHighlight": false, "text": "Cooper to Bailey,1 run,full on the stumps and he drills it down to long-off"}, {"ball": 16.3, "isHighlight": false, "text": "Cooper to Miller,1 run,this was a fuller ball and he works it away down to deep midwicket"}, {"ball": 16.4, "isHighlight": false, "text": "Cooper to Bailey,1 run,slower ball and forced Bailey into checking his shot, stabbed it down to cover"}, {"ball": 16.5, "isHighlight": false, "text": "Cooper to Miller,1 run,makes room to a length ball and pushes it hard down to long-off"}, {"ball": 16.6, "isHighlight": false, "text": "Cooper to Bailey,1 leg bye,makes room and the bowler follows him by bowling on the body, pulls but can't beat short fine leg"}, {"ball": 16.6, "isHighlight": false, "text": "Saurabh: \"@Anil.. thats a bonus for advertisers... leave the point... :P\""}, {"ball": 17.1, "isHighlight": false, "text": "Tambe to Bailey,1 run,comes down the track and works it towards deep square leg and only a single"}, {"ball": 17.2, "isHighlight": false, "text": "Tambe to Miller,2 runs,Miller is in trouble and Royals are confident they have run him out! Miller works it towards long-on and challenges Rahane's throw by going for the second run, he dives and replays show that he has just made it before Samson breaks the bails"}, {"ball": 17.3, "isHighlight": false, "text": "Tambe to Miller,2 runs,forced it down to deep midwicket for a couple"}, {"ball": 17.4, "isHighlight": false, "text": "Tambe to Miller,1 run,he comes down the track and drills it hard down to long-off"}, {"ball": 17.5, "isHighlight": false, "text": "Tambe to Bailey,1 run,down the track and drives off the toe of the bat to deep cover"}, {"ball": 17.6, "isHighlight": false, "text": "Tambe to Miller, $$SIX$$ ,breaks the boundary drought! This was tossed up and Miller was down the track and lofted it dead straight and cleared the sight screen, in fact Tambe bowled that from behind the crease"}, {"ball": 18.1, "isHighlight": false, "text": "Faulkner to Bailey, $$FOUR$$ ,exploits the fact there's nobody at deep cover, length ball and he makes room and carves it over cover, there are plenty patroling the leg side though"}, {"ball": 18.2, "isHighlight": false, "text": "Faulkner to Bailey, $$SIX$$ ,that was high and far, the slower ball from Faulkner, angling down leg and Bailey made room and lofted it over wide long-on, several rows back"}, {"ball": 18.3, "isHighlight": false, "text": "Faulkner to Bailey,2 runs,gets away with a full toss, wide outside the off stump, he makes room and chips it to deep point"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to Bailey,(no ball) 2 runs,Faulker has overstepped, he makes room again and chips it down to deep point"}, {"ball": 18.4, "isHighlight": false, "text": "Faulkner to Bailey,1 run,he is caught off the  $$Free$$ $$Hit$$  at third man, makes room and gets an outside edge that carries all the way to Tambe"}, {"ball": 18.5, "isHighlight": false, "text": "Faulkner to Miller, $$SIX$$ ,sends this over deep midwicket, length ball on the stumps and he makes room and slogs him away"}, {"ball": 18.6, "isHighlight": false, "text": "Faulkner to Miller,1 run,this was short of a length and pulled, miscued and just clears square leg"}, {"ball": 18.6, "isHighlight": false, "text": "23 off the over"}, {"ball": 19.1, "isHighlight": false, "text": "Cooper to Miller,1 bye,good slower ball to start with, Miller made a lot of room and swung and missed, they steal a bye"}, {"ball": 19.2, "isHighlight": false, "text": "Cooper to Bailey,1 run,this was full outside off and he drills it down the ground to long-off"}, {"ball": 19.3, "isHighlight": false, "text": "Cooper to Miller,4 leg byes,that's a bonus for Kings XI, fine leg was up, it was down the leg side, Miller had a swing and the inside edge took it past short fine leg"}, {"ball": 19.4, "isHighlight": false, "text": "Cooper to Miller,2 runs,swings it to the leg side and it's in the air, the fielder does well at deep square leg to run to his left and take it on the first bounce"}, {"ball": 19.5, "isHighlight": false, "text": "Cooper to Miller,1 bye,swings and misses a slower ball, they pick up another bye"}, {"ball": 19.6, "isHighlight": false, "text": "Cooper to Bailey,1 bye,this was a low full toss down the leg side but Bailey moved a long way across the stumps to swing, he missed and the keeper has some work to do to collect that, the umpire signals a bye but Bailey was a bit perplexed and was expecting a wide, he has a discussion with the two umpires and their decision is final. Nothing heated, just an enqiry"}, {"ball": 19.6, "isHighlight": false, "text": "Late acceleration takes Kings XI to 179. This promises to be a good chase because Royals are back to full strength (almost). Rahane is back. Join us shortly for the chase."}], "name": "Kings XI Punjab v Rajasthan Royals", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734033.html?innings=1;view=commentary", "match_num": 52}