{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase. Rahane and Nair walk out to open. Balaji has the new ball. One slip in"}, {"ball": 0.1, "isHighlight": false, "text": "Balaji to Rahane,no run,a low full toss angled in to off, Rahane leans across and works it to mid on"}, {"ball": 0.2, "isHighlight": false, "text": "Balaji to Rahane,no run,beats him, Rahane goes pushing at a wide delivery that straightens and bounces past the outside edge"}, {"ball": 0.3, "isHighlight": false, "text": "Balaji to Rahane,no run,holding the line from a good length again, pushed to point"}, {"ball": 0.4, "isHighlight": false, "text": "Balaji to Rahane, $$FOUR$$ ,Balaji goes short and wide, Rahane tries to fetch it, and ends up dragging it just over mid on"}, {"ball": 0.5, "isHighlight": false, "text": "Balaji to Rahane,no run,Balaji past the outside edge second time in the over, goes wide of the crease, angles it in outside off and moves it away sharply, Rahane prods in vain"}, {"ball": 0.6, "isHighlight": false, "text": "Balaji to Rahane,1 run,softly taps at a straightening good length ball towards point and takes a single"}, {"ball": 1.1, "isHighlight": false, "text": "Hendricks to Rahane,1 run,what a ripper first up from Hendricks, an inswinging yorker on the stumps, somehow Rahane gets front leg away from the line and jabs it behind square"}, {"ball": 1.2, "isHighlight": false, "text": "Hendricks to Nair,3 runs,gets bat around the front pad to tuck this length delivery past square leg, Balaji runs across from fine leg and dives to keep it in, top effort"}, {"ball": 1.3, "isHighlight": false, "text": "Hendricks to Rahane,no run,tries to cut, but this short of a length delivery comes in and cramps him for room, he finds point"}, {"ball": 1.4, "isHighlight": false, "text": "Hendricks to Rahane,3 runs,length ball turned past square leg again, it is a longer chase for Balaji this time but the ball slows down and he is able to save a run"}, {"ball": 1.5, "isHighlight": false, "text": "Hendricks to Nair,no run,bouncer, slanted across at 133 kph, Karun sways inside the line"}, {"ball": 1.6, "isHighlight": false, "text": "Hendricks to Nair, $$FOUR$$ ,short and widish, Karun latches on it eagerly, and hops to slap it powerfully in front of square"}, {"ball": 2.1, "isHighlight": false, "text": "Balaji to Rahane,1 run,outside off and he opens the face and dabs it down to third man"}, {"ball": 2.2, "isHighlight": false, "text": "Balaji to Nair, $$FOUR$$ ,this was short and wide outside off and asking to be hit, Nair got across and thrashed this over backward point"}, {"ball": 2.3, "isHighlight": false, "text": "Balaji to Nair,no run,angles this slightly inwards and he gets forward and across and defends"}, {"ball": 2.4, "isHighlight": false, "text": "Balaji to Nair, $$OUT$$ ,Bailey takes the skier, this was short of a length and Nair was down the track looking to deposit this somewhere, not near the pitch of it and it was a top edge that swirled towards cover, Bailey keeps his gaze on the ball"}, {"ball": 2.4, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$c$$ $$Bailey$$ $$b$$ $$Balaji$$ $$11$$ $$(12m$$ $$6b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$183.33$$"}, {"ball": 2.5, "isHighlight": false, "text": "Balaji to Rahane,no run,lands outside off and he doesn't play at it"}, {"ball": 2.6, "isHighlight": false, "text": "Balaji to Rahane,2 runs,excellent stop by Akshar at fine leg, this was on the pads and Rahane flicked it away neatly and Akshar really had to time his dive right and that's what he did"}, {"ball": 3.1, "isHighlight": false, "text": "Dhawan to Samson,no run,good inswing by Dhawan straightaway, dipping in and Samson does well to cover the line"}, {"ball": 3.2, "isHighlight": false, "text": "Dhawan to Samson,1 run,gives him width and he opens the face of the bat and dabs it to third man"}, {"ball": 3.3, "isHighlight": false, "text": "Dhawan to Rahane,no run,gives a little width and he looks to cut but mistimes it to cover point"}, {"ball": 3.4, "isHighlight": false, "text": "Dhawan to Rahane,1 wide,he slides down the leg side and wide called"}, {"ball": 3.4, "isHighlight": false, "text": "Dhawan to Rahane,1 run,on the pads and clipped away and Balaji misfields at square leg"}, {"ball": 3.5, "isHighlight": false, "text": "Dhawan to Samson,1 run,Samson plays that late, opens the face and dabs it towards third man"}, {"ball": 3.6, "isHighlight": false, "text": "Dhawan to Rahane,1 run,on the pads and clipped to square leg, Rahane hurries the single to beat Balaji's throw"}, {"ball": 4.1, "isHighlight": false, "text": "Patel to Rahane,1 run,tossed up and he drives a full ball towards deep point"}, {"ball": 4.2, "isHighlight": false, "text": "Patel to Samson,1 run,this one darted back in and he punched it towards cover"}, {"ball": 4.3, "isHighlight": false, "text": "Patel to Rahane,no run,keeps him quiet, he can only push this down to point"}, {"ball": 4.4, "isHighlight": false, "text": "Patel to Rahane,no run,quicker and flatter and doesn't give him room, he punches it to point"}, {"ball": 4.5, "isHighlight": false, "text": "Patel to Rahane,1 run,drifts back in and it's only a single to long-on"}, {"ball": 4.6, "isHighlight": false, "text": "Patel to Samson,no run,tossed up and he drives it back to the bowler, good over"}, {"ball": 5.1, "isHighlight": false, "text": "Dhawan to Rahane, $$FOUR$$ ,that rocketed off the bat, Rahane gave Dhawan the charge early and chipped a full ball wide of mid-off, it was in the air and well clear of the fielder"}, {"ball": 5.2, "isHighlight": false, "text": "Dhawan to Rahane,no run,good length on the pads and worked to square leg"}, {"ball": 5.3, "isHighlight": false, "text": "Dhawan to Rahane,1 leg bye,on the pads and clipped off the pads to the leg side, Dhawan appeals but it was sliding down leg, they take a leg bye"}, {"ball": 5.3, "isHighlight": false, "text": "Keeper up to the stumps"}, {"ball": 5.4, "isHighlight": false, "text": "Dhawan to Samson, $$FOUR$$ ,cleverly played, the keeper was up and he wasn't afraid to play the late cut, the ball came back in and cramped him for room but he adjusted well, played to third man"}, {"ball": 5.5, "isHighlight": false, "text": "Dhawan to Samson,no run,punched towards backward point and Samson set off and was sent back"}, {"ball": 5.6, "isHighlight": false, "text": "Dhawan to Samson, $$FOUR$$ ,that's a low full toss on the pads, swinging back in  and he clips it away to deep midwicket"}, {"ball": 6.1, "isHighlight": false, "text": "Hendricks to Rahane,1 run,wide outside off and it's in the air towards third man"}, {"ball": 6.2, "isHighlight": false, "text": "Hendricks to Samson,1 run,good running, he drops it towards short point and sets off quickly and his partner sets off"}, {"ball": 6.3, "isHighlight": false, "text": "Hendricks to Rahane,1 run,he drops it short and he swivels and pulls him towards deep square leg"}, {"ball": 6.4, "isHighlight": false, "text": "Hendricks to Samson,no run,slower ball outside off and he shoulders arms"}, {"ball": 6.5, "isHighlight": false, "text": "Hendricks to Samson, $$SIX$$ ,carries over fine leg, this was a short ball rearing in on the helmet, he hooks and it's high in the air and has enough to clear the rope"}, {"ball": 6.6, "isHighlight": false, "text": "Hendricks to Samson,1 run,good length outside off and he punches it towards deep point"}, {"ball": 6.6, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 6.6, "isHighlight": false, "text": "Vipul_G: \"Doppelganger alert! Rishi Dhawan and Ricardo Darin. The resemblance is uncanny...\""}, {"ball": 7.1, "isHighlight": false, "text": "Karanveer Singh to Samson,no run"}, {"ball": 7.2, "isHighlight": false, "text": "Karanveer Singh to Samson,no run,tossed up and he softly defends"}, {"ball": 7.3, "isHighlight": false, "text": "Karanveer Singh to Samson,1 run,gets forward and pushes a single to cover"}, {"ball": 7.4, "isHighlight": false, "text": "Karanveer Singh to Rahane,1 run,he gets a bit of turn and bowls it wide, he cuts"}, {"ball": 7.5, "isHighlight": false, "text": "Karanveer Singh to Samson,no run,good one from Karanveer as he forces Samson to check his shot, he was down the pitch and chose to defend on seeing the length"}, {"ball": 7.6, "isHighlight": false, "text": "Karanveer Singh to Samson,no run,turn again and he chops it to point"}, {"ball": 7.6, "isHighlight": false, "text": "geoff: \"I cant understand why these bowlers bowl a decent over and then end with a short ball. It seems 4 out of 5 short balls end up on the other side of the boundary. \""}, {"ball": 8.1, "isHighlight": false, "text": "Dhawan to Rahane, $$OUT$$ ,Dhawan's got the important wicket, he gets it to swing back in, Rahane was playing down the wrong line, left a gap between bat and pad and bowled through the gate"}, {"ball": 8.1, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$b$$ $$Dhawan$$ $$23$$ $$(40m$$ $$26b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$88.46$$"}, {"ball": 8.2, "isHighlight": false, "text": "Dhawan to Watson, $$OUT$$ ,Dhawan's rattled the furniture again and this time it's Watto! Like the previous ball he got the  ball to move back in through the air, Watson was looking to push it to the off side but left a small gap between pad and bat, the ball clipped the off stump, the keeper was up to the stumps"}, {"ball": 8.2, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$b$$ $$Dhawan$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 8.3, "isHighlight": false, "text": "Dhawan to Binny,no run,the keeper goes back for the hat trick ball, Binny pushes it to the off side"}, {"ball": 8.4, "isHighlight": false, "text": "Dhawan to Binny,1 run,he steers this one down to third man"}, {"ball": 8.4, "isHighlight": false, "text": "Viral Patel: \"Rishi Dhawan is a big hero right now for Mumbai Indians and Hyderabad Sunrisers !!! \""}, {"ball": 8.5, "isHighlight": false, "text": "Dhawan to Samson,no run,swings it back in and he clips it to the on side"}, {"ball": 8.6, "isHighlight": false, "text": "Dhawan to Samson,1 run,fullish in length on the off stump and he drives to long-off"}, {"ball": 9.1, "isHighlight": false, "text": "Karanveer Singh to Samson,no run,tossed up and he works it towards midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Karanveer Singh to Samson,2 runs,down the track and he gets an inside edge to square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Karanveer Singh to Samson,1 run,gives it more air and he gets forward and drives on the up towards long-off"}, {"ball": 9.4, "isHighlight": false, "text": "Karanveer Singh to Binny,no run,no turn this time, makes room and punches it to cover"}, {"ball": 9.5, "isHighlight": false, "text": "Karanveer Singh to Binny,1 wide,this was really wide down the leg side, Binny was looking to smash it"}, {"ball": 9.5, "isHighlight": false, "text": "Karanveer Singh to Binny,1 run,lunges forward and pushes it to the off side"}, {"ball": 9.6, "isHighlight": false, "text": "Karanveer Singh to Samson,1 run,he makes room and punches it down to long-off"}, {"ball": 9.6, "isHighlight": false, "text": "sammydude: \"I think they missed a trick by not sending in Hodge when they have a required run rate of 11. Binny hasn't exactly kept the scorers busy.\""}, {"ball": 10.1, "isHighlight": false, "text": "Dhawan to Samson,1 run,close call for Samson as he mistimes the loft towards long-on, it went off the toe of the bat, one bounce to the fielder"}, {"ball": 10.2, "isHighlight": false, "text": "Dhawan to Binny,no run,fullish and swinging in and he works it to midwicket"}, {"ball": 10.3, "isHighlight": false, "text": "Dhawan to Binny,2 runs,gives himself room and he steers it to Balaji at third man"}, {"ball": 10.3, "isHighlight": false, "text": "Zuch: \"If there is one person who loves these kind of situations, its Faulkner. He is a (and probably the only for RR now) game changer.\""}, {"ball": 10.4, "isHighlight": false, "text": "Dhawan to Binny,2 runs,stays beside the line and works it towards backward point"}, {"ball": 10.5, "isHighlight": false, "text": "Dhawan to Binny,no run,Dhawan keeps it nice and straight and cramps him up for room, he defends"}, {"ball": 10.6, "isHighlight": false, "text": "Dhawan to Binny,1 run,good length on the stumps and he pushes it to long-on"}, {"ball": 11.1, "isHighlight": false, "text": "Karanveer Singh to Binny, $$OUT$$ ,high catching practice for Shaun Marsh at long-off, tossed up and Binny made room and gave him the charge, wanted to clear long-off but it was a half hearted shot more than anything else, easy for Marsh"}, {"ball": 11.1, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$Marsh$$ $$b$$ $$Karanveer$$ $$Singh$$ $$7$$ $$(11m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$70.00$$"}, {"ball": 11.1, "isHighlight": false, "text": "It's Rahul Tewatia and not Hodge"}, {"ball": 11.2, "isHighlight": false, "text": "Karanveer Singh to Tewatia,1 run,begins with the sweep down to deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Karanveer Singh to Samson,1 run,he comes down the track and gets an outside edge towards short third man"}, {"ball": 11.4, "isHighlight": false, "text": "Karanveer Singh to Tewatia,2 runs,dropped it short and he pulled it with force and Dhawan did really well to sprint to his right and cut it off before the rope"}, {"ball": 11.5, "isHighlight": false, "text": "Karanveer Singh to Tewatia,2 runs,Tewatia lofts this one towards deep cover and Miller does well this time to run to his left to stop it"}, {"ball": 11.6, "isHighlight": false, "text": "Karanveer Singh to Tewatia,1 run,Tewatia goes airborne again this time and it's down to long-off"}, {"ball": 12.1, "isHighlight": false, "text": "Patel to Tewatia,1 leg bye,he bowls round the wicket to the left-hander, clips the pads as he looks to sweep"}, {"ball": 12.2, "isHighlight": false, "text": "Patel to Samson,1 run,Samson looking to hit out and he gets an outside edge that rolls to short third man, he's desperate for boundaries"}, {"ball": 12.3, "isHighlight": false, "text": "Patel to Tewatia,1 run,drives down to sweeper cover for a single"}, {"ball": 12.4, "isHighlight": false, "text": "Patel to Samson,1 run,comes forward and drives this one down to long-off for a single"}, {"ball": 12.5, "isHighlight": false, "text": "Patel to Tewatia,1 leg bye"}, {"ball": 12.6, "isHighlight": false, "text": "Patel to Samson,1 run,bowls that flatter and fuller and he drives to cover"}, {"ball": 12.6, "isHighlight": false, "text": "Swagath Subrama: \"Watson- not sending Hodge, Faulkner when RR is more than 12, dropping Rahane in a crucial game some days ago. Dhoni-giving David Hussey the ball with 10 to defend in 1 over, giving Jaddu the ball when warner was devastating. Are they reading the same book on captaincy?\""}, {"ball": 12.6, "isHighlight": false, "text": "Something's got to give for Royals"}, {"ball": 13.1, "isHighlight": false, "text": "Karanveer Singh to Samson, $$OUT$$ ,stumped by a mile! And Karanveer impresses, Samson was down the track to launch that and was completely foxed by flight, bounce and turn, nowhere near the pitch of the ball, didn't bother to get back"}, {"ball": 13.1, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$st$$ $$†Saha$$ $$b$$ $$Karanveer$$ $$Singh$$ $$30$$ $$(50m$$ $$29b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$103.44$$"}, {"ball": 13.1, "isHighlight": false, "text": "It's the Time Out"}, {"ball": 13.2, "isHighlight": false, "text": "Karanveer Singh to Hodge,no run,tossed up and Hodge comes forward and defends"}, {"ball": 13.3, "isHighlight": false, "text": "Karanveer Singh to Hodge,no run,spin, bounce and turn again and Hodge was completely squared up! Fine ball"}, {"ball": 13.4, "isHighlight": false, "text": "Karanveer Singh to Hodge,no run,softly pushed it to the off side"}, {"ball": 13.5, "isHighlight": false, "text": "Karanveer Singh to Hodge,no run,Hodge this time looks to cut and he is beaten, Karanveer's winning this round"}, {"ball": 13.6, "isHighlight": false, "text": "Karanveer Singh to Hodge,1 run,skids through and he tucks it to the on side"}, {"ball": 14.1, "isHighlight": false, "text": "Balaji to Hodge,1 run,doesn't give him much room, he punches it to the off side"}, {"ball": 14.2, "isHighlight": false, "text": "Balaji to Tewatia,2 runs,the lap shot that didn't come off as well as expected, he moved right across his stumps and nearly lost his balance, just about cleared the keeper"}, {"ball": 14.3, "isHighlight": false, "text": "Balaji to Tewatia,1 leg bye,he moved right across his stumps and looked to push it to the on side and it hits the pad and rolls away"}, {"ball": 14.4, "isHighlight": false, "text": "Balaji to Hodge,2 runs,on the pads and tucked away towards fine leg and Karanweer slides and cuts it off"}, {"ball": 14.5, "isHighlight": false, "text": "Balaji to Hodge,1 wide,he strays wide down the leg side"}, {"ball": 14.5, "isHighlight": false, "text": "Balaji to Hodge,1 run,this was a low full toss which he heaves towards the leg side"}, {"ball": 14.6, "isHighlight": false, "text": "Balaji to Tewatia,no run,this was a slower ball and he makes room to swing and misses"}, {"ball": 15.1, "isHighlight": false, "text": "Patel to Hodge,1 run,he makes room and punches it to the off side"}, {"ball": 15.1, "isHighlight": false, "text": "50 balls since the last boundary"}, {"ball": 15.2, "isHighlight": false, "text": "Patel to Tewatia,1 run,flatter one on the pads and he gets on his knee and sweeps to the on side"}, {"ball": 15.3, "isHighlight": false, "text": "Patel to Hodge,1 run,he stays back and knocks it towards midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Patel to Tewatia, $$SIX$$ ,breaks the boundary drought but is it too late? Tossed up and Tewatia gets on his knee and slogs this over deep midwicket and Vohra nearly catches it but the ball parries over"}, {"ball": 15.5, "isHighlight": false, "text": "Patel to Tewatia, $$OUT$$ ,Karanveer takes this easily, Tewatia looks to go for another slog but doesn't get the distance and this time he finds the fielder at deep square leg"}, {"ball": 15.5, "isHighlight": false, "text": "$$R$$ $$Tewatia$$ $$c$$ $$Karanveer$$ $$Singh$$ $$b$$ $$Patel$$ $$16$$ $$(21m$$ $$13b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$123.07$$"}, {"ball": 15.6, "isHighlight": false, "text": "Patel to Faulkner,2 runs,he knocks it towards deep midwicket for a couple"}, {"ball": 16.1, "isHighlight": false, "text": "Hendricks to Hodge, $$SIX$$ ,Hodge welcomes Hendricks to the crease with a huge hit over deep square leg, he bowls this one short and he bludgeons it"}, {"ball": 16.2, "isHighlight": false, "text": "Hendricks to Hodge, $$FOUR$$ ,he fires this one full and wide outside the off stump and Hodge really has to reach out and he bangs this wide of cover"}, {"ball": 16.3, "isHighlight": false, "text": "Hendricks to Hodge, $$FOUR$$ ,Marsh has overrun this! Hendricks comes round the wicket and Hodge lofts a length ball straight down the ground and it goes towards long-on, Marsh ran a couple of yards too many to his left and the ball bounced over his head"}, {"ball": 16.4, "isHighlight": false, "text": "Hendricks to Hodge,2 runs,length ball outside off and he makes room and carves this one down to third man"}, {"ball": 16.5, "isHighlight": false, "text": "Hendricks to Hodge,no run,the slow bouncer, Hendricks bowls this one from the back of the hand, Hodge was looking to hook but got his head out of the way"}, {"ball": 16.6, "isHighlight": false, "text": "Hendricks to Hodge, $$SIX$$ ,expensive over! This was a length ball sliding on the pads and he lofts this one over long-on, 22 off this over"}, {"ball": 16.6, "isHighlight": false, "text": "Mehul: \"There we go, that is how you chase 179, guess Wastson was looking at the points table upside down by not sending in these two before.\""}, {"ball": 17.1, "isHighlight": false, "text": "Patel to Faulkner,1 run,he gets on his knee and sweeps him down to square leg"}, {"ball": 17.2, "isHighlight": false, "text": "Patel to Hodge,2 runs,flatter one and he sweeps and Hendricks fumbles at deep square leg and parries it to deep midwicket"}, {"ball": 17.3, "isHighlight": false, "text": "Patel to Hodge, $$OUT$$ ,another easy stumping for Saha, Hodge was looking to advance down the track and he made room, Akshar fired this towards the leg stump and Hodge was a long way down and missed it"}, {"ball": 17.3, "isHighlight": false, "text": "$$BJ$$ $$Hodge$$ $$st$$ $$†Saha$$ $$b$$ $$Patel$$ $$31$$ $$(22m$$ $$18b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$172.22$$"}, {"ball": 17.4, "isHighlight": false, "text": "Patel to Cooper,2 runs,comes forward and lofts this one down to wide long-off and the fielder does well to cut it off and parry it to sweeper cover"}, {"ball": 17.5, "isHighlight": false, "text": "Patel to Cooper, $$OUT$$ ,fine running catch by Marsh! Tossed up and Cooper looks to smash it over the off side but miscues it, it was high in the air and falling in front of long-off and Marsh had a lot of ground to cover, he timed his fall well and took it and held on after hitting the ground"}, {"ball": 17.5, "isHighlight": false, "text": "$$KK$$ $$Cooper$$ $$c$$ $$Marsh$$ $$b$$ $$Patel$$ $$2$$ $$(1m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "Patel to Faulkner,1 run,turns it to midwicket for a single"}, {"ball": 18.1, "isHighlight": false, "text": "Balaji to Faulkner, $$FOUR$$ ,this was a low full toss outside off and Faulkner reached out and hit it hard wide of sweeper cover"}, {"ball": 18.2, "isHighlight": false, "text": "Balaji to Faulkner, $$SIX$$ ,4 + 6! This was a length ball outside off and Faulkner fetched that and launched it over long-on, clean strike"}, {"ball": 18.3, "isHighlight": false, "text": "Balaji to Faulkner,1 run,fuller and he drills it hard down to Miller at long-off, Miller's throw hits the stumps at the bowler's and the third umpire takes a look, Malik's bat was in the air for a while but he grounded it"}, {"ball": 18.3, "isHighlight": false, "text": "The umpire has signalled a  $$short$$ $$run$$ . Malik didn't ground his bat properly inside the crease on completing the first run"}, {"ball": 18.4, "isHighlight": false, "text": "Balaji to Faulkner, $$SIX$$ ,Fualkner's not giving up and boy that went really far back! This was a friendly full toss by Balaji, Faulkaner stayed at the crease and launched it several rows over the sight screen"}, {"ball": 18.5, "isHighlight": false, "text": "Balaji to Faulkner,1 run,another full toss and he gets away with it this time, outside off and thudded down to long-off on the first bounce"}, {"ball": 18.6, "isHighlight": false, "text": "Balaji to Malik,no run,fuller and he drills this down to long-on"}, {"ball": 18.6, "isHighlight": false, "text": "Hendricks to bowl"}, {"ball": 19.1, "isHighlight": false, "text": "Hendricks to Faulkner,no run,nearly dragged that onto his stumps, this was a low full toss, he had the room but he missed it and the ball nearly shaved the off stump"}, {"ball": 19.2, "isHighlight": false, "text": "Hendricks to Faulkner, $$SIX$$ ,when he connects it flies, this was a slower ball and landing on a full length and Faulkner sends that a few rows over wide long-on"}, {"ball": 19.3, "isHighlight": false, "text": "Hendricks to Faulkner,no run,good yorker and he drills this down to long-off and he refuses the single"}, {"ball": 19.4, "isHighlight": false, "text": "Hendricks to Faulkner, $$SIX$$ ,he continues to swing them over the ropes, it was a length ball and he sent it over deep midwicket"}, {"ball": 19.5, "isHighlight": false, "text": "Hendricks to Faulkner,1 run,a single to fine leg is all he will get, down the leg side and pulled down to fine leg"}, {"ball": 19.6, "isHighlight": false, "text": "Hendricks to Malik,1 run,length ball and he pulls this one to deep square leg and Kings XI take pole position in the playoffs, they are the No.1 team"}, {"ball": 19.6, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 19.6, "isHighlight": false, "text": "$$Bailey$$ : \"We have been trying to have a smaller gap between your best and worst cricket. We said we had a lot of batters capable of scoring between 20 and 40 but the pleasing thing tonight was we kept wickets in hand and building stands. Karanveer has been patient and bowled beautifully tonight. I thought Balaji and Rishi were excellent in the middle overs. Akshar too.\""}, {"ball": 19.6, "isHighlight": false, "text": "$$Marsh$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ : \"Enjoyed batting with Manan. The bowlers were fantastic. The ball was coming on really nicely, full credit to our bowlers. Good that we got a good win tonight.\""}, {"ball": 19.6, "isHighlight": false, "text": "That's it from us here. Two games tomorrow but the first of the two is inconsequential - between a team that has qualified and one that is out. Sunrisers winning will make things interesting."}, {"ball": 19.6, "isHighlight": false, "text": "Join us tomorrow. Thanks for your company. Cheers!"}, {"ball": 19.6, "isHighlight": false, "text": "$$End$$ $$of$$ $$the$$ $$match$$ : Royals' defeat will come as a huge relief for Mumbai Indians who are still in with a chance. The battle for fourth place is still on."}, {"ball": 19.6, "isHighlight": false, "text": "Watson: \"Very good wicket. I'm a culprit for losing my wicket. Faulkner has been incredible with the bat. We have got to pick ourselves up from tonight's game. The game against Mumbai Indians is a knockout.\""}, {"ball": 19.6, "isHighlight": false, "text": "Peculiar batting order from the Royals. Questions will be asked why Hodge and Faulkner was sent in so late, ahead of Binny and Tewatia."}], "name": "Kings XI Punjab v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734033.html?innings=2;view=commentary", "match_num": 52}