{"commentary": [{"ball": 0, "isHighlight": false, "text": "Takawale and Rossouw to open for RCB. Nehra has the new ball"}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm$$ $$Dhoni$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$CSK$$ $$will$$ $$bowl$$"}, {"ball": 0, "isHighlight": false, "text": "For CSK, Badree and Nehra are in for Hastings and Negi"}, {"ball": 0, "isHighlight": false, "text": "for RCB, Gayle is out, so are Muralitharan, Dinda and Nechim. Coming in are Rampaul, Rossouw, Zol and Jakati"}, {"ball": 0, "isHighlight": false, "text": "Kohli, in green today, says RCB would have bowled too. Dhoni says CSK have struggled to contain the opposition on good batting wickets."}, {"ball": 0, "isHighlight": false, "text": "-------------------- Eniyan: \"I dont see Gayle as dropped. Considering the insignificance of this match he would have dropped himself. He is already struggling in fitness.\""}, {"ball": 0, "isHighlight": false, "text": "Rohit Raghavan: \"Gayle should have been dropped eons ago. He was very clearly struggling for form and only his credential as a big name helped him retain his spot. \""}, {"ball": 0, "isHighlight": false, "text": "Jeevan: \"Future Captain who..? One IPL, one Champions league and a remarkable turn around this year..Rohit certainly is our Man after Dhoni!\""}, {"ball": 0, "isHighlight": false, "text": "Nitin: \"Brave, albeit very late, call from Kohli to drop Gayle. This should have been done 4-5 matches back. Gayle has been holding back RCB with some pathetic, ball consuming, excruciatingly slow innings.\""}, {"ball": 0, "isHighlight": false, "text": "Aditya Mandalem: \"Sincerely I believe Rohit will be a better captain for India than Kohli. Kohli is like Sachin Tendulkar. He should be given a position in the batting order and he excels there. Make him captain, and he gets under a lot of stress. Rohit does better when he's a captain. Leadership comes to him naturally.\""}, {"ball": 0, "isHighlight": false, "text": "Amit: \"Never thought I would see Gayle dropped from any T20 team anywhere in the world.\""}, {"ball": 0, "isHighlight": false, "text": "Ishan Jain: \"CSK vs RCB has always been a fire vs fire contest. Sadly, RCB will not go through this time, but least they can do for their fans is to put in a typical RCB performance. Would love to see Kohli special today!\""}, {"ball": 0, "isHighlight": false, "text": "Sai Kiran: \"Present captain vs Future captain. Going to be interesting...\""}, {"ball": 0, "isHighlight": false, "text": "$$3.10pm$$  You would not want to play two knockout games to make it to the final, if you have made it towards the top of the table after a gruelling campaign in the heat of summer. One of Chennai Super Kings and Kolkata Knight Riders will possibly finish second after today's double header, and take on Kings XI Punjab later for a place in the final. One of them will possibly finish third, and stand the risk of exiting the tournament if they lose the eliminator against the fourth-placed team. CSK go up first this afternoon against Royal Challengers Bangalore, and after that, KKR face Sunrisers Hyderabad. While RCB's campaign is already over, Sunrisers are still in with a chance as are Rajasthan Royals and Mumbai Indians"}, {"ball": 0, "isHighlight": false, "text": "Nimish: \"RR is not too far behind in NRR though!! and if CSK and KKR lose today, that gap will reduce even further, They also have the advantage of playing the last match!!\""}, {"ball": 0, "isHighlight": false, "text": "Suyash Roongta: \"Or Rajasthan could pip them both on NRR if they both lose and Rajasthan win tomorrow?\" Possibilities there too, although RR's NRR is the poorest of the three - RR, CSK and KKR - at the moment"}, {"ball": 0.1, "isHighlight": false, "text": "Nehra to Rossouw,no run,good delivery to start off, pitches it up right on off stump, straightens it too, Rossouw defends"}, {"ball": 0.2, "isHighlight": false, "text": "Nehra to Rossouw,1 run,very tight single to get going, Rossouw pushes a similar ball to mid off and sets off, Manhas runs forward but his throw is wide, even as Rossouw dives in desperately"}, {"ball": 0.3, "isHighlight": false, "text": "Nehra to Takawale,1 run,comes forward and pushes a length ball down to third man"}, {"ball": 0.4, "isHighlight": false, "text": "Nehra to Rossouw,no run,fuller from Nehra on off, Rossouw squeezes it out to extra cover"}, {"ball": 0.5, "isHighlight": false, "text": "Nehra to Rossouw, $$OUT$$ ,he's been pegging away in that area around off stump throughout the over, and this time he gets one through, pitched up, slanted in, Rossouw has been kept quiet and tries to force it to leg with an angled bat, misses, and his off stump is uprooted"}, {"ball": 0.5, "isHighlight": false, "text": "$$RR$$ $$Rossouw$$ $$b$$ $$Nehra$$ $$1$$ $$(3m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$25.00$$"}, {"ball": 0.5, "isHighlight": false, "text": "Zol is in"}, {"ball": 0.6, "isHighlight": false, "text": "Nehra to Zol,no run,excellent delivery to end an excellent over, and a rather close leave from Zol, this outswinger barely missed the off stump as he raised his bat high"}, {"ball": 0.6, "isHighlight": false, "text": "Badree to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Badree to Takawale,no run,nice, tosses it up outside off, draws him forward, he pushes for turn, it comes in instead to beat the inside edge"}, {"ball": 1.2, "isHighlight": false, "text": "Badree to Takawale,no run,hit on the pad now as he presses forward, but it strikes him outside the line"}, {"ball": 1.3, "isHighlight": false, "text": "Badree to Takawale,no run,bowls a legbreak on middle, Takawale comes forward and taps it to the leg side"}, {"ball": 1.4, "isHighlight": false, "text": "Badree to Takawale,no run,plays it off the back foot, as it pitches good length and carries in towards him"}, {"ball": 1.5, "isHighlight": false, "text": "Badree to Takawale,no run,again played out quietly off the back foot, this was a legbreak straightening around off"}, {"ball": 1.6, "isHighlight": false, "text": "Badree to Takawale, $$FOUR$$ ,does not let him bowl a maiden, gets down on his knee for the slog-sweep and cracks it to the deep midwicket boundary"}, {"ball": 2.1, "isHighlight": false, "text": "Nehra to Zol,no run,good length ball straightening on off, defended"}, {"ball": 2.2, "isHighlight": false, "text": "Nehra to Zol,1 run,sends it in to middle and leg this time, and it is tucked to long leg for a single"}, {"ball": 2.3, "isHighlight": false, "text": "Nehra to Takawale,no run,width on this short of a length ball but Jadeja dives full-length to his left at backward point to stop the cut, saved a boundary"}, {"ball": 2.4, "isHighlight": false, "text": "Nehra to Takawale,1 run,short ball now, 130.5 kph, Takawale gets on his toes, fends it down into the off side"}, {"ball": 2.5, "isHighlight": false, "text": "Nehra to Zol, $$SIX$$ ,Zol tees off straight, Nehra bowls it on a length just outside off, Zol lunges forward and picks it high over the boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Nehra to Zol,2 runs,tucked behind square leg for a couple"}, {"ball": 3.1, "isHighlight": false, "text": "Badree to Takawale, $$FOUR$$ ,takes it from around off stump and sweeps crisply, into the deep square leg rope"}, {"ball": 3.2, "isHighlight": false, "text": "Badree to Takawale,no run,comes down the track, Badree shortens the length, and Takawale has to push it away"}, {"ball": 3.3, "isHighlight": false, "text": "Badree to Takawale, $$FOUR$$ ,four more, Takawale sweeps again, goes behind square, but well to the left of short fine leg, superb placement"}, {"ball": 3.3, "isHighlight": false, "text": "Dhoni has a word with his bowler"}, {"ball": 3.4, "isHighlight": false, "text": "Badree to Takawale,no run,pushed to backward point"}, {"ball": 3.5, "isHighlight": false, "text": "Badree to Takawale,no run,some bounce on the legbreak outside off, dabbed to short third man"}, {"ball": 3.6, "isHighlight": false, "text": "Badree to Takawale, $$FOUR$$ ,slight spin outside off but it is shortish, and Takawale opens up to swat a pull between long on and deep midwicket, there is a dive near the rope from Mohit, in vain"}, {"ball": 3.6, "isHighlight": false, "text": "Ashwin on"}, {"ball": 4.1, "isHighlight": false, "text": "Ashwin to Zol,1 run,comes forward to turn a full ball on middle and leg to midwicket"}, {"ball": 4.2, "isHighlight": false, "text": "Ashwin to Takawale,1 run,length ball with slight turn into the pad, nudged square"}, {"ball": 4.3, "isHighlight": false, "text": "Ashwin to Zol,no run,goes back to work it to square leg off the pads"}, {"ball": 4.4, "isHighlight": false, "text": "Ashwin to Zol,1 run,lunges forward and bends to sweep but drags it to midwicket"}, {"ball": 4.5, "isHighlight": false, "text": "Ashwin to Takawale, $$OUT$$ ,given by umpire Anil Chaudhary after a long appeal, Takawale pushed forward but played outside the line as it straightened a bit from round the stumps, but it was still angling across, and struck him on the line of off stump, not sure that was going to hit off"}, {"ball": 4.5, "isHighlight": false, "text": "$$YV$$ $$Takawale$$ $$lbw$$ $$b$$ $$Ashwin$$ $$19$$ $$(18m$$ $$17b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$111.76$$"}, {"ball": 4.6, "isHighlight": false, "text": "Ashwin to Kohli,no run,worked to square leg, Zol had taken a start and has to hurry back"}, {"ball": 4.6, "isHighlight": false, "text": "Mohit Sharma"}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Zol,2 runs,lofts the length delivery high over mid off, clears the man easily but hasn't timed it well enough to reach the rope"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Zol,no run,tries to pull a short of a length ball but mishits it off the lower part of the bat to mid on"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Zol,no run,short of a length again, angled in towards off, played out to point"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Zol, $$OUT$$ ,Zol's had one swing too many, he wanted to slog this length delivery with the incoming angle over midwicket, he missed, and Mohit hit middle stump"}, {"ball": 5.4, "isHighlight": false, "text": "$$VH$$ $$Zol$$ $$b$$ $$Sharma$$ $$13$$ $$(20m$$ $$12b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$108.33$$"}, {"ball": 5.4, "isHighlight": false, "text": "This is Mohit's first strike in four matches"}, {"ball": 5.4, "isHighlight": false, "text": "Yuvraj Singh"}, {"ball": 5.4, "isHighlight": false, "text": "Mohit over the stumps"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,tries to drive a length ball around middle and leg, but hits it off the inner half of the bat to midwicket"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,Mohit goes short, at 133.4 kph, and Yuvraj crouches into a pull, there is deep square leg around"}, {"ball": 5.6, "isHighlight": false, "text": "Reetam: \"Just sums up the umpiring this IPL\""}, {"ball": 5.6, "isHighlight": false, "text": "Suresh Raina on"}, {"ball": 6.1, "isHighlight": false, "text": "Raina to Yuvraj Singh,3 runs,pushes forward and gets a thick edge towards the third man boundary before it is pulled back inside"}, {"ball": 6.2, "isHighlight": false, "text": "Raina to Kohli,no run,offbreak on middle, he goes back to turn it to midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Raina to Kohli,no run,back and across to a length offbreak, turns it to square leg now"}, {"ball": 6.4, "isHighlight": false, "text": "Raina to Kohli,1 wide,some spin for Raina, which takes the ball down the leg side"}, {"ball": 6.4, "isHighlight": false, "text": "Raina to Kohli,1 run,shorter one turning in from outside off, punched to long on"}, {"ball": 6.5, "isHighlight": false, "text": "Raina to Yuvraj Singh,no run,pitched up and straightening around off stump, he is forward to block"}, {"ball": 6.6, "isHighlight": false, "text": "Raina to Yuvraj Singh,no run,bends forward again to defend an offbreak that bounces a bit more"}, {"ball": 6.6, "isHighlight": false, "text": "Jai: \"*sigh* RCB self-destruction mode on\""}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Kohli,no run,leans into the drive on this length ball but cannot beat extra cover"}, {"ball": 7.1, "isHighlight": false, "text": "Keeper standing up"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Kohli,1 run,Kohli is made to stay in the crease, a 132 kph length ball is guided to third man"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Yuvraj Singh,no run,angled across just outside off, back of a length, whipped to midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Yuvraj Singh,1 run,plenty of width outside off and Yuvraj crashes it square, but Raina throws himself to his left at backward point to save a certain boundary"}, {"ball": 7.4, "isHighlight": false, "text": "Ram: \"I m happy, atleast Gayle wont be blamed for RCB's debacle today\""}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Kohli,no run,rises from just short of a length, Kohli adjusts to push it to the off side, extra cover runs across to prevent the single"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Kohli,no run,beaten, this seemed to hold the line after it pitched good length close to off, and zipped past Kohli's prod"}, {"ball": 8.1, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run,whipped past square leg, Jadeja from deep midwicket sprints across to keep them to one"}, {"ball": 8.2, "isHighlight": false, "text": "Raina to Kohli,1 run,short, deserves to be put away, Kohli rocks back and pulls hard, finds deep midwicket"}, {"ball": 8.3, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run,worked to fine leg off the pad"}, {"ball": 8.4, "isHighlight": false, "text": "Raina to Kohli,1 run,makes some room and punches a flat offbreak, midwicket dives but cannot stop it"}, {"ball": 8.5, "isHighlight": false, "text": "Raina to Yuvraj Singh,no run,some turn outside off, Yuvraj punches to extra cover off the back foot"}, {"ball": 8.6, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run,length ball pushed past a diving Raina to long on"}, {"ball": 8.6, "isHighlight": false, "text": "Time out"}, {"ball": 8.6, "isHighlight": false, "text": "Gareth: \"RCB are the new Mumbai Indians. Big stars, under-performing. \""}, {"ball": 9.1, "isHighlight": false, "text": "Ashwin to Yuvraj Singh,2 runs,Yuvraj skips out, he is not quite to the pitch, but chips it cleanly over the bowler, Mohit does well to save the boundary with a dive on the boundary"}, {"ball": 9.2, "isHighlight": false, "text": "Ashwin to Yuvraj Singh,1 run,swept hard to fine leg"}, {"ball": 9.3, "isHighlight": false, "text": "Ashwin to Kohli, $$SIX$$ ,Kohli out of the crease now, hitting with the spin, and swatting it over deep midwicket"}, {"ball": 9.4, "isHighlight": false, "text": "Ashwin to Kohli,no run,reaches forward to push solidly to extra cover"}, {"ball": 9.5, "isHighlight": false, "text": "Ashwin to Kohli,no run,lets this offbreak go as it travels down the leg side, not given a wide, umpire Llong signals it brushed Kohli's pad"}, {"ball": 9.6, "isHighlight": false, "text": "Ashwin to Kohli,1 run,makes room and hits to sweeper cover"}, {"ball": 10.1, "isHighlight": false, "text": "Raina to Kohli,3 runs,nudged fine off the pads, Mohit Sharma has had plenty of running to do in the deep, he puts in another long run and saves the four with a dive, gets up and limps back to his position"}, {"ball": 10.2, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run"}, {"ball": 10.3, "isHighlight": false, "text": "Raina to Kohli,no run,sees him coming down, shortens the length, Kohli taps it to midwicket"}, {"ball": 10.4, "isHighlight": false, "text": "Raina to Kohli,1 run,leans forward and works it to long on with the spin"}, {"ball": 10.5, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run,bends forward, opens the face and guides it to point for one"}, {"ball": 10.6, "isHighlight": false, "text": "Raina to Kohli,1 run,skips out once more, but Raina drags the length back, Kohli can only knock it along the ground to long on"}, {"ball": 11.1, "isHighlight": false, "text": "Ashwin to Kohli,2 runs,Kohli is stepping out frequently but he is not getting the length to get underneath, Ashwin shortens it and Kohli works it square, past the dive from the fielder in the circle"}, {"ball": 11.2, "isHighlight": false, "text": "Ashwin to Kohli, $$SIX$$ ,Kohli stays back this time, Ashwin bowls it shortish, and Kohli pulls it powerfully with the turn over deep midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Ashwin to Kohli,1 run,backs away to a good length offbreak and dabs it behind point"}, {"ball": 11.4, "isHighlight": false, "text": "Ashwin to Yuvraj Singh,1 run,sees it spinning away sharply, stops his forward lunge, and guides it to point"}, {"ball": 11.5, "isHighlight": false, "text": "Ashwin to Kohli,no run,leans forward to a length offbreak, taps it to the leg side"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin to Kohli,no run,leaves the crease, takes it on the full, works it straight to square leg"}, {"ball": 12.1, "isHighlight": false, "text": "Raina to Yuvraj Singh,no run,pushed to midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Raina to Yuvraj Singh,1 run,quick and flat just outside off, punched to extra cover"}, {"ball": 12.3, "isHighlight": false, "text": "Raina to Kohli,1 run,and again, when Kohli steps out, Raina drags the length back, Kohli turns it through midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Raina to Yuvraj Singh, $$FOUR$$ ,Yuvraj loses his balance and falls as he lunges forward for the slog-sweep, but despite that he's placed it wide of the deep fielder and into the deep midwicket rope"}, {"ball": 12.5, "isHighlight": false, "text": "Raina to Yuvraj Singh, $$FOUR$$ ,that'll go too, quick and flat outside off, Yuvraj crouches, delays his shot a tad, and late-cuts behind backward point"}, {"ball": 12.6, "isHighlight": false, "text": "Raina to Yuvraj Singh,no run,comes forward to defend solidly to the off side"}, {"ball": 12.6, "isHighlight": false, "text": "Ravindra Jadeja"}, {"ball": 13.1, "isHighlight": false, "text": "Jadeja to Kohli,1 run,angles it in full, Kohli comes forward and pushes it past the bowler to long on"}, {"ball": 13.2, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,1 run,shortish, Yuvraj rocks back and pulls, but long on reaches it to his left"}, {"ball": 13.3, "isHighlight": false, "text": "Jadeja to Kohli,1 run,leaves the crease and pushes for one to long on"}, {"ball": 13.4, "isHighlight": false, "text": "Jadeja to Yuvraj Singh,1 run,full around off, drilled straight down the ground to long off"}, {"ball": 13.5, "isHighlight": false, "text": "Jadeja to Kohli,1 run,charges out, Jadeja hurls it in flat and quick, Kohli swipes, mishits it through midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja to Yuvraj Singh, $$OUT$$ ,gone, Jadeja strikes first over, Yuvraj slog-sweeps a length ball from outside off, it bounces  a touch more than he would have liked and he picks out Raina at deep midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Raina$$ $$b$$ $$Jadeja$$ $$25$$ $$(29m$$ $$24b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$104.16$$"}, {"ball": 13.6, "isHighlight": false, "text": "Time out"}, {"ball": 14.1, "isHighlight": false, "text": "Badree to Kohli,2 runs,skips out of the crease, Badree bowls it full into the legs, Kohli works it wide of deep midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Badree to Kohli, $$SIX$$ ,dancing down yet again, and swatting it 87 metres into the crowd over the long off boundary"}, {"ball": 14.3, "isHighlight": false, "text": "Badree to Kohli,2 runs,works it through midwicket and immediately shouts 'two', de Villiers has to rush back, direct hit would have been interesting"}, {"ball": 14.4, "isHighlight": false, "text": "Badree to Kohli,1 run,hits it to the left of long off for a single"}, {"ball": 14.5, "isHighlight": false, "text": "Badree to de Villiers,1 run,flat length ball not rising much, AB whips it from outside off to long on"}, {"ball": 14.6, "isHighlight": false, "text": "Badree to Kohli,1 run,lunges forward and scoops it in the air past the non-striker to long on"}, {"ball": 15.1, "isHighlight": false, "text": "Jadeja to Kohli,2 runs,superb stop from David Hussey, Kohli had slogged it hard, and it was bouncing over him as he ran to his left from deep midwicket, but he jumped and slapped the ball back in with his left hand"}, {"ball": 15.2, "isHighlight": false, "text": "Jadeja to Kohli,1 wide,hurled fast and flat and down the leg side"}, {"ball": 15.2, "isHighlight": false, "text": "Jadeja to Kohli,2 runs,tosses it up wider and slower outside off, Kohli drives hard but cannot beat the sweeper"}, {"ball": 15.3, "isHighlight": false, "text": "Jadeja to Kohli,1 run,hit to sweeper cover for a single"}, {"ball": 15.4, "isHighlight": false, "text": "Jadeja to de Villiers,1 run,backs away outside leg, Jadeja follows him, AB sweeps it behind square, but there is a deep fielder there"}, {"ball": 15.5, "isHighlight": false, "text": "Jadeja to Kohli,no run,bowled a tad slower, and it spins past the outside edge as Kohli tries to drive it"}, {"ball": 15.6, "isHighlight": false, "text": "Jadeja to Kohli,1 wide,now he fires it at 101.3 kph down the leg side"}, {"ball": 15.6, "isHighlight": false, "text": "Jadeja to Kohli,1 run,hit to long on for one"}, {"ball": 16.1, "isHighlight": false, "text": "Ashwin to Kohli,1 run,comes down the track and turns a length ball to deep midwicket"}, {"ball": 16.2, "isHighlight": false, "text": "Ashwin to de Villiers,1 leg bye,AB jumps out now, Ashwin gets it to bounce as he shortens the length, he is hit on the pad and the ball pops up on the leg side"}, {"ball": 16.3, "isHighlight": false, "text": "Ashwin to Kohli,no run,sees him advancing out again, and bowls it full into the pad, Kohli kicks it away"}, {"ball": 16.4, "isHighlight": false, "text": "Ashwin to Kohli, $$FOUR$$ ,goes deep in the crease this time and pulls with the turn to the deep square leg boundary to bring up his fifty"}, {"ball": 16.5, "isHighlight": false, "text": "Ashwin to Kohli,1 run"}, {"ball": 16.6, "isHighlight": false, "text": "Ashwin to de Villiers, $$FOUR$$ ,a low full toss, AB reaches forward, brings out the reverse sweep and connects crisply, into the third man boundary"}, {"ball": 17.1, "isHighlight": false, "text": "Nehra to Kohli, $$FOUR$$ ,starts the over with a full toss, Kohli moves forward and easily swats it between deep midwicket and long on"}, {"ball": 17.2, "isHighlight": false, "text": "Nehra to Kohli,1 run,hammers a pitched up ball straight to long off"}, {"ball": 17.2, "isHighlight": false, "text": "stephen: \"Good News: Kohli back in form Bad News:This year IPL has ended..\""}, {"ball": 17.2, "isHighlight": false, "text": "round the stumps"}, {"ball": 17.3, "isHighlight": false, "text": "Nehra to de Villiers, $$FOUR$$ ,a length ball slanted in towards off, AB gets down on his knee and slogs high over midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "Nehra to de Villiers, $$OUT$$ ,Nehra gets the yorker in, and takes out the middle stump, after AB slogs and misses"}, {"ball": 17.4, "isHighlight": false, "text": "$$AB$$ $$de$$ $$Villiers$$ $$b$$ $$Nehra$$ $$10$$ $$(16m$$ $$6b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$166.66$$"}, {"ball": 17.4, "isHighlight": false, "text": "Sachin Rana is in"}, {"ball": 17.4, "isHighlight": false, "text": "SD: \"That's what Nehra is capable of! Fabulous delivery to get rid of AB. Wish to see more of that.\""}, {"ball": 17.5, "isHighlight": false, "text": "Nehra to Rana,1 run,a length ball in to off and middle, whipped through square leg"}, {"ball": 17.6, "isHighlight": false, "text": "Nehra to Kohli,1 run,keeps the strike with a push to extra cover off the length ball"}, {"ball": 17.6, "isHighlight": false, "text": "Mohit Sharma to bowl the 19th"}, {"ball": 18.1, "isHighlight": false, "text": "Sharma to Kohli, $$SIX$$ ,Kohli reaches forward to force it over midwicket, he hasn't hit it too well, but done enough to clear Jadeja's jump at deep midwicket"}, {"ball": 18.2, "isHighlight": false, "text": "Sharma to Kohli,1 run,full, wide and angled further away, Kohli pushes it to extra cover"}, {"ball": 18.3, "isHighlight": false, "text": "Sharma to Rana,no run,slower one from back of the hand, it moves away outside off past Rana's swipe"}, {"ball": 18.3, "isHighlight": false, "text": "uday: \"this is what happens when you have the world's best batsman in your team and you use him as a slogger at no.6\""}, {"ball": 18.4, "isHighlight": false, "text": "Sharma to Rana,1 run,another slower length ball, this time he taps it to point and gets the captain back on strike"}, {"ball": 18.5, "isHighlight": false, "text": "Sharma to Kohli,1 run,just misses the yorker, Kohli cracks it to long off"}, {"ball": 18.6, "isHighlight": false, "text": "Sharma to Rana,2 runs,a length ball close to off, he hits it towards sweeper cover, they push for the second and a wide throw helps them"}, {"ball": 19.1, "isHighlight": false, "text": "Nehra to Kohli,1 wide,hurls a full toss down the leg side, umpire calls it a wide,  Kohli signals it has brushed him, but the decision has been made"}, {"ball": 19.1, "isHighlight": false, "text": "Nehra to Kohli, $$SIX$$ ,a length ball, Kohli takes a couple of steps out and slogs it 93 metres and over the deep midwicket boundary"}, {"ball": 19.2, "isHighlight": false, "text": "Nehra to Kohli, $$OUT$$ ,Nehra's response is one more yorker, and Kohli cannot prevent it from hitting the stumps even as he brings his bat down, it brushes the bat, then onto pad and onward to the stumps"}, {"ball": 19.2, "isHighlight": false, "text": "$$V$$ $$Kohli$$ $$b$$ $$Nehra$$ $$73$$ $$(62m$$ $$49b$$ $$2x4$$ $$5x6)$$ $$SR:$$ $$148.97$$"}, {"ball": 19.3, "isHighlight": false, "text": "Nehra to Starc,1 run,a high full toss, Starc swings hard, and the ball rolls down to long off"}, {"ball": 19.4, "isHighlight": false, "text": "Nehra to Rana,1 leg bye,Nehra gets away with a length ball, Rana tries to slog it over the leg side with the incoming angle but misses"}, {"ball": 19.5, "isHighlight": false, "text": "Nehra to Starc,1 run,Starc has a slog to a pitched up delivery, thick inside edge runs through square leg"}, {"ball": 19.6, "isHighlight": false, "text": "Nehra to Rana,1 run,the extra ball goes for only one, Rana tries another heave to another length delivery, but he cannot connect"}, {"ball": 19.6, "isHighlight": false, "text": "RCB have managed 53 off the last five but they were just past 100 after 15 overs, and CSK will back themselves to chase this down"}, {"ball": 19.6, "isHighlight": false, "text": "Ashwin feels it is a slow wicket, and the ball is holding a bit. He says it is a par score and CSK will have to bat well."}, {"ball": 19.6, "isHighlight": false, "text": "Snehil: \"Say what you will of Nehra..but he has uprooted the stumps of the two best batsman in the world..those are some yorkers..\""}, {"ball": 19.6, "isHighlight": false, "text": "Aniket Ghadge: \"Nehra should buy a lottery ticket tonight... It's not everyday that he gets two of the best batsmen in the world bowled with perfect yorkers!\""}], "name": "Royal Challengers Bangalore v Chennai Super Kings", "innings": "Royal Challengers Bangalore  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734035.html?innings=1;view=commentary", "match_num": 53}