{"commentary": [{"ball": 0, "isHighlight": false, "text": "Back for the chase. Dwayne Smith and Faf du Plessis to open for CSK. Jakati has the new ball"}, {"ball": 0.1, "isHighlight": false, "text": "Jakati to Smith,no run,length ball hurrying in with the angle, punched to mid on from the crease"}, {"ball": 0.2, "isHighlight": false, "text": "Jakati to Smith,2 runs,rocks back and pulls a short ball, Starc is at deep midwicket, he comes forward and dives, but it bounces just in front"}, {"ball": 0.3, "isHighlight": false, "text": "Jakati to Smith,1 run,survives again, looks to lift it straight, just clears mid on this time"}, {"ball": 0.4, "isHighlight": false, "text": "Jakati to du Plessis,1 run,whipped to midwicket for a single"}, {"ball": 0.5, "isHighlight": false, "text": "Jakati to Smith,1 run,cracks it towards deep midwicket again, Starc in business once more as he runs to his left"}, {"ball": 0.6, "isHighlight": false, "text": "Jakati to du Plessis,no run,leaves the crease and pushes to extra cover"}, {"ball": 0.6, "isHighlight": false, "text": "Rampaul to bowl"}, {"ball": 1.1, "isHighlight": false, "text": "Rampaul to Smith, $$FOUR$$ ,what a shot, this has been drilled straight past the bowler, on the up, this is nowhere near driving length, but Smith has made slight room and crashed it down the ground with a straight followthrough"}, {"ball": 1.2, "isHighlight": false, "text": "Rampaul to Smith,1 run,swatted off the pads to long leg"}, {"ball": 1.3, "isHighlight": false, "text": "Rampaul to du Plessis,no run,tries to hit this widish short of a length ball outside off, and is beaten"}, {"ball": 1.4, "isHighlight": false, "text": "Rampaul to du Plessis,no run,still wider this time, du Plessis tries to reach it but cannot make contact once again"}, {"ball": 1.5, "isHighlight": false, "text": "Rampaul to du Plessis, $$FOUR$$ ,gives him the charge, picks up the length delivery and smashes it in the air through midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Rampaul to du Plessis, $$SIX$$ ,even better connection this time, as Faf jumps out again to a length ball and lofts it way over the long off boundary"}, {"ball": 2.1, "isHighlight": false, "text": "Jakati to Smith,2 runs,not too short, but sits up and Smith comes across to pull in front of square, deep square leg runs to his left and dives to stop it"}, {"ball": 2.2, "isHighlight": false, "text": "Jakati to Smith, $$SIX$$ ,smoked over the deep extra cover boundary now, Smith hasn't powered this, he's eased into the stroke and timed it all the way"}, {"ball": 2.3, "isHighlight": false, "text": "Jakati to Smith,1 run"}, {"ball": 2.4, "isHighlight": false, "text": "Jakati to du Plessis, $$FOUR$$ ,now du Plessis, he makes room outside leg and drills it through extra cover, long off dives in vain"}, {"ball": 2.5, "isHighlight": false, "text": "Jakati to du Plessis,1 run,driven down to long off for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Jakati to Smith,1 run,waits on this length ball and hits it towards extra cover, there is a throw at the non-striker's end, but it misses"}, {"ball": 2.6, "isHighlight": false, "text": "Mitchell Starc"}, {"ball": 3.1, "isHighlight": false, "text": "Starc to Smith,2 runs,gets the same treatment, Smith gets forward to a length ball and lofts over mid off, does not time it but clears the man"}, {"ball": 3.2, "isHighlight": false, "text": "Starc to Smith, $$FOUR$$ ,pummeled down the ground now, Starc pitches it up, and Smith clears front leg to drill it dead straight"}, {"ball": 3.3, "isHighlight": false, "text": "Starc to Smith, $$FOUR$$ ,Smith wants to end this early, over extra cover again as he eases forward and lifts this length delivery way over the infield"}, {"ball": 3.4, "isHighlight": false, "text": "Starc to Smith,no run,finally Smith fails to connect, this was back of a length and coming in close to off, Smith tried to force it away"}, {"ball": 3.5, "isHighlight": false, "text": "Starc to Smith,1 run,length ball into the pad, turned behind square"}, {"ball": 3.6, "isHighlight": false, "text": "Starc to du Plessis,1 wide,full and wide outside off, but way too far"}, {"ball": 3.6, "isHighlight": false, "text": "Starc to du Plessis, $$SIX$$ ,six more, a top edge but anything goes for six here, Faf pulls a short ball, fine leg is up, would have made little difference if he had been on the rope"}, {"ball": 4.1, "isHighlight": false, "text": "Rampaul to Smith, $$FOUR$$ ,a slower ball, Smith still gets it away, he makes room and reaches forward to swat it straight over the bowler, Starc is at long on, he fails to get there"}, {"ball": 4.2, "isHighlight": false, "text": "Rampaul to Smith, $$OUT$$ ,Smith is gone after an electric start, he's tried to whip this length ball to the leg side, ends up mishitting it high for Kohli at midwicket to settle under it"}, {"ball": 4.2, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$c$$ $$Kohli$$ $$b$$ $$Rampaul$$ $$34$$ $$(19m$$ $$17b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 4.2, "isHighlight": false, "text": "Suresh Raina"}, {"ball": 4.2, "isHighlight": false, "text": "Surjith Bhaskar: \"I am confused. Were the chennai batsmen told by Dhoni that they have to win in 10 overs to qualify.\""}, {"ball": 4.3, "isHighlight": false, "text": "Rampaul to du Plessis,1 run,clips a length ball from off and middle in front of square leg"}, {"ball": 4.4, "isHighlight": false, "text": "Rampaul to Raina,1 run,a back of a length ball dabbed to third man"}, {"ball": 4.5, "isHighlight": false, "text": "Rampaul to du Plessis,no run,back of a length around off, guided towards point"}, {"ball": 4.6, "isHighlight": false, "text": "Rampaul to du Plessis,no run,a slower length ball pushed back to the bowler"}, {"ball": 5.1, "isHighlight": false, "text": "Starc to Raina,no run"}, {"ball": 5.2, "isHighlight": false, "text": "Starc to Raina,no run,good length ball just outside off, he leans forward to push to mid on"}, {"ball": 5.3, "isHighlight": false, "text": "Starc to Raina,1 run,dabs again and beats short third man, but there is a squarer third man too, and he fields"}, {"ball": 5.4, "isHighlight": false, "text": "Starc to du Plessis,no run,pitched up and moving in to hit the pad, but that was headed down the leg side"}, {"ball": 5.5, "isHighlight": false, "text": "Starc to du Plessis,no run,very full outside off, square driven to cover"}, {"ball": 5.6, "isHighlight": false, "text": "Starc to du Plessis, $$FOUR$$ ,shot, du Plessis jumps out, and drills the pitched up ball straight past the non-striker and into the boundary"}, {"ball": 5.6, "isHighlight": false, "text": "Chahal to bowl"}, {"ball": 6.1, "isHighlight": false, "text": "Chahal to Raina,1 run,comes down the track and pushes a legbreak off the pad through midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Chahal to du Plessis,1 run,legbreak straightening on middle, he goes back to work it to deep midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Chahal to Raina,no run,turned from back in the crease to midwicket"}, {"ball": 6.4, "isHighlight": false, "text": "Chahal to Raina,1 run,walks down the crease and pushed softly to long on for one"}, {"ball": 6.5, "isHighlight": false, "text": "Chahal to du Plessis,1 run,Faf leaves the crease as well, and opens the face to push to extra cover"}, {"ball": 6.6, "isHighlight": false, "text": "Chahal to Raina,1 run,short ball punched down to wide long on"}, {"ball": 7.1, "isHighlight": false, "text": "Rana to Raina,no run,stays a touch low from a length outside off, guided to covers"}, {"ball": 7.2, "isHighlight": false, "text": "Rana to Raina,1 run,short and wide, Raina beats backward point but there is a sweeper"}, {"ball": 7.3, "isHighlight": false, "text": "Rana to du Plessis,1 run,good length ball angled in, whipped off the pad to deep midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Rana to Raina,no run,pushes off the front foot to extra cover"}, {"ball": 7.5, "isHighlight": false, "text": "Rana to Raina, $$FOUR$$ ,Raina gets one away finally, a back of a length ball sitting up, and Raina pulls it in the air, just over Yuvraj's leap at midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Rana to Raina,1 run,flows forward to push a length ball to sweeper cover"}, {"ball": 8.1, "isHighlight": false, "text": "Chahal to Raina, $$FOUR$$ ,comes out first ball of the over and lofts over midwicket"}, {"ball": 8.2, "isHighlight": false, "text": "Chahal to Raina,no run"}, {"ball": 8.3, "isHighlight": false, "text": "Chahal to Raina,2 runs,makes room and guides it superbly to the right of the sweeper, who has to dive to stop it"}, {"ball": 8.4, "isHighlight": false, "text": "Chahal to Raina,1 run,opens the face and eases it through extra cover against the turn"}, {"ball": 8.5, "isHighlight": false, "text": "Chahal to du Plessis,no run,close call, Faf comes forward to a tossed up ball and pushes to cover, he is a long way down before he turns back, has to dive in, which is what saves him"}, {"ball": 8.6, "isHighlight": false, "text": "Chahal to du Plessis,1 run,walks down the track, and turns a full one on off through midwicket"}, {"ball": 9.1, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,no run,goes back in the crease to a tossed up ball and runs it to point"}, {"ball": 9.2, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,full into the pads, worked behind square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Yuvraj Singh to Raina, $$OUT$$ ,Yuvraj strikes, Raina skips out to a flighted ball slanted across him, misses it, and the keeper does the rest"}, {"ball": 9.3, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$st$$ $$†Takawale$$ $$b$$ $$Yuvraj$$ $$Singh$$ $$18$$ $$(22m$$ $$18b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 9.3, "isHighlight": false, "text": "Dhoni comes in"}, {"ball": 9.4, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,no run,comes forward to push to the off side"}, {"ball": 9.5, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,goes deep in the crease and turns a length ball in front of square leg"}, {"ball": 9.6, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,walks out and picks up a single through midwicket as Yuvraj slants it in"}, {"ball": 10.1, "isHighlight": false, "text": "Chahal to du Plessis,no run,appeal for a catch as Faf jumps out, the ball pops up and keeper comes around to take it, replays show it came off the glove on to the pad"}, {"ball": 10.2, "isHighlight": false, "text": "Chahal to du Plessis,no run"}, {"ball": 10.3, "isHighlight": false, "text": "Chahal to du Plessis,1 run,googly, he goes back and punches it past the bowler to long off"}, {"ball": 10.4, "isHighlight": false, "text": "Chahal to Dhoni,no run,presses forward to a defend a full legbreak"}, {"ball": 10.5, "isHighlight": false, "text": "Chahal to Dhoni,2 runs,Dhoni walks out, and nudges a full delivery on the leg side for a couple"}, {"ball": 10.6, "isHighlight": false, "text": "Chahal to Dhoni,no run,cuts an 87 kph legbreak to point"}, {"ball": 11.1, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,Yuvraj posing more problems, Faf leaves the crease, Yuvraj finds some turn, and a thick outside edge goes to point"}, {"ball": 11.2, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,takes a couple of steps out and turns it through midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,no run,makes room to a tossed up ball and tries to drive through the off side, but misses it, that was not far from off stump"}, {"ball": 11.4, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,swats a flat length ball to deep square leg"}, {"ball": 11.5, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,deep midwicket runs in and keeps them to one as Dhoni works a length ball"}, {"ball": 11.6, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,punched down to long off for a single"}, {"ball": 12.1, "isHighlight": false, "text": "Jakati to du Plessis,1 run,makes room in the crease to a full delivery and pushes it down to long on"}, {"ball": 12.2, "isHighlight": false, "text": "Jakati to Dhoni,no run,cuts straight to cover"}, {"ball": 12.3, "isHighlight": false, "text": "Jakati to Dhoni,1 run"}, {"ball": 12.4, "isHighlight": false, "text": "Jakati to du Plessis,1 run,comes out and hits it hard through extra cover, long off cuts it off, Dhoni seems to be in some trouble, he twisted his left ankle when he turned around after the single"}, {"ball": 12.4, "isHighlight": false, "text": "Time out as Dhoni gets some treatment"}, {"ball": 12.5, "isHighlight": false, "text": "Jakati to Dhoni,1 run,lunges forward, squeezes it to the leg side and limps for a single"}, {"ball": 12.6, "isHighlight": false, "text": "Jakati to du Plessis,no run"}, {"ball": 13.1, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,jumps out, taps it in front of midwicket and charges down for the single, limps as he slows down after passing the non-striker's crease"}, {"ball": 13.2, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,no run,around the blockhole, forced back to the bowler"}, {"ball": 13.3, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,leaves the crease, Yuvraj shortens it, Faf punches it down to long on"}, {"ball": 13.4, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,no run,that stayed a bit low as it was pushed flat and wide outside off, Dhoni is beaten on the cut"}, {"ball": 13.5, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,reaches forward and pushes it down to long off"}, {"ball": 13.6, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,length ball hurrying in with the angle, he makes room to hit it through midwicket"}, {"ball": 14.1, "isHighlight": false, "text": "Chahal to du Plessis,1 run,shortish on the off, pulled away towards deep midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Chahal to Dhoni,1 run,flatter on middle and off, nudged towards point, there's a fumble and Dhoni manages to steal a single"}, {"ball": 14.3, "isHighlight": false, "text": "Chahal to du Plessis,1 run,fullish on leg stump and that's clipped past square leg for a single"}, {"ball": 14.4, "isHighlight": false, "text": "Chahal to Dhoni, $$FOUR$$ ,smart stuff from Dhoni, tossed up on middle and Dhoni leaned forward to paddle that wide of short fine leg for a much-needed boundary"}, {"ball": 14.5, "isHighlight": false, "text": "Chahal to Dhoni,no run,tossed up on the off, reaches forward and pushes it towards extra cover"}, {"ball": 14.6, "isHighlight": false, "text": "Chahal to Dhoni,1 run,flighted on the off, driven through to long-off for a single"}, {"ball": 15.1, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,4 byes, $$missed$$ $$stumping$$ , Yuvraj cannot believe it, Dhoni jumped out and missed a heave to a full delivery just outside off, the ball stayed a tad low and went through the keeper's legs"}, {"ball": 15.2, "isHighlight": false, "text": "Yuvraj Singh to Dhoni, $$SIX$$ ,Dhoni sticks to his guns, he charges out, and pummels it way over the long on boundary"}, {"ball": 15.3, "isHighlight": false, "text": "Yuvraj Singh to Dhoni, $$SIX$$ ,Dhoni does it again, that missed chance is history, he leaves the crease again, reaches the pitch and sends it 95 metres over the straight boundary"}, {"ball": 15.4, "isHighlight": false, "text": "Yuvraj Singh to Dhoni,1 run,stays back this time to a flat one darted in and pulls to long on"}, {"ball": 15.5, "isHighlight": false, "text": "Yuvraj Singh to du Plessis,1 run,Faf walks out, gets too close to the pitch, hits it into the pitch and it bounces just over Yuvraj"}, {"ball": 15.6, "isHighlight": false, "text": "Yuvraj Singh to Dhoni, $$FOUR$$ ,Yuvraj will not pitch it up to Dhoni now, Dhoni knows that, it arrives short and angling into him, he pulls, and deep square leg's dive is futile"}, {"ball": 15.6, "isHighlight": false, "text": "The asking rate had started to touch nine, but Dhoni has finished the game in that one over"}, {"ball": 15.6, "isHighlight": false, "text": "Starc round the wicket"}, {"ball": 16.1, "isHighlight": false, "text": "Starc to du Plessis,1 run,drives a pitched up ball to extra cover for a quick single"}, {"ball": 16.1, "isHighlight": false, "text": "Amanamrit: \"Dear Dhoni!! you are not supposed to finish any game before last over!!!\""}, {"ball": 16.2, "isHighlight": false, "text": "Starc to Dhoni, $$FOUR$$ ,phew, Dhoni is killing it now, long off is not too far as Dhoni drills a length ball to his left, but it is hit so hard he has no chance"}, {"ball": 16.3, "isHighlight": false, "text": "Starc to Dhoni,1 run,casually swats a drive, extra cover cannot stop it cleanly, and another single is taken"}, {"ball": 16.4, "isHighlight": false, "text": "Starc to du Plessis,2 runs,yorker on the stumps, but Faf has done well to jab it in front of square, and they have sprinted back for two as well"}, {"ball": 16.5, "isHighlight": false, "text": "Starc to du Plessis,1 run,length ball turned from off stump to long on"}, {"ball": 16.6, "isHighlight": false, "text": "Starc to Dhoni,1 run,a full toss pushed through the off side, extra cover dives to his right to stop it"}, {"ball": 16.6, "isHighlight": false, "text": "Munna: \"twisted ankle has waken up Dhoni...he is in a rush\""}, {"ball": 17.1, "isHighlight": false, "text": "Jakati to Dhoni, $$FOUR$$ ,tossed up on the pad, Dhoni comes out and sweeps it hard past short fine leg"}, {"ball": 17.2, "isHighlight": false, "text": "Jakati to Dhoni, $$SIX$$ ,Dhoni moves to the leg side as he comes out, Jakato drags it short, Dhoni stops and whacks it over long on"}, {"ball": 17.3, "isHighlight": false, "text": "Jakati to Dhoni,1 run,leaves the crease and pushes a flat delivery through covers"}, {"ball": 17.4, "isHighlight": false, "text": "Jakati to du Plessis, $$SIX$$ ,Faf gets to fifty and ends the game with the last skip down the pitch of the evening, and lofts cleanly over long off"}, {"ball": 17.4, "isHighlight": false, "text": "That is all from this game. Follow KKR v Sunrisers  $$here$$ . Good bye"}, {"ball": 17.4, "isHighlight": false, "text": "MS Dhoni is the Man of the Match. Dhoni: \"It (the ankle) is pretty alright as of now. During the morning, it will be properly addressed as to how it is. Still I was running properly, it was a bit difficult. Bowling was one area where we were not doing well, especially on flat wickets. This is a ground which suits our bowling a bit more.\""}, {"ball": 17.4, "isHighlight": false, "text": "Virat Kohli: \"Another disappointing game for us. Could have executed better with the ball. Was not a wicket where such a score was easily chaseable. We started off pretty nicely, we lost momentum midway through the tournament, it is very hard to regain it. Those close losses are the ones that cost us in the end. They still hurt. We have a very strong side and we have not clicked.\""}, {"ball": 17.4, "isHighlight": false, "text": "Dhoni collects a stump for his efforts. Comprehensive win for CSK, although they slowed down after that frenetic start of 57 in just over four overs. CSK end their league games with a win after three losses. They have also opened up a gap of 0.12 between their NRR and KKR's"}, {"ball": 17.4, "isHighlight": false, "text": "Ramprashad: \"CSK's fan mood swing: First couple of overs - CSK can win in 16 overs ; when Smith got out - may be in 18 overs; when Raina got out - may be in 19 overs; around 14th over: a win will be great; Finally in 18 overs!\""}], "name": "Royal Challengers Bangalore v Chennai Super Kings", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734035.html?innings=2;view=commentary", "match_num": 53}