{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  Big turnout at Eden Gardens, the stands awash with purple."}, {"ball": 0, "isHighlight": false, "text": "Genie: \"Hello guys I am on leave today. So leave it to the teams to do their business\""}, {"ball": 0, "isHighlight": false, "text": "Here come the umpires, a roar from the crowd as the KKR side walk out and form a Huddle. Dhawan and Warner making their way to the middle as well."}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm>$$ $$Aakarsh:$$ $$\"@krithikou......$$ $$Remember$$ $$I$$ $$have$$ $$two$$ $$more$$ $$wishes$$ $$if$$ $$a$$ $$genie$$ $$does$$ $$come$$ $$by??\"$$"}, {"ball": 0, "isHighlight": false, "text": "Aneesh: \"Thought if Finch will ever be dropped it will be for Taylor. Weak middle order weaker now. Strange.\""}, {"ball": 0, "isHighlight": false, "text": "We make wishes come true. TB: \"I would ask my comment to be published in Cricinfo if a genie appears. \""}, {"ball": 0, "isHighlight": false, "text": "Niladri: \"I saw certain Myburgh and Peter Borren do it in T20WC... will it be certain Ten Doeschate's turn today??? #DutchConnection\""}, {"ball": 0, "isHighlight": false, "text": "Lots of people mailing in with this. Nataraj: \"Weak middle order in SRH. Collapse on cards with the help of narine. \""}, {"ball": 0, "isHighlight": false, "text": "Abbas Khambati: \"This is great stuff from SRH, big game, weak batting order and play with 6 bowlers who cant even bat for 10 balls ! \""}, {"ball": 0, "isHighlight": false, "text": "Mounika: \"I hate Math! So I just want RR to win tomorrow!\""}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  Senthil: \"Unless KKR bundles SRH below 100, this is going to be really tough for KKR to qualify for Qualifier, but anyway they are sure that they will play eliminator and they may just want to win and keep the momentum going, rather then push for a big and lose their last league match and lose the winning momentum. \""}, {"ball": 0, "isHighlight": false, "text": "Aakasrh wants many things to fall in place: \"SRH score 200+ KKR try to reach it get bundled out for around 100! MI tomorrow win tomorrow in a super over! My first wish if a genie appears!\""}, {"ball": 0, "isHighlight": false, "text": "Krithikou: \"@Aakasrh, that's sub-optimal. You might just as well make a wish that SRH take the title!\""}, {"ball": 0, "isHighlight": false, "text": "Anwy: \"Can anyone tell me what is Zimbabwe's Brendan Taylor role? Why was he bought at the auction if he is not getting a single game?\""}, {"ball": 0, "isHighlight": false, "text": "Anurag: \"Gambhir might say that he is not thinking too much about 2nd position but deep within his heart he knows that they would want to do that especially as they have to win one game less to win the title.\""}, {"ball": 0, "isHighlight": false, "text": "Ted: \"Couldn't care less whether we get into the top 2 or not. We've won 6 in a row, let's make it 7, so that we can then go on and make it 10.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  \"KOLKATAAAAAAAA,\" screams Danny Morrison."}, {"ball": 0, "isHighlight": false, "text": "Gautam Gambhir says he isn't thinking too much of the second spot, and doesn't want to put too much pressure on his side. He says midway through the season, if he was asked whether he would take this position, he would."}, {"ball": 0, "isHighlight": false, "text": "Raunak: \"KKR have nothing to lose. If they don't get a big win, they play the eliminator anyway. Looking forward to some aggressive cricket from them.\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$  Kolkata win toss -  $$KKR$$ $$will$$ $$bowl$$ . Gambhir says they have been chasing well, so there's no need to change things. They stick with the same XI."}, {"ball": 0, "isHighlight": false, "text": "Sunrisers have made two changes: Aaron Finch and Irfan Pathan are out, Jason Holder and Anirudh Srikanth are in."}, {"ball": 0, "isHighlight": false, "text": "$$7.15pm$$  Greetings everyone. KKR fans waiting to know the equation for their team to reach in second place, here it is:  $$If$$ $$KKR$$ $$bat$$ $$first,$$ $$they$$ $$need$$ $$to$$ $$win$$ $$by$$ $$roughly$$ $$39$$ $$runs.$$ $$If$$ $$KKR$$ $$bat$$ $$second,$$ $$they$$ $$need$$ $$to$$ $$complete$$ $$the$$ $$chase$$ $$in$$ $$around$$ $$92$$ $$balls.$$"}, {"ball": 0, "isHighlight": false, "text": "Think it is possible? Or are CSK certain of second spot?"}, {"ball": 0, "isHighlight": false, "text": "Here's our preview to this game:  $$Remote$$ $$chance$$ $$of$$ $$progress$$ $$for$$ $$Sunrisers$$"}, {"ball": 0, "isHighlight": false, "text": "Think you know your cricket? Prove it at  $$CricIQ$$ ."}, {"ball": 0, "isHighlight": false, "text": "Anand Gautam: \"What about the 4th place equation? SRH is pretty much out of the competition. They need to win by around 80 runs to stay alive in the competition. Mumbai needs to beat RR by around 45 runs or chase down in around 14 overs to qualify. If that happens and SRH win by 80 runs, then only SRH qualify. So it is pretty much Mumbai or RR.\""}, {"ball": 0, "isHighlight": false, "text": "Talha thinks KKR can do it: \"It is difficult to win by such margin unless your opponent collapses...and SRH does that every other match..so possible for KKR to go second :-P\""}, {"ball": 0, "isHighlight": false, "text": "Deep doesn't think KKR can: \"It was CSK who gave KKR the chance of getting to the 2nd spot by losing 3 back to back games, but now with this thumping win over RCB they seem to have snatched that opportunity away from them..\""}, {"ball": 0.1, "isHighlight": false, "text": "Morkel to Warner, $$FOUR$$ ,Morne Morkel steams in, quick and down the leg side, helped off the thigh pad, it races down to fine leg where a sliding Narine lets it through hsi legs to the rope"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Warner,1 wide,wide down the leg side"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Warner, $$OUT$$ ,big blow here, Morne Morkel has knocked over the dangerous Warner, back of a length ball hits the top of off, Warner leaves a huge gap between bat and pad as he looks to drive, off stump finds itself yards behind its usual position"}, {"ball": 0.2, "isHighlight": false, "text": "$$DA$$ $$Warner$$ $$b$$ $$Morkel$$ $$4$$ $$(2m$$ $$2b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 0.3, "isHighlight": false, "text": "Morkel to Ojha,no run,short of length and outside off, left alone"}, {"ball": 0.4, "isHighlight": false, "text": "Morkel to Ojha,no run,quick shortish ball outside off, another leave"}, {"ball": 0.4, "isHighlight": false, "text": "Two slips in place"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Ojha,no run,solidly defended off the front foot to the off side"}, {"ball": 0.6, "isHighlight": false, "text": "Morkel to Ojha, $$FOUR$$ ,length ball on the pads, clipped elegantly off the pads to the midwicket boundary for four"}, {"ball": 0.6, "isHighlight": false, "text": "Lots of readers think this game is over."}, {"ball": 0.6, "isHighlight": false, "text": "Arpit: \"No Finch and Warner gone. Match over for SRH !! team selection has been baffling sometimes this season\""}, {"ball": 0.6, "isHighlight": false, "text": "Senthil: \"I think that's the game, set and Match for KKR. What a big strike that is from Morne\""}, {"ball": 0.6, "isHighlight": false, "text": "Zaheer: \"Warning: There goes the SRH's dream of playoffs.\""}, {"ball": 0.6, "isHighlight": false, "text": "Mounika: \"Sunrisers have become sunsetters for sure now!\""}, {"ball": 0.6, "isHighlight": false, "text": "Vinay Kumar shares the new ball"}, {"ball": 1.1, "isHighlight": false, "text": "Vinay Kumar to Dhawan,no run,short of length and outside off, slapped towards backward point by Dhawan"}, {"ball": 1.2, "isHighlight": false, "text": "Vinay Kumar to Dhawan,no run,huge appeal for caught behind, short of length curving in, past the inside edge and think that was off the thigh pad through to the keeper, Vinay getting the ball to hag around"}, {"ball": 1.3, "isHighlight": false, "text": "Vinay Kumar to Dhawan,1 run,Dhawan goes for a big shot and gets a thick inside edge towards fine leg"}, {"ball": 1.4, "isHighlight": false, "text": "Vinay Kumar to Ojha,no run,beauty from Vinay Kumar, back of length ball curls away from Ojha, who shows little footwork as he pecks at it, beaten"}, {"ball": 1.5, "isHighlight": false, "text": "Vinay Kumar to Ojha,4 leg byes,looking to start the movement from middle and leg, it doesn't curve back and ends up on the pads, four leg byes to fine leg"}, {"ball": 1.6, "isHighlight": false, "text": "Vinay Kumar to Ojha,no run,length ball on off stump, defended towards cover off the front foot"}, {"ball": 2.1, "isHighlight": false, "text": "Morkel to Dhawan,no run,Morkel gets that to rise sharply and zip away past the outside edge, Dhawan doesn't move his feet much as he wafts at it"}, {"ball": 2.2, "isHighlight": false, "text": "Morkel to Dhawan,no run,on off stump, 145.8kph, pushed off the front foot towards cover"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Dhawan, $$FOUR$$ ,the man at cover point was flying to his right hoping to get a hand on that, but Dhawan gets it wide of Manish Pandey to get a boundary to backward point"}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Dhawan,no run,144.6kph, typical Morkel length, Dhawan confidently gets on the front foot and looks to drive on the up, beaten"}, {"ball": 2.5, "isHighlight": false, "text": "Morkel to Dhawan,1 run,short of length and on off stump, dropped in front of point for a quick single"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Ojha,5 wides,it all goes wrong for Morkel, after an accurate over he sprays this miles (cricketing metric) down the leg side, no chance for Uthappa"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Ojha,no run,short and outside off, Ojha looks to chop that past point but misses"}, {"ball": 2.6, "isHighlight": false, "text": "Trumpet: \"Having spent much of the beginning of the year watching Dave Warner pummel the South African bowlers, it's nice to see big Morne finally get one over the Aussie. Remember AB's drop catch in the Test series off Morne's bowling? I think Warner's average across all formats is superb against Morkel, though I can't remember the exact figures (perhaps you guys can fill us in on those numbers).\""}, {"ball": 2.6, "isHighlight": false, "text": "zafarjaveds: \"Poor KKR, they have only one ORANGE CAP holder. SRH has got 11 :P\""}, {"ball": 3.1, "isHighlight": false, "text": "Vinay Kumar to Dhawan, $$FOUR$$ ,Dhawan steps down the track and flays that through cover, shortish and wide outside off, easy put away for Dhawan"}, {"ball": 3.2, "isHighlight": false, "text": "Vinay Kumar to Dhawan,no run,defended towards cover point"}, {"ball": 3.3, "isHighlight": false, "text": "Vinay Kumar to Dhawan,no run,short of length jagging away, Dhawan gets forward and weakly pokes at it, misses"}, {"ball": 3.4, "isHighlight": false, "text": "Vinay Kumar to Dhawan, $$FOUR$$ ,shot, width on offer for Dhawan, he capitalises, thrashes it behind backward point"}, {"ball": 3.5, "isHighlight": false, "text": "Vinay Kumar to Dhawan, $$FOUR$$ ,once more, behind backward point for four, dropping a bit too short here Vinay, easy for Dhawan to deal with those"}, {"ball": 3.6, "isHighlight": false, "text": "Vinay Kumar to Dhawan,1 run,once more, shortish and wide outside off, no boundary this time though as third man is wide, Dhawan guides it for a single"}, {"ball": 3.6, "isHighlight": false, "text": "Umair: \"Anirudh Srikanth has not played a First class match since 2012; and his previous t20 match was in April 2013. How can he be selected for a match where a team has to go all out to win by a big margin?\""}, {"ball": 3.6, "isHighlight": false, "text": "Siddharth Bora: \"Anyone knows why Piyush Chawla isn't playing? I think he would have been far more economical than Vinay\" Gambhir said Chawla was unlucky to miss out."}, {"ball": 4.1, "isHighlight": false, "text": "Morkel to Dhawan,no run,driven towards mid-off by Dhawan as Morkel begins his third over"}, {"ball": 4.2, "isHighlight": false, "text": "Morkel to Dhawan,no run,a ripper from Morkel, 142.8kph, short of length ball moves away just a touch away, Dhawan is beaten as he looks to defend"}, {"ball": 4.3, "isHighlight": false, "text": "Morkel to Dhawan,no run,short of length on the body, Dhawan is cramped as he pulls that to square leg"}, {"ball": 4.3, "isHighlight": false, "text": "Harish Varanasi: \"One reason why Vinay Kumar has not been successful at the international level, 4 deliveries in that over outside the off stump, and bonus, a bundle of runs in just an over !\""}, {"ball": 4.4, "isHighlight": false, "text": "Morkel to Dhawan,no run,Dhawan is opened up by that one, 146.1 kph, again the Morkel length, called a Morkel motorway by Damien Fleming, Dhawan looks to defend but he's playing down the wrong line as the ball has curled away"}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Dhawan,4 leg byes,more bad luck for Morkel as he beats Dhawan once more, but the ball flies off the pads past the keeper for four leg byes"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Dhawan,no run,outside off, Dhawan chases it and misses, top over that from Morkel"}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Ojha, $$FOUR$$ ,Narine is on, and he's welcomed by an inside-out drive for four through extra cover, best bowler in the IPL? 'I dont' care,' Ojha says"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Ojha,no run,defended towards backward point this time"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Ojha, $$FOUR$$ ,another drive for four, though this time it was streaky, a thick outside edge as the ball flies past backward point for four though Ojha was looking to send it past cover"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Ojha,no run,bounce for Narine as he drops it a touch short, outside off left alone"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Ojha,no run,this one zips away from Ojha, outside edge and leaves Ojha flustered, this is more like the Narine IPL fans have come to expect"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Ojha,no run,defends the final ball of the over"}, {"ball": 5.6, "isHighlight": false, "text": "Ravi: \"Last time Mr Mysterious spinner was hit for a 4 off his first ball of the game, he ended up taking 4 wickets (against RCB)..\""}, {"ball": 5.6, "isHighlight": false, "text": "Senthil: \"Decent powerplay for SRH afterall they have lost Warner in the first over. Can they build on it?\""}, {"ball": 6.1, "isHighlight": false, "text": "UT Yadav to Dhawan, $$FOUR$$ ,not entirely in control there, a healthy outside edge sends the ball down to the third-man boundary"}, {"ball": 6.2, "isHighlight": false, "text": "UT Yadav to Dhawan,1 leg bye,towards backward square leg for a leg bye"}, {"ball": 6.3, "isHighlight": false, "text": "UT Yadav to Ojha, $$FOUR$$ ,length ball sliding down the leg side, helped along for four more to fine leg, poor ball that, gifting runs"}, {"ball": 6.4, "isHighlight": false, "text": "UT Yadav to Ojha, $$FOUR$$ ,gets forward and square drives this for four more, more solid contact this time, gets it past a diving backward point"}, {"ball": 6.5, "isHighlight": false, "text": "UT Yadav to Ojha,no run,short of length and moving away outside off, 139kph from Umesh, left alone by Ojha"}, {"ball": 6.6, "isHighlight": false, "text": "UT Yadav to Ojha,no run,this time Ojha chases after the ball outside off, 136.8kph, can't get bat on ball there"}, {"ball": 6.6, "isHighlight": false, "text": "Time for the  $$Timeout$$ . There have been several edged boundaries, several gifts from KKR's bowlers, which combined to leave SRH pretty well-placed here despite that early loss of Warner. Morkel was outstanding though, and once more he doesn't have the wickets to show for his testing bowling."}, {"ball": 6.6, "isHighlight": false, "text": "Krishna: \"Some one please remind Ojha, there is some thing called 1s and 2s. I don't see it from him after 18 balls.\" Five fours and nothing else. Only three singles all innings from SRH so far."}, {"ball": 7.1, "isHighlight": false, "text": "ten Doeschate to Dhawan,1 run,there's a rare single, chopped towards deep point by Dhawan"}, {"ball": 7.2, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,length ball on off stump, defended towards mid-on"}, {"ball": 7.3, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,a yorker on middle stump, swings a bit as well, pushed towards mid-on"}, {"ball": 7.4, "isHighlight": false, "text": "ten Doeschate to Ojha,no run,short of length ball is pushed back towards RTD, who fields and shapes up to fire the ball back at the stumps, the Eden crowd loves it"}, {"ball": 7.5, "isHighlight": false, "text": "ten Doeschate to Ojha, $$SIX$$ ,Ojha doesn't believe in singles and twos, after three dot balls he makes up with a huge six over midwicket, that ball went a long way up, but clears the rope by a handful of yards"}, {"ball": 7.6, "isHighlight": false, "text": "ten Doeschate to Ojha, $$OUT$$ ,Ojha sends this one high up in the air as well, this wasn't off the middle though as he looked to pick the ball off the pads, top edge and the ball is swirling around, RTD gets under it, has plenty of time to visualise how he might make a mess of it, and then pouches it, Ojha punches his helmet as he walks off"}, {"ball": 7.6, "isHighlight": false, "text": "$$NV$$ $$Ojha$$ $$c$$ $$&$$ $$b$$ $$ten$$ $$Doeschate$$ $$26$$ $$(35m$$ $$23b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$113.04$$"}, {"ball": 8.1, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,no run,moving away outside off, beaten"}, {"ball": 8.2, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,no run,a single to get off the mark"}, {"ball": 8.3, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,2 runs,guided towards deep backward point this time"}, {"ball": 8.4, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,no run,goes for the Hollywood drive, nowhere near the pitch of the ball, bat gets nowhere near the ball as it zips through to the keeper"}, {"ball": 8.4, "isHighlight": false, "text": "Trevor: \"Lip reading GG in slo mo is like following normal speed speech!\""}, {"ball": 8.5, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,no run,slower one, well I thought it was a slower one, speed gun says 137kph, on middle stump, defended down the pitch"}, {"ball": 8.6, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,1 wide,sprays that down the leg side"}, {"ball": 8.6, "isHighlight": false, "text": "UT Yadav to Venugopal Rao,1 run,defended towards point for a single, a rare economical over from Umesh"}, {"ball": 8.6, "isHighlight": false, "text": "AP: \"Bad move by Sunrisers to send Rao. They need at least 12 an over to have a chance to qualify. They probably went to the Rajasthan Royals school of bad decisions.\""}, {"ball": 9.1, "isHighlight": false, "text": "Vinay Kumar to Venugopal Rao,no run,short of length ball coming in towards off, defended solidly"}, {"ball": 9.2, "isHighlight": false, "text": "Vinay Kumar to Venugopal Rao,no run,Venugopal looks to hammer that towards midwicket, can't get bat on ball and is struck on the thigh pad, why is he not looking for a single, give the strike to Dhawan"}, {"ball": 9.2, "isHighlight": false, "text": "Danish: \"Take away Naman Ojha's boundries and his final score would mean he was out for a 17 ball duck. SHould've attempted to add atleast 10 singles in there"}, {"ball": 9.3, "isHighlight": false, "text": "Vinay Kumar to Venugopal Rao,no run,there's the Vinay outswinger, Venugopal is drawn towards it but is beaten by the movement"}, {"ball": 9.4, "isHighlight": false, "text": "Vinay Kumar to Venugopal Rao, $$FOUR$$ ,three dot balls and a boundary, that could be the title if they make a movie of this innings, short and wide from Vinay, thumped beyond backward point for four"}, {"ball": 9.5, "isHighlight": false, "text": "Vinay Kumar to Venugopal Rao,1 run,stop the press, a single! full ball on the pads is whipped towards deep square leg"}, {"ball": 9.6, "isHighlight": false, "text": "Vinay Kumar to Dhawan,no run,blocked down the track to end the over, short of length ball on middle stump"}, {"ball": 9.6, "isHighlight": false, "text": "Here's Shakib"}, {"ball": 10.1, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,no run,does he have a wicket first up, he flights this one, Venugopal can't get bat on ball, Uthappa takes off the bails, is Venugopal's back leg down in time, it's tight, think he is just in"}, {"ball": 10.2, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,2 runs,sweeps from way outside off stump, a top edge and the ball runs away towards deep backward square leg where Vinay Kumar pulls off a sliding stop"}, {"ball": 10.3, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,1 leg bye,goes for the sweep once more, this time there is no contact, ball strikes the shoulder after Venugopal has gone through with the shot"}, {"ball": 10.4, "isHighlight": false, "text": "Shakib Al Hasan to Dhawan,1 run,pushed towards mid-off for a single"}, {"ball": 10.5, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,1 run,length ball sliding on, defended towards square leg"}, {"ball": 10.6, "isHighlight": false, "text": "Shakib Al Hasan to Dhawan,no run,this one is defended back towards the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "Narine here."}, {"ball": 11.1, "isHighlight": false, "text": "Narine to Venugopal Rao,1 run,length ball is worked towards midwicket for a single, Venugopal turns over the strike to Dhawan"}, {"ball": 11.2, "isHighlight": false, "text": "Narine to Dhawan,2 runs,spins away outside off, played off the back foot towards sweeper cover"}, {"ball": 11.3, "isHighlight": false, "text": "Narine to Dhawan,1 run,turns away way outside off, chopped towards sweeper cover for one more"}, {"ball": 11.4, "isHighlight": false, "text": "Narine to Venugopal Rao,1 leg bye,that is a beauty from Narine, a legbreak at 100kph, much too good for Venugopal Rao, who grops at it but is beaten, off the thigh pad"}, {"ball": 11.5, "isHighlight": false, "text": "Narine to Dhawan,1 run,towards sweeper cover for a single"}, {"ball": 11.6, "isHighlight": false, "text": "Narine to Venugopal Rao,no run,spinning away, defended towards cover"}, {"ball": 11.6, "isHighlight": false, "text": "Now waiting for people to complain about too many singles, and no boundaries."}, {"ball": 11.6, "isHighlight": false, "text": "Nandakiran N: \"Ojha has lost his wickets to dot balls today. Pressure because of it! Isn't it fundamental to keep the scoreboard ticking and take calculated risks! In my opinion, it is the number of dotballs that should have persuaded Ojha to go after the bowler even after hitting a six in the previous delivery!\""}, {"ball": 12.1, "isHighlight": false, "text": "Shakib Al Hasan to Dhawan,no run,full ball on off stump, driven towards extra cover"}, {"ball": 12.2, "isHighlight": false, "text": "Shakib Al Hasan to Dhawan, $$OUT$$ ,outstanding bit of fielding there from Manish Pandey, results in the big wicket of Dhawan, the ball was hammered by Dhawan towards extra cover, Pandey dived to his right to stop that one, holds on to it on the second chance, and fires in an accurate throw to the keeper even before he gets up, Dhawan is caught short"}, {"ball": 12.2, "isHighlight": false, "text": "$$S$$ $$Dhawan$$ $$run$$ $$out$$ $$29$$ $$(59m$$ $$31b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$93.54$$"}, {"ball": 12.3, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,no run,Sammy is in much earlier than he would have wanted, defended towards extra cover"}, {"ball": 12.4, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,no run,spinning away outside off, flighted delivery goes past the outside edge"}, {"ball": 12.5, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,no run,solidly defended off the front foot"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,no run,hit to extra cover to end a superb over for KKR"}, {"ball": 13.1, "isHighlight": false, "text": "Morkel to Venugopal Rao,no run,Morkel is in for his final over, 140.5kph, shortish and outside off, Venugopal wants to thrash that one, doesn't connect"}, {"ball": 13.2, "isHighlight": false, "text": "Morkel to Venugopal Rao, $$FOUR$$ ,again Venugopal wants to thrash the ball away, this time he connects, over backward point for four, that was short and wide from Morkel"}, {"ball": 13.3, "isHighlight": false, "text": "Morkel to Venugopal Rao, $$FOUR$$ , $$dropped$$ , Venugopal Rao has decided to swing at everything, he wants to smash that over the leg side, a top edge sends it flying towards third man where Sunil Narine has to leap to get that one, just gets a finger on it when he should have latched on, one-bounce four"}, {"ball": 13.4, "isHighlight": false, "text": "Morkel to Venugopal Rao,no run,short and quick outside off, Venugopal swings his bat at it and misses"}, {"ball": 13.5, "isHighlight": false, "text": "Morkel to Venugopal Rao, $$FOUR$$ ,this is comical cricket, Venugopal swings yet again, one more outside edge, flies away to the third-man boundary"}, {"ball": 13.6, "isHighlight": false, "text": "Morkel to Venugopal Rao,1 run,inside-edge onto the body for a single"}, {"ball": 14.1, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,1 run,swept towards deep backward square leg for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Shakib Al Hasan to Sammy, $$SIX$$ , $$dropped$$ , right through the hands of Yusuf Pathan at long-on, who has dropped catches previously when he goes with the reverse-cup technique, once again he puts it down, and is struck on the cheek before the ball goes away for six, it was a poor ball to start, Sammy thought he was out, results in a six"}, {"ball": 14.3, "isHighlight": false, "text": "Shakib Al Hasan to Sammy, $$SIX$$ ,no doubt about this one, right off the middle of the bat, around length, way over long-on for six"}, {"ball": 14.4, "isHighlight": false, "text": "Shakib Al Hasan to Sammy, $$FOUR$$ ,serious power from Sammy, with the ball not really coming on he still manages to hammer the ball to wide long-on for four"}, {"ball": 14.5, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,1 run,a single only, towards sweeper cover"}, {"ball": 14.6, "isHighlight": false, "text": "Shakib Al Hasan to Venugopal Rao,1 run,  $$OUT$$ ,another run-out! Venugopal Rao's kamikaze innings is over, the ball is swept away towards deep midwicket, where Vinay Kumar seems to have over run the ball, adjusts well to stop the ball from reaching the rope, Pandey is there to help out, he fires in a superb throw, Venugopal is nowhere near making his ground, he had ambled the first, and then stumbled after stepping on Shakib's leg"}, {"ball": 14.6, "isHighlight": false, "text": "$$Y$$ $$Venugopal$$ $$Rao$$ $$run$$ $$out$$ $$27$$ $$(32m$$ $$26b$$ $$4x4$$ $$0x6)$$ $$SR:$$ $$103.84$$"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Sammy,no run,carefully defended by Sammy"}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Sammy,1 run,eased past point for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Anirudha,no run,defended to the off side this time, again Narine keeping it tight"}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Anirudha,1 run,helped towards backward square leg for a single"}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Sammy,1 leg bye,spinning in towards the pad, beats the bat but off the pads for a leg bye"}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Anirudha,1 run,length ball on the pads, pushed towards mid-on, Narine has to chase, Aniruddha wants two, Narine is quick to the ball though and they settle for one"}, {"ball": 15.6, "isHighlight": false, "text": "$$Timeout$$  time."}, {"ball": 15.6, "isHighlight": false, "text": "Trevor: \"Cricinfo Syndrome: The anxiety induced by that slightly longer interval between ball commentaries which presages the big bold 'OUT'. There is no cure.\""}, {"ball": 15.6, "isHighlight": false, "text": "Senthil: \"First game of the year and he is up against Narine, life is really difficult for Anirudha\""}, {"ball": 16.1, "isHighlight": false, "text": "Shakib Al Hasan to Anirudha,1 run,length ball, tossed up, worked towards midwicket for a single"}, {"ball": 16.2, "isHighlight": false, "text": "Shakib Al Hasan to Sammy,1 run,brutal hit from Sammy towards cow corner, just fetches him a single as the placement isn't great"}, {"ball": 16.3, "isHighlight": false, "text": "Shakib Al Hasan to Anirudha, $$OUT$$ ,ripper from Shakib! drifts in and is a touch short, much too short for Anirudhha who was skipping down the track, the ball then turns away and Aniruddha can't get bat on it, stumped by a long way"}, {"ball": 16.3, "isHighlight": false, "text": "$$S$$ $$Anirudha$$ $$st$$ $$†Uthappa$$ $$b$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$3$$ $$(6m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 16.4, "isHighlight": false, "text": "Shakib Al Hasan to Holder,no run,pushed  towards the off side"}, {"ball": 16.5, "isHighlight": false, "text": "Shakib Al Hasan to Holder,no run,huge appeal for lbw, looked dead plumb, hit in front of middle on the back thigh, no trouble with the height, the umpire has to have thought there was an edge there, else Holder was a goner, Shakib looks at the skies and screams in frustration"}, {"ball": 16.6, "isHighlight": false, "text": "Shakib Al Hasan to Holder,no run,pushed towards the off to end another tidy over"}, {"ball": 17.1, "isHighlight": false, "text": "Narine to Sammy,1 run"}, {"ball": 17.2, "isHighlight": false, "text": "Narine to Holder,1 run,eased towards long-on for a single"}, {"ball": 17.3, "isHighlight": false, "text": "Narine to Sammy,1 run,flatbatted off the back foot towards long-off"}, {"ball": 17.4, "isHighlight": false, "text": "Narine to Holder,no run,another huge lbw appeal, another one where KKR thought they had a wicket, was that sliding down, I don't think it was, the umpire thought it was, otherwise that was another plumb one"}, {"ball": 17.5, "isHighlight": false, "text": "Narine to Holder,no run,is there another run-out here, pushed towards cover, straight to Shakib, who fires the ball to the keeper, Holder has to dive back to beat the throw"}, {"ball": 17.6, "isHighlight": false, "text": "Narine to Holder,no run,blocks this fulle delivery"}, {"ball": 17.6, "isHighlight": false, "text": "Ridiculously incident packed cricket.Also, our stats man, Shiva, has found out that Naman Ojha's innings was the second highest score in IPL purely off boundaries. A Jayasuriya 36  $$in$$ $$2008$$  was the highest."}, {"ball": 18.1, "isHighlight": false, "text": "UT Yadav to Sammy,1 leg bye,off the thigh pad towards the leg side"}, {"ball": 18.2, "isHighlight": false, "text": "UT Yadav to Holder, $$SIX$$ ,swings hard and connects, hammers that over long-on for a massive six"}, {"ball": 18.3, "isHighlight": false, "text": "UT Yadav to Holder, $$FOUR$$ ,full toss this time, clubbed to the square leg boundary for four"}, {"ball": 18.4, "isHighlight": false, "text": "UT Yadav to Holder,1 run,another full toss, towards long-on for a single"}, {"ball": 18.5, "isHighlight": false, "text": "UT Yadav to Sammy,1 run,length ball, Sammy was going for the massive swing that he usually does, inside-edge that onto his knee cap on his back leg, I think, Sammy is in serious pain here, he is so much pain that he can barely take the single, hobbling through, nearly gives up midway through"}, {"ball": 18.6, "isHighlight": false, "text": "UT Yadav to Holder, $$FOUR$$ ,a length ball is absolutely hammered by Holder, a diving fielder at long-off can't cut that off as it has too much pace on it"}, {"ball": 18.6, "isHighlight": false, "text": "Vinay to bowl the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Vinay Kumar to Sammy, $$SIX$$ ,whoah! how on earth did that go for six, it is full and very wide, Sammy plonks his front foot forward and reaches out for it, connects and connects well, the ball sails over backward point for six"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to Sammy,1 wide,too far outside off, called a wide"}, {"ball": 19.2, "isHighlight": false, "text": "Is this the tallest pair of batsmen together in the middle?"}, {"ball": 19.2, "isHighlight": false, "text": "Vinay Kumar to Sammy,1 run,a full toss, thick inside-edge onto the pad, Sammy is frustrated at missing out on that one"}, {"ball": 19.3, "isHighlight": false, "text": "Vinay Kumar to Holder, $$OUT$$ ,shortish ball from round the wicket, Holder goes for the big hit, he doesn't connect, Sammy had zipped through for the bye, wasn't he writhing in pain just a few minutes ago? in any case, he has motored through, Holder hasn't responded early enough, Uthappa lobs the ball to the bowler, Holder is run-out and he is furious, absolutely furious"}, {"ball": 19.3, "isHighlight": false, "text": "$$JO$$ $$Holder$$ $$run$$ $$out$$ $$16$$ $$(14m$$ $$12b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 19.4, "isHighlight": false, "text": "Vinay Kumar to Sammy, $$OUT$$ ,and now Sammy is dismissed, goes for the big hit, doesn't middle this length ball and holes out to Shakib at sweeper cover, what an action-packed innings this is!"}, {"ball": 19.4, "isHighlight": false, "text": "$$DJG$$ $$Sammy$$ $$c$$ $$Shakib$$ $$Al$$ $$Hasan$$ $$b$$ $$Vinay$$ $$Kumar$$ $$29$$ $$(35m$$ $$19b$$ $$1x4$$ $$3x6)$$ $$SR:$$ $$152.63$$"}, {"ball": 19.5, "isHighlight": false, "text": "Vinay Kumar to Sharma, $$FOUR$$ ,and even more drama, a shortish ball from Vinay, Karn wants to hammer it through point, gets a top edge, Uthappa leaps and gets a glove on it but the ball zips through for four"}, {"ball": 19.6, "isHighlight": false, "text": "Vinay Kumar to Sharma,1 run,a low full toss is drilled towards long-on for a single to end the over, Sunrisers end on 160"}, {"ball": 19.6, "isHighlight": false, "text": "$$KKR$$ $$need$$ $$to$$ $$win$$ $$in$$ $$15.2$$ $$overs$$  to finish in second place."}, {"ball": 19.6, "isHighlight": false, "text": "It has been drizzling for the last few overs of the innings. Not heavy enough to stop place. Hope there is no more rain, Duckworth Lewis calculations on top of net-run rate calculations = maths overload."}, {"ball": 19.6, "isHighlight": false, "text": "John: \"Paper hats for Sunriser's players putting on the most comical performance of the IPL...\" Even by the standards of Twenty20, that was frenetic, and what's more, all that swinging resulted in a total of only 160."}, {"ball": 19.6, "isHighlight": false, "text": "$$To$$ $$stay$$ $$alive,$$ $$Sunrisers$$ $$need$$ $$to$$ $$restrict$$ $$KKR$$ $$to$$ $$23$$ ."}], "name": "Kolkata Knight Riders v Sunrisers Hyderabad", "innings": "Sunrisers Hyderabad  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734037.html?innings=1;view=commentary", "match_num": 54}