{"commentary": [{"ball": 0, "isHighlight": false, "text": "Gautam Gambhir and the new orange cap holder Robin Uthappa are at the crease. Bhuvneshwar Kumar has the ball in hand. Two slips"}, {"ball": 0, "isHighlight": false, "text": "Bumble: \"Sunriser's swung the bat so hard that the wind gathered cloud and it started to drizzle!\""}, {"ball": 0, "isHighlight": false, "text": "Bharath: \"I wish KKR send Tendo to open and make him go for that 15.2 chase. Being from Netherlands, he should be knowing how to get there like how  $$their$$ $$team$$ $$did$$ .\""}, {"ball": 0.1, "isHighlight": false, "text": "Kumar to Uthappa,1 run,back of a length outside off, dabbed into the covers and he sets off with the shot"}, {"ball": 0.2, "isHighlight": false, "text": "Kumar to Gambhir,no run,there we go! This pitch has been responding to the new ball considerably and Bhuvi gets this one to dart past Gambhir's angled blade."}, {"ball": 0.3, "isHighlight": false, "text": "Kumar to Gambhir,no run,and again! This time it's fuller and Gambhir tentatively pushes at it. But the ball pitches and then jags away off the seam"}, {"ball": 0.4, "isHighlight": false, "text": "Kumar to Gambhir,no run,that's the trifecta! He gets it to pitch where Gambhir is not certain whether to come forward or stay back. Pokes and the movement off the deck beats him again. Those two slips better be warmed up"}, {"ball": 0.5, "isHighlight": false, "text": "Kumar to Gambhir,1 run,a touch shorter and this one doesn't misbehave. Gambhir steers it just behind point with soft hands"}, {"ball": 0.6, "isHighlight": false, "text": "Kumar to Uthappa,no run,presses forward and goes for a punch down the ground, Bhuvi gets this to move away from the right-hander's outside edge. Top over!"}, {"ball": 0.6, "isHighlight": false, "text": "Dale Steyn.. with two slips... and this pitch"}, {"ball": 1.1, "isHighlight": false, "text": "Steyn to Gambhir,no run,shortish and outside off, Gambhir looked to cut over point but can't connect"}, {"ball": 1.2, "isHighlight": false, "text": "Steyn to Gambhir, $$FOUR$$ ,fires a full delivery wide outside off, Gambhir looks for the drill through the covers. Instead he has to settle for a boundary through fine leg"}, {"ball": 1.3, "isHighlight": false, "text": "Steyn to Gambhir,1 run,had no idea where the ball was, but Uthappa was completely aware. This was on a good length but hurried onto him. Gambhir's flick fails and the ball dribbles off the pad. Single pinched as Steyn misses the target with a kick"}, {"ball": 1.4, "isHighlight": false, "text": "Steyn to Uthappa,no run,defended into the off side as he comes forward to meet the good length ball"}, {"ball": 1.5, "isHighlight": false, "text": "Steyn to Uthappa,no run,full on off stump, Uthappa drives to mid-on with a straight bat"}, {"ball": 1.6, "isHighlight": false, "text": "Steyn to Uthappa,no run,nicely forward as he pushes the fuller ball into the covers"}, {"ball": 2.1, "isHighlight": false, "text": "Kumar to Gambhir, $$FOUR$$ ,length ball, Gambhir skips down the track and launches that over extra cover for four"}, {"ball": 2.2, "isHighlight": false, "text": "Kumar to Gambhir,1 run,opens the face as he steers the ball, bounces through to second slip, where it is not cleanly held, allowing a single"}, {"ball": 2.2, "isHighlight": false, "text": "rssampat: \"First, Morkel bowled Brilliantly, but had no luck going his way and now Bhuvi bowled a incredible first over, again with no luck going his way and then Styen gets an inner edge off Gambhir, only to see it miss the stumps and race away to the boundary. Truly; Cricket is a Batsman's Game.\""}, {"ball": 2.3, "isHighlight": false, "text": "Kumar to Uthappa, $$FOUR$$ ,lovely shot from Uthappa, gets on the front foot and whips that to midwicket for four, it was a length ball on middle stump"}, {"ball": 2.4, "isHighlight": false, "text": "Kumar to Uthappa,no run,this one curls away just a touch, Uthappa plays down the wrong line and the ball whizzes past the outside edge"}, {"ball": 2.5, "isHighlight": false, "text": "Kumar to Uthappa,no run,a short ball outside off, Uthappa charges down and is forced to play a cross-batted shot, no contact"}, {"ball": 2.6, "isHighlight": false, "text": "Kumar to Uthappa, $$FOUR$$ ,third boundary of the over, and this one is the best of the lot, hardly any effort as he works that pitched-up delivery towards midwicket for four more"}, {"ball": 3.1, "isHighlight": false, "text": "Steyn to Gambhir,1 run,a typical Gambhir single, gets on the back foot, drops the ball towards point and sets off"}, {"ball": 3.2, "isHighlight": false, "text": "Steyn to Uthappa,1 run,length ball on the pads, another effortless stroke sends the ball towards deep square leg, the timing has been terrific on his shots today"}, {"ball": 3.2, "isHighlight": false, "text": "Siddharth: \"Robin Uthappa should have certainly booked himself a seat on the plane to Dhaka, if not to London. He definitely should be there in the ODI and T20 squads for the England tour.\""}, {"ball": 3.3, "isHighlight": false, "text": "Steyn to Gambhir,no run,short of length ball on off stump, glided toward backward point where Warner is lurking, he fires in the throw making Uthappa abandon all thoughts of a single"}, {"ball": 3.4, "isHighlight": false, "text": "Steyn to Gambhir,no run,wild from Gambhir, a cross-batted heave to a ball that was moving away from him, gets nowhere close the ball"}, {"ball": 3.5, "isHighlight": false, "text": "Steyn to Gambhir, $$FOUR$$ ,that rocketed to the boundary, think third man took about three or four steps before that reached the fielder there, Bhuvneshwar looks to stop that with his legs after sliding, but that ball was really travelling, Gambhir just used the pace of the bowler to slap it from off side"}, {"ball": 3.6, "isHighlight": false, "text": "Steyn to Gambhir,no run,this is driven towards mid-on, not too well timed"}, {"ball": 3.6, "isHighlight": false, "text": "Algonda Bhusnoo: \"@rsssampat, Correction : Truly; Limited Overs Cricket is a Batsman's game. Get Steyn and Gambhir in whites with the cherry and we'll see how much of a batsman's game it is. Point being that in today's age, test cricket is the only way of knowing a cricketer's true worth. Limited overs have destroyed the balance between bat and ball and reduced the gap between the good and mediocre.\""}, {"ball": 4.1, "isHighlight": false, "text": "Holder to Uthappa,2 runs,flicked off the pads towards short fine leg, Steyn can only slow the ball as he looks to stop it, allows time for two"}, {"ball": 4.2, "isHighlight": false, "text": "Holder to Uthappa,1 run,short of length ball, defended towards point for a single"}, {"ball": 4.3, "isHighlight": false, "text": "Holder to Gambhir,(no ball)  $$SIX$$ ,bang! back of length ball is swiped over midwicket into the Eden Gardens crowd, clean hit that, it is also a no-ball, which wasn't initially signalled, but the replays showed Holder was over the line"}, {"ball": 4.3, "isHighlight": false, "text": "Holder to Gambhir,(no ball)  $$FOUR$$ ,four more, and another no-ball! it was a short ball that cramped up Gambhir who was looking to make room, just had enough to slam it over cover for four"}, {"ball": 4.3, "isHighlight": false, "text": "Holder to Gambhir,2 runs,this time it is a slower offcutter well outside off, Gambhir top edges it towards cover, where the fielder has to run back to catch it over his shoulder, he puts it down and there's time for two"}, {"ball": 4.4, "isHighlight": false, "text": "Holder to Gambhir, $$OUT$$ ,bowled 'im! the sort of dismissal which we have seen so many times from Gambhir, once again he looks to steer the ball to third man, inside edges onto the stumps, this match is utterly packed with incident"}, {"ball": 4.4, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$b$$ $$Holder$$ $$28$$ $$(22m$$ $$18b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$155.55$$"}, {"ball": 4.5, "isHighlight": false, "text": "Holder to Pandey,no run,first ball is on a length at off stump, 136kph, defended to the off side by the new batsman Manish Pandey"}, {"ball": 4.6, "isHighlight": false, "text": "Holder to Pandey,no run,a touch shorter, Pandey makes room and guides the ball towards backward point"}, {"ball": 5.1, "isHighlight": false, "text": "Steyn to Uthappa, $$FOUR$$ ,Uthappa sends this on one over cover, not quite off the middle but has enough on it to go for four"}, {"ball": 5.2, "isHighlight": false, "text": "Steyn to Uthappa,no run,Steyn bangs it in a bit short, Uthappa looks to pull after getting a bit forward, the ball bounces back towards the bowler, who grabs it and fires it towards the keeper"}, {"ball": 5.3, "isHighlight": false, "text": "Steyn to Uthappa,no run,quick, short of length ball, Uthappa wants to whip it to midwicket but he can't get bat on it, on the pads and there is a loud appeal, but that was sliding down"}, {"ball": 5.4, "isHighlight": false, "text": "Steyn to Uthappa,1 run,look to swipe it towards midwicket, doesn't quite get it off the middle but gets a single"}, {"ball": 5.5, "isHighlight": false, "text": "Steyn to Pandey,no run,that is quick from Steyn, 146.5kph, Pandey looks to crack it through point off the back foot, he is beaten by that one outside off"}, {"ball": 5.6, "isHighlight": false, "text": "Steyn to Pandey,1 wide,losing the radar there, this one is way down the leg side"}, {"ball": 5.6, "isHighlight": false, "text": "Steyn to Pandey,no run,length ball outside off, Pandey slaps it towards point but still can't get off the mark"}, {"ball": 6.1, "isHighlight": false, "text": "Holder to Uthappa,2 runs,moves across and takes that from off stump, guiding it behind square leg for a couple"}, {"ball": 6.1, "isHighlight": false, "text": "Govind: \"Why do the matches having these kind of comical situations almost always involve KKR this season?\""}, {"ball": 6.2, "isHighlight": false, "text": "Holder to Uthappa,no run,looking to club that out of the park after coming down the track, doesn't connect"}, {"ball": 6.3, "isHighlight": false, "text": "Holder to Uthappa,no run,slower one, 114kph, Uthappa was through with his slog before the ball arrived, he loses his balances as he plays the shot as well"}, {"ball": 6.4, "isHighlight": false, "text": "Holder to Uthappa,1 run,shortish ball, not much room for Uthappa, who still goes for the chop over cover, top edges it and drops just short of Rasool as he charges in from third man, hits him in the nose on the bounce"}, {"ball": 6.5, "isHighlight": false, "text": "Holder to Pandey,1 run,short ball, worked to midwicket"}, {"ball": 6.6, "isHighlight": false, "text": "Holder to Uthappa,no run,full ball outside off, slower one, jammed to the off side, KKR a long way way from winning this in 15.2 overs"}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Pandey,1 run,thick inside edge sends  the ball in front of square leg"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Uthappa,1 run,full ball on leg stump, backs away and drives it towards mid-off"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Pandey, $$OUT$$ ,length ball, Pandey skips down the track and slices the ball towards long-on, Steyn gobbles that up, Pandey's is out for a seven-ball two"}, {"ball": 7.3, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$c$$ $$Steyn$$ $$b$$ $$Sharma$$ $$2$$ $$(14m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$28.57$$"}, {"ball": 7.3, "isHighlight": false, "text": "$$Time-out$$ ."}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Uthappa,1 run,length ball, a thick inside edge sends the ball behind square leg"}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Pathan,1 run, $$dropped$$ , S Aniruddha has put down an absolute sitter, Yusuf thought he was gone and was walking off, it was typical Yusuf slog, flew to the man at deep midwicket, coming straight at Aniruddha, who barely gets a finger on it as he lets it through to hit his chest"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Uthappa,no run"}, {"ball": 8.1, "isHighlight": false, "text": "Holder to Pathan,1 run,shortish ball, Yusuf goes for the wild slog again, thick bottom edge and could have rolled back to the stumps"}, {"ball": 8.2, "isHighlight": false, "text": "Holder to Uthappa,1 run,steered towards short third man for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Holder to Pathan,1 run,slow full toss, more than knee-high, whipped down to fine leg"}, {"ball": 8.4, "isHighlight": false, "text": "Holder to Uthappa, $$SIX$$ ,cracking shot from Uthappa, short ball is pummelled over midwicket, he moved away from leg and made sure he made proper contact, way back in the crowd"}, {"ball": 8.5, "isHighlight": false, "text": "Holder to Uthappa, $$FOUR$$ ,another short one, this one is off the bottom of the bat, but it is placed wide of David Warner at deep midwicket for four more"}, {"ball": 8.6, "isHighlight": false, "text": "Holder to Uthappa,1 run,full ball on middle stump is whipped to deep square leg for a single"}, {"ball": 9.1, "isHighlight": false, "text": "Sharma to Uthappa, $$SIX$$ ,drops it short, in this form Uthappa is not going to miss out, he slugs this over midwicket for six more, that's nine consecutive scores above 40, that is an incredible achievement in T20"}, {"ball": 9.2, "isHighlight": false, "text": "Sharma to Uthappa, $$OUT$$ ,he's gone now, Uthappa looked to launch that against the spin, doesn't get enough on this length ball, holes out to long-on"}, {"ball": 9.2, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Holder$$ $$b$$ $$Sharma$$ $$41$$ $$(48m$$ $$30b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$136.66$$"}, {"ball": 9.3, "isHighlight": false, "text": "Sharma to Pathan,1 run,length ball just outside off, whipped in front of square leg"}, {"ball": 9.4, "isHighlight": false, "text": "Sharma to ten Doeschate, $$OUT$$ ,there have been several run-outs already today, there's one more now, a length ball is hammered back at the bowler, who puts down a difficult chance to his left, ten Doeschate sets off for the run, there isn't much of a response from Yusuf, RtD has to scramble back, but he is a long way from safety when the keeper takes the bails off"}, {"ball": 9.4, "isHighlight": false, "text": "$$RN$$ $$ten$$ $$Doeschate$$ $$run$$ $$out$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 9.4, "isHighlight": false, "text": "At last, here's Shakib Al Hasan"}, {"ball": 9.5, "isHighlight": false, "text": "Sharma to Shakib Al Hasan,no run,slides on outside off, slapped towards point"}, {"ball": 9.6, "isHighlight": false, "text": "Sharma to Shakib Al Hasan,no run,thick inside edge onto the back pad , the ball rolls away towards point"}, {"ball": 9.6, "isHighlight": false, "text": "Barath: \"Looks like GG read Watson'r (or RR's) book on batting order last night.Why wouldn't you send Shakib, who played brilliantly in the last game and a better striker of the ball (frequency wise) ahead of RTD and Yusuf especially when you are trying to improve your NRR?\""}, {"ball": 10.1, "isHighlight": false, "text": "Parvez Rasool to Pathan, $$SIX$$ ,Yusuf shows us why he became an IPL sensation, a massive hit over square leg as Rasool drops it a touch short, that one has travelled a long way"}, {"ball": 10.1, "isHighlight": false, "text": "Pressure on Rasool now. Dhawan and Sammy walk up to give him some advice."}, {"ball": 10.2, "isHighlight": false, "text": "Parvez Rasool to Pathan,1 run,short of length ball is slapped towards long-on for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Parvez Rasool to Shakib Al Hasan,1 run,length ball is eased towards sweeper cover for a single, over to Yusuf"}, {"ball": 10.4, "isHighlight": false, "text": "Parvez Rasool to Pathan, $$FOUR$$ ,short ball outside off, thick outside edge races past short third man for four, this game has had a lot of inside and outside edges"}, {"ball": 10.4, "isHighlight": false, "text": "A brief hold-up as some insects head for Yusuf's face"}, {"ball": 10.5, "isHighlight": false, "text": "Parvez Rasool to Pathan, $$SIX$$ , $$dropped$$ , this was clubbed towards deep square leg, serious power on it, but you expect Dale Steyn to hand on to this sort of overhead chance, he doesn't and that's six, Rasool is incensed, Sammy isn't too pleased either"}, {"ball": 10.6, "isHighlight": false, "text": "Parvez Rasool to Pathan, $$FOUR$$ ,another misfield, this time at long-on, Holder is all arms and legs as he flops over trying to stop the ball, he seems to have done so, but just as he gets up he palms the ball over the rope, quite comical that"}, {"ball": 11.1, "isHighlight": false, "text": "Sharma to Shakib Al Hasan,1 leg bye,looking to tuck the ball towards square leg, off the pads for a leg-bye"}, {"ball": 11.2, "isHighlight": false, "text": "Sharma to Pathan, $$SIX$$ ,big, big hit, Yusuf sends that length ball way beyond the boundary rope, many, many rows behind the rope, KKR are on the charge"}, {"ball": 11.3, "isHighlight": false, "text": "Sharma to Pathan,2 runs,short of length ball is slashed towards deep point, Yusuf slips a bit as he comes back for a tight second, but he survives as the throw from Warner is a bit wide giving him the extra time"}, {"ball": 11.4, "isHighlight": false, "text": "Sharma to Pathan, $$SIX$$ ,Eden Gardens going berserk as Yusuf Pathan goes berserk, a length ball is sent over long-off for six, this was not middle, it was sliced, still enough power on it to carry for six"}, {"ball": 11.5, "isHighlight": false, "text": "Sharma to Pathan,1 run,gets on the back foot and nonchalantly whips this one towards deep square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Sharma to Shakib Al Hasan, $$OUT$$ ,Shakib looks to join the fun, he skips down the track and throws his bat it, slices the ball, it goes high and reaches only as far as Jason Holder at long-off, no mistakes this time in the field"}, {"ball": 11.6, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$c$$ $$Holder$$ $$b$$ $$Sharma$$ $$1$$ $$(11m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$"}, {"ball": 11.6, "isHighlight": false, "text": "Suryakumar Yadav is the new batsmen, he hasn't batted in KKR's last six matches.  $$45$$ $$needed$$ $$off$$ $$20$$ $$balls$$ ."}, {"ball": 11.6, "isHighlight": false, "text": "Steyn is back for his final over."}, {"ball": 12.1, "isHighlight": false, "text": "Steyn to Pathan, $$FOUR$$ ,shortish and wide, Yusuf power to the fore, hits low on the bat as he looks to slug it to the leg side, the ball whizzes past the bowler and goes away for four"}, {"ball": 12.2, "isHighlight": false, "text": "Steyn to Pathan, $$SIX$$ ,electric from Yusuf, just 15 balls for his 50, incredible innings from him, he has just dispatched steyn over midwicket for a mammoth six"}, {"ball": 12.3, "isHighlight": false, "text": "Steyn to Pathan, $$SIX$$ ,length ball from Steyn and he has been bludgeoned over long-off for six more, world's best bowler? Yusuf doesn't care"}, {"ball": 12.4, "isHighlight": false, "text": "Steyn to Pathan, $$FOUR$$ ,four more! Yusuf pulls this short ball to the square-leg boundary, Steyn being taken apart here, CSK worried now"}, {"ball": 12.5, "isHighlight": false, "text": "Steyn to Pathan, $$FOUR$$ ,fifth ball of the over, fifth ball that goes to the boundary, thick outside edge past the keeper for four more, Eden Gardens is loving it"}, {"ball": 12.6, "isHighlight": false, "text": "Steyn to Pathan,2 runs,full ball on the pads, clipped towards deep square leg for two more, 26 off the over, that's the most expensive one Steyn has bowled in IPL"}, {"ball": 13.1, "isHighlight": false, "text": "Sharma to SA Yadav, $$FOUR$$ ,it's not all about power, Suryakumar shows the finesses with a lap-sweep for four"}, {"ball": 13.1, "isHighlight": false, "text": "$$15$$ $$needed$$ $$off$$ $$13$$"}, {"ball": 13.2, "isHighlight": false, "text": "Sharma to SA Yadav,1 run,another sweep, this time a more powerful one towards deep square leg"}, {"ball": 13.2, "isHighlight": false, "text": "In case I didn't mention it in all the excitement, this is the quickest 50 in the IPL"}, {"ball": 13.3, "isHighlight": false, "text": "Sharma to Pathan,no run,looks to whip this to the leg side, towards short fine leg for the first dot ball off his innings"}, {"ball": 13.4, "isHighlight": false, "text": "Sharma to Pathan, $$SIX$$ ,six more! I need to keep that on copy-paste, Karn drops it short and Yusuf sends it over to the delirious Eden Gardens crowd for six more"}, {"ball": 13.5, "isHighlight": false, "text": "Sharma to Pathan, $$OUT$$ ,and it's over, a special innings from Yusuf that has all but earned KKR a place in the top two, he was going for another sixbut can only get it as far as Dhawan at deep midwicket, he knows the job is virtually done, clearly enjoyed this innings, punches gloves with suryakumar before walking off, raises his bat and an adoring crowd replies with raucous cheers"}, {"ball": 13.5, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$c$$ $$Dhawan$$ $$b$$ $$Sharma$$ $$72$$ $$(35m$$ $$22b$$ $$5x4$$ $$7x6)$$ $$SR:$$ $$327.27$$"}, {"ball": 13.6, "isHighlight": false, "text": "Sharma to SA Yadav,1 run,eased to long-off for a single, been a while since I got to type something as simple as that"}, {"ball": 14.1, "isHighlight": false, "text": "Kumar to SA Yadav,no run,short of length ball outside off, guided towards backward point"}, {"ball": 14.1, "isHighlight": false, "text": "$$7$$ $$needed$$ $$off$$ $$7$$"}, {"ball": 14.2, "isHighlight": false, "text": "Kumar to SA Yadav, $$SIX$$ ,scores are level, as there's yet another six, Suryakumar skips down the track and hammers that over long-on"}, {"ball": 14.3, "isHighlight": false, "text": "Kumar to SA Yadav,1 wide,KKR get their seventh win in a row, their longest streak, and they go through as No. 2, the result is confirmed by a wide down the leg side, Sunrisers are knocked out"}, {"ball": 14.3, "isHighlight": false, "text": "Yusuf Pathan - 72 off 22. That was unbelievable hitting. He's still pumped, waving a stump about in jubilation."}, {"ball": 14.3, "isHighlight": false, "text": "Rishabh Prajapa: \"This innings has now paid off the entire money KKR had paid for the four years to Yusuf.\""}, {"ball": 14.3, "isHighlight": false, "text": "SKD: \"Man of the match: Anirudhha Srikanth.\""}, {"ball": 14.3, "isHighlight": false, "text": "Suman Dustakar: \"In Excitement you also forgot that karan sharma took 4 wkts :)\" Totally did."}, {"ball": 14.3, "isHighlight": false, "text": "$$Darren$$ $$Sammy:$$  \"I wish I could hit like that. Credit to Yusuf. Phenomenal hitting. We've not been consistently good enough this tournament.\""}, {"ball": 14.3, "isHighlight": false, "text": "Sudipta: \"Netherland revisited and relieved. Qualified withan over to spare. Robin doing a Myburgh and Yusuf doing a Cooper here.\""}, {"ball": 14.3, "isHighlight": false, "text": "Nandakiran N: \"Binary form of batting is Yusuf Pathan. Play a blinder or blindly get out. :P\""}, {"ball": 14.3, "isHighlight": false, "text": "Karthik: \"What a fine margin between being a hero and a zero -quite literally in this case! Pathan dropped on 0.\""}, {"ball": 14.3, "isHighlight": false, "text": "saurish: \"what the hell happened,i had gone to have dinner for 15 mintues..returned and games over :o\""}, {"ball": 14.3, "isHighlight": false, "text": "faraz681: \"Yusuf hit Dale Steyn for 26 in an over....move over Dhoni...\""}, {"ball": 14.3, "isHighlight": false, "text": "John Paul: \"Yusuf On, Comments Gone\""}, {"ball": 14.3, "isHighlight": false, "text": "$$Robin$$ $$Uthappa:$$  \"There was a massive belief that we would play in the semi-finals here, when I was walking past Danny before the game he asked me whether we would make it, I told him, I know we'll make it.\" Uthappa also has plenty of praise for the Eden Gardens crowd."}, {"ball": 14.3, "isHighlight": false, "text": "$$Chennai$$ $$Super$$ $$Kings$$  tweet: \"One more game! One more reason to #whistlepodu!\""}, {"ball": 14.3, "isHighlight": false, "text": "Sharma: \"Thank you YK Pathan for understanding I have exams to revise for and finishing the match early.\""}, {"ball": 14.3, "isHighlight": false, "text": "Ishan Jain: \"Steyn's reputation has taken a serious pounding this season. Hope he recovers soon from this traumatic season. He is the arguably most threatening fast bowler of this era.\""}, {"ball": 14.3, "isHighlight": false, "text": "$$Presentation$$ $$ceremony:$$"}, {"ball": 14.3, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir:$$  \"I have never seen this sort of innings in my career, unbelievable hitting, I can only dream of it, but I saw it in reality. We always wanted to finish it in 15.2 overs, this is what we play cricket for. We didn't start well up front bowling, we dropped some crucial catches, but this is not the time to talk about negatives, I have never seen such an innings.\""}, {"ball": 14.3, "isHighlight": false, "text": "Man of the Match is  $$Yusuf$$ $$Pathan:$$  \"I hit form at the right time. It feels great when the ball hits the middle of the bat and travels a long way. My hundred for Rajasthan was a good knock but I got run-out and we couldn't win the match, but this time we won, this feels like my best innings.\""}, {"ball": 14.3, "isHighlight": false, "text": "Well, I need a breather after that unbelievable game. I'm off, sorry couldn't post more comments when Yusuf was going bonkers. See you tomorrow. G'night."}], "name": "Kolkata Knight Riders v Sunrisers Hyderabad", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734037.html?innings=2;view=commentary", "match_num": 54}