{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$4.00pm$$  Here we go, then. Kumar Dharmasena and Vineet Kulkarni are the umpires for today's game. It's KP and Mayank Agarwal to open for Delhi. Parvinder Awana has the new ball."}, {"ball": 0, "isHighlight": false, "text": "Harish Varanasi makes a sliiiiiiiightly hyperbolic comparison. \"Shaun Marsh has played for Mohali more than any other player, dropping him is still baffling, would you drop Gerrard from Liverpool ?\""}, {"ball": 0, "isHighlight": false, "text": "Shikhar Sachdev: \"Play Marsh, Maxwell, Miller, and Bailey all I say! Who cares about the bowling; you can chase down any total in the world and at the same post 230 everytime! Runs galore! Wooohoooo\""}, {"ball": 0, "isHighlight": false, "text": "Sridhar: \"Marsh has been dropped? MOM in previous match and who can guide the innings and score at the same time? Surely, Bailey could have considered dropping himself in favor of Maxwell.\""}, {"ball": 0, "isHighlight": false, "text": "$$3.40pm$$  Delhi Daredevils have left out M Vijay, Siddarth Kaul and Wayne Parnell. Shaun Marsh, Beuran Hendricks and L Balaji are out for Kings XI Punjab."}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm$$  Ian Bishop says the temperature in Mohali is 42 degrees (presumably Celsius). George Bailey says Punjab have a few new guys in, but doesn't reveal who just yet. He also says the pitch is \"a little bit dry\" at one end and \"a little bit grassy\" at the other."}, {"ball": 0, "isHighlight": false, "text": "Asked what's gone wrong, Kevin Pietersen says Delhi wouldn't be in the position they are in if they had been able to put their finger on it."}, {"ball": 0, "isHighlight": false, "text": "It's heads, and George Bailey has won the toss.  $$Kings$$ $$XI$$ $$Punjab$$ $$will$$ $$bowl$$ $$first$$ . He says it'll be hard to defend a total here, but KP says he would have chosen to bat."}, {"ball": 0, "isHighlight": false, "text": "Mitchell Johnson, Glenn Maxwell and Parvinder Awana are back for Kings XI. Daredevils, meanwhile, have brought back Jimmy Neesham, Mayank Agarwal and Mohammed Shami. Neither captain said which players have made way. We'll fill you in as soon as we know."}, {"ball": 0, "isHighlight": false, "text": "Jasnesh: \"with nothing much to play for both teams, i hope both sets of teams give chances to their fringe players. Delhi hasnt opted for Saurabh Tiwary (dont know if he is injured or not) while Gurkeerat Singh (SuperMann) hasnt featured too.\" Saurabh Tiwary is out with a shoulder injury, Jasnesh."}, {"ball": 0, "isHighlight": false, "text": "$$3.15pm$$  Hello, everyone. This is Karthik Krishnaswamy, your commentator for the first match in the last double-header of the season."}, {"ball": 0, "isHighlight": false, "text": "This is Kings XI Punjab against Delhi Daredevils, first versus last, and first will remain first and last will remain last no matter what happens in this match. Despite the lack of anything tangible to play for, there could be a lot of entertainment on offer, considering these are the two bowling attacks that have leaked the most runs this season, as this  $$preview$$ by Bishen Jeswant will tell you."}, {"ball": 0, "isHighlight": false, "text": "The league phase ends today. Not just at the IPL, but at CricIQ as well. And just like the IPL, it has come down to the last day... Today is your last chance to scramble onto the Powerplay leaderboard and stay in the running for the big prize - the chance to watch India v England at Lord's this summer.  $$Make$$ $$your$$ $$last$$ $$chance$$ $$count.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Awana to Pietersen,no run,that's a length ball wide of off stump, and KP comes forward and drives towards mid-off"}, {"ball": 0.2, "isHighlight": false, "text": "Awana to Pietersen,1 run,that's full, on off stump, and a fumble at midwicket allows KP to get off the mark with that flick"}, {"ball": 0.2, "isHighlight": false, "text": "Akshar Patel was the (mis)fielder."}, {"ball": 0.3, "isHighlight": false, "text": "Awana to Agarwal,1 run,length ball, outside off, and Agarwal slices it past point with a slightly open face"}, {"ball": 0.4, "isHighlight": false, "text": "Awana to Pietersen,no run,good stop. Akshar dives to his left and saves what might well be four runs, after KP walks across his stumps and flicks it from outside off. A big chip seems to have come off the bottom of his bat."}, {"ball": 0.4, "isHighlight": false, "text": "Bit of a delay as KP calls for a replacement bat. The broken one looked brand-new."}, {"ball": 0.5, "isHighlight": false, "text": "Awana to Pietersen,no run,length ball, outside off, with a bit of inward angle. KP drives to mid-off"}, {"ball": 0.6, "isHighlight": false, "text": "Awana to Pietersen, $$FOUR$$ ,direct hit! the man at point throws hard and flat to the bowler's end after KP sends Agarwal back. The fielder was Maxwell, who picked up this open-faced dab from KP after the ball seamed away from him slightly. The diving Agarwal is home, and Delhi get four overthrows."}, {"ball": 0.6, "isHighlight": false, "text": "Akshar Patel now"}, {"ball": 1.1, "isHighlight": false, "text": "Patel to Agarwal,1 run,skids onto the batsman from just back of a length. Agarwal waits and tucks it away behind square leg"}, {"ball": 1.2, "isHighlight": false, "text": "Patel to Pietersen,no run,KP takes two big strides down the pitch and across outside off. Looks to go leg side, but the ball hits him on the pads"}, {"ball": 1.3, "isHighlight": false, "text": "Patel to Pietersen, $$FOUR$$ ,short, and KP rocks back and cuts hard to the left of point"}, {"ball": 1.4, "isHighlight": false, "text": "Patel to Pietersen,1 run,no turn on this straightish length ball, and KP nudges it into the midwicket area"}, {"ball": 1.5, "isHighlight": false, "text": "Patel to Agarwal,no run,looks for the single with the nurdle to short fine leg, but Bailey runs to his right from square leg and cuts it off"}, {"ball": 1.6, "isHighlight": false, "text": "Patel to Agarwal,no run,back of a length, outside off, punched towards point"}, {"ball": 1.6, "isHighlight": false, "text": "Here's Mitch now"}, {"ball": 2.1, "isHighlight": false, "text": "Johnson to Pietersen,1 run,back of a length, angled towards off stump. It straightens after pitching, and KP gets an inside-edge past his stumps as he slashes at it with no footwork"}, {"ball": 2.2, "isHighlight": false, "text": "Johnson to Agarwal, $$OUT$$ ,edged, and gone! No feet again, from Mayank this time, and Johnson gets some bounce from a good length. Agarwal gets a thick edge on his on-the-up drive, and Sehwag catches it above his head at a wide-ish slip."}, {"ball": 2.2, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Sehwag$$ $$b$$ $$Johnson$$ $$2$$ $$(12m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$40.00$$"}, {"ball": 2.2, "isHighlight": false, "text": "DK is the new man. He's got DK on the back of his shirt, and a DK sticker on the back of his bat."}, {"ball": 2.3, "isHighlight": false, "text": "Johnson to Karthik, $$FOUR$$ ,top shot! that was just a touch short, and DK has got on top of it and cut it hard to the right of point."}, {"ball": 2.4, "isHighlight": false, "text": "Johnson to Karthik,no run,that's full and wide, and DK drives that, all hands and no feet, to mid-off."}, {"ball": 2.5, "isHighlight": false, "text": "Johnson to Karthik,no run,he's middling everything. This one's a solid punch off the back foot, off a back of a length ball on off stump, and it bounces up and is fielded by point, raising his arms above his head"}, {"ball": 2.6, "isHighlight": false, "text": "Johnson to Karthik, $$FOUR$$ ,Johnson strays onto the pads, and Karthik flicks that confidently past square. He's looking in really good touch here."}, {"ball": 3.1, "isHighlight": false, "text": "Awana to Pietersen,no run,overpitched, wide outside off, but KP doesn't get hold of it. His drive goes off the toe-end of his bat to mid-off"}, {"ball": 3.2, "isHighlight": false, "text": "Awana to Pietersen,no run,he's struggling for timing, so far. down the pitch, looks to hit this length ball past cover, possibly, but it doesn't come on and he gets a thick inside edge into the leg side"}, {"ball": 3.3, "isHighlight": false, "text": "Awana to Pietersen,no run,waits on it this time and pushes it to cover. Length ball again, possibly a slower ball"}, {"ball": 3.4, "isHighlight": false, "text": "Awana to Pietersen, $$FOUR$$ ,that's definitely a slower ball, with a leg-cutter release. KP spots this early, though, and hits it over the bowler showing the full face of the bat"}, {"ball": 3.5, "isHighlight": false, "text": "Awana to Pietersen,1 run,length ball, on off and middle, and KP hurries to the other end after pushing it wristily to mid-on"}, {"ball": 3.6, "isHighlight": false, "text": "Awana to Karthik, $$FOUR$$ ,oh, lovely shot. Awana has given him width, but it wasn't a half-volley. DK leans over it and times this drive sweetly to the left of a diving cover fielder"}, {"ball": 4.1, "isHighlight": false, "text": "Johnson to Pietersen, $$FOUR$$ ,that's full and wide, and KP has a lot of time to drive it between a deepish cover point and a shortish extra cover"}, {"ball": 4.2, "isHighlight": false, "text": "Johnson to Pietersen,no run,that's a touch short. KP slashes hard, but Rishi Dhawan makes a good stop at cover point, tumbling to his right"}, {"ball": 4.3, "isHighlight": false, "text": "Johnson to Pietersen,3 runs,KP looks to flick this over the leg side, but he gets a leading edge, possibly because of the angle, and it loops over cover. Dhawan slides and cuts it off just short of the rope."}, {"ball": 4.4, "isHighlight": false, "text": "Johnson to Karthik,1 run,full, almost in the blockhole, and just outside off. DK gets back and across and pushes it with a straight bat towards mid-off"}, {"ball": 4.5, "isHighlight": false, "text": "Johnson to Pietersen, $$FOUR$$ ,lovely shot. That was a length ball, and there wasn't too much width on it, and KP stays next to the line of the ball and swings freely through the line to the left of extra cover"}, {"ball": 4.6, "isHighlight": false, "text": "Johnson to Pietersen,1 run,slashes at this one, just back of a length, and slices it to third man"}, {"ball": 5.1, "isHighlight": false, "text": "Awana to Pietersen,1 leg bye,Awana appeals as KP is struck on the pads after moving across to flick to the on-side. The ball might have hit him outside the line. They sneak a leg-bye, as the cover fielder misses the stumps at the non-striker's end"}, {"ball": 5.2, "isHighlight": false, "text": "Awana to Karthik, $$OUT$$ ,got him! did that straighten a bit? Maybe. DK was back in his crease, and he tried to flick it from off stump towards midwicket, but he ends up getting a leading edge that loops into point's hands."}, {"ball": 5.2, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$c$$ $$Patel$$ $$b$$ $$Awana$$ $$13$$ $$(14m$$ $$7b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$185.71$$"}, {"ball": 5.2, "isHighlight": false, "text": "Kedar Jadhav is in, much earlier than usual"}, {"ball": 5.3, "isHighlight": false, "text": "Awana to Jadhav,no run,shuffles out of his crease, Awana shortens his length a touch, and KJ knocks it back to the bowler with a flick of his wrist"}, {"ball": 5.4, "isHighlight": false, "text": "Awana to Jadhav,no run,tries to slash this length ball through cover, I think, but it comes in a touch and beats his inside edge"}, {"ball": 5.5, "isHighlight": false, "text": "Awana to Jadhav,no run,bit of inward movement again as Jadhav pushes out at it. Drops it down safely into the off side, off the inside half of his bat"}, {"ball": 5.6, "isHighlight": false, "text": "Awana to Jadhav, $$OUT$$ ,gone! Jadhav danced down the pitch and seemed to time that flat-batted drive really well. But he doesn't keep it down, and he doesn't get any real elevation either, and Vohra takes it just above his head at mid-off"}, {"ball": 5.6, "isHighlight": false, "text": "$$KM$$ $$Jadhav$$ $$c$$ $$Vohra$$ $$b$$ $$Awana$$ $$0$$ $$(3m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 5.6, "isHighlight": false, "text": "Manoj Tiwary now. KP to face the legspinner Karanveer Singh. That was a double-wicket maiden from Awana."}, {"ball": 6.1, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,full, outside off, and wide mid-off dives left to cut off the drive"}, {"ball": 6.2, "isHighlight": false, "text": "Karanveer Singh to Tiwary,1 run,back of a length, on the pads, and it's worked away towards square leg"}, {"ball": 6.3, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,bit of flight on this, and KP opts to go deep in his crease and look for the cut. It's too close to off stump, and he can only hit it straight to point"}, {"ball": 6.4, "isHighlight": false, "text": "Karanveer Singh to Tiwary,no run,Tiwary goes back now, and it's flatter. Chopped away to point."}, {"ball": 6.5, "isHighlight": false, "text": "Karanveer Singh to Tiwary,1 run,length ball, outside off, and Tiwary stretches forward to sweep it to deep backward square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Karanveer Singh to Pietersen,2 runs,what a shot that is, and what a stop. KP gets a lot of bottom hand into this sweep from way outside off, and Glenn Maxwell throws himself to his right after running around from deep midwicket to save two runs"}, {"ball": 6.6, "isHighlight": false, "text": "Saurav Bhattach: \"that was not a maiden\" Yes, it was. The only run that came off it was a leg-bye. That doesn't go into the bowler's tally."}, {"ball": 6.6, "isHighlight": false, "text": "CricketFan: \"Expected. DD tinker again with their batting line up. Why does someone send Jadhav at no. 4? you need partnerships at this time and you send a slogger? Bad thinking costs them one wicket. DD aren't learning from their mistakes.\" That's rather harsh. Jadhav isn't a slogger. He was the highest run-getter in the Ranji Trophy this season, and he's a really good timer of the ball."}, {"ball": 6.6, "isHighlight": false, "text": "Here's Rishi Dhawan now"}, {"ball": 7.1, "isHighlight": false, "text": "Dhawan to Tiwary,1 run,onto the pads, and it's flicked to deep midwicket"}, {"ball": 7.2, "isHighlight": false, "text": "Dhawan to Pietersen, $$FOUR$$ ,unlucky! that swung back in, very late, and KP inside edges that attempted cover drive past his stumps"}, {"ball": 7.3, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,loses his line completely. It's way wide of off stump, and KP reaches out to slap it to deep point"}, {"ball": 7.4, "isHighlight": false, "text": "Dhawan to Tiwary,no run,this one shapes away a little, with a bit of extra bounce, and Tiwary is beaten as he tries to dab it towards third man"}, {"ball": 7.5, "isHighlight": false, "text": "Dhawan to Tiwary,1 run,slower ball, drifts onto the pads, and it's clipped to the right of deep midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,angled in towards off stump. KP is out of his crease to wrist this down the ground to long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Wasim Kumandan: \"This is ridiculous thinking on part of the DD .. Punjab have a leg spinner n a left arm slow bowler n despite having two left handers.. u have two right handers batting!!\""}, {"ball": 8.1, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,nice shot, but only one. KP gives himself room and drives this inside-out to wide long-on"}, {"ball": 8.2, "isHighlight": false, "text": "Karanveer Singh to Tiwary,1 run,that is a lot of loop, and Tiwary waits and waits before driving to the sweeper"}, {"ball": 8.3, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,that's short, but KP finds cover with his cut. Misfield allows him to take the single"}, {"ball": 8.4, "isHighlight": false, "text": "Karanveer Singh to Tiwary,2 runs,that's another shortish ball, and it's cut to deep point. They run two, and Tiwary just beats the throw to the keeper with the dive."}, {"ball": 8.5, "isHighlight": false, "text": "Karanveer Singh to Tiwary,1 run,Bailey gets a hand to this drive at cover, diving left, after Tiwary leans forward and drives"}, {"ball": 8.6, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,KP gives himself room and tries to drive wristily through cover, but he's too early into his shot, and the ball trickles into the leg side off his inside edge"}, {"ball": 9.1, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,tries to sweep this from outside off, but doesn't really time it. Easy stop for square leg"}, {"ball": 9.2, "isHighlight": false, "text": "Dhawan to Tiwary,1 wide,tries to find the blockhole, I think, but gets his wrist position wrong and it slides down the leg side"}, {"ball": 9.2, "isHighlight": false, "text": "Dhawan to Tiwary,no run,shortish, wide of off, but not that short, and it sneaks under Tiwary's bat as he tries to chop it past point"}, {"ball": 9.3, "isHighlight": false, "text": "Dhawan to Tiwary, $$OUT$$ ,what are you doing, Delhi? Has Tiwary sacrificed his wicket, or has KP just run past him? Tiwary bunted that straight to point, and KP just took off. Bailey is the fielder, and he only has to lob it underarm to the bowler to complete the simplest of run-outs."}, {"ball": 9.3, "isHighlight": false, "text": "$$MK$$ $$Tiwary$$ $$run$$ $$out$$ $$8$$ $$(18m$$ $$11b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$72.72$$"}, {"ball": 9.3, "isHighlight": false, "text": "Jean-Paul Duminy, the man every Delhi fan has been waiting to see"}, {"ball": 9.4, "isHighlight": false, "text": "Dhawan to Pietersen,no run,slower ball, angled in towards middle stump, defended down the pitch"}, {"ball": 9.4, "isHighlight": false, "text": "KP pulls away from his stance, and the umpire stops Dhawan in his run-up. There seems to be a really strong wind. The branches on the trees around the ground are swaying quite angrily"}, {"ball": 9.5, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,length ball, angled in, wristed down to long-on"}, {"ball": 9.6, "isHighlight": false, "text": "Dhawan to Duminy,1 run,angled towards middle stump. Duminy walks across and works that square on the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Akshar now"}, {"ball": 10.1, "isHighlight": false, "text": "Patel to Duminy,1 run,full, onto the pads, and Duminy flicks it towards midwicket"}, {"ball": 10.2, "isHighlight": false, "text": "Patel to Pietersen, $$FOUR$$ ,KP goes forward and across, and laps this length ball from the stumps, very fine"}, {"ball": 10.3, "isHighlight": false, "text": "Patel to Pietersen, $$FOUR$$ ,that's a touch short, but it gives KP enough time to rock back and slap it to the right of backward point"}, {"ball": 10.4, "isHighlight": false, "text": "Patel to Pietersen, $$FOUR$$ ,what happened here? KP comes forward to defend. His bat comes down in that curtain-rail manner of his, and the inside edge sneaks past leg stump. Lucky boy, KP"}, {"ball": 10.5, "isHighlight": false, "text": "Patel to Pietersen,no run,forward press, defends this length ball into the leg side"}, {"ball": 10.6, "isHighlight": false, "text": "Patel to Pietersen,no run,Akshar sees KP jumping down the track and shortens his length. KP defends it back to him."}, {"ball": 10.6, "isHighlight": false, "text": "They appear to have taken a time-out here."}, {"ball": 10.6, "isHighlight": false, "text": "L: \"Can someone break it down for me: Why is it easier for a left handed batsmen to play a leg spinner than a RHB?\" Well, unless it's late in a Test match and there is a lot of rough outside the left-hander's off stump, the thinking is that it's easier to play the ball spinning into you. Especially in a Twenty20 situation, where the slog over the leg side is such an important shot."}, {"ball": 11.1, "isHighlight": false, "text": "Dhawan to Duminy,no run,angled across Duminy, who tries to drive through the off side, on the up, but only gets an inside-edge into the leg side"}, {"ball": 11.2, "isHighlight": false, "text": "Dhawan to Duminy,1 run,slower ball this time, angled away from Duminy, and he leans forward to push it to mid-off"}, {"ball": 11.3, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,that's a length ball, worked off the stumps to backward square leg"}, {"ball": 11.4, "isHighlight": false, "text": "Dhawan to Duminy,1 run,angled towards off stump, just back of a length, and Duminy tucks it to midwicket"}, {"ball": 11.5, "isHighlight": false, "text": "Dhawan to Pietersen,1 run,slower ball, outside off stump, and KP presses forward, waits, and chops down on it to send it rolling towards third man"}, {"ball": 11.6, "isHighlight": false, "text": "Dhawan to Duminy,no run,length ball, outside off, and Duminy is beaten as he throws his bat at it, attempting the flat-batted drive"}, {"ball": 12.1, "isHighlight": false, "text": "Karanveer Singh to Pietersen,1 run,back of a length, on the stumps, and KP goes back to work it towards midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Karanveer Singh to Duminy, $$FOUR$$ ,drifts away from Duminy, away from off stump, but it's a full-toss, and he sweeps hard to the left of a diving deep midwicket"}, {"ball": 12.3, "isHighlight": false, "text": "Karanveer Singh to Duminy, $$OUT$$ ,got him! Tries to sweep again from outside off, but the ball drops shorter than he must have expected and bounced to take his top edge and loop towards cover"}, {"ball": 12.3, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$c$$ $$Patel$$ $$b$$ $$Karanveer$$ $$Singh$$ $$8$$ $$(14m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 12.4, "isHighlight": false, "text": "Karanveer Singh to Neesham,no run,shortish, spins back towards the stumps, and Neesham hurriedly changes his mind. He wanted to cut, but he pushes it softly into the off side instead."}, {"ball": 12.5, "isHighlight": false, "text": "Karanveer Singh to Neesham,no run,length ball, defended back to the bowler"}, {"ball": 12.6, "isHighlight": false, "text": "Karanveer Singh to Neesham,1 run,onto the pads now, and he tucks it to square leg"}, {"ball": 13.1, "isHighlight": false, "text": "Dhawan to Neesham,no run,it's on that uncomfortable full-but-not-driveable length again, and angled towards off stump. Neesham pushes it back to the bowler"}, {"ball": 13.2, "isHighlight": false, "text": "Dhawan to Neesham,no run,shorter now, and Neesham is beaten, trying to slice it past point"}, {"ball": 13.3, "isHighlight": false, "text": "Dhawan to Neesham,1 run,back of a length, and a bit more width. Neesham is on the front foot, and he slaps it to the off-side sweeper from around waist-height"}, {"ball": 13.4, "isHighlight": false, "text": "Dhawan to Pietersen, $$OUT$$ ,Given! KP walks across his stumps again, and is hit on the front pad trying to work the ball around it. It was headed towards leg stump, or it was just missing. Can't really say with any certainty"}, {"ball": 13.4, "isHighlight": false, "text": "$$KP$$ $$Pietersen$$ $$lbw$$ $$b$$ $$Dhawan$$ $$58$$ $$(70m$$ $$41b$$ $$9x4$$ $$0x6)$$ $$SR:$$ $$141.46$$"}, {"ball": 13.4, "isHighlight": false, "text": "Shahbaz Nadeem is in now. He might not have expected to come in with nearly seven overs to go."}, {"ball": 13.5, "isHighlight": false, "text": "Dhawan to Nadeem,no run,That's banged in, and it rises up towards Shahbaz's throat. Jumps up to keep it down."}, {"ball": 13.6, "isHighlight": false, "text": "Dhawan to Nadeem,5 wides,poor work behind the stumps from Saha. It's a slower ball, and it angles down the leg side and goes to the keeper on the bounce, and it went between his legs"}, {"ball": 13.6, "isHighlight": false, "text": "Dhawan to Nadeem,no run,bit of bounce again, around chest-height this time, and Nadeem takes his bottom hand off the handle as he defends"}, {"ball": 13.6, "isHighlight": false, "text": "Mitchell returns"}, {"ball": 14.1, "isHighlight": false, "text": "Johnson to Neesham,no run,tries to work this into the leg side from outside off, gets an inside edge onto the front pad"}, {"ball": 14.2, "isHighlight": false, "text": "Johnson to Neesham, $$FOUR$$ ,straighter this time, and Neesham times this flick really well. Midwicket gives chase, and he seems to be in with a chance of cutting it off, but the ball simply doesn't slow down"}, {"ball": 14.3, "isHighlight": false, "text": "Johnson to Neesham,no run,short ball, and Neesham drops his gloves under the ball as it rises past him"}, {"ball": 14.4, "isHighlight": false, "text": "Johnson to Neesham,1 run,short, rising ball again, and Neesham plays it well, close to his body, bunting it down onto the pitch"}, {"ball": 14.4, "isHighlight": false, "text": "Sridhar: \"What is it with Australians and beards.. Richardson, maxwell and marsh. ?\" Mitch has gone the other way. He seems to have shaved off his moustache."}, {"ball": 14.5, "isHighlight": false, "text": "Johnson to Nadeem,no run,whoa. That's nasty. It's short, and Nadeem takes his eye off it but just manages to duck his head under it"}, {"ball": 14.6, "isHighlight": false, "text": "Johnson to Nadeem,no run,fuller now, on the stumps, and Nadeem's feet are frozen. But he manages to get decent contact and swat it away towards cover"}, {"ball": 14.6, "isHighlight": false, "text": "Akshar goes left-arm over now"}, {"ball": 15.1, "isHighlight": false, "text": "Patel to Neesham,no run,shortish ball, and Neesham finds point with that cut"}, {"ball": 15.2, "isHighlight": false, "text": "Patel to Neesham,no run,length ball, punched towards mid-off"}, {"ball": 15.3, "isHighlight": false, "text": "Patel to Neesham,2 runs,on the stumps, and Neesham's worked it away towards midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Patel to Neesham,1 run,gives himself room, looking for the cut, but it turns in, and he's forced to work it towards midwicket instead"}, {"ball": 15.5, "isHighlight": false, "text": "Patel to Nadeem,1 run,worked off the pads behind square leg"}, {"ball": 15.6, "isHighlight": false, "text": "Patel to Neesham,no run,length ball, Neesham goes deep in his crease and punches it towards cover"}, {"ball": 15.6, "isHighlight": false, "text": "They've taken another time-out now."}, {"ball": 15.6, "isHighlight": false, "text": "madan: \"Good anticipation from DD here to include Neesham (used to playing in windy conditions) in this game :p\""}, {"ball": 16.1, "isHighlight": false, "text": "Karanveer Singh to Nadeem,1 run,bit of flight, but it drops down before Shahbaz can skip down the track and get to the pitch. Tucked off the pads towards midwicket"}, {"ball": 16.2, "isHighlight": false, "text": "Karanveer Singh to Neesham,no run,that's short and wide, but Neesham can only bunt it towards point"}, {"ball": 16.3, "isHighlight": false, "text": "Karanveer Singh to Neesham,no run,flatter, quicker, and Neesham is beaten trying to cut"}, {"ball": 16.4, "isHighlight": false, "text": "Karanveer Singh to Neesham,2 runs,bit of turn into the left-hander this time, and he tucks it off his pads, past midwicket, and the bowler has to run all the way to field that"}, {"ball": 16.5, "isHighlight": false, "text": "Karanveer Singh to Neesham,no run,quicker ball, full and on the stumps, and it's defended into the leg side"}, {"ball": 16.6, "isHighlight": false, "text": "Karanveer Singh to Neesham, $$OUT$$ ,that's a rubbish delivery, but it's got him a wicket. It's short and wide, but Neesham isn't really in a good position to cut, and hits it uppishly, straight to backward point"}, {"ball": 16.6, "isHighlight": false, "text": "$$JDS$$ $$Neesham$$ $$c$$ $$Bailey$$ $$b$$ $$Karanveer$$ $$Singh$$ $$12$$ $$(20m$$ $$20b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$60.00$$"}, {"ball": 16.6, "isHighlight": false, "text": "Loads of people saying KP was clearly not out, and commenting on the general state of umpiring. I won't defend that, but I think there was some chance of that ball clipping leg stump. Shami is in now"}, {"ball": 17.1, "isHighlight": false, "text": "Patel to Nadeem,1 run,gives himself room to drive it wide of long-off"}, {"ball": 17.2, "isHighlight": false, "text": "Patel to Mohammed Shami, $$OUT$$ ,He's gone! that's a straight ball, back of a length. Shami goes back and tries to work it with an extravagant twirl of his wrists but gets no bat on it as it sneaks through and hits top of middle-and-off"}, {"ball": 17.2, "isHighlight": false, "text": "$$Mohammed$$ $$Shami$$ $$b$$ $$Patel$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.3, "isHighlight": false, "text": "Patel to Imran Tahir,no run,pushed through, outside off, and Tahir defends off the back foot"}, {"ball": 17.4, "isHighlight": false, "text": "Patel to Imran Tahir,no run,straighter this time, and it's defended back to the bowler off the back foot"}, {"ball": 17.5, "isHighlight": false, "text": "Patel to Imran Tahir, $$FOUR$$ ,Patel bowls this wide of off stump, and Tahir throws his hands at it and cuts off the front foot"}, {"ball": 17.6, "isHighlight": false, "text": "Patel to Imran Tahir, $$OUT$$ ,he's holed out here. Tahir skips down the track, but doesn't get to the pitch, and he checks his shot a bit. It goes high in the air and drops into Rishi's hands at long-on"}, {"ball": 17.6, "isHighlight": false, "text": "$$Imran$$ $$Tahir$$ $$c$$ $$Dhawan$$ $$b$$ $$Patel$$ $$4$$ $$(2m$$ $$4b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to Unadkat, $$OUT$$ ,what a shot that is, but he's hit it straight to the fielder. Unadkat stays leg side of the ball, and slices it from a middle-stump line. It goes screaming off his bat, and it would have been four had it gone five yards in either direction. He's hit it straight to point, however, and Delhi are all out with 11 balls left to play."}, {"ball": 18.1, "isHighlight": false, "text": "$$JD$$ $$Unadkat$$ $$c$$ $$Maxwell$$ $$b$$ $$Johnson$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.1, "isHighlight": false, "text": "Daredevils were 91 for four at one point. They've lost their last six wickets for 24 runs. It's an abject collapse, and a sorry end to the batting part of their season. It's left their bowlers just 115 to defend, and while there's a bit of seam movement and bounce on this pitch, it's nowhere near being a challenging total. Still, this is cricket, and funny things have been known to happen. Can Daredevils defy the odds and pull off an incredible win, or will the table-toppers canter away with millions of overs to spare, or will rain have the final say? Stay tuned to find out."}], "name": "Kings XI Punjab v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734039.html?innings=1;view=commentary", "match_num": 55}