{"commentary": [{"ball": 0, "isHighlight": false, "text": "Raj: \"Bailey please make Maxwell open batting! Please! I've sat here waiting for him to bat! Please make this happen!!\""}, {"ball": 0, "isHighlight": false, "text": "You're not getting your wish, Raj. It's going to be Sehwag and Vohra, as usual. Shami will bowl the first over for Delhi."}, {"ball": 0.1, "isHighlight": false, "text": "Mohammed Shami to Sehwag,1 run,angles this in, and gets a bit of lift as well as away movement. Sehwag gets a thick edge down to third man"}, {"ball": 0.2, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 run,away movement again, and Vohra gets a thickish edge down to third man"}, {"ball": 0.3, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,shorter now, and Sehwag jumps up to defend back to the bowler"}, {"ball": 0.4, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,bouncer this time, and Sehwag ducks his head to let it go over him"}, {"ball": 0.5, "isHighlight": false, "text": "Mohammed Shami to Sehwag, $$FOUR$$ ,drifts towards the leg side this time, and Sehwag is on his toes to flick it off his hips past square leg"}, {"ball": 0.6, "isHighlight": false, "text": "Mohammed Shami to Sehwag, $$FOUR$$ ,lovely! that's back of a length, outside off, and Sehwag is on the jump again to help it with a straight bat between point and cover"}, {"ball": 1.1, "isHighlight": false, "text": "Unadkat to Vohra,2 runs,tries to loft on the up over long-off, mistimes it over extra cover, falls well short of the rope"}, {"ball": 1.2, "isHighlight": false, "text": "Unadkat to Vohra,no run,bouncer, and he sways out of the way"}, {"ball": 1.3, "isHighlight": false, "text": "Unadkat to Vohra,no run,shortish, widish, and Vohra punches that to point, who has to dive to his right to stop it"}, {"ball": 1.4, "isHighlight": false, "text": "Unadkat to Vohra,no run,slower ball, outside off, and a slightly overbalanced Vohra is on the walk as he pushes it towards point"}, {"ball": 1.5, "isHighlight": false, "text": "Unadkat to Vohra,no run,angled across Vohra again, on a good length, and that front foot doesn't quite come out of the crease as he pushes at it and is beaten"}, {"ball": 1.6, "isHighlight": false, "text": "Unadkat to Vohra,no run,better this time. Gets a decent stride in to meet it with his head over the ball and defend towards point"}, {"ball": 2.1, "isHighlight": false, "text": "Mohammed Shami to Sehwag,1 wide,poor ball, just doesn't come out right, and it slides well down the leg side"}, {"ball": 2.1, "isHighlight": false, "text": "Mohammed Shami to Sehwag,no run,slight bit of width outside off and Sehwag gets a lot of power into this backfoot punch. Point jumps in the air to field it on the bounce"}, {"ball": 2.2, "isHighlight": false, "text": "Mohammed Shami to Sehwag, $$OUT$$ ,got him! Sehwag tries that backfoot punch again, but his feet were cemented to the ground and he gets a thin outside edge as the ball seams away a touch, with a bit of extra bounce"}, {"ball": 2.2, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$†Karthik$$ $$b$$ $$Mohammed$$ $$Shami$$ $$9$$ $$(8m$$ $$7b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$128.57$$"}, {"ball": 2.2, "isHighlight": false, "text": "Here's Maxwell"}, {"ball": 2.3, "isHighlight": false, "text": "Mohammed Shami to Maxwell,1 leg bye,And here's Shami! That's a brutish short ball that rises up and hits the batsman on the shoulder as he tries to sway his head out of the way"}, {"ball": 2.4, "isHighlight": false, "text": "Mohammed Shami to Vohra,no run,slower ball, outside off, and it sneaks under Maxwell's bat as he tries to slog it away to midwicket"}, {"ball": 2.5, "isHighlight": false, "text": "Mohammed Shami to Vohra,no run,straighter this time, angled towards the top of off, and Maxwell pushes it carefully down to long-on with a bit of wrist"}, {"ball": 2.6, "isHighlight": false, "text": "Mohammed Shami to Vohra,2 runs,short, and Vohra gets it high on the bat as he tries to pull from outside off and the ball goes high in the air but drops beyond midwicket's reach as he runs towards the boundary"}, {"ball": 2.6, "isHighlight": false, "text": "Left-arm around now, for Unadkat"}, {"ball": 3.1, "isHighlight": false, "text": "Unadkat to Maxwell,no run,it's full, outside off, and Maxwell punches it powerfully but straight to point"}, {"ball": 3.2, "isHighlight": false, "text": "Unadkat to Maxwell, $$OUT$$ ,Maxwell's gone for a duck! it's short and outside off, and Maxwell tries to pull it but ends up slicing a simple catch to KP on the edge of the circle at mid-off"}, {"ball": 3.2, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Pietersen$$ $$b$$ $$Unadkat$$ $$0$$ $$(5m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 3.2, "isHighlight": false, "text": "That Shami bouncer, and even this awkward dismissal off Unadkat, will alert Maxwell and Kings XI Punjab's opponents in the knockouts. Here's Miller now"}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Miller,no run,and he's greeted by a monster of a ball. It rises from just short of a good length, and he's hit on the gloves as he pushes at it off the front foot"}, {"ball": 3.4, "isHighlight": false, "text": "Unadkat to Miller,no run,this one comes back in off the seam, from outside off, and Miller moves his body and bat out of the way to let it pass over the stumps"}, {"ball": 3.5, "isHighlight": false, "text": "Unadkat to Miller,no run,he's back and across this time to defend it solidly"}, {"ball": 3.6, "isHighlight": false, "text": "Unadkat to Miller,1 run,bit of inward movement from outside off, and Miller is out of his crease to play a defensive push to mid-on"}, {"ball": 4.1, "isHighlight": false, "text": "Mohammed Shami to Miller,no run,that's full and outside off, and Miller comes forward to play the checked drive to mid-off"}, {"ball": 4.2, "isHighlight": false, "text": "Mohammed Shami to Miller,1 run,pitches on leg and straightens towards leg stump from just back of a length. Miller pushes it to mid-on"}, {"ball": 4.3, "isHighlight": false, "text": "Mohammed Shami to Vohra,1 run,that's an awkward-looking shot from Vohra. It was short, but not short enough for the ramp shot, and he ends up hitting it much squarer than he expected, just behind point"}, {"ball": 4.4, "isHighlight": false, "text": "Mohammed Shami to Miller,1 wide,short, rising ball, and DK takes it with his right glove stretched way above his head. It's called wide, and quite right too. It went well over Miller's head as he pulled away from it"}, {"ball": 4.4, "isHighlight": false, "text": "Mohammed Shami to Miller, $$SIX$$ ,slower ball, was it? Miller comes down the track, giving himself a bit of room, and cracks it over mid-off, almost flat-bats it"}, {"ball": 4.5, "isHighlight": false, "text": "Mohammed Shami to Miller,no run,pushed across Miller from back of a length, defended towards mid-off off the back foot"}, {"ball": 4.5, "isHighlight": false, "text": "goes around the wicket now"}, {"ball": 4.6, "isHighlight": false, "text": "Mohammed Shami to Miller, $$FOUR$$ ,change of angle doesn't work. Drifts onto Miller's pads, and he tickles it very fine"}, {"ball": 4.6, "isHighlight": false, "text": "Neesham comes in now"}, {"ball": 5.1, "isHighlight": false, "text": "Neesham to Vohra,no run,angled towards off stump from back of a length, defended towards point"}, {"ball": 5.2, "isHighlight": false, "text": "Neesham to Vohra, $$FOUR$$ ,didn't quite get hold of it as he tried to pull this from outside off. It was short and rising, and he gets it high on the bat. Was looking towards deep midwicket, but it goes over mid-on instead"}, {"ball": 5.3, "isHighlight": false, "text": "Neesham to Vohra,no run,gives himself room and tries to slash this short ball but misses"}, {"ball": 5.4, "isHighlight": false, "text": "Neesham to Vohra, $$FOUR$$ ,this short length is getting predictable. This one's in the perfect slot for the slash over point, and he gives himself room and executes it perfectly"}, {"ball": 5.5, "isHighlight": false, "text": "Neesham to Vohra,4 leg byes,slides this down the leg side this time, and Vohra gets a bit of thigh pad on this to send it screaming past a diving DK"}, {"ball": 5.6, "isHighlight": false, "text": "Neesham to Vohra, $$SIX$$ ,this one isn't short, but it's a half-volley, and Vohra clears his front leg to swing freely through the line and launch that over mid-off. It's hit the rope (or the prism-shaped advertising thingy, whatever it's called) on the full"}, {"ball": 5.6, "isHighlight": false, "text": "Duminy now, offspin from right-arm around"}, {"ball": 6.1, "isHighlight": false, "text": "Duminy to Miller,no run,Miller tries to flick this off his pads, gets an inside edge onto them instead"}, {"ball": 6.2, "isHighlight": false, "text": "Duminy to Miller,1 run,that's a wide full-toss, and Miller slaps it straight to the sweeper on the off-side boundary"}, {"ball": 6.2, "isHighlight": false, "text": "stays around the wicket to the right-hander"}, {"ball": 6.3, "isHighlight": false, "text": "Duminy to Vohra, $$FOUR$$ ,that's full, on off stump, and Vohra stretches forward, gets his foot next to the line to make room for the swing of the arms and lofts it nicely over extra cover"}, {"ball": 6.4, "isHighlight": false, "text": "Duminy to Vohra,no run,dropped! that was hit hard, straight back to the bowler, and it hit his fingers and dropped onto the pitch"}, {"ball": 6.5, "isHighlight": false, "text": "Duminy to Vohra,1 run,worked off the pads towards square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Miller,5 wides,down the leg side, and Miller misses his paddle, and an unsighted DK misses the ball"}, {"ball": 6.6, "isHighlight": false, "text": "Duminy to Miller,1 run,full, on the stumps, driven down to long-on"}, {"ball": 6.6, "isHighlight": false, "text": "spin, and South Africans, from both ends now. Tahir"}, {"ball": 7.1, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,straightens from a stump-to-stump line, and it's worked with a turn of the wrists to long-on"}, {"ball": 7.2, "isHighlight": false, "text": "Imran Tahir to Vohra,no run,wrong 'un, hurries into Vohra, but he seems to have read it, and he defends it calmly with a twirl of the wrists"}, {"ball": 7.3, "isHighlight": false, "text": "Imran Tahir to Vohra,no run,this one goes straight on, towards the pads, and it's jammed down towards midwicket"}, {"ball": 7.4, "isHighlight": false, "text": "Imran Tahir to Vohra,1 run,that's not too short, and not too wide, but Miller's made himself a lot of room to slash that uppishly but safely past point"}, {"ball": 7.5, "isHighlight": false, "text": "Imran Tahir to Miller, $$FOUR$$"}, {"ball": 7.6, "isHighlight": false, "text": "Imran Tahir to Miller,no run,that skids on again. From outside leg towards leg stump, and he defends towards cover"}, {"ball": 8.1, "isHighlight": false, "text": "Duminy to Vohra,1 run,tossed up, outside off, Miller aims a big drive at it but gets an inside edge into the pitch"}, {"ball": 8.2, "isHighlight": false, "text": "Duminy to Miller,no run"}, {"ball": 8.3, "isHighlight": false, "text": "Duminy to Miller,no run,comes forward and inside the line, opens his bat face to steer it towards point"}, {"ball": 8.4, "isHighlight": false, "text": "Duminy to Miller,1 run,length ball, swept towards square leg"}, {"ball": 8.5, "isHighlight": false, "text": "Duminy to Vohra,1 run,shortish ball, on the stumps, and it's tucked away towards wide long-on"}, {"ball": 8.6, "isHighlight": false, "text": "Duminy to Miller,no run,goes with the angle, towards the stumps, and Miller comes forward to defend back to the bowler"}, {"ball": 8.6, "isHighlight": false, "text": "They've taken a time-out now, and Gautham is on hand to show me the light of knowledge. \"Its called the boundary cushions...Get with it man!\""}, {"ball": 9.1, "isHighlight": false, "text": "Imran Tahir to Vohra,1 run,back of a length, on off stump, skids straight on. Vohra opens his bat-face and dabs it to short third man"}, {"ball": 9.2, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,googly, I think. It was tossed up on leg stump, and Miller sweeps it hard to deep backward square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Imran Tahir to Vohra,1 run,Vohra is a lucky boy. Didnt pick the googly, and his attempt at driving inside-out over cover ends up looping over mid-off's head. Safe, though."}, {"ball": 9.4, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,straight, on the stumps, and Miller is forward to drive to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Imran Tahir to Vohra,no run,beauty! that was tossed up, and it dipped on Vohra and turned viciously past his outside edge"}, {"ball": 9.6, "isHighlight": false, "text": "Imran Tahir to Vohra,1 wide,and he's followed that with a rubbish ball. Skids on with the angle, and goes down the leg side"}, {"ball": 9.6, "isHighlight": false, "text": "Imran Tahir to Vohra, $$FOUR$$ ,that's tossed up once more, outside off, and Vohra gets a good stride out to square-drive that past point"}, {"ball": 9.6, "isHighlight": false, "text": "Left-arm spin, for the first time. It's Shahbaz Nadeem, bowling left-arm over to Miller"}, {"ball": 10.1, "isHighlight": false, "text": "Nadeem to Miller,1 run,down the pitch, and he doesn't quite get to the pitch. It turns a bit, and he swings it around between long on and deep midwicket. He was looking to hit down the ground, I think"}, {"ball": 10.1, "isHighlight": false, "text": "left-arm around to the right-hander"}, {"ball": 10.2, "isHighlight": false, "text": "Nadeem to Vohra, $$SIX$$ ,and he's picked that up, easily, effortlessly, from outside off and launched it over long-on"}, {"ball": 10.3, "isHighlight": false, "text": "Nadeem to Vohra,1 run,short ball, and Vohra opens his body completely and swats that, with a bit of a flick of the wrist right at the end, to deep backward square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Nadeem to Miller,2 runs,turns into Miller from outside off, and he tucks it off his pads to the left of deep square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Nadeem to Miller,1 run,slow length ball, and Miller reaches out to sweep it to deep square leg"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to Vohra,1 wide,poor bowling, this. pitches leg, continues with the angle, goes way down the leg side"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to Vohra,2 runs,short ball, and Vohra punches it to the right of the off-side sweeper"}, {"ball": 10.6, "isHighlight": false, "text": "Nishant Vats: \"I am from Delhi.. and I wish there was a relegation option here in the IPL which could have allowed DD to be relegated and instead introduce new teams from Ranji T20 team.. if possible\""}, {"ball": 11.1, "isHighlight": false, "text": "Imran Tahir to Miller,2 runs,a bit of turn, from stump-to-stump, and Miller flicks it off his pads to deep square leg"}, {"ball": 11.2, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,gives himself room to drive through the off side, gets a thick inside edge that runs towards deep midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "Imran Tahir to Vohra,no run,that's full, and on the pads, and Vohra flicks against the turn to midwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Imran Tahir to Vohra,1 run,tossed up, on off stump, and Vohra swats across the line, doesn't git it particularly cleanly, down to deep square leg"}, {"ball": 11.5, "isHighlight": false, "text": "Imran Tahir to Miller,no run,googly, and Miller comes down the track and defends into the off side"}, {"ball": 11.6, "isHighlight": false, "text": "Imran Tahir to Miller,1 wide,whoa. What happened there? That was another googly, but he loses his radar completely and slides it full and almost on top of the tram-line outside off stump"}, {"ball": 11.6, "isHighlight": false, "text": "Imran Tahir to Miller, $$FOUR$$ ,another googly, and Miller edges it wide of the keeper as he tries to launch it over cover"}, {"ball": 12.1, "isHighlight": false, "text": "Nadeem to Vohra,no run,length ball, on the stumps, defended towards mid-on, fielded by the bowler"}, {"ball": 12.2, "isHighlight": false, "text": "Nadeem to Vohra,no run,drops it a touch short, and Vohra makes himself room to punch it to cover"}, {"ball": 12.3, "isHighlight": false, "text": "Nadeem to Vohra,3 runs,tossed up, and Vohra comes forward, knowing he won't get to the pitch of it. He simply goes through with the shot, and chips the ball over extra cover"}, {"ball": 12.4, "isHighlight": false, "text": "Nadeem to Miller,2 runs,that's wide of leg stump, and Miller sweeps, or helps this along to deep fine leg"}, {"ball": 12.5, "isHighlight": false, "text": "Nadeem to Miller, $$FOUR$$ ,makes room this time, and lifts this length ball over cover. Trickles slowly over the boundary cushions"}, {"ball": 12.6, "isHighlight": false, "text": "Nadeem to Miller,1 run,down the pitch, and Nadeem shortens his length. Miller flat-bats that to long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Gaurav Manchand: \"Duminy has been DD's most economical in this season.\" Yes, he is, if you discount Coulter-Nile, who only bowled four overs before getting injured. Tells you all you need to know about Delhi's season"}, {"ball": 13.1, "isHighlight": false, "text": "Imran Tahir to Miller,1 run,short, turns in from outside off, punched towards cover"}, {"ball": 13.2, "isHighlight": false, "text": "Imran Tahir to Vohra, $$OUT$$ ,got him! Pitches wide outside off and the googly spins back viciously to knock back off stump as Vohra misses the cut. The rain starts coming down concurrently, quite heavily, and the players go off the field"}, {"ball": 13.2, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$b$$ $$Imran$$ $$Tahir$$ $$47$$ $$(59m$$ $$38b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$123.68$$"}, {"ball": 13.2, "isHighlight": false, "text": "What a time for a rain interruption. They only needed four runs! Oh, wait. They've come back on. Bailey is in."}, {"ball": 13.2, "isHighlight": false, "text": "avi: \"Even GOD is crying watching this performance of Delhi Daredevils...\""}, {"ball": 13.3, "isHighlight": false, "text": "Imran Tahir to Bailey,1 run,Bailey is down the pitch to this, and he flicks it to deep midwicket from outside off"}, {"ball": 13.3, "isHighlight": false, "text": "KP (I assume it's the same one): \"Who is ahead on D/L?\""}, {"ball": 13.4, "isHighlight": false, "text": "Imran Tahir to Miller,no run,short, turns in from outside off, and Miller slaps it straight to cover"}, {"ball": 13.5, "isHighlight": false, "text": "Imran Tahir to Miller, $$SIX$$ ,That's the winning hit, and it's an emphatic winning hit. It's tossed up on the stumps, and Miller's slog-swept that out of the planet."}, {"ball": 13.5, "isHighlight": false, "text": "$$Presentation$$ $$time$$  George Bailey: \"The way Awana and Mitchie bowled, that set the tone. We'll go back to basics now. It doesn't matter what order you finish. Everyone starts from zero come finals time.\""}, {"ball": 13.5, "isHighlight": false, "text": "Bailey also asked what a bowler has to do to win Man of the Match, and, well, bowling Delhi out for 115 isn't the answer to his question.  $$Manan$$ $$Vohra$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$"}, {"ball": 13.5, "isHighlight": false, "text": "\"It's my home ground, so it's always fun to bat out there,\" Vohra says. \"I guess the management had a better plan for me. I was just waiting for my turn. I knew when I get a chance I could do something special. Players like Maxwell, David Miller, George, Viru pa. They're strokeplayers, and it gives me the freedom to go after the bowling.\""}, {"ball": 13.5, "isHighlight": false, "text": "That's it from us for this game. Pop over  $$here$$  for our live commentary from the Mumbai-Rajasthan game, which will begin very very soon. Thanks for tuning in, and for posting your comments."}, {"ball": 13.5, "isHighlight": false, "text": "ramu: \"2 overs for Unadakat. KP, are you kidding me? 2-0-3-1\""}, {"ball": 13.5, "isHighlight": false, "text": "Viru is beaming as he comes out to shake hands with his former teammates. Daredevils might wonder if they were better off with their bespectacled basher on their side. But then, they didn't do particularly well last season either."}, {"ball": 13.5, "isHighlight": false, "text": "It's been a crushing defeat for Daredevils in their last match of the season. Ninth straight defeat for them, and they've lost all nine matches they've played in India this season. Lots of soul-searching to do, because you'd think, looking through their squad, that they have too many good players to perform this poorly."}, {"ball": 13.5, "isHighlight": false, "text": "$$Kevin$$ $$Pietersen$$ $$apologises$$ $$to$$ $$Delhi's$$ $$fans$$  He says they batted poorly, and shouldn't have posted such a low total on this pitch. He then sums up the season: \"It's been an enjoyable experience, but on the field there's been a lot of not-so-good stuff.\""}], "name": "Kings XI Punjab v Delhi Daredevils", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734039.html?innings=2;view=commentary", "match_num": 55}