{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8.00$$ $$pm$$  Royals are not pulling back their punches (in the experimenting department either). Shane Watson and Sanju Samson are their openers. Corey Anderson has the new ball in hand. Dibbly-dobbly medium pace to start off a must-win match"}, {"ball": 0, "isHighlight": false, "text": "Jiten Surtani: \"Dream - I can imagine Ravi Shastri screaming at the time of the toss... Mumbaaaaiiiiiiiii ! Its the Royals in blue paying a visit to the Indians in blue....for a spot in the playoffs.... all the reasons to get glued ....!!\""}, {"ball": 0, "isHighlight": false, "text": "Sandy: \"@Chirag and Commentrator: how selfish you guys are people waiting for this crunch game and you want to spoil that party...how cheap :P\" Perhaps, but who wouldn't like a day off from work?"}, {"ball": 0, "isHighlight": false, "text": "\"@adhitya - Really? You are complaining about typing effort to cricinfo guys who are looking at typing for the next 40 overs?\" Sam shall be the man I pick to defend me in a duel to the death. I've obviously been watching Game of Thrones too much"}, {"ball": 0, "isHighlight": false, "text": "\"I don't understand why everyone wants Steven Smith in the team ( I am not forgetting his match winning innings). But had hodge not be injured Smith would not have even gotten his chance. As for the other foreign players : Watson - captain. Faulkner - A very important all rounder as is Kevon cooper(His death bowling is also useful) So I think this is the best team. IF Samson plays like how he started the season, then team is very well balanced. Hey @cricinfo, I took a lot of effort to write this,\" labours Adhithya S R. We appreciate your interest and also it was only six-odd lines."}, {"ball": 0, "isHighlight": false, "text": "Naren: \"Abhishek has been the most terrible player from Rajasthan and for such a key game. No Steve Smith too.\" I wouldn't worry about Nayar too much. He tends to step up, but benching Smith does seem like they're leaving themselves a tougher challenge"}, {"ball": 0, "isHighlight": false, "text": "Adway Lele: \"Corey is in. That means MI seems to be looking to bat-out RR. Don't care what you score, 5 of us will go for it.\""}, {"ball": 0, "isHighlight": false, "text": "Daud: \"Watson has been poor with the bat this year, he needs to score big today. A captains knock.\" He liked the look of the pitch tonight. Wonder if that's any indication"}, {"ball": 0, "isHighlight": false, "text": "chirag: \"I hope it rains there ,then RR will go through play-offs and i can also study for my end sem instead ! \" And I can take an early day."}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$ $$Mumbai$$ $$Indians$$  have won the toss and a  $$huge$$  roar goes around the ground. They have  $$decided$$ $$to$$ $$field$$ .  \"It's a good toss to win because we know the equation. One change:  $$Corey$$ $$Anderson$$ $$in$$  for Marchant de Lange. I have a very good feeling tonight,\" says  $$Rohit$$ $$Sharma$$  at the toss. \"Great opportunity now. After losing all our games in UAE, we've shown we can do anything. The pitch looks a little dry, but it won't change much\""}, {"ball": 0, "isHighlight": false, "text": "\"It's come down to the last game of the tournament and we've just got to play our absolute best,\" says  $$Shane$$ $$Watson$$ . \"Everyone's fit. Bit of pace and bounce, bit of nip for the spinners. It's going to be a good cricket wicket. This is what excites all players to be involved in games like this. A knockout scenario. Majority of the time we've been pretty consistent. We've been trying out a few combinations, today we have three changes:  $$Abhishek$$ $$Nayar$$ $$in$$ $$for$$ $$Stuart$$ $$Binny,$$ $$Dhawal$$ $$Kulkarni$$ $$for$$ $$Vikram$$ $$Malik$$ $$and$$ $$Ankit$$ $$Sharma$$ $$for$$ $$Rahul$$ $$Tewatia$$ \""}, {"ball": 0, "isHighlight": false, "text": "$$7.20$$ $$pm$$  \"Mumbai need to be beat Royals by a margin of at least 42 runs batting first, or chase down a target in the region of 130-201 in 87 balls to move up on net run rate,\" says our  $$preview$$  by Rachna Shetty"}, {"ball": 0, "isHighlight": false, "text": "\"This is effectively a 20-15, not 20-20 match,\" opines Murali, who is presumably a Mumbai fan. He'll be pleased to know the home side is rather relaxed in their huddle. Rohit and Wright are grinning away. This is Wankhede stadium. They know that this is their fortress. The head-to-head though is 2-2."}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  It didn't look like it. The script as recent as last week ran something like: Rajasthan Royals cruise into the playoffs and Mumbai Indians contemplate how it all went pear shaped. And the fans would have been treated to a slew of dead rubbers (Yay!). But you can never count on the IPL to follow the predictable. Royals are still on the outside looking in, but a win would be enough to push them into the top four. Mumbai though have to mind net run-rate and those big hitters would be working overtime tonight."}, {"ball": 0, "isHighlight": false, "text": "-------------------------"}, {"ball": 0, "isHighlight": false, "text": "The league phase ends today. Not just at the IPL, but at CricIQ as well. And just like the IPL, it has come down to the last day... Today is your last chance to scramble onto the Powerplay leaderboard and stay in the running for the big prize - the chance to watch India v England at Lord's this summer.  $$Make$$ $$your$$ $$last$$ $$chance$$ $$count.$$"}, {"ball": 0.1, "isHighlight": false, "text": "Anderson to Watson,1 run,strays a little close to his pads and a little bit of nip inward allows Watson to glance it to long leg"}, {"ball": 0.1, "isHighlight": false, "text": "One slip in place. Four men in the ring on the off side"}, {"ball": 0.2, "isHighlight": false, "text": "Anderson to Samson,no run,better line and that inswing is more threatening. Samson knows it is seeking the base of middle and plays late and pushes to mid-off"}, {"ball": 0.3, "isHighlight": false, "text": "Anderson to Samson, $$FOUR$$ ,wonderfully timed! Anderson continues getting the ball to dart in, but Samson strides forward and drives with more or less a straight bat to the right of mid-on"}, {"ball": 0.4, "isHighlight": false, "text": "Anderson to Samson,no run,full and wide, Samson might have wanted to glide it away but then thinks better of it"}, {"ball": 0.5, "isHighlight": false, "text": "Anderson to Samson,no run,good length ball with a bit of width, Samson drives to point and Pollard unleashes a throw to keep the non-striker on his toes"}, {"ball": 0.6, "isHighlight": false, "text": "Anderson to Samson,no run,chases at a fuller one angled across him and misses."}, {"ball": 0.6, "isHighlight": false, "text": "Jasprit Bumrah, with a slip in"}, {"ball": 0.6, "isHighlight": false, "text": "Indranil: \"What turned out to be quite amusing and pleasant is really frustrating now..RR and there experimentation..Watto at top is welcomed though..so now will karun come one down or rahane or cooper or ankit sharma???...won't be shocked if Tambe comes either\""}, {"ball": 1.1, "isHighlight": false, "text": "Bumrah to Watson,no run,just back of a length and angled in, as he so often does. Watson allows it through to the keeper"}, {"ball": 1.2, "isHighlight": false, "text": "Bumrah to Watson,no run,strides forward to block a full delivery angling into leg stump. Almost had to play around his front pad there. That's Watto's weakness"}, {"ball": 1.3, "isHighlight": false, "text": "Bumrah to Watson,no run,watchfully left alone outside off stump with Bumrah keeping to a fuller length"}, {"ball": 1.4, "isHighlight": false, "text": "Bumrah to Watson,no run,141kph, wanted to defend that but prefers to shoulder arms as the back of a length ball skids off the deck"}, {"ball": 1.5, "isHighlight": false, "text": "Bumrah to Watson,no run,142kph, solid front foot step to defend this good length ball on off stump. Pollard won't let it go through"}, {"ball": 1.6, "isHighlight": false, "text": "Bumrah to Watson,no run,144kph, can he really bowl that fast?! This was a fuller one outside off so Watson doesn't bother with it. Looks like he wants to settle before bringing out those booming drives"}, {"ball": 2.1, "isHighlight": false, "text": "Anderson to Samson,no run,appreciable swing there and the length was quite good too. Cramped him up as he was looking for midwicket. Mild appeal, but it was too high and sliding down leg"}, {"ball": 2.2, "isHighlight": false, "text": "Anderson to Samson,1 run,invites him on the drive and Samson obliges. Unleashes a straight bat and had to take it on the up, but it seems he hasn't timed it quite as well. Only dribbles down to mid-off"}, {"ball": 2.3, "isHighlight": false, "text": "Anderson to Watson,no run,Watson lunges on the front foot now and drives into the covers. Anderson flitting between the inswinger and working the angle across the right-hander"}, {"ball": 2.4, "isHighlight": false, "text": "Anderson to Watson,1 leg bye,directed the good length inswinger on leg stump and Watson is happy to collect a leg bye in front of square leg"}, {"ball": 2.5, "isHighlight": false, "text": "Anderson to Samson, $$FOUR$$ ,almost! Gopal was at short third man and he takes a few paces to his left and pushes out his left hand to try and catch the outside edge of Samson's lashing blade."}, {"ball": 2.6, "isHighlight": false, "text": "Anderson to Samson, $$FOUR$$ ,much better this time and he did benefit from enough width and a fuller length to lean into the drive. Sliced between point and third man"}, {"ball": 3.1, "isHighlight": false, "text": "Bumrah to Watson,no run,142kph, almost in the slot and Watson looks drill it down the ground. But though the shot looked really good, it doesn't travel off the pitch so quickly"}, {"ball": 3.2, "isHighlight": false, "text": "Bumrah to Watson,no run,good lenght ball on and around off stump, opens the face to find point"}, {"ball": 3.3, "isHighlight": false, "text": "Bumrah to Watson,no run,136kph, this is a full toss on middle, Watson finds mid-on! He'd be sorely disappointed with that"}, {"ball": 3.4, "isHighlight": false, "text": "Bumrah to Watson,1 run,fullish and the width is exploited with a guide to deep third man. That's first runs off Bumrah in nine balls"}, {"ball": 3.4, "isHighlight": false, "text": "Sasikanth: \"Rahane is gonna be of little use in the middle order..and I though Ojha would have been a better bet to start things off..especially with Watto opening the innings..not the greatest of innovations by both the teams here..\""}, {"ball": 3.5, "isHighlight": false, "text": "Bumrah to Samson,no run,seeks the yorker and I think it ended up a low full toss. Samson keeps it out"}, {"ball": 3.6, "isHighlight": false, "text": "Bumrah to Samson, $$FOUR$$ ,and we thought Watson would teach Samson. This full toss is elegantly punched through the covers. Little effort, maximum reward"}, {"ball": 3.6, "isHighlight": false, "text": "Ojha now"}, {"ball": 4.1, "isHighlight": false, "text": "Ojha to Watson,1 run,tossed up on middle and leg, Watson eases it through midwicket"}, {"ball": 4.2, "isHighlight": false, "text": "Ojha to Samson,no run,good length ball on middle, defended"}, {"ball": 4.3, "isHighlight": false, "text": "Ojha to Samson,1 wide,looks to step outside leg and Ojha follows him. Samson wanted that, I think, but his sweep doesn't connect"}, {"ball": 4.3, "isHighlight": false, "text": "Ojha to Samson,no run,drifts into middle and leg, Samson looks to nudge it around his front pad"}, {"ball": 4.4, "isHighlight": false, "text": "Ojha to Samson, $$SIX$$ ,all the way! Samson has always sparkled and this is an effortless sweep that carries beyond the boundary"}, {"ball": 4.5, "isHighlight": false, "text": "Ojha to Samson,1 run,backs away and punches it through extra  cover. Predictably Ojha went flat and quick"}, {"ball": 4.6, "isHighlight": false, "text": "Ojha to Watson,1 run,worked off the pads towards the region of square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Harbhajan in at the other end"}, {"ball": 4.6, "isHighlight": false, "text": "Prakash Venna: \"Wt is sachin saying on mic? Im in office so on mute\" Said Samson has good temperement, spoke of the dynamics of being in the opposite dressing room from Dravid and that this has been a very good start for Mumbai"}, {"ball": 5.1, "isHighlight": false, "text": "Harbhajan Singh to Watson, $$FOUR$$ ,starts off with a terrible delivery. Short ball pushed down leg and Watson sweep-pulls it well fine of square leg. Loads of power in that"}, {"ball": 5.2, "isHighlight": false, "text": "Harbhajan Singh to Watson,no run,another flatter one, seemed to be the topspinner. Watson went back to pull but the extra bounce is too much for him"}, {"ball": 5.3, "isHighlight": false, "text": "Harbhajan Singh to Watson, $$OUT$$ ,this is slower and it's a little more tossed up. Watson came down the track and skewed the loft. Pollard raced in and dived forward to take a good, low catch. Explodes in a Guitar Hero-like celebration. Wankhede  breaks the sound barrier"}, {"ball": 5.3, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$c$$ $$Pollard$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$8$$ $$(22m$$ $$18b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$44.44$$"}, {"ball": 5.3, "isHighlight": false, "text": "Karun Nair is at No. 3"}, {"ball": 5.4, "isHighlight": false, "text": "Harbhajan Singh to Samson,no run,keeps it slow and around off stump, Nair goes back and blocks"}, {"ball": 5.5, "isHighlight": false, "text": "Harbhajan Singh to Samson,no run,flighted on middle, Samson comes forward to block"}, {"ball": 5.6, "isHighlight": false, "text": "Harbhajan Singh to Samson,1 run,saw the batsman moving around in the crease and pushed it full and flat. Samson bunts it down to long-on"}, {"ball": 6.1, "isHighlight": false, "text": "Ojha to Samson,no run,flighted on middle, Samson stays beside it and blocks with an open face"}, {"ball": 6.2, "isHighlight": false, "text": "Ojha to Samson,1 run,goes back and flicks it through midwikcet."}, {"ball": 6.2, "isHighlight": false, "text": "Arjuna: \"This wicket might actually be a good thing for RR. Watto was not timing the ball at all. They should send Hodge why nair??\""}, {"ball": 6.3, "isHighlight": false, "text": "Ojha to Nair,no run,loopy delivery on middle, Nair pushes back to the bowler"}, {"ball": 6.4, "isHighlight": false, "text": "Ojha to Nair,no run,steps forward and times a push towards mid-off rather nicely"}, {"ball": 6.5, "isHighlight": false, "text": "Ojha to Nair,1 run,flighted on middle, Nair employs a shot that has been highly productive for him. Swept to deep square leg"}, {"ball": 6.6, "isHighlight": false, "text": "Ojha to Samson,1 run,steps down and there is a little bit of hesitation after he pushes into the covers. Not bad enough to stop the single from being taken"}, {"ball": 6.6, "isHighlight": false, "text": "deepak: \"Mumbai should play with some strategy here.. dont take more than 5 wickets.. Rajasthan actually start batting only after then..\""}, {"ball": 6.6, "isHighlight": false, "text": "chirag: \"@Arjuna,Why would you bring your reliable finisher in the 6th over who is also not a very good player of spin bowling ?\""}, {"ball": 7.1, "isHighlight": false, "text": "Harbhajan Singh to Samson,1 run,pushed down to long-on as he goes deep in the crease"}, {"ball": 7.1, "isHighlight": false, "text": "Rahane is under the helmet in the dugout"}, {"ball": 7.2, "isHighlight": false, "text": "Harbhajan Singh to Nair,no run,slower through the air and it doesn't turn as Nair expects. Dabbed down the pitch"}, {"ball": 7.3, "isHighlight": false, "text": "Harbhajan Singh to Nair,1 run,flighted outside off, driven to long-off. With every ball bowled, Faulkner and Hodge's job is getting tougher"}, {"ball": 7.4, "isHighlight": false, "text": "Harbhajan Singh to Samson,2 runs,goes for a reverse sweep and it has been placed well enough to collect a quick couple."}, {"ball": 7.5, "isHighlight": false, "text": "Harbhajan Singh to Samson,no run,attempted to make some room to scythe the tossed up delivery over extra cover, but the ball straightens instead of spinning in. Beats him"}, {"ball": 7.6, "isHighlight": false, "text": "Harbhajan Singh to Samson,1 run,pushed down to long-on as he holds his length back and that brings us to a time-out. Will Royals come out of it with a bit more intent?"}, {"ball": 7.6, "isHighlight": false, "text": "Siva: \"Never seen watto bat like this. RR looks like very much shaken up! \""}, {"ball": 7.6, "isHighlight": false, "text": "Shreyas Gopal into the attack"}, {"ball": 7.6, "isHighlight": false, "text": "nandeesh: \"Harbhajan is way better than Ashwin... 1. He knows the basics of off spin very well but Ashwin has already forgotten it 2. He bowls over the wicket which ashwin never does 3. Flight and deception sometimes which ashwin never does 4. He took the maxwell's wicket with ease but Ashwin couldn't crack the tactic for maxwell even for the second time 5. Doosra vs Carrom but carrom has been ripped apart by maxwell 6. Experience 7. Harbhajan never gets frightened when someone hits him a six, he manages to stick to his basics ( ex. wickets of Maxwell and Gayle)\""}, {"ball": 8.1, "isHighlight": false, "text": "Gopal to Samson,1 run,keeps nice and tight on middle, punched down to long-on"}, {"ball": 8.2, "isHighlight": false, "text": "Gopal to Nair,1 run,went back in his crease and finds it wasn't as short as he thought. Adjusts from his pull to a short armed jab to midwicket"}, {"ball": 8.3, "isHighlight": false, "text": "Gopal to Samson,1 run,we have a direct hit from third man and the third umpire gets some work. Although the excitement is all for nothing as Nair was in safely"}, {"ball": 8.4, "isHighlight": false, "text": "Gopal to Nair,1 run,flighted and drifting in on leg, flicked through midwicket"}, {"ball": 8.5, "isHighlight": false, "text": "Gopal to Samson, $$SIX$$ ,picked out the flighted on and mauled it over square leg. Slog sweep with such immense power."}, {"ball": 8.6, "isHighlight": false, "text": "Gopal to Samson,no run,tossed up on off stump, defended with an open face"}, {"ball": 8.6, "isHighlight": false, "text": "Rajib: \"Similarities between Harbhajan and Ashwin: both dont get wicket overseas\""}, {"ball": 8.6, "isHighlight": false, "text": "jignesh: \"@nandeesh, mostly correct ... regarding #7 ... bhajji starts bowling flat when he gets hit ... that's why he lost his mojo and national team spot. Bhajji mostly performed when he was playing with Jumbo. He is not a lead spinner material, sadly!\""}, {"ball": 8.6, "isHighlight": false, "text": "Guitar hero into the attack"}, {"ball": 8.6, "isHighlight": false, "text": "Nandeesh: Your comment got posted not because you're right, but cuz its going to provide fodder for more comments to follow.\" Anjan must have spies in the office"}, {"ball": 9.1, "isHighlight": false, "text": "Pollard to Nair,2 runs,he backtracks on and on as fast as he could, but the ball lobs over his head. Bumrah could have made a better effort. This was a slower short ball and resulted in a thick top edge"}, {"ball": 9.2, "isHighlight": false, "text": "Pollard to Nair,1 leg bye,wore this short ball on the stomach. Another short ball with no pace on it and this pitch is aiding those efforts"}, {"ball": 9.3, "isHighlight": false, "text": "Pollard to Samson,1 run,full and into the pads, Samson clips it behind square leg"}, {"ball": 9.4, "isHighlight": false, "text": "Pollard to Nair,no run,fullish and outside off, driven into the covers. Looks quite correct, this fellow"}, {"ball": 9.5, "isHighlight": false, "text": "Pollard to Nair,1 run,slower ball with a bit of width, Nair has to made the pace as he cuts towards point"}, {"ball": 9.6, "isHighlight": false, "text": "Pollard to Samson,1 run,took it from way outside off stump and pulls it to deep midwicket. Struck it reasonably well too"}, {"ball": 9.6, "isHighlight": false, "text": "arun: \"Its time to groom another spinner....both harbhajan and ashwin thrive in friendly conditions . period\""}, {"ball": 10.1, "isHighlight": false, "text": "Gopal to Samson,1 run,stopped on him as he was looking to knock it away into the leg side. The ball goes in the air, but is well beyond the bowler's reach"}, {"ball": 10.2, "isHighlight": false, "text": "Gopal to Nair, $$SIX$$ ,and another one! Gopal seems to be the one that's got to go. This was flighted right where Nair wanted it and launches him over deep midwicket. Slog sweep paying dividends again"}, {"ball": 10.3, "isHighlight": false, "text": "Gopal to Nair, $$FOUR$$ ,split the gap between deep midwicket and long-on as Gopal goes short and flat. He was waiting for it and thought he didn't time it as well as the last shot."}, {"ball": 10.4, "isHighlight": false, "text": "Gopal to Nair,no run,held it back just a touch and Nair steps forward to block. Takes a bit of a leading edge into the off side"}, {"ball": 10.5, "isHighlight": false, "text": "Gopal to Nair, $$FOUR$$ ,goes for the reverse sweep and gets the smallest connection to beat the keeper to dribble away to the third man boundary"}, {"ball": 10.6, "isHighlight": false, "text": "Gopal to Nair, $$FOUR$$ ,that is spectacular! Full and on the pads and Nair responds with a punch. It had no follow through, yet the strength of his bottom hand has sent the ball skimming to the midwicket boundary."}, {"ball": 11.1, "isHighlight": false, "text": "Pollard to Samson,1 run,doesn't bother with any pace on the ball. Samson has to wait ages before pushing down to long-on"}, {"ball": 11.2, "isHighlight": false, "text": "Pollard to Nair, $$FOUR$$ ,carved over cover. Why would they fiddle with Nair's batting position when he is in such good form. This was full and had enough room outside off to be lifted for a one-bounce four"}, {"ball": 11.3, "isHighlight": false, "text": "Pollard to Nair,no run,goes the slower bouncer way, 118 kph, Nair backed away to upper cut it. But misses. Third man was inside too"}, {"ball": 11.3, "isHighlight": false, "text": "IPL: \"We shouldnt mind RR getting out of the tournament, but we should still appreciate them to giving ample-ton opportunities to players like Sanju, Karun, Rahul Tewatia etc whereas most other teams heavily relied on international top stars.\""}, {"ball": 11.3, "isHighlight": false, "text": "goes around the wicket as he runs up and doesn't let the ball go. Back over now"}, {"ball": 11.4, "isHighlight": false, "text": "Pollard to Nair,1 run,full on middle, worked away to long-on"}, {"ball": 11.5, "isHighlight": false, "text": "Pollard to Samson,2 runs,they're starting to pick the gaps here. Goes short with the change of pace and Samson waited just enough before pulling between deep square leg and deep midwikcet"}, {"ball": 11.6, "isHighlight": false, "text": "Pollard to Samson, $$FOUR$$ ,threatened to walk across to the off side, and when Pollard fired a length ball down the leg side, he has just swiped it over the head of short fine leg. Brilliant work"}, {"ball": 11.6, "isHighlight": false, "text": "Febin: \"Pollard doing a Bhatia.\""}, {"ball": 11.6, "isHighlight": false, "text": "Sriman: \"Batting order for RR from now on - Faulkner, Hodge, Cooper\""}, {"ball": 11.6, "isHighlight": false, "text": "Ojha's back, 13 off his 2 overs"}, {"ball": 12.1, "isHighlight": false, "text": "Ojha to Nair,1 run,gripped on the pitch, but since it was short the batsman had time to gauge it and flick through midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Ojha to Samson,1 run,wanders outside leg stump and when the bowler follows him, he tucks it to short fine leg for the single that gets him to a fifty"}, {"ball": 12.3, "isHighlight": false, "text": "Ojha to Nair, $$SIX$$ ,that's been massacred! Another poor ball as Ojha bowls short and wide outside off. Nair goes deep in his crease and pulls way into the crowd at midwicket"}, {"ball": 12.4, "isHighlight": false, "text": "Ojha to Nair, $$FOUR$$ ,exhibits range now as he opens up his stance and cuts through point. Such quick hands. Another short ball dispatched"}, {"ball": 12.5, "isHighlight": false, "text": "Ojha to Nair,no run,another shortish ball, but it was a little closer to off stump. Mistimes the chop into the covers"}, {"ball": 12.6, "isHighlight": false, "text": "Ojha to Nair, $$FOUR$$ ,reverse chop! Nair is doiing something special here! That's the time out. It was fired in as Ojha switched his angle to over the wicket. Nair's balance is almost perfect and beats short third man comfortably"}, {"ball": 12.6, "isHighlight": false, "text": "Siva: \"Who cares abt Ash or Bhajji? karun Nair is the best!!\""}, {"ball": 12.6, "isHighlight": false, "text": "shubham: \"really missing the 4 slinga overs!!! Mallinga come bacck and save MI!! :P\" He's too busy running England ragged"}, {"ball": 13.1, "isHighlight": false, "text": "Harbhajan Singh to Samson,2 runs,set up for the reverse sweep early which allowed Bhajji to shorten his length. Samson adjusts and directs it through point"}, {"ball": 13.2, "isHighlight": false, "text": "Harbhajan Singh to Samson,1 run,it was just a little short and Samson made it shorter with some lovely footwork. Goes back and outside leg to carve it over extra cover. Simmons is quick enough at long-off thoguh"}, {"ball": 13.3, "isHighlight": false, "text": "Harbhajan Singh to Nair, $$FOUR$$ ,lobbed over short fine leg. Bumrah attempts a feeble attempt to catch it but it sailed over his head. Excellent scoop-pull from Nair and Bhajji has started bowling quick and flat"}, {"ball": 13.4, "isHighlight": false, "text": "Harbhajan Singh to Nair,1 run,nudged through midwicket. Such a nonchalant shot to bring up a neat little fifty"}, {"ball": 13.5, "isHighlight": false, "text": "Harbhajan Singh to Samson, $$SIX$$ ,they are turning it on here! Bhajji goes short on middle, Samson jumps back and mauls it over wide long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Harbhajan Singh to Samson,1 run,switches around the wicket, no change in pace though. Still quick and flat. Pushes down the ground to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "Rajasthan has scored 62 runs in the last four overs so Bumrah's back"}, {"ball": 14.1, "isHighlight": false, "text": "Bumrah to Samson, $$FOUR$$ ,attempts the slower ball but Samson almost seemed to read his mind. Waited on the back foot and lets it run off the open face to collect a very clever boundary to third man"}, {"ball": 14.2, "isHighlight": false, "text": "Bumrah to Samson,2 runs,goes for a seam up delivery and Samson has punched it through point. Deep third man needed a desperate drive to pull things back"}, {"ball": 14.3, "isHighlight": false, "text": "Bumrah to Samson,2 runs,walks across and whips the full length ball to deep square leg"}, {"ball": 14.4, "isHighlight": false, "text": "Bumrah to Samson, $$FOUR$$ ,offers up a full toss on middle, Samson has carved it over point. Simple stroke, excellently executed"}, {"ball": 14.4, "isHighlight": false, "text": "Dharmendra kuma: \"where are the fielders, man?\""}, {"ball": 14.5, "isHighlight": false, "text": "Bumrah to Samson,1 run,slower ball pushed full and outside off, Samson walks across outside off and tickles into midwicket for the single that brings them a hundred partnership"}, {"ball": 14.6, "isHighlight": false, "text": "Bumrah to Nair, $$OUT$$ ,and almost predictably it has to end with a soft dismissal. Took a while to register considering Mumai weren't too keep on celebrating. The bowler was only concerned to see if it carried and then turned away with a bowed head. It was short and Nair goes for the pull. But he's mistimed it this time and Simmons at short midwicket picks up a good, low chance."}, {"ball": 14.6, "isHighlight": false, "text": "$$KK$$ $$Nair$$ $$c$$ $$Simmons$$ $$b$$ $$Bumrah$$ $$50$$ $$(42m$$ $$27b$$ $$7x4$$ $$2x6)$$ $$SR:$$ $$185.18$$"}, {"ball": 14.6, "isHighlight": false, "text": "Karun Nair: \"@Dharmendra kuma, You jinxed me.....\""}, {"ball": 14.6, "isHighlight": false, "text": "Brad Hodge with five overs left"}, {"ball": 15.1, "isHighlight": false, "text": "Gopal to Samson,1 run,tossed up outside off, Samson taps it through extra cover"}, {"ball": 15.1, "isHighlight": false, "text": "Faulkner is getting into his gear"}, {"ball": 15.2, "isHighlight": false, "text": "Gopal to Hodge,1 run,stays back and cuts the shortish ball through to the sweeper"}, {"ball": 15.3, "isHighlight": false, "text": "Gopal to Samson, $$OUT$$ ,he's sliced it and the outside edge lands safely in the hands of a backtracking Bhajji at point. That's a useful double-strike and are Mumbai back in this? Lovely flight from Gopal that time"}, {"ball": 15.3, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$c$$ $$Harbhajan$$ $$Singh$$ $$b$$ $$Gopal$$ $$74$$ $$(68m$$ $$47b$$ $$7x4$$ $$3x6)$$ $$SR:$$ $$157.44$$"}, {"ball": 15.4, "isHighlight": false, "text": "Gopal to Hodge,3 runs,lashed over the covers and it needed a brilliant effort from Rayudu to stop it from reaching the boundary. Used the flight and did not hold back. The sweeper hurtled to his left and dived to parry the ball, but even as he pleaded for support there was no one coming to his aid. He has to get up and get the ball in himself"}, {"ball": 15.5, "isHighlight": false, "text": "Gopal to Faulkner,1 run,flighted outside off, driven down the ground to long-off"}, {"ball": 15.6, "isHighlight": false, "text": "Gopal to Hodge,1 run,goes short and Hodge has little problem cutting through point"}, {"ball": 15.6, "isHighlight": false, "text": "Barath: \"Decoding Samson's smile after getting out: \"Dude,you got me out at the wrong time.We have Faulkner coming in next and he will hurt you much more than I could have\"\""}, {"ball": 16.1, "isHighlight": false, "text": "Ojha to Hodge,1 run,nice and slow just outside off, Hodge has to wait a long time before steering it to short third man"}, {"ball": 16.2, "isHighlight": false, "text": "Ojha to Faulkner,no run,that might just have stayed a touch low judging from Faulkner's reaction. It was a touch short and skidded into the keeper as the batsman tried to cut"}, {"ball": 16.3, "isHighlight": false, "text": "Ojha to Faulkner,no run,prefers to stay back and cut this shortish ball into the covers"}, {"ball": 16.4, "isHighlight": false, "text": "Ojha to Faulkner,1 run,tossed up on middle, drilled to long-on"}, {"ball": 16.5, "isHighlight": false, "text": "Ojha to Hodge,no run,short and a touch wide, Hodge cannot put it away as his cut finds point"}, {"ball": 16.6, "isHighlight": false, "text": "Ojha to Hodge,no run,that was the arm ball and Hodge lunged forward to block. Only two runs off that over"}, {"ball": 16.6, "isHighlight": false, "text": "Navdeep Kumar P: \"Mumbai should watch Netherlands chase of Ireland in the Innings Break. If associate nation players can do so can these star batsmen like Rohit, Simmons, Hussey, Pollard, Anderson, Harbhajan..... \""}, {"ball": 17.1, "isHighlight": false, "text": "Harbhajan Singh to Faulkner,no run,that's more like it. This was much slower and the top spinner gets more bounce to fool Faulkner's attempted sweep"}, {"ball": 17.2, "isHighlight": false, "text": "Harbhajan Singh to Faulkner, $$SIX$$ ,but the follow up is poor. This was full and flat and in the arc for Faulkner to slog sweep over square leg"}, {"ball": 17.3, "isHighlight": false, "text": "Harbhajan Singh to Faulkner, $$SIX$$ ,tries to foil the plot by looping it outside off, but Faulkner has reached out and sent it into orbit over midwicket. Grudging glance as the ball sails away from Rohit"}, {"ball": 17.4, "isHighlight": false, "text": "Harbhajan Singh to Faulkner,1 run,seeks the blockhole and Faulkner pushes down the ground"}, {"ball": 17.5, "isHighlight": false, "text": "Harbhajan Singh to Hodge, $$FOUR$$ ,short and wide, Hodge rocked back and cut away with considerable skill. It seemed to skid off the deck, but Hodge used that pace so well"}, {"ball": 17.6, "isHighlight": false, "text": "Harbhajan Singh to Hodge,1 run,keeps to a good length on off stump, Hodge retains strike with a single through to the sweeper"}, {"ball": 17.6, "isHighlight": false, "text": "Radhesh: \"@Navdeep - No need to go that back.. KKR might have watched the match and KKR did it.. MI juz need to go back one day..\""}, {"ball": 17.6, "isHighlight": false, "text": "Important over for Bumrah"}, {"ball": 18.1, "isHighlight": false, "text": "Bumrah to Hodge,1 run,starts off well with a yorker on middle and off. Dug out into the off side for a single"}, {"ball": 18.2, "isHighlight": false, "text": "Bumrah to Faulkner,1 run,has to shovel another yorker from off stump into the covers. Two very useful balls at this stage"}, {"ball": 18.3, "isHighlight": false, "text": "Bumrah to Hodge,1 run,another one, this time Hodge spoons it back to the bowler who misfields. But it is only a single. Third yorker on the trot from Bumrah"}, {"ball": 18.4, "isHighlight": false, "text": "Bumrah to Faulkner,1 wide,this time he fires in a full toss down the leg side."}, {"ball": 18.4, "isHighlight": false, "text": "Bumrah to Faulkner,1 run,full toss on middle, Faulkner has swiped it to deep midwicket. Would be disappointed he didn't put that away"}, {"ball": 18.5, "isHighlight": false, "text": "Bumrah to Hodge,1 run,flicks a low full toss to deep midwicket. That's only the sixth run off the over"}, {"ball": 18.6, "isHighlight": false, "text": "Bumrah to Faulkner, $$SIX$$ ,and add six more! This time the low full toss is launched  $$over$$  deep midwicket. Powerful hit from Faulkner"}, {"ball": 18.6, "isHighlight": false, "text": "Nandakiran N: \"I feel Rohit must come one down today. Once Hussey and Simmons set the tone, Rohit can take it altogether to another level. He has done it in past and he will be the one to do that tonight.\""}, {"ball": 19.1, "isHighlight": false, "text": "Pollard to Hodge,2 runs,drilled down the ground and some urgency between the wickets fetches two. Pollard finds the blockhole, more or less"}, {"ball": 19.2, "isHighlight": false, "text": "Pollard to Hodge,2 runs,that is spectacularly done! It was length and it was hacked away wide of long-on. Anderson hustled from deep midwicket. reached out and plucked the ball from beyond the boundary, while keeping his feet in play and pulls it back inside"}, {"ball": 19.3, "isHighlight": false, "text": "Pollard to Hodge, $$SIX$$ ,length ball, slower ball, in the slot and Hodge set himself up, waited with a giant backlift and clattered it into the sight screen"}, {"ball": 19.4, "isHighlight": false, "text": "Pollard to Hodge,1 run,full and angled in, Hodge skews it to long-on"}, {"ball": 19.4, "isHighlight": false, "text": "Arun Titto: \"Will MI get a Loan of Maxwell, Miller, Pathan, Devillers to chase this total in 14.3 overs ? Sad...\" Pollard's still smiling though"}, {"ball": 19.5, "isHighlight": false, "text": "Pollard to Faulkner,1 wide,goes for a bouncer and it's got a little too much height on it. Excellent presence of mind from Faulkner to pull away from his stroke"}, {"ball": 19.5, "isHighlight": false, "text": "Pollard to Faulkner, $$OUT$$ ,this was a slower bouncer, he had to drag it from outside off and that means he doesn't get enough power to beat deep midwicket. Easy catch, but the umpires are asking him to stay back. They want to check the height on this, remember Pollard had bowled a bouncer earlier. This would be a no-ball if it is over shoulder-height. It looks very tight, but the third umpire says it's okay"}, {"ball": 19.5, "isHighlight": false, "text": "$$JP$$ $$Faulkner$$ $$c$$ $$Anderson$$ $$b$$ $$Pollard$$ $$23$$ $$(20m$$ $$12b$$ $$0x4$$ $$3x6)$$ $$SR:$$ $$191.66$$"}, {"ball": 19.6, "isHighlight": false, "text": "Pollard to Hodge, $$FOUR$$ ,full toss on middle and off, Hodge swipes a one-handed four to long leg to push Royals to 189! Rohit has a wry smile. Hussey is jogging off to get ready for the reply. Remember Mumbai need to  $$hunt$$ $$this$$ $$down$$ $$in$$ $$87$$ $$balls.$$ $$That's$$ $$a$$ $$required$$ $$rate$$ $$of$$ $$13.2$$ $$over$$"}, {"ball": 19.6, "isHighlight": false, "text": "Kieron Pollard says they will go all out for it, but if it isn't possible they will at least try to win this game. He's happy with the turnaround Mumabai produced after the UAE leg"}, {"ball": 19.6, "isHighlight": false, "text": "Sanju Samson said it was their role to form a foundation with the finishers they have. He and Nair just decided to go for their shots. Everyone has given their 100% and Royals have done their best, he says, but adds that it is a funny game"}], "name": "Mumbai Indians v Rajasthan Royals", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734041.html?innings=1;view=commentary", "match_num": 56}