{"commentary": [{"ball": 0, "isHighlight": false, "text": "The chase is about to start. Michael Hussey and Simmons are out to open, Faulkner has the new ball"}, {"ball": 0.1, "isHighlight": false, "text": "Faulkner to Simmons,no run,short and wide, going across, he tries to cut, but misses"}, {"ball": 0.2, "isHighlight": false, "text": "Faulkner to Simmons, $$FOUR$$ ,this is full outside off, and Simmons has flayed it in the air through extra cover"}, {"ball": 0.3, "isHighlight": false, "text": "Faulkner to Simmons,no run,short of a length, he hops and pushes it to covers"}, {"ball": 0.4, "isHighlight": false, "text": "Faulkner to Simmons, $$FOUR$$ ,four more, it pitches around good length and moves into the pad, Simmons goes back and tucks it past short fine leg"}, {"ball": 0.5, "isHighlight": false, "text": "Faulkner to Simmons,no run,denies him width on this back of a length ball, Simmons gets on his toes and pushes to extra cover"}, {"ball": 0.6, "isHighlight": false, "text": "Faulkner to Simmons, $$FOUR$$ ,third boundary of the over, Faulkner goes short, into the body, Simmons swivels and hooks it just over a jumping short fine leg"}, {"ball": 0.6, "isHighlight": false, "text": "TheKlingon: \"3 boundaries and it's still below the asking rate...\""}, {"ball": 1.1, "isHighlight": false, "text": "Kulkarni to Hussey, $$SIX$$ ,Hussey goes maximum first ball, Kulkarni starts shortish, and Hussey hammers it from outside off way over the deep midwicket boundary"}, {"ball": 1.2, "isHighlight": false, "text": "Kulkarni to Hussey,no run,just short of a length, cramping him with the line on the stumps, Hussey tries to whip it to leg, cannot time it, the ball runs down the pitch"}, {"ball": 1.3, "isHighlight": false, "text": "Kulkarni to Hussey,1 run,eases forward to a length ball and drives to mid off for a quick single"}, {"ball": 1.4, "isHighlight": false, "text": "Kulkarni to Simmons,no run,a slow length ball outside off, Simmons' cut finds backward point, he had the width there"}, {"ball": 1.5, "isHighlight": false, "text": "Kulkarni to Simmons, $$OUT$$ ,first strike for Royals, Simmons makes room and slogs a length delivery, it is another slower one, and Faulkner takes a simple catch at mid on"}, {"ball": 1.5, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$c$$ $$Faulkner$$ $$b$$ $$Kulkarni$$ $$12$$ $$(8m$$ $$8b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 1.5, "isHighlight": false, "text": "Corey Anderson, returning to the side, is at No.3"}, {"ball": 1.6, "isHighlight": false, "text": "Kulkarni to Hussey,no run,a touch slower on and around off stump, Hussey eases it in front of point but the slower pace keeps it inside the circle"}, {"ball": 1.6, "isHighlight": false, "text": "rohit: \"Rajasthan can just use their 3 main bowlers and get done with the first 12 overs to ensure Mumbai are knocked out\" Watto from the other end"}, {"ball": 2.1, "isHighlight": false, "text": "Watson to Anderson, $$FOUR$$ ,four off his first ball. Struck very nicely, but he did have some help. Gentle medium pace ends up being too full on off stump. Anderson stands and drills it through extra cover"}, {"ball": 2.2, "isHighlight": false, "text": "Watson to Anderson, $$SIX$$ ,this time it is length and Anderson has pulled it clean over deep midwicket. Two balls, two thumping hits. Mumbai are fighting big time here"}, {"ball": 2.2, "isHighlight": false, "text": "Long-on goes back, Third man and fine leg are up"}, {"ball": 2.3, "isHighlight": false, "text": "Watson to Anderson,no run,charges out but Watson ups his pace and pushes a fuller ball beyond Anderson's reach as he made room outside leg"}, {"ball": 2.4, "isHighlight": false, "text": "Watson to Anderson,1 run,this is a top edge and it was in the air for ages. Anderson was stuck on the back foot and was hurried into a pull. But long-on is back and midwicket cannot get across quick enough"}, {"ball": 2.5, "isHighlight": false, "text": "Watson to Hussey, $$FOUR$$ ,runs down the pitch and gets a thick outside edge that carries fine enough to the third man boundary. He was looking over point with the room he made, but he'll take it nonetheless"}, {"ball": 2.6, "isHighlight": false, "text": "Watson to Hussey,no run,switches around the wicket and goes full on off stump. Huss presents a lovely cover drive but can't beat the off side infield"}, {"ball": 2.6, "isHighlight": false, "text": "Mayank: \"Today is the day for Anderson to pay off the huge bounty that MI has payed to get him onboard.100 off 30 balls again\""}, {"ball": 2.6, "isHighlight": false, "text": "Watson and the umpire are in a bit of a conversation.The DJ has been sent back, curfew for music is at 10 pm"}, {"ball": 3.1, "isHighlight": false, "text": "Kulkarni to Anderson, $$SIX$$ ,another length ball, this time Anderson steps forward and launches it into the sight screen. Go big or go home seems to be the philosophy today"}, {"ball": 3.2, "isHighlight": false, "text": "Kulkarni to Anderson,no run,goes again, but this time he toe-ends it back to the bowler. Dhawal gets the ball and feigns a throw. Stares him down like a big tall fast bowler"}, {"ball": 3.3, "isHighlight": false, "text": "Kulkarni to Anderson,1 run,full and a touch wide of off stump, he cleared his front leg to launch it over the off side but gets an inside edge. Quick single to midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "nandeesh: \"Can they really tackle Pravin Tambe is my question?\""}, {"ball": 3.4, "isHighlight": false, "text": "Kulkarni to Hussey, $$SIX$$ ,switches around the wicket but that doesn't perturb Huss who dances down and flicks it over square leg. Carried just over the rope."}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Hussey,1 wide,it's a full toss outside off, Huss dancing down has made Kulkarni change tactics but he toes the wrong side of the white line"}, {"ball": 3.5, "isHighlight": false, "text": "Kulkarni to Hussey,2 runs,shortish and has enough width for Huss to tap it through to the sweeper to bring up the second fastest fifty of the season"}, {"ball": 3.5, "isHighlight": false, "text": "\"Mumbaaaai, Mumbai,\" yell Wankhede!"}, {"ball": 3.6, "isHighlight": false, "text": "Kulkarni to Hussey,3 runs,chipped it over mid-off and extra cover. That was so wonderfully played from Hussey to collect three runs"}, {"ball": 3.6, "isHighlight": false, "text": "$$137$$ $$off$$ $$63$$ $$balls$$ $$now$$ , still 13 needed per over"}, {"ball": 3.6, "isHighlight": false, "text": "Kevon Cooper has the ball in hand"}, {"ball": 4.1, "isHighlight": false, "text": "Cooper to Hussey,no run,gets a little more lift courtesy those strong shoulders. Huss was down the track again, but is beaten as he looks to launch"}, {"ball": 4.2, "isHighlight": false, "text": "Cooper to Hussey, $$OUT$$ ,goes full, goes straight and it's timber! Cooper punches his chest and then the air after he deceived Huss who was looking to hack it through the leg side but the shot across the line doesn't succeed"}, {"ball": 4.2, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Cooper$$ $$22$$ $$(23m$$ $$11b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 4.2, "isHighlight": false, "text": "Here's Kieron Pollard"}, {"ball": 4.3, "isHighlight": false, "text": "Cooper to Pollard,1 run,shortish and outside off, Pollard walks down and taps it into the point region for a single"}, {"ball": 4.3, "isHighlight": false, "text": "DM: \"Still having the same feeling .. this is KXIP v KXIP stuff!\""}, {"ball": 4.4, "isHighlight": false, "text": "Cooper to Anderson,1 leg bye,dupes Anderson with a change of pace. It was shortish and he had set up for the pull, but it sits in the deck and after he was done with the shot, he is hit on the back. Single taken"}, {"ball": 4.5, "isHighlight": false, "text": "Cooper to Pollard, $$SIX$$ ,that's outta here! It was length and allowed Pollard to free his arms. Slogged over cow corner!"}, {"ball": 4.6, "isHighlight": false, "text": "Cooper to Pollard, $$OUT$$ ,he's broken Mumbai! This was another slower ball and Pollard after having walked down the pitch, his flick ends up looping it to square leg. Hit too high on the bat as he was closing the face. Hodge runs in and picks up the simplest catch."}, {"ball": 4.6, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$c$$ $$Hodge$$ $$b$$ $$Cooper$$ $$7$$ $$(3m$$ $$3b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$233.33$$"}, {"ball": 4.6, "isHighlight": false, "text": "$$129$$ $$off$$ $$57$$  and Rohit Sharma is in now"}, {"ball": 5.1, "isHighlight": false, "text": "Faulkner to Sharma,no run,fullish and outside off, driven to mid-off"}, {"ball": 5.2, "isHighlight": false, "text": "Faulkner to Sharma,1 run,shortish and outside off, tapped behind point for a quick single"}, {"ball": 5.3, "isHighlight": false, "text": "Faulkner to Anderson,1 run,slower ball, think it was the legcutter. Anderson chops it through to the covers"}, {"ball": 5.4, "isHighlight": false, "text": "Faulkner to Sharma, $$SIX$$ ,this has been smoked over point! Lands in the second tier, that is Rohit at his very best. It was short and he rode the bounce with aplomb"}, {"ball": 5.4, "isHighlight": false, "text": "Nishant Vats: \"Pollard has been the biggest disappointment for MI .. attitude batting bowling.. every single thing has failed this season.. Cooper is the unsung hero of this IPL so far.. \""}, {"ball": 5.5, "isHighlight": false, "text": "Faulkner to Sharma,1 leg bye,just back of a length, slower ball again. Rohit tucks it to midwicket for a single"}, {"ball": 5.6, "isHighlight": false, "text": "Faulkner to Anderson,1 run,seeks the block hole just outside off, carved to extra cover for a quick single"}, {"ball": 5.6, "isHighlight": false, "text": "Sachin : \"MI still dont know how to use pollard. Sometimes they use him too late and sometimes too early... Rohit should have come out in place of Pollard. In the end pollard wud b handy against spinners..\" When the rate is over 13, you need your biggest hitter out there no matter what.  $$119$$ $$needed$$ $$off$$ $$51$$"}, {"ball": 6.1, "isHighlight": false, "text": "Cooper to Anderson,1 leg bye,full on the pads, Anderson looks to flick it away but gets struck on the boot"}, {"ball": 6.2, "isHighlight": false, "text": "Cooper to Sharma,1 run,goes full and a touch outside off, Rohit works it down to wide long-on"}, {"ball": 6.2, "isHighlight": false, "text": "Raghu Ifmr: \"@Nishanth - nope that \"most disappointment' title goes to Chris Gayle.. Pls let RCB win atleast this..\""}, {"ball": 6.3, "isHighlight": false, "text": "Cooper to Anderson,no run,how did that miss off stump? He's rooted to the crease and swings off his hips, the slower, good length ball misses its target by a whisker"}, {"ball": 6.4, "isHighlight": false, "text": "Cooper to Anderson,1 run,pulled, but only as far as long-on. Anderson is really trying to hit the ball hard but he's not timing it at all now"}, {"ball": 6.5, "isHighlight": false, "text": "Cooper to Sharma,1 run,waits on the change of pace and works it behind square leg for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Cooper to Anderson,no run,swings and misses, as has been the bane of Anderson this IPL. Another slower ball and it holds in the pitch just enough to hurt Mumbai"}, {"ball": 6.6, "isHighlight": false, "text": "Gautam: \"@Nishant Vats: How about adding Watto to that list Very Very poor with the bat and then add the strange captaincy which lost at least 2 matches \""}, {"ball": 6.6, "isHighlight": false, "text": "$$115$$ $$off$$ $$45$$ $$now$$"}, {"ball": 6.6, "isHighlight": false, "text": "wap36: \"Bring on Tambe at the other end. Choke MI\" Here he is"}, {"ball": 7.1, "isHighlight": false, "text": "Tambe to Sharma,1 run,flighted on off stump, Rohit has lashed it to long-off"}, {"ball": 7.2, "isHighlight": false, "text": "Tambe to Anderson,no run,pushes the good length ball that skids off the pitch and doesn't turn. Anderson goes for the cut and missed"}, {"ball": 7.3, "isHighlight": false, "text": "Tambe to Anderson, $$FOUR$$ ,this was on leg stump, and Anderson has shoveled it wide of midwicket's reach. Good effort from the fielder there, but in vain"}, {"ball": 7.4, "isHighlight": false, "text": "Tambe to Anderson, $$SIX$$ ,this was in the slot and Anderson has slog swept him miles over midwicket. Tambe bowls the wrong 'un, but he's overpitched"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to Anderson,1 wide,that's a poor ball. Hurls a very quick delivery too far outside off"}, {"ball": 7.5, "isHighlight": false, "text": "Tambe to Anderson,1 run,loops one on leg, Anderson flicks to long-on"}, {"ball": 7.6, "isHighlight": false, "text": "Tambe to Sharma,1 run,little room and Rohit stays beside the ball and slaps it through to the sweeper"}, {"ball": 7.6, "isHighlight": false, "text": "$$101$$ $$needed$$ $$off$$ $$39$$ $$balls$$"}, {"ball": 7.6, "isHighlight": false, "text": "DM: \"Mumbai need a big 25-run over. Can we have Dale Steyn bowl an over please?\" How soon the mind forgets"}, {"ball": 8.1, "isHighlight": false, "text": "Cooper to Sharma,1 run,runs down the pitch and lashes this through to deep cover. Got the pitch and drilled it, but doesn't find the gap"}, {"ball": 8.2, "isHighlight": false, "text": "Cooper to Anderson, $$FOUR$$ ,long-off gave up. This was a length delivery that allowed Anderson's arms some freedom. Smoked through extra cover"}, {"ball": 8.3, "isHighlight": false, "text": "Cooper to Anderson,2 runs,fullish and on the pads, Anderson flicks it to deep square leg"}, {"ball": 8.4, "isHighlight": false, "text": "Cooper to Anderson, $$SIX$$ ,launched straight down the ground. The man who turned it all around is being smoked to all parts. It was another length ball and Anderson stood and delivered"}, {"ball": 8.5, "isHighlight": false, "text": "Cooper to Anderson,2 runs,tucked him up just outside off, Anderson bunts it to the right of long-off"}, {"ball": 8.5, "isHighlight": false, "text": "Three men behind square on the off side"}, {"ball": 8.6, "isHighlight": false, "text": "Cooper to Anderson,no run,goes short and Anderson is too early on the pull. Gets an inside edge back to the bowler"}, {"ball": 8.6, "isHighlight": false, "text": "$$86$$ $$off$$ $$33$$ $$needed$$ $$for$$ $$Mumbai$$ $$to$$ $$qualify$$"}, {"ball": 9.1, "isHighlight": false, "text": "Kulkarni to Sharma, $$FOUR$$ ,this was the full toss outside off, Rohit flings his bat at it and gets an inside edge that runs away to long leg boundary"}, {"ball": 9.1, "isHighlight": false, "text": "Anon06: \"Steyn isn't out of form because he never is. He 'pretends' he is in this inconsequential IPL, and make the batsmen think that they can take him on. Then on South Africa's next tour, the batsmen will carry their same habits, thinking that they can take on Steyn. But Steyn, being Steyn, will rip them out at 15 runs a piece. He's a genius.\" I doubt he takes it easy in any game"}, {"ball": 9.2, "isHighlight": false, "text": "Kulkarni to Sharma, $$OUT$$ ,he's holed out! Rohit had to go for it and it was almost in the slot. Looks to swing as hard as he can, but ends up getting a thick outside edge that sits into the hands of the sweeper"}, {"ball": 9.2, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$Nair$$ $$b$$ $$Kulkarni$$ $$16$$ $$(23m$$ $$11b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$145.45$$"}, {"ball": 9.2, "isHighlight": false, "text": "Ambati Rayudu with a strike rate of 120 this season"}, {"ball": 9.3, "isHighlight": false, "text": "Kulkarni to Anderson,1 wide,141kph, seeks the wide yorker but this is too far outside off"}, {"ball": 9.3, "isHighlight": false, "text": "Kulkarni to Anderson,no run,another full toss with ample room. Anderson whacks it to point and Rayudu has raced to the middle of the pitch! Anderson did not want the single and Ankit Sharma, the fielder, sends in a good throw to the bowler. Kulkarni rushes back and tries to flick the stumps with the back of his hand and misses!"}, {"ball": 9.4, "isHighlight": false, "text": "Kulkarni to Anderson, $$SIX$$ ,launched over long-off! That's his fifty, and he gets to it with a typically powerful stroke down the ground"}, {"ball": 9.5, "isHighlight": false, "text": "Kulkarni to Anderson,1 run,shortish and on middle, Anderson goes for the pull but its a little too quick for him to time it"}, {"ball": 9.6, "isHighlight": false, "text": "Kulkarni to Rayudu, $$FOUR$$ ,length again and Rayudu has smashed it to the sight screen. Planted his front foot down and swung clean"}, {"ball": 9.6, "isHighlight": false, "text": "$$70$$ $$needed$$ $$off$$ $$27$$"}, {"ball": 9.6, "isHighlight": false, "text": "apoorvagj: \"RR scored 75 from overs 11-15. Samson and Karun again maybe for Mumbai?\""}, {"ball": 10.1, "isHighlight": false, "text": "Faulkner to Anderson, $$FOUR$$ ,backs away and smokes it down the ground. Faulkner tried to stop it but it was too well struck. The bowler is on the floor and the ball has pinged into the advertising board"}, {"ball": 10.2, "isHighlight": false, "text": "Faulkner to Anderson,2 runs,room outside off and he carves it through the covers"}, {"ball": 10.3, "isHighlight": false, "text": "Faulkner to Anderson,1 run,a little shortish and Anderson flat-bats it down the ground to long-on"}, {"ball": 10.3, "isHighlight": false, "text": "Radhesh: \"RR badly missing Rajat Bhatia. Especially seeing how effective Cooper has been with his change of pace. Paying the price for picking Binny over Bhatia\" Watson and Faulkner in deep conversation."}, {"ball": 10.4, "isHighlight": false, "text": "Faulkner to Rayudu,1 wide,shortish delivery well down the leg side."}, {"ball": 10.4, "isHighlight": false, "text": "Faulkner to Rayudu,1 run,swings the fullish delivery from the stumps to deep square leg"}, {"ball": 10.5, "isHighlight": false, "text": "Faulkner to Anderson, $$SIX$$ ,picked it up and smoked it over long-on. Anderson is making a strong case here. Faulkner needs to find his yorkers and instead he is going length"}, {"ball": 10.6, "isHighlight": false, "text": "Faulkner to Anderson, $$FOUR$$ ,well, even the yorker doesn't work! Anderson was waiting outside leg stump and he's sliced it past the reach of hte keeper"}, {"ball": 10.6, "isHighlight": false, "text": "$$51$$ $$off$$ $$21$$  and Watson has brought himself back"}, {"ball": 11.1, "isHighlight": false, "text": "Watson to Rayudu, $$FOUR$$ ,this was the slower short ball and Rayudu has carved it over the short third man fielder. That's not the length to bowl with him up in the circle"}, {"ball": 11.1, "isHighlight": false, "text": "Suddenly the Royals dug out is quite nervous"}, {"ball": 11.2, "isHighlight": false, "text": "Watson to Rayudu, $$FOUR$$ ,goes short again and Rayudu has backed away and slapped it handsomely over the infield. Just missed going for six"}, {"ball": 11.2, "isHighlight": false, "text": "$$43$$ $$off$$ $$19$$  Square leg is inside the circle as Watson goes around the wicket."}, {"ball": 11.3, "isHighlight": false, "text": "Watson to Rayudu, $$FOUR$$ ,141kph, and another one! This is length on leg stump, Rayudu says thank you very much with a biff that bisects long-on and midwicket"}, {"ball": 11.3, "isHighlight": false, "text": "$$39$$ $$off$$ $$18$$"}, {"ball": 11.4, "isHighlight": false, "text": "Watson to Rayudu,1 run,goes full on off stump, a little slower this time. Rayudu pushes to long-off"}, {"ball": 11.4, "isHighlight": false, "text": "Watson and Hodge are getting the fielders where they want them"}, {"ball": 11.5, "isHighlight": false, "text": "Watson to Anderson, $$FOUR$$ ,goes full and wide, he wants to keep it out of Anderson's reach. But he plonks his bat out and gets a thick edge that flies away to third man. This over has changed the game!"}, {"ball": 11.5, "isHighlight": false, "text": "Royals fans are screaming at their players in frustration"}, {"ball": 11.6, "isHighlight": false, "text": "Watson to Anderson,1 run,shortish and outside off, Anderson has cut it over the two men square, but there is also protection in the deep"}, {"ball": 11.6, "isHighlight": false, "text": "$$33$$ $$off$$ $$15$$ $$balls$$"}, {"ball": 11.6, "isHighlight": false, "text": "manoj kini: \"NO NO NO, pls RR, DONT MESS UP !! \""}, {"ball": 12.1, "isHighlight": false, "text": "Cooper to Anderson, $$FOUR$$ ,it is length again and Anderson stands deep in his crease and pummels it too well for long-off to bother with"}, {"ball": 12.2, "isHighlight": false, "text": "Cooper to Anderson,2 runs,fullish and on the stumps, Anderson hoicks it down the ground. Was only going to be one but Faulkner lets it through his fingers. Terrible misfield"}, {"ball": 12.2, "isHighlight": false, "text": "Watson has a towel in his hands, presumably for the dew"}, {"ball": 12.3, "isHighlight": false, "text": "Cooper to Anderson,no run,this is short and it is quick, Anderson looks to pull but he is a little too slow on the shot"}, {"ball": 12.4, "isHighlight": false, "text": "Cooper to Anderson,2 runs,full and wide outside off, Anderson drives wide of long-off. The bat face closes a bit on impact to rid him of the timing. Its a couple and Anderson easily makes it. Third umpire was asked to confirm it and when the big green \"Not out\" went up on screen, Wankhede roars!"}, {"ball": 12.5, "isHighlight": false, "text": "Cooper to Anderson,1 run,this is a short delivery, Anderson goes for a pull but there is protection in the deep"}, {"ball": 12.5, "isHighlight": false, "text": "$$24$$ $$off$$ $$10$$ $$needed$$ $$for$$ $$Mumbai$$"}, {"ball": 12.5, "isHighlight": false, "text": "Barath: \"Just to make things more interesting,can we have a super over if scores are tied after 14.3 overs?\""}, {"ball": 12.6, "isHighlight": false, "text": "Cooper to Rayudu, $$FOUR$$ ,that is brilliant placement! The yorker goes wrong and Rayudu has pulled his front leg away and caressed it through the covers. Too well timed for the man in the deep"}, {"ball": 12.6, "isHighlight": false, "text": "Yahya Kamran: \"\"Watson has a towel in his hands, presumably for his tears.\"\"  $$20$$ $$off$$ $$9$$ $$balls$$  Pravin Tambe will tackle this pressure-riddled over"}, {"ball": 13.1, "isHighlight": false, "text": "Tambe to Anderson,no run,he's missed a full toss! It was in the slot to be massacred over midwicket, but instead its a dot ball"}, {"ball": 13.1, "isHighlight": false, "text": "Rohit is nervous in the dressing room."}, {"ball": 13.2, "isHighlight": false, "text": "Tambe to Anderson, $$FOUR$$ ,that was a tracer bullet if ever there was one. Tambe goes flat and fast, Anderson stays deep in his crease and murders it down the ground"}, {"ball": 13.3, "isHighlight": false, "text": "Tambe to Anderson,1 run,flighted on middle, Anderson slog sweeps to the man in the deep"}, {"ball": 13.4, "isHighlight": false, "text": "Tambe to Rayudu,1 run,tossed up outside off, Rayudu remains beside the ball and carves it to deep cover"}, {"ball": 13.4, "isHighlight": false, "text": "$$14$$ $$off$$ $$5$$"}, {"ball": 13.5, "isHighlight": false, "text": "Tambe to Anderson, $$FOUR$$ ,he's bisected long-on and midwicket! Who says he struggles against spin! That slog sweep is his safety net and this is a length ball that scurries away. This is awesome power"}, {"ball": 13.5, "isHighlight": false, "text": "$$10$$ $$off$$ $$4$$"}, {"ball": 13.6, "isHighlight": false, "text": "Tambe to Anderson,1 run,seeks the yorker on off stump, Anderson hacks it down to long-on"}, {"ball": 13.6, "isHighlight": false, "text": "$$9$$ $$off$$ $$3$$ . Watson, Hodge and Faulkner have a mini conference. Looks like Faulkner will be bowling."}, {"ball": 13.6, "isHighlight": false, "text": "Raghu Ifmr: \"And that kids, is how RR claimed the biggest chokers tag from SA..\" It's not over just yet..."}, {"ball": 14.1, "isHighlight": false, "text": "Faulkner to Anderson,1 run,shortish and outside off, he wants to keep out of Anderson's swing. Gets a thick edge to deep third man. Only a single"}, {"ball": 14.1, "isHighlight": false, "text": "$$8$$ $$off$$ $$2$$  Long-on and deep square leg in place. Deep cover as well."}, {"ball": 14.2, "isHighlight": false, "text": "Faulkner to Rayudu, $$SIX$$ ,it's a full toss on leg stump! That's just about the perfect gift and Rayudu has launched it over the long leg boundary. What a hit! What a collapse under pressure for Faulkner!"}, {"ball": 14.2, "isHighlight": false, "text": "$$2$$ $$off$$ $$1$$ $$fior$$ $$Mumbai$$ $$to$$ $$qualify$$"}, {"ball": 14.3, "isHighlight": false, "text": "Faulkner to Rayudu,1 run,  $$OUT$$ ,it's a ridiculous comedy of error. Rayudu is on his knees on the floor! This was back of a length but a little too quick for him as he went for a cut. Gets struck high on the bat and goes only as far as short cover. They set off for the single and the fielder runs in and underarms a throw to try and get him out but misses. They go for the second and the throw from midwicket finds Rayudu short"}, {"ball": 14.3, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$run$$ $$out$$ $$30$$ $$(32m$$ $$10b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$300.00$$"}, {"ball": 14.3, "isHighlight": false, "text": "$$There$$ $$is$$ $$a$$ $$giant$$ $$conference$$ $$between$$ $$the$$ $$umpires$$ $$and$$ $$the$$ $$Royals$$ $$players.$$ $$It$$ $$seems$$ $$they$$ $$need$$ $$a$$ $$boundary$$ $$off$$ $$this$$ $$delivery$$ $$to$$ $$win$$ $$the$$ $$game$$ $$and$$ $$seal$$ $$a$$ $$playoff$$ $$spot$$"}, {"ball": 14.3, "isHighlight": false, "text": "Rohit is smiling away. A message comes out to Aditya Tare, who will be on strike. Kulkarni comes in to talk with Watson. The umpires as them to get ready for the ball"}, {"ball": 14.4, "isHighlight": false, "text": "Faulkner to Tare, $$SIX$$ , $$it's$$ $$six,$$ $$Mumbai$$ $$have$$ $$qualified!$$  This was a full toss on leg stump and Tare has launched it over square leg. Tare is beside himself, he pulls his shirt over his head and is being manhandled by his team-mares. Mumbai have exploded all over the Wankhede. Sachin gives big hugs to Anderson and Tare."}, {"ball": 14.4, "isHighlight": false, "text": "So, what can I say to sum this game up. It was sheer, convoluted drama and at the end of it all. defending champions Mumbai Indians have stormed into the playoffs. We'll have the match report in a few, we'll have quotes, we've got the Huddle so don't go anywhere. Thank you for your comments tonight and I hope you've all enjoyed the cricket. This is Alagappan Muthu, saying Phew...."}, {"ball": 14.4, "isHighlight": false, "text": "$$Corey$$ $$Anderson$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"We knew what we needed. We let them get too many runs. I'm glad I could do something to bring them to their feet. Rayudu came in and smashed it and that last ball from tare as well. It was about staying still and backing yourself. The thing is when you complicate things you get in trouble. People started realising we had a chance here and I wanted to be out there in the end. It doesn't get any better than this. The Mumbai crowd are unbelievable. Now I do feel at home here\""}, {"ball": 14.4, "isHighlight": false, "text": "\"It will take a little while to get my hearbeat down\", says  $$Rohit$$ $$Sharma$$ . \"Nothing is impossible. The performance, doesn;t come every day. This is for th epeople of Mumbai. It was a fantastic victory. Anderson was unbelievable. Rayudu played a little cameo there and hats off to Tare. We knew whatever target we see in front of us, we gotta go and chase it. There was no pressure on us and we knew we had hit our stride quickly. We were in a similar situation in the Champions League, so we had the belief. And only brighter things are yet to come\""}, {"ball": 14.4, "isHighlight": false, "text": "Jignesh: \"As an MI fan I just want to say: #$@*#$@*#$@*#%$@*#$@*%\""}, {"ball": 14.4, "isHighlight": false, "text": "\"Fantastic. Coming out of Dubai no one thought it was possible. Even at half-time we knew it was going to be difficult. Corey coming into this game was amazing. Ambati as well. We thought it was working against us. But we have a nver say die and soon as we won a couple of games in a row, words can't describe that,\" says Kieron Pollard, \"You can see the emotion. We worked hard, we stuck together and we knew anything was possible\""}, {"ball": 14.4, "isHighlight": false, "text": "LK: \"Poor Faulkner!! I think Ishant must be enjoying more than MI fans are enjoying at this moment;)\""}, {"ball": 14.4, "isHighlight": false, "text": "\"I've played a fair bit of cricket but I've never been involved with something like this,\" says Michael Hussey, \"We're through to the playoffs. Wasn't sure if we could do this but this game continues to bemuse everyone\""}, {"ball": 14.4, "isHighlight": false, "text": "DisappointedRRF: \"Let this be the lesson for the rest of the teams.. you are not qualified till you are qualified!\""}, {"ball": 14.4, "isHighlight": false, "text": "The celebrations are never-ending. This has been a match of epic proportions. Getting 190 in 14.3 was an improbable ask. But Corey Anderson, after flopping all season, has produced one of the knocks of the season and Ambati Rayudu and Aditya Tare have played amazing cameos. Dravid throws his cap off in disgust after that poor ball. He's had to watch some pretty poor bowling in the death, Shane Watson leaked 18 runs the 12th over. James Faulkner bowled two generous full tosses on leg stump when Mumbai needed big hits. They missed the easiest run-out opportunity. I'm reeling for breath here!"}], "name": "Mumbai Indians v Rajasthan Royals", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734041.html?innings=2;view=commentary", "match_num": 56}