{"commentary": [{"ball": 0, "isHighlight": false, "text": "Awana will start off"}, {"ball": 0, "isHighlight": false, "text": "A clean-shaven  $$Glenn$$ $$Maxwell$$ $$says$$ $$Kings$$ $$XI$$ $$Punjab$$ $$have$$ $$been$$ $$the$$ $$dominant$$ $$team$$ $$of$$ $$the$$ $$IPL$$ $$and$$ $$are$$ $$hoping$$ $$for$$ $$a$$ $$similar$$ $$performance.$$ $$Adds$$ $$that$$ $$they're$$ $$only$$ $$concerned$$ $$with$$ $$their$$ $$game.$$ $$Concentrating$$ $$on$$ $$muffling$$ $$their$$ $$big-hitters.$$"}, {"ball": 0, "isHighlight": false, "text": "shrenik: \" How can you leave a man who has provided you breakthrough in powerplays and when the opposition has openers as Uthappa and Gambhir. I think KXIP should have included in Sandeep Sharma in place of Awana.\""}, {"ball": 0, "isHighlight": false, "text": "$$3.30pm$$ $$Toss$$  Gambhir says 'tails,', it is 'heads'.  $$Kings$$ $$XI$$ $$win$$ $$toss$$ $$and$$ $$bowl$$ . Bailey says the pitch has been under covers for a long time, so if there is anything in the surface the bowlers should exploit it early. Kings XI are unchanged."}, {"ball": 0, "isHighlight": false, "text": "KKR make one change: Piyush in for Vinay."}, {"ball": 0, "isHighlight": false, "text": "Kanishka: \"Rishi Dhawan was in the 2008 squad as well\"."}, {"ball": 0, "isHighlight": false, "text": "Arpit Phanshika: \"Would have been good if Kallis would have come in for Tendo. KKR need experience for big matches. Nevertheless a wise decision to get Chawla ahead of Vinay Kumar. Chawla adds variety and had done well against KingsXI."}, {"ball": 0, "isHighlight": false, "text": "$$Yusuf$$ $$Pathan$$  says that the only thing in his mind when he played that whirlwind innings against Sunrisers was that KKR had to finish in the top two. He is happy that he could deliver when the team needed him to."}, {"ball": 0, "isHighlight": false, "text": "$$3.25pm$$  Five minutes away from the toss."}, {"ball": 0, "isHighlight": false, "text": "Misbah: \"Incidentally this is the first time Punjab is playing a playoff match after the 1st edition of IPL. Wonder any common players between then and now ?\" I haven't compared squads, but Shaun Marsh is one player who was there then as well."}, {"ball": 0, "isHighlight": false, "text": "Arpit: \"It will be interesting to see if KingsXI play Karanveer Singh. He was impressive in last couple of outings. However given that KKR predominantly played spin better, I wont be surprised in the add another quick bowler. Hope Johnson plays\""}, {"ball": 0, "isHighlight": false, "text": ""}, {"ball": 0, "isHighlight": false, "text": "$$3.15pm$$  Both teams warming up on the outfield ahead of the big match."}, {"ball": 0, "isHighlight": false, "text": "Yatin: \"Miller & Maxwell vs Narine could be the deciding factor. If they tackle him effectively, KKR would be in big mess.\""}, {"ball": 0, "isHighlight": false, "text": "Who will be the key bowler for Kings XI?"}, {"ball": 0, "isHighlight": false, "text": "Jugnu: \"Will be good to see how Maxwell handles this pressure situation. I am sure he has never been in such a big match and given the shots he has played in last few matches it will be very interesting to see if he plays bit more responsibly.\""}, {"ball": 0, "isHighlight": false, "text": "Raghu B: \"Remember Sachin Tendulkar amazing consistency in 2003 world cup and so as Hussey's 733 mammoth in last year's IPL? It had been huge body blow to their respective teams when they failed on big day and getting Uthappa cheaper will be the move of the match if KXIP can get to him!\""}, {"ball": 0, "isHighlight": false, "text": "SKD: \"The form of Shakib Al Hasan will be important. Also waiting for another HULK like innings from Yusuf Pathan. \""}, {"ball": 0, "isHighlight": false, "text": "Adrian Meredith: \"Punjab is very Australian this year. Maxwell, Bailey, Johnson and potentially even Marsh - though I suspect that Miller will play. I reckon most Australians will be going for them - now that the other Aussie side Rajasthan Royals are out.\""}, {"ball": 0, "isHighlight": false, "text": "Tharun: \"Sachin was consistent in 2011 too and was indeed dismissed early in finals. Yet India won. So focussing on Uthappa is goog but npt the only aim for Punjab\""}, {"ball": 0, "isHighlight": false, "text": "$$2.50pm$$  Good news, IPL fans - @lionsdenkxip: Things are looking good! It hasn't rained and we're on our way to a 3:30 pm toss! #KXIPvsKKR"}, {"ball": 0, "isHighlight": false, "text": "First mails of the day coming in: C.A.Sridhar: \"Uthappa vs Maxwell leading run scorers..face each other..treat to watch..\""}, {"ball": 0, "isHighlight": false, "text": "Neloy Hasan: \"I've Miller, Vohra, Maxi, Utthappa, Narine and also Shakib. Confusion is who should I nominate the captain of my Cricinfo Fantasy XI.\""}, {"ball": 0, "isHighlight": false, "text": "Have you pencilled Maxwell and Narine into your XI? Surely you have made space for Uthappa too. Get your  $$Cricinfo$$ $$Fantasy$$ $$XI$$  ready in time for the big game."}, {"ball": 0.1, "isHighlight": false, "text": "Awana to Uthappa,no run,struck on the pads first up, he was looking to play across the line and may have missed leg"}, {"ball": 0.1, "isHighlight": false, "text": "Massive din at the Eden"}, {"ball": 0.2, "isHighlight": false, "text": "Awana to Uthappa,1 run,off the mark this time with a dab down to third man, gets forward and across"}, {"ball": 0.3, "isHighlight": false, "text": "Awana to Gambhir,1 run,cramped him up for room but Gambhir managed to chop that on towards short third man and set off"}, {"ball": 0.4, "isHighlight": false, "text": "Awana to Uthappa,no run,keeps it nice and straight and he stays behind the line and punches it back to the bowler"}, {"ball": 0.5, "isHighlight": false, "text": "Awana to Uthappa,no run,appeals for a catch down the leg side, this was short and on the ribs and he looked to nudge it away and it wasn't far from the gloves"}, {"ball": 0.6, "isHighlight": false, "text": "Awana to Uthappa,no run,Uthappa moves across and punches it down the track"}, {"ball": 0.6, "isHighlight": false, "text": "Manprabh: \"Sandeep Sharma should have been selected, the importance of early wickets is crucial in this match and he has a great strike rate with the white cherry! \""}, {"ball": 0.6, "isHighlight": false, "text": "vicky7777: \"Punjab should start with akshar patel. He can perform under pressure situation and perform well. Bailey should utilise him under powerplay..\""}, {"ball": 1.1, "isHighlight": false, "text": "Johnson to Gambhir,no run,appeal for an lbw by Johnson and it was a confident shout, this was coming back in and struck him on the thigh pad, that would have cleared the stumps"}, {"ball": 1.2, "isHighlight": false, "text": "Johnson to Gambhir, $$OUT$$ ,the captain departs early! Gambhir gets a short ball and he fetches that from the off stump and looks to pull him in front of square, couldn't get enough on it to clear the infield and Bailey jumped and took it above his head at mid-on, he was fielding a few yards in front"}, {"ball": 1.2, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$Bailey$$ $$b$$ $$Johnson$$ $$1$$ $$(7m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 1.3, "isHighlight": false, "text": "Johnson to Pandey,1 run,another short one and Pandey negotiated it well, kept it down and dabbed it wide of point"}, {"ball": 1.3, "isHighlight": false, "text": "Short point in place"}, {"ball": 1.4, "isHighlight": false, "text": "Johnson to Uthappa,1 run,aiming for the inswinging yorker and Uthappa does well to flick that to fine leg"}, {"ball": 1.5, "isHighlight": false, "text": "Johnson to Pandey,1 run,he fires in another yorker and this time outside off, he bends and squirts it out to third man"}, {"ball": 1.5, "isHighlight": false, "text": "James: \"How's Mitch hitting the speed gun? The IPL speeds are usually a bit generous!\""}, {"ball": 1.5, "isHighlight": false, "text": "The last one said 143"}, {"ball": 1.6, "isHighlight": false, "text": "Johnson to Uthappa,no run,good length on middle and leg and he works it to midwicket"}, {"ball": 1.6, "isHighlight": false, "text": "Gaurav Manchand: \"So gambhir is no more a contender for reserve opener slot for England tour.\""}, {"ball": 2.1, "isHighlight": false, "text": "Patel to Pandey,1 leg bye,tossed up on the pads and he nudges it to the on side"}, {"ball": 2.2, "isHighlight": false, "text": "Patel to Uthappa,1 run,tucks it towards midwicket for a single"}, {"ball": 2.3, "isHighlight": false, "text": "Patel to Pandey,1 run,fuller and he works it wide of midwicket"}, {"ball": 2.4, "isHighlight": false, "text": "Patel to Uthappa,1 run,down to deep midwicket this time and it's a length ball he puts away"}, {"ball": 2.5, "isHighlight": false, "text": "Patel to Pandey,1 leg bye,works it against the turn down to square leg"}, {"ball": 2.6, "isHighlight": false, "text": "Patel to Uthappa, $$FOUR$$ ,fine leg was up, he fired it on middle and leg and he shuffled and made it possible to flick it wide of short fine leg"}, {"ball": 3.1, "isHighlight": false, "text": "Johnson to Pandey, $$FOUR$$ ,close call for Pandey! This was a fuller ball on the stumps and Pandey drove at it half heartedly and spooned it towards mid-off, Bailey was a few yards in front and the ball was to his right, he did his best to dive but couldn't get a hand to it"}, {"ball": 3.2, "isHighlight": false, "text": "Johnson to Pandey,1 wide,he slides down the leg side"}, {"ball": 3.2, "isHighlight": false, "text": "Bailey at the edge of the circle now"}, {"ball": 3.2, "isHighlight": false, "text": "Johnson to Pandey,1 run,good length outside off and he dabs it towards third man"}, {"ball": 3.3, "isHighlight": false, "text": "Johnson to Uthappa, $$SIX$$ ,148 kph, that was coming quick at Uthappa, it was short and he read the length early, went forward and adjusted and pulled it over deep square leg"}, {"ball": 3.4, "isHighlight": false, "text": "Johnson to Uthappa, $$FOUR$$ ,in the air but very safe, didn't look in control initially, length ball on the pads, played a checked drive in the air and wide of mid-on"}, {"ball": 3.5, "isHighlight": false, "text": "Johnson to Uthappa,1 run,this was bowled fuller outside off and he opens the face and runs it to third man"}, {"ball": 3.6, "isHighlight": false, "text": "Johnson to Pandey,no run,Johnson tempts him to go for the expansive off drive by bowling it wide outside off, he goes for it and nearly edges it"}, {"ball": 3.6, "isHighlight": false, "text": "Dheeraj: \"Interestingly, this match has 3 batsmen (Uthappa, Gambhir and Sehwag) who is contending for the reserve opener slot.! Uthappa can get edge over other as he can serve as back-up wicket keeper as well\""}, {"ball": 4.1, "isHighlight": false, "text": "Awana to Uthappa,no run,he looks to launch that over the on side, moves across the stumps and nearly gets an inside edge"}, {"ball": 4.2, "isHighlight": false, "text": "Awana to Uthappa, $$FOUR$$ ,take that! After getting beaten the previous ball Uthappa comes down the pitch and slams that in the air over extra cover, listen to the roar"}, {"ball": 4.3, "isHighlight": false, "text": "Awana to Uthappa,1 run,he opens the face and dabs it to third man, the fielder is fine"}, {"ball": 4.4, "isHighlight": false, "text": "Awana to Pandey,1 run,he had to hurry there, this was pushed with soft hands towards mid-off and set off, Bailey underarms the throw but missed the stumps"}, {"ball": 4.5, "isHighlight": false, "text": "Awana to Uthappa, $$FOUR$$ ,that was flat! A short one from Awana, he fetched that from the off stump and pulled it over midwicket, the ball lands just short of the rope"}, {"ball": 4.6, "isHighlight": false, "text": "Awana to Uthappa,1 run,he gets an inside edge that sneaks past the stumps"}, {"ball": 4.6, "isHighlight": false, "text": "Utkarsh: \"I think in Dhoni's absence Uthappa should be a certain for Bangladesh's tour. I don't want to see Saha getting picked again.\""}, {"ball": 5.1, "isHighlight": false, "text": "Dhawan to Uthappa, $$SIX$$ ,welcomes Dhawan to the crease with an effortless six over the sight screen, this was pitched up, he moved across to the pitch of the ball and scooped it downtown"}, {"ball": 5.1, "isHighlight": false, "text": "Keeper up to the stumps"}, {"ball": 5.2, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,he gets forward and across and pushes it to the off side"}, {"ball": 5.3, "isHighlight": false, "text": "Dhawan to Pandey,no run,nearly edged that, he was forward and across and the ball skidded past the bat, Saha breaks the stumps immediately and appeals for a stumping, Pandey drags the back foot back in time"}, {"ball": 5.4, "isHighlight": false, "text": "Dhawan to Pandey, $$FOUR$$ ,thrashed down the ground, this was a slower ball on the stumps and pitched up, moved across and drilled it down the pitch and wide of the bowler"}, {"ball": 5.5, "isHighlight": false, "text": "Dhawan to Pandey,1 run,pushed it with soft hands towards mid-on and they do well to take a quick single, beat the throw"}, {"ball": 5.6, "isHighlight": false, "text": "Dhawan to Uthappa,1 run,he gets an inside edge towards midwicket and sets off"}, {"ball": 5.6, "isHighlight": false, "text": "Archit Agarwal: \"@Utkarsh - I am not doubting Uthapa's talent, but IPL is not the right platform for judging any player. There are many players who perform only in IPL\""}, {"ball": 6.1, "isHighlight": false, "text": "Patel to Uthappa,no run,bounce and turn for Akshar, he looks to dab it to third man and is beaten"}, {"ball": 6.2, "isHighlight": false, "text": "Patel to Uthappa,1 run,goes back and works it to the on side"}, {"ball": 6.3, "isHighlight": false, "text": "Patel to Pandey,no run,he stays back and punches it to the off side"}, {"ball": 6.4, "isHighlight": false, "text": "Patel to Pandey,1 run,length ball and he pulls it towards long-on"}, {"ball": 6.5, "isHighlight": false, "text": "Patel to Uthappa,no run,looks to slash that to third man boundary  but Sehwag does well to dive in the circle and stop that"}, {"ball": 6.6, "isHighlight": false, "text": "Patel to Uthappa,1 run,he stays back and works it to the on side"}, {"ball": 6.6, "isHighlight": false, "text": "It's the  $$Time$$ $$Out$$"}, {"ball": 6.6, "isHighlight": false, "text": "Khalid: \"The way KKR is going is excellent, the boundary hits are followed by some singles to rotate the strike, none of the batsmen seems carried away. Great platform for some late assault by Pathan, Shakib & Co. Go KKR, love to watch you\""}, {"ball": 6.6, "isHighlight": false, "text": "ram cts: \"@Archit Agarwal how we can doubt a batsmen who is consistent from ranji trophy, challenger trophy, syed trophy, and ipl \""}, {"ball": 6.6, "isHighlight": false, "text": "Here's Karanveer"}, {"ball": 7.1, "isHighlight": false, "text": "Karanveer Singh to Uthappa,1 run,waits for the turn and works it towards mid-on"}, {"ball": 7.2, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,how lucky was he? That landed in between two fielders, Pandey looks to slog against the turn, miscued it and it was in the air, Miller ran forward from long-on, Karanveer turned around and ran and it fell in the middle"}, {"ball": 7.3, "isHighlight": false, "text": "Karanveer Singh to Uthappa,1 run,lofts it over cover and only just"}, {"ball": 7.4, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$FOUR$$ ,he was fully in control of this, this was tossed up outside off and he leans forward and lofts it clean over cover"}, {"ball": 7.5, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run"}, {"ball": 7.6, "isHighlight": false, "text": "Karanveer Singh to Uthappa,1 run,he goes back and cuts towards point, good stop"}, {"ball": 8.1, "isHighlight": false, "text": "Patel to Uthappa,no run,flatter delivery and he goes back, makes room and punches it to  the off side"}, {"ball": 8.2, "isHighlight": false, "text": "Patel to Uthappa, $$OUT$$ ,finds long-off with precision, tossed up on the off stump, he leans forward and looks to clear long-off and doesn't fully go through with it, Miller stayed put and took it comfortably"}, {"ball": 8.2, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Miller$$ $$b$$ $$Patel$$ $$42$$ $$(43m$$ $$30b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$140.00$$"}, {"ball": 8.3, "isHighlight": false, "text": "Patel to Pandey,no run,flatter one outside off and pushed to the off side"}, {"ball": 8.4, "isHighlight": false, "text": "Patel to Pandey,no run"}, {"ball": 8.5, "isHighlight": false, "text": "Patel to Pandey, $$OUT$$ ,double strike by Akshar and an unfortunate way to get out, he shuffled across the stumps and the ball hit the thigh pad and lobbed up, Pandey wasn't quite sure where the ball was and the ball knocked off the leg bail"}, {"ball": 8.5, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$b$$ $$Patel$$ $$21$$ $$(37m$$ $$20b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$105.00$$"}, {"ball": 8.6, "isHighlight": false, "text": "Patel to Pathan,no run,gets forward and pushes it to the off side"}, {"ball": 8.6, "isHighlight": false, "text": "Both set batsmen gone"}, {"ball": 9.1, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan,no run,looks to drive and gets an inside edge to the leg side"}, {"ball": 9.2, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan,1 run,he drops it short and Shakib mistimes the punch to point"}, {"ball": 9.3, "isHighlight": false, "text": "Karanveer Singh to Pathan,1 run,slower through the air and he shuffles and softly clips it to the on side"}, {"ball": 9.4, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan,1 run,fuller one and he drags it across the line to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Karanveer Singh to Pathan,1 run,fetches it from off and middle and sweeps him"}, {"ball": 9.6, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan,1 wide,slides that wide outside off"}, {"ball": 9.6, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan,1 run,drops it wide outside off and he punches it to point"}, {"ball": 9.6, "isHighlight": false, "text": "Chiranjeev: \"This is the best thing that can happen to Punjab. That is Shakib and Yusuf coming together early. They may not know what to do now, how to build and innings with no target to go for.\""}, {"ball": 9.6, "isHighlight": false, "text": "Mahesh: \"@Khalid, this is called Spectator's Curse :)\""}, {"ball": 10.1, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,1 wide,he slides this one wide down the leg side"}, {"ball": 10.1, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,no run,hammers it on a good length and cramps him up for room, he punches it down the track"}, {"ball": 10.1, "isHighlight": false, "text": "Veeru: \"Tendo would have been a better choice than Yusuf, at this stage of the innings! I see a low score for Yusuf..\""}, {"ball": 10.2, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,2 runs,nearly bisects the gap between two men in the deep on the on side, he pulls and deep midwiclet slides and cuts it off"}, {"ball": 10.3, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,1 run,fuller and in the length to drive and he places it to the deep but straight to the sweeper"}, {"ball": 10.4, "isHighlight": false, "text": "Johnson to Pathan,no run,awkward looking shot by Yusuf, this was short and on the body and he doesn't make proper contact"}, {"ball": 10.5, "isHighlight": false, "text": "Johnson to Pathan, $$FOUR$$ ,much better from Yusuf, another short one but this was angling across, he followed the angle and arched back and carved it over point, used the pace and didn't hit it too hard"}, {"ball": 10.6, "isHighlight": false, "text": "Johnson to Pathan,no run,this was a yorker fired on the pads and it was a bit too quick for Yusuf, hit on the legs and Johnson appeals, missing leg.. oh wait! maybe that was hitting, need to see another replay of that"}, {"ball": 11.1, "isHighlight": false, "text": "Dhawan to Shakib Al Hasan,1 run"}, {"ball": 11.2, "isHighlight": false, "text": "Dhawan to Pathan,1 run,he tucks it towards deep square leg"}, {"ball": 11.3, "isHighlight": false, "text": "Dhawan to Shakib Al Hasan,1 run,the keeper is up, he gives him some width and he cuts him to point"}, {"ball": 11.4, "isHighlight": false, "text": "Dhawan to Pathan, $$FOUR$$ ,edged and no slip, this was wide outside off and he chased it and he gets an outside edge that beat Saha"}, {"ball": 11.5, "isHighlight": false, "text": "Dhawan to Pathan,no run,full on the pads and he works it to midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Dhawan to Pathan,2 runs,punched towards mid-off and the throw to the bowler;s end was wide and they claim the overthrow, Karanveer is irritated"}, {"ball": 11.6, "isHighlight": false, "text": "Suzz: \"10.6 missing leg?! Ah I think Pathan is extremely lucky to still be out there!\""}, {"ball": 12.1, "isHighlight": false, "text": "Awana to Shakib Al Hasan,no run,outside off and cut towards point"}, {"ball": 12.2, "isHighlight": false, "text": "Awana to Shakib Al Hasan, $$FOUR$$ ,good counter attack, this was hammered on a length and he comes down the track and pounds it down to deep extra cover"}, {"ball": 12.3, "isHighlight": false, "text": "Awana to Shakib Al Hasan,1 run,a bit short and he hops and dabs it down to third man"}, {"ball": 12.4, "isHighlight": false, "text": "Awana to Pathan,no run,appeal for an lbw, he was looking to softly push this to the on side and the ball came back in,struck on the back leg but on the thigh pad, Llong thought it may have cleared the stumps"}, {"ball": 12.5, "isHighlight": false, "text": "Awana to Pathan,1 leg bye,swings it back in and he tucks it off the pads"}, {"ball": 12.6, "isHighlight": false, "text": "Awana to Shakib Al Hasan,no run,fires it full and he can only push it down to mid-off"}, {"ball": 13.1, "isHighlight": false, "text": "Dhawan to Pathan,no run,close call for Yusuf as Kings XI appeal for a run out, this was tucked towards square leg and Yusuf set off and was sent back, did the dive and Awana's throw was to the keeper, he made his ground"}, {"ball": 13.2, "isHighlight": false, "text": "Dhawan to Pathan,no run,hits the pads and lobs up and drops on the pitch"}, {"ball": 13.3, "isHighlight": false, "text": "Dhawan to Pathan, $$SIX$$ ,wakes up this time with a six over long-off, this was full and he made room and launched it into the crowd"}, {"ball": 13.4, "isHighlight": false, "text": "Dhawan to Pathan,1 run,swings it towards the pads and he works it towards midwicket"}, {"ball": 13.5, "isHighlight": false, "text": "Dhawan to Shakib Al Hasan,1 run,strange shot by Shakib, he punches it on the up towards mid-off"}, {"ball": 13.5, "isHighlight": false, "text": "Sid: \"@Suzz: With the number of legit dismissals turned down this IPL, the batsman is not really that lucky any more. These incidents are becoming more and more consistent.\""}, {"ball": 13.6, "isHighlight": false, "text": "Dhawan to Pathan,no run,comes back in and he drives back to the bowler"}, {"ball": 14.1, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan, $$FOUR$$ ,as straight as it gets! Tossed up on middle, Shakib cleared the front leg, made room to launch that over the bowler and long-off"}, {"ball": 14.2, "isHighlight": false, "text": "Karanveer Singh to Shakib Al Hasan, $$OUT$$ ,he looks to go downtown again but fails this time, tossed up and he was looking to swipe this across the line, miscued and Miller runs to his left from long-off and sets off"}, {"ball": 14.2, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$c$$ $$Miller$$ $$b$$ $$Karanveer$$ $$Singh$$ $$18$$ $$(30m$$ $$16b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$112.50$$"}, {"ball": 14.3, "isHighlight": false, "text": "Karanveer Singh to Pathan, $$OUT$$ ,Karanveer is on a hat-trick and KKR lose Yusuf as well! This was a fairly soft dismissal, tossed up on middle and leg and Yusus looks to chip this over long-on but doesn't do so with conviction, catching practice for Miller again"}, {"ball": 14.3, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$c$$ $$Miller$$ $$b$$ $$Karanveer$$ $$Singh$$ $$20$$ $$(30m$$ $$18b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$111.11$$"}, {"ball": 14.3, "isHighlight": false, "text": "News just in"}, {"ball": 14.3, "isHighlight": false, "text": "Team for Bangladesh: Raina (C ), Uthappa, Rahane, Pujara, Rayudu, Manoj, Jadhav, Saha, Rasool, Akshar, Vinay, Umesh, Binny, Mohit, Mishra"}, {"ball": 14.3, "isHighlight": false, "text": "Slip in place"}, {"ball": 14.4, "isHighlight": false, "text": "Karanveer Singh to SA Yadav,no run,Suryakumar quietly defends the hat-trick ball off the back foot"}, {"ball": 14.5, "isHighlight": false, "text": "Karanveer Singh to SA Yadav, $$FOUR$$ ,oh well Rishi makes a mess of it at third man, spinning away and Suryakumar follows the turn and dabs it wide of slip, Dhawan chases it and doesn't time the dive right, tries to pull it back but fails, tries again and again and the ball beats him"}, {"ball": 14.6, "isHighlight": false, "text": "Karanveer Singh to SA Yadav,no run"}, {"ball": 15.1, "isHighlight": false, "text": "Patel to ten Doeschate,no run,looks to cut but misses, stifled appeal"}, {"ball": 15.2, "isHighlight": false, "text": "Patel to ten Doeschate,1 leg bye,on the pads and he knocks it to the on side"}, {"ball": 15.3, "isHighlight": false, "text": "Patel to SA Yadav,no run,he stays back and punches it to the off side"}, {"ball": 15.3, "isHighlight": false, "text": "Started drizzling"}, {"ball": 15.4, "isHighlight": false, "text": "Patel to SA Yadav,no run,makes room to punch it through the off side but gets an inside edge to the pad"}, {"ball": 15.4, "isHighlight": false, "text": "$$5.40$$ : All the covers are off. The umoires are waiting for the groundstaff to finish. The players are near the boundary"}, {"ball": 15.4, "isHighlight": false, "text": "Arvi : \"Pankaj Singh !?! 8 Ranji Matches 39 .. Was it good enough . Anureet Singh did better .. He took 44 wickets in 8 Matches and bowls at good pace as well .. Very strange selection. \""}, {"ball": 15.4, "isHighlight": false, "text": "Natasha Rajshekhar: \"Gambhir got lucky. I hope he doesn't disappoint. I have a feeling he won't but I've been proven wrong a lot lately.\""}, {"ball": 15.4, "isHighlight": false, "text": "Nikhil Naz: \"During India's last tour to England a total of 11 players returned home injured. Unsurprisingly this time they've picked a 18 member squad.\""}, {"ball": 15.4, "isHighlight": false, "text": "$$5.35pm$$ : Some of the outfield covers are slowly coming off. But the square is still protected"}, {"ball": 15.4, "isHighlight": false, "text": "JV: \"Can't understand this swap of roles for Aaron and Yadav. During the NZ tour, Aaron was in the ODI side and Yadav in the test side. Now a swap. Why?\""}, {"ball": 15.4, "isHighlight": false, "text": "Saad: \"@Rahul, Samson is indeed talented but I still doubt he is quite ready for test cricket. He seems to lack maturity to keep going. Saha on the other hand is older but still on 28, a much better keeper and this IPL he proved that he can score quickly if need be. \""}, {"ball": 15.4, "isHighlight": false, "text": "$$5.28pm$$ : And just as they started removing the covers the tap was turned on again. The covers are coming back on!"}, {"ball": 15.4, "isHighlight": false, "text": "Squad for Eng tour - MS Dhoni (capt), M Vijay, Shikhar Dhawan, Gautam Gambhir, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, Rohit Sharma, Ravindra Jadeja, R Ashwin, Bhuvneshwar Kumar, Mohammed Shami, Ishwar Pandey, Ishant Sharma, Stuart Binny, Varun Aaron, Wriddhiman Saha, Pankaj Singh"}, {"ball": 15.4, "isHighlight": false, "text": "Gambhir and Pankaj stand out, at first glance"}, {"ball": 15.4, "isHighlight": false, "text": "Tushar: \"How come Ishant Sharma does not stand out for you?\" Seven wickets in an innings in NZ. Let's not forget"}, {"ball": 15.4, "isHighlight": false, "text": ""}, {"ball": 15.4, "isHighlight": false, "text": "$$5.25pm$$ : Better news guys. The covers are coming off"}, {"ball": 15.4, "isHighlight": false, "text": "hayer: \"Manoj over Yuvi is surprising! What this guy have done to. Been injured most of the time, have not played single match winning innings in IPL!\""}, {"ball": 15.4, "isHighlight": false, "text": "$$5.20pm$$ : The drizzle's picked up and the covers are on. Clouds don't look too threatening so we hope this is just a brief interruption"}, {"ball": 15.4, "isHighlight": false, "text": "Manan: \"Very good team section but Raina as captain is little surprising. Really happy to see Pervez given a look. Hope this time he gets a chance in playing XI\""}, {"ball": 15.4, "isHighlight": false, "text": "Rahul: \"Saha over Samson? and why must we persist with the likes of Vinay and Binny!\""}, {"ball": 15.5, "isHighlight": false, "text": "Patel to SA Yadav,no run,looks to whip it away and the ball hits high on the pad"}, {"ball": 15.6, "isHighlight": false, "text": "Patel to SA Yadav,1 run,he stays back and punches it towards long-off"}, {"ball": 15.6, "isHighlight": false, "text": "No reduction in overs"}, {"ball": 16.1, "isHighlight": false, "text": "Dhawan to SA Yadav, $$SIX$$ ,this was the pick up shot, this was a good length ball on middle and he swings and sends it a few rows over deep square leg"}, {"ball": 16.2, "isHighlight": false, "text": "Dhawan to SA Yadav, $$FOUR$$ ,another impressive stroke, this was fuller and Yadav made a hint of room and lofted it effortlessly down the ground"}, {"ball": 16.3, "isHighlight": false, "text": "Dhawan to SA Yadav,no run,good comeback as Dhawan swings it in and Yadav gets an inside edge to the boot"}, {"ball": 16.4, "isHighlight": false, "text": "Dhawan to SA Yadav,1 run,a low inswinging full toss on the pads and he works it away to fine leg"}, {"ball": 16.5, "isHighlight": false, "text": "Dhawan to ten Doeschate,2 runs,that's good running, tucks it into the vacant gap at midwicket, ten Doeschate hurries him for the second"}, {"ball": 16.6, "isHighlight": false, "text": "Dhawan to ten Doeschate,1 run,slower ball on the pads and he works it to midwicket"}, {"ball": 17.1, "isHighlight": false, "text": "Karanveer Singh to ten Doeschate, $$SIX$$ ,minimum effort and maximum reward, ten Doeschate comes down the pitch to a flighted ball and checks his chipped shot and yet sends it a few rows over wide long-on"}, {"ball": 17.2, "isHighlight": false, "text": "Karanveer Singh to ten Doeschate, $$SIX$$ ,higher and further! Tossed up and he gets on his knee and slams that over long-on again, mad scramble for the ball there"}, {"ball": 17.3, "isHighlight": false, "text": "Karanveer Singh to ten Doeschate,1 run,swung towards long-on and in the air but on the first bounce"}, {"ball": 17.4, "isHighlight": false, "text": "Karanveer Singh to SA Yadav,no run,looks to sweep and gets hit on the pad"}, {"ball": 17.5, "isHighlight": false, "text": "Karanveer Singh to SA Yadav, $$FOUR$$ ,excellent placement! Tossed up on middle and leg, he gets on his knee and sweeps him firlmy to deep midwicket, bisects the gap between two fielders there"}, {"ball": 17.6, "isHighlight": false, "text": "Karanveer Singh to SA Yadav, $$OUT$$ ,his cameo has ended, Yadav shuffles across his stumps and exposes the leg stump, Karanveer bowls that straight on the stumps and hits middle and leg"}, {"ball": 17.6, "isHighlight": false, "text": "$$SA$$ $$Yadav$$ $$b$$ $$Karanveer$$ $$Singh$$ $$20$$ $$(13m$$ $$14b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$142.85$$"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to ten Doeschate,1 run,good length on the body and he shuffles and works it away down to fine leg"}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to Chawla,1 run,Johnson bowls this full on the pads and he whips it down to deep square leg"}, {"ball": 18.3, "isHighlight": false, "text": "Johnson to ten Doeschate,no run,looked like the slower bouncer, 124 kph, ten Doeschate doesn't read it and swings too early but misses"}, {"ball": 18.4, "isHighlight": false, "text": "Johnson to ten Doeschate, $$OUT$$ ,caught at the boundary's edge, Johnson bowled that full on the pads, ten Doeschate was aiming to flick that over deep midwicket, a little more muscle would have sent it over, Vohra barely had to move"}, {"ball": 18.4, "isHighlight": false, "text": "$$RN$$ $$ten$$ $$Doeschate$$ $$c$$ $$Vohra$$ $$b$$ $$Johnson$$ $$17$$ $$(19m$$ $$10b$$ $$0x4$$ $$2x6)$$ $$SR:$$ $$170.00$$"}, {"ball": 18.5, "isHighlight": false, "text": "Johnson to Chawla,no run,he beats him on the drive outside the off stump"}, {"ball": 18.6, "isHighlight": false, "text": "Johnson to Chawla,1 run,fires it full on the stumps and he drives on the up towards mid-on"}, {"ball": 19.1, "isHighlight": false, "text": "Awana to Chawla, $$FOUR$$ ,good way to start the final over, a low full toss on the pads, he easily whips it down to fine leg, fielder dives in vain"}, {"ball": 19.2, "isHighlight": false, "text": "Awana to Chawla, $$FOUR$$ ,fine leg is up and Awana makes the mistake of dropping it short down the leg side, free swing to the fine leg rope"}, {"ball": 19.3, "isHighlight": false, "text": "Awana to Chawla,2 runs,fullish ball on the stumps and drilled to long-on, they hurry the second, Chawla comes in the way of the throw and is hit on the back"}, {"ball": 19.4, "isHighlight": false, "text": "Awana to Chawla,no run,good comeback by Awana, fires the yorker and he can only drill it back to the bowler"}, {"ball": 19.5, "isHighlight": false, "text": "Awana to Chawla,1 run,  $$OUT$$ ,Direct hit and Narine has to go but all sorts of things happened there. The yorker was squirted back to Awana who deflected the ball to the on side, the fielder had a shy at the batsman's end and there was an overthrow, Johnson then picked up and fired the throw to the bowler's end and knocked down the stump, Narine was well short but Bailey who was behind the stumps for the throw nudged a bail, the bail didn;t fall but Johnson's throw uprooted the stump, the third umpire took his time and it was a legit call"}, {"ball": 19.5, "isHighlight": false, "text": "$$SP$$ $$Narine$$ $$run$$ $$out$$ $$0$$ $$(6m$$ $$0b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$-$$"}, {"ball": 19.6, "isHighlight": false, "text": "Awana to Chawla, $$FOUR$$ ,nice way to round off the innings, shuffles across the stumps and paddles a low full toss over short fine leg"}, {"ball": 19.6, "isHighlight": false, "text": "Kings XI are known to chase down big targets with ease, but it this big enough? Should be a fascinating contest against KKR's spin. This may be a shorter break owing to the interruption earlier so please stick around. We should be back soon."}, {"ball": 19.6, "isHighlight": false, "text": "Cyrille Viossat: \"Does it matter that Bailey dislodged a bail? The throw uprooted the stump -which is how to achieve a run-out when bails are off. So surely that would have been out even if both bails had been dislodged.\""}], "name": "Kings XI Punjab v Kolkata Knight Riders", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734043.html?innings=1;view=commentary", "match_num": 57}