{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  A bit of a drizzle around in Mumbai, one of the reasons CSK chose to chase."}, {"ball": 0, "isHighlight": false, "text": "All the overseas players in this match are primarily batsmen."}, {"ball": 0, "isHighlight": false, "text": "Daud: \"Michael vs David. Battle of the Hussey brothers.\""}, {"ball": 0, "isHighlight": false, "text": "Sriram: \"The last time these two faced off in finals, Hussey was in Yellow and Smith in Blue!\""}, {"ball": 0, "isHighlight": false, "text": "Michael Hussey and Lendl Simmons are Mumbai's openers. Ashish Nehra to bowl."}, {"ball": 0, "isHighlight": false, "text": "$$7.40pm$$  Brendon McCullum is back, Samuel Badree is out."}, {"ball": 0, "isHighlight": false, "text": "Here's the Mumbai XI: Lendl Simmons, Michael Hussey, Rohit Sharma, Kieron Pollard, Amabti Rayudu, Corey Anderson, Aditya Tare, Harbhajan Singh, Praveen Kumar, Pragyan Ojha, Jasprit Bumrah"}, {"ball": 0, "isHighlight": false, "text": "Chennai XI: Dwayne Smith, Brendon McCullum, Suresh Raina, Faf du Plessis, David Hussey, MS Dhoni, Ravindra Jadeja, R Ashwin, Mohit Sharma, Ishwar Pandey, Ashish Nehra."}, {"ball": 0, "isHighlight": false, "text": "Meanwhile, at Eden Gardens,  $$Kolkata$$ $$Knight$$ $$Riders$$ $$are$$ $$through$$ $$to$$ $$the$$ $$final$$ , having beaten Kings XI Punjab."}, {"ball": 0, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ : \"It is slightly different to playing in the league phase, Brabourne is a fantastic ground, quick outfield.\" He says there could be plenty of runs in this."}, {"ball": 0, "isHighlight": false, "text": "$$Rohit$$ $$Sharma$$ : \"Let's hope we put up a good show. This pitch, I dont think it will be too different from the Wankhede track. The other night was brilliant, Corey Anderson was amazing.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.35pm$$ $$Chennai$$ $$choose$$ $$to$$ $$field$$ . It is the batting that has been CSK's strength, and they seem to have the confidence of chasing down any target that is set by Mumbai."}, {"ball": 0, "isHighlight": false, "text": "Raghunath R: \"MI will be high on confidence after their assault last game. CSK will be eager to prove themselves after a blip towards the latter stage of this ipl. Add to that, the history of enmity between the two teams. I hope CSK will look to make it equal it 10-10. This is going to be a cracker of a contest.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.15pm$$  Fifteen minutes away from a match-up between the two highest profile teams in the tournament. Chennai Super Kings v Mumbai Indians coming up."}, {"ball": 0, "isHighlight": false, "text": "Just a reminder that the match is at the Brabourne Stadium, and not at the Wankhede Stadium."}, {"ball": 0, "isHighlight": false, "text": "Ninad: \"I think Brabourne is key to everything in today's match. Its generally slow and turns in tests but in T20 it has been very flat in the past. If its turner and slow scoring track, it will be a cracker as both teams have quality spinners\""}, {"ball": 0, "isHighlight": false, "text": "MS Dhoni playing for you today? What about Corey Anderson? Get your  $$Cricinfo$$ $$Fantasy$$ $$XI$$  ready in time for the big game."}, {"ball": 0.1, "isHighlight": false, "text": "Nehra to Simmons,1 run,the first ball from Nehra cuts back after pitching around off, Simmons is cramped up, he whips the ball towards  midwicket"}, {"ball": 0.2, "isHighlight": false, "text": "Nehra to Hussey,1 run,length ball on the pads, guided down to fine leg"}, {"ball": 0.3, "isHighlight": false, "text": "Nehra to Simmons, $$FOUR$$ ,shuffles across and clips that to the midwicket boundary, great timing there, no effort to hit that hard"}, {"ball": 0.4, "isHighlight": false, "text": "Nehra to Simmons,no run,misses out this time, Nehra is getting the ball to move around here, but now gets it down the leg side, should have been glanced to the fine-leg boundary, Simmons can't get bat on it, off the thigh pad"}, {"ball": 0.5, "isHighlight": false, "text": "Nehra to Simmons,no run,this one is down the leg side, should have been called a wide"}, {"ball": 0.6, "isHighlight": false, "text": "Nehra to Simmons,no run,length ball on middle, blocked off the back foot to the off side"}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Hussey,no run,defends Ishwar Pandey's first ball down the track"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Hussey,no run,more defence, this time to the leg side, Ishwar keeping it short of a length"}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Hussey,1 leg bye,fuller ball on the pads, Hussey can't whip that away down the leg side, off the pads"}, {"ball": 1.3, "isHighlight": false, "text": "samkit: \"0.5 That was a clear wide...any umpire should have given this as wide"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Simmons, $$FOUR$$ ,gets on his toes and slashes that through the covers for four, stylishly done by Simmons"}, {"ball": 1.4, "isHighlight": false, "text": "shams: \"Curious to see/know if Hussey brothers would celebrate when One Hussey brother is involved in the dismissal of other Hussey brother :) \""}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Simmons,1 run,short of length ball just outside off, defended behind point for a quick single, some hesitation there and if Jadeja had hit the stumps at the non-striker's end, Simmons would have been run out"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Hussey,1 run,tapped towards cover for another single"}, {"ball": 2.1, "isHighlight": false, "text": "Nehra to Hussey,no run,pitched up and on the stumps, eased towards mid-on"}, {"ball": 2.2, "isHighlight": false, "text": "Nehra to Hussey,no run,137kph, pitched up, thick outside bounces through to slip, where David Hussey stops the ball"}, {"ball": 2.3, "isHighlight": false, "text": "Nehra to Hussey,1 run,full ball on middle and leg, patted to the leg side for one more, that was a thick inside edge actually, sends the ball towards midwicket"}, {"ball": 2.4, "isHighlight": false, "text": "Nehra to Simmons,1 run,another inside-edge, goes for a flashy drive through covers, but the ball rolls behind square leg instead"}, {"ball": 2.5, "isHighlight": false, "text": "Nehra to Hussey,1 run,given a bit of width, that is helped towards fine leg for a single"}, {"ball": 2.6, "isHighlight": false, "text": "Nehra to Simmons,1 run,short of length ball is worked away towards mid-on for one more"}, {"ball": 3.1, "isHighlight": false, "text": "Sharma to Simmons,1 run,short of length ball on off stump, tapped in front of point for a single"}, {"ball": 3.2, "isHighlight": false, "text": "Sharma to Hussey,no run,Hussey charges down the track and looks to thrash the ball through the mid-off, doesn't connect"}, {"ball": 3.3, "isHighlight": false, "text": "Sharma to Hussey, $$FOUR$$ ,this time it is off the middle of the bat, superbly struck by Hussey, waits for it and slaps this past cover for four, it was a short of length ball just outside off, not too much wrong with that"}, {"ball": 3.4, "isHighlight": false, "text": "Sharma to Hussey,no run,thick outside edge this time, the ball rolls towards cover"}, {"ball": 3.5, "isHighlight": false, "text": "Sharma to Hussey,1 run,length ball is tapped towards mid-off"}, {"ball": 3.6, "isHighlight": false, "text": "Sharma to Simmons,no run,stays in the crease and thumps this full ball towards mid-off, can't place it wide of the fielder"}, {"ball": 3.6, "isHighlight": false, "text": "Suhaib: \"There have been too many farcical umpiring errors throughout this IPL. I guess umpires are increasingly feeling the pressures of all the excitement and in turn getting excited themselves. One solution could be to put ear plugs on them or better still a soul-searching/mind-broadening lecture by some \"guru\" on a loop.\""}, {"ball": 4.1, "isHighlight": false, "text": "Pandey to Hussey, $$FOUR$$ ,a boundary to start the over, pitched up and that is punched over the bowler's head for four, Mumbai getting a move on now"}, {"ball": 4.2, "isHighlight": false, "text": "Pandey to Hussey, $$FOUR$$ ,drops it short, Hussey waits for it and thumps it to midwicket for four more, two fours off the first two balls puts the pressure on Ishwar"}, {"ball": 4.3, "isHighlight": false, "text": "Pandey to Hussey,no run,angling across Hussey, who wanted to steer that down to third man but doesn't get bat on it"}, {"ball": 4.4, "isHighlight": false, "text": "Pandey to Hussey,1 leg bye,on the pads, a length ball, can't get bat on it, the ball rolls off his pads behind square leg"}, {"ball": 4.5, "isHighlight": false, "text": "Pandey to Simmons,1 run,short of length ball on off stump, Simmons dabs it towards point for a single"}, {"ball": 4.6, "isHighlight": false, "text": "Pandey to Hussey,1 run,guided towards backward point for another quick single"}, {"ball": 4.6, "isHighlight": false, "text": "Atish: \"I hate it when Mumbai Indians don't capitalize the first powerplay (6 overs). CSK is the best chasing team in big games. Who knows what score will be enough?\""}, {"ball": 4.6, "isHighlight": false, "text": "James: \"Have to agree with Suhaib, especially as the IPL has most of the world's best umpires (and Billy Bowden). Would DRS reduce the errors?\""}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Hussey, $$FOUR$$ ,a classic Twenty20 hit, Hussey goes for the mow over midwicket, top edges it instead over the slips for four"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Hussey,1 run,short of length ball outside off, slapped towards deep point for a single"}, {"ball": 5.2, "isHighlight": false, "text": "Siddharth: \"@Suhaib: And a \"ding\" sound in the middle of the lecture when the batsman nicks it\""}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Simmons, $$FOUR$$ ,Simmons skips down the track and slaps that over extra cover, a flat-batted powerhit, he had the room to free his arms allowing him to get plenty of muscle behind that"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Simmons, $$SIX$$ ,shot! Simmons stays in the crease this time, not that short from Mohit, it still seems to sit up for Simmons, who hammers that over midwicket for six"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Simmons, $$FOUR$$ ,goes to the slower ball which has worked for him so well in the past two seasons, doesn't fool Simmons though as he thrashes the ball through point for four"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Simmons,no run,length ball is defended towards the bowler, Mumbai will be thrilled with this start, 53 in the Powerplay"}, {"ball": 5.6, "isHighlight": false, "text": "$$Time-out$$"}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin from round the wicket"}, {"ball": 6.1, "isHighlight": false, "text": "Ashwin to Hussey,no run,sliding in towards middle, defended by Hussey off the front foot"}, {"ball": 6.2, "isHighlight": false, "text": "Ashwin to Hussey,no run,defended once more by Hussey"}, {"ball": 6.3, "isHighlight": false, "text": "Ashwin to Hussey,3 runs,gives some width this time, slapped towards sweeper cover, where a diving stop from Mohit keeps the ball from reaching the rope, he's scraped his knee stopping that one"}, {"ball": 6.4, "isHighlight": false, "text": "Ashwin to Simmons,no run"}, {"ball": 6.5, "isHighlight": false, "text": "Ashwin to Simmons,1 run,thrashed towards long-on by Simmons"}, {"ball": 6.6, "isHighlight": false, "text": "Ashwin to Hussey,no run,on the back foot, looks to work the ball towards the leg side, doesn't get bat on it"}, {"ball": 7.1, "isHighlight": false, "text": "Jadeja to Simmons,1 run,goes for the sweep, towards fine leg for a single"}, {"ball": 7.2, "isHighlight": false, "text": "Jadeja to Hussey,no run,a reverse-lap shot from Hussey, can't get it fine towards third man though, it is towards point instead"}, {"ball": 7.3, "isHighlight": false, "text": "Jadeja to Hussey,1 run,clipped towards midwicket for a single"}, {"ball": 7.4, "isHighlight": false, "text": "Jadeja to Simmons,1 run,full ball on middle and leg, driven inside-out towards long-off"}, {"ball": 7.5, "isHighlight": false, "text": "Jadeja to Hussey,1 run,just outside off, goes on the back foot, and clips that towards midwicket"}, {"ball": 7.6, "isHighlight": false, "text": "Jadeja to Simmons,2 runs,full ball on the pads, eased towards wide mid-on, the bowler Jadeja has to chase after it, stops it just past the circle, the batsmen have sprinted back for two by then"}, {"ball": 8.1, "isHighlight": false, "text": "Ashwin to Hussey,1 run,on the pads, whipped towards deep midwicket"}, {"ball": 8.2, "isHighlight": false, "text": "Ashwin to Simmons,1 run,dropped short, Simmons wants to go big, his slog sweep can only send the ball towards deep square leg for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Ashwin to Hussey, $$SIX$$ ,Hussey shows how it's done, who needs power to hit big? takes a couple of paces down the track and times it perfectly as he swings that towards cow corner"}, {"ball": 8.4, "isHighlight": false, "text": "Ashwin to Hussey,1 run,tucks it away for a single this time"}, {"ball": 8.5, "isHighlight": false, "text": "Ashwin to Simmons,no run,full ball on the pads, was sliding down"}, {"ball": 8.6, "isHighlight": false, "text": "Ashwin to Simmons,no run,driven towards cover by Simmons to end the over"}, {"ball": 8.6, "isHighlight": false, "text": "Ankit Kumar: \"Mumbai 65-0 and Sri Lanka 65-9 Same score. Different stories.\""}, {"ball": 9.1, "isHighlight": false, "text": "Jadeja to Hussey,1 run,short of length ball well outside off, slapped towards deep point for a single"}, {"ball": 9.1, "isHighlight": false, "text": "Just a reminder that the Brabourne boundaries are quite short, so Mumbai will need a tall score."}, {"ball": 9.2, "isHighlight": false, "text": "Jadeja to Simmons,1 run,steps down the track, eases the ball towards long-on for a single"}, {"ball": 9.3, "isHighlight": false, "text": "Jadeja to Hussey,2 runs,full toss outside off, uncharacteristically Hussey doesn't capitalise, he thumps the ball towards wide long-on, gets two for his efforts"}, {"ball": 9.4, "isHighlight": false, "text": "Jadeja to Hussey, $$OUT$$ ,quicker one from Jadeja gets the breakthrough, doesn't bounce as much as Michael Hussey expects, Hussey was looking to slog that towards midwicket, the ball sneaks under his bat and onto the stumps"}, {"ball": 9.4, "isHighlight": false, "text": "$$MEK$$ $$Hussey$$ $$b$$ $$Jadeja$$ $$39$$ $$(41m$$ $$33b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$118.18$$"}, {"ball": 9.4, "isHighlight": false, "text": "Corey Anderson is the new batsman, fresh from a stunning innings that dumped Rajasthan Royals out of the tournament"}, {"ball": 9.5, "isHighlight": false, "text": "Jadeja to Anderson,no run,length ball is defended back towards the bowler"}, {"ball": 9.6, "isHighlight": false, "text": "Jadeja to Anderson, $$SIX$$ ,six second ball for Anderson, his national team captain, Brendon McCullum was luring at deep backward square leg boundary but Anderson has hit this well enough to clear the rope, McCullum jumps but he had no realistic chance of getting that"}, {"ball": 10.1, "isHighlight": false, "text": "Ashwin to Simmons,no run,spins away as Simmons looks to thump that through the off side, misses"}, {"ball": 10.2, "isHighlight": false, "text": "Ashwin to Simmons,1 run,worked towards mid-on for a single"}, {"ball": 10.3, "isHighlight": false, "text": "Ashwin to Anderson,1 run,on the pads, Anderson shuffles across and clips the ball to square leg"}, {"ball": 10.4, "isHighlight": false, "text": "Ashwin to Simmons,no run,length ball on the pads, Simmons stifled by Ashwin's outside-leg line, defends towards midwicket"}, {"ball": 10.5, "isHighlight": false, "text": "Ashwin to Simmons,1 run,a full ball is thumped towards long-off this time"}, {"ball": 10.6, "isHighlight": false, "text": "Ashwin to Anderson,1 run,on the pads, worked away for a single to midwicket, Ashwin has bowled another tight over, just 17 off his three overs"}, {"ball": 10.6, "isHighlight": false, "text": "Avinesh: \"SriLanka 67 all out. Is there any chance Malinga will be back for IPL if MI goes into the Qualifier.\""}, {"ball": 11.1, "isHighlight": false, "text": "Raina to Anderson,no run,short of length outside off from round the wicket, Anderson wants to shop that through the off, bottom edges it and it bounces towards the keeper"}, {"ball": 11.2, "isHighlight": false, "text": "Raina to Anderson,1 run,reverse-swept towards point for a single"}, {"ball": 11.3, "isHighlight": false, "text": "Raina to Simmons,1 run,drops this short, Simmons pulls but can't get a boundary, just a single to midwicket"}, {"ball": 11.4, "isHighlight": false, "text": "Raina to Anderson, $$SIX$$ ,there's the big hit, Anderson gets on one knee and slog-sweeps that over midwicket for six, just clears the rope, not sure how many other grounds that would have been a six"}, {"ball": 11.5, "isHighlight": false, "text": "Raina to Anderson, $$FOUR$$ ,Anderson showing why he was the talk of the town before the auction, a scorching reverse-sweep here, gets serious power to send that ball behind backward point for four"}, {"ball": 11.6, "isHighlight": false, "text": "Raina to Anderson,1 run,drills this one towards wide long-on, Faf du Plessis is the fielder there, keeps them to a single"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Anderson, $$OUT$$ ,Anderson is gone, a top-edge as he goes for the sweep, Ishwar Pandey gets under that deep backward square leg, has to wait a long time for the ball to land, he keeps his calm though and pouches it"}, {"ball": 12.1, "isHighlight": false, "text": "$$CJ$$ $$Anderson$$ $$c$$ $$Pandey$$ $$b$$ $$Ashwin$$ $$20$$ $$(10m$$ $$10b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 12.2, "isHighlight": false, "text": "Ashwin to Simmons, $$SIX$$ ,Simmons flatbats this with immense power, there was a man at long-on, but Simmons was confident he could clear him, he does"}, {"ball": 12.3, "isHighlight": false, "text": "Ashwin to Simmons,3 runs,well outside off, chopped towards deep backward point, Rohit sprints back for the third"}, {"ball": 12.4, "isHighlight": false, "text": "Ashwin to Sharma,no run,defended by Rohit to the leg side"}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Sharma,no run,guided towards backward point by Rohit"}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin to Sharma,no run,three dot balls in a row to finish the over"}, {"ball": 13.1, "isHighlight": false, "text": "Pandey to Simmons,no run,short of length ball outside off, Simmons looks to chop that through point, but doesn't connect"}, {"ball": 13.2, "isHighlight": false, "text": "Pandey to Simmons,no run,connects properly this time, but doesn't place it properly, shortish ball is slapped towards backward point"}, {"ball": 13.3, "isHighlight": false, "text": "Pandey to Simmons,no run,short of length ball outside off, Simmons looks to hammer that through the off side, can't connect, that's six dots in a row!"}, {"ball": 13.3, "isHighlight": false, "text": "Simmons takes off his helmet and walks away from the stumps to gather his concentration"}, {"ball": 13.4, "isHighlight": false, "text": "Pandey to Simmons, $$FOUR$$ ,instead of trying to lash the ball through the off, Simmons decides to move across the stumps and helps this past short fine for four, gets to a quick half-century as well"}, {"ball": 13.5, "isHighlight": false, "text": "Pandey to Simmons,1 run,clipped towards deep midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Pandey to Sharma, $$FOUR$$ ,how often does Rohit Sharma play this shot? seems like at least once every T20 innings, he's looking to drive the ball through the off, a length ball, an edge sends the ball wide of the keeper to the third man boundary, despite three dot balls to start, Mumbai have managed to get nine off the over"}, {"ball": 14.1, "isHighlight": false, "text": "Jadeja to Simmons, $$SIX$$ ,no trouble at the start of the over this time for simmons, plants his front leg well forward and thumps that high and straight to the long-off boundary for six"}, {"ball": 14.2, "isHighlight": false, "text": "Jadeja to Simmons,1 run,towards backward square leg for a single"}, {"ball": 14.3, "isHighlight": false, "text": "Jadeja to Sharma,2 runs,full ball is driven towards deep point for a quick two"}, {"ball": 14.4, "isHighlight": false, "text": "Jadeja to Sharma,no run,length ball is driven off the front foot, Jadeja dives to his left to stop that one"}, {"ball": 14.5, "isHighlight": false, "text": "Jadeja to Sharma,1 run,Faf makes it so easy as he stops that fierce lofted drive from Rohit, who skipped down the track before sending the ball towards wide long-off"}, {"ball": 14.6, "isHighlight": false, "text": "Jadeja to Simmons,no run,defended by Simmons to end the over"}, {"ball": 14.6, "isHighlight": false, "text": "Ashish Nehra is back"}, {"ball": 15.1, "isHighlight": false, "text": "Nehra to Sharma,1 run,short of length ball, well outside off, stylishly driven towards sweeper cover for a single"}, {"ball": 15.2, "isHighlight": false, "text": "Nehra to Simmons,1 run,short of length ball on the pads, tucked towards midwicket for a single"}, {"ball": 15.3, "isHighlight": false, "text": "Nehra to Sharma, $$FOUR$$ ,another shot we have often seen from Rohit, skips down the track and flat bats that short of length ball over cover for four, powerfully struck"}, {"ball": 15.4, "isHighlight": false, "text": "Nehra to Sharma,no run,short of length ball is eased towards backward point, Simmons set off for a single, but is sent back"}, {"ball": 15.5, "isHighlight": false, "text": "Nehra to Sharma,1 run,length ball outside off is eased past the bowler towards long-off for a single"}, {"ball": 15.6, "isHighlight": false, "text": "Nehra to Simmons, $$SIX$$ ,Simmons makes this a good over for Mumbai, charges down the track and launches the ball over long-on, sweet strike that to finish the over"}, {"ball": 15.6, "isHighlight": false, "text": "$$Time-out$$ ."}, {"ball": 15.6, "isHighlight": false, "text": "Ashvini: \"4 overs to go.... 8 wickets in hand.... Pollard, Rayudu, Tare to follow.... Waiting for that 20 run over!!!!!\""}, {"ball": 16.1, "isHighlight": false, "text": "Jadeja to Sharma,1 run,short of a length ball, flat and on middle stump, eased towards sweeper cover"}, {"ball": 16.2, "isHighlight": false, "text": "Jadeja to Simmons,1 run,tries to make room but Jadeja doesn't give him much, slapped to long-on for a single"}, {"ball": 16.3, "isHighlight": false, "text": "Jadeja to Sharma,1 run,another single, down to long-off this time, Chennai won't mind this"}, {"ball": 16.4, "isHighlight": false, "text": "Jadeja to Simmons, $$OUT$$ ,and they certainly won't mind this, Simmons going for another big one, but doesn't middle, a thick inside edge and the ball lands safely in the hands of long-on"}, {"ball": 16.4, "isHighlight": false, "text": "$$LMP$$ $$Simmons$$ $$c$$ $$Raina$$ $$b$$ $$Jadeja$$ $$67$$ $$(71m$$ $$44b$$ $$5x4$$ $$4x6)$$ $$SR:$$ $$152.27$$"}, {"ball": 16.5, "isHighlight": false, "text": "Jadeja to Sharma,1 run,Rohit stays in the crease and taps the ball to square leg for a single"}, {"ball": 16.5, "isHighlight": false, "text": "Pollard banging the bail into the pitch to mark his guard."}, {"ball": 16.5, "isHighlight": false, "text": "CSKSimmons: \"Simmons doing what Dwayne Smith did last year!!! WHAT NEXT???? CSK will look to pick Simmons in the NEXT AUCTION!! :D\""}, {"ball": 16.6, "isHighlight": false, "text": "Jadeja to Pollard,1 run,length ball on the pads, eased towards mid-on for a single, just five off the over, superb from Jadeja"}, {"ball": 17.1, "isHighlight": false, "text": "Sharma to Pollard,1 run,short of length ball to start from Mohit, whipped towards deep square leg"}, {"ball": 17.2, "isHighlight": false, "text": "Sharma to Sharma, $$FOUR$$ ,lofted extra cover drive from Rohit Sharma, steps down the track and makes width by moving away from leg, then launches the ball over the infield"}, {"ball": 17.2, "isHighlight": false, "text": "Muqeet Ahmed: \"If there will be any award for fielding outside the circle on his own bowling, Jaddu will definitely have it every match.\""}, {"ball": 17.3, "isHighlight": false, "text": "Sharma to Sharma, $$OUT$$ ,Rohit is gone, looks to hammer the ball but top edges it, the ball swirls towards short third man, Brendon McCullum makes sure he pouches that one"}, {"ball": 17.3, "isHighlight": false, "text": "$$RG$$ $$Sharma$$ $$c$$ $$McCullum$$ $$b$$ $$Sharma$$ $$20$$ $$(25m$$ $$16b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$125.00$$"}, {"ball": 17.4, "isHighlight": false, "text": "Sharma to Pollard,1 run,Mohit tests Pollard with a slower ball, swatted towards deep square leg"}, {"ball": 17.5, "isHighlight": false, "text": "Sharma to Rayudu,1 run,short of length ball just outside off, guided towards short third man for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Sharma to Pollard,1 run,slower ball does the job for Mohit, Pollard checks his stroke, defends the ball towards cover for a single"}, {"ball": 17.6, "isHighlight": false, "text": "Mumbai unable to accelerate towards the end of the innings so far"}, {"ball": 18.1, "isHighlight": false, "text": "Nehra to Pollard, $$SIX$$ ,Pollard may change that though, he's begun with a thunderous hit that is way into the crowd beyond midwicket"}, {"ball": 18.1, "isHighlight": false, "text": "Nehra from round the wicket now"}, {"ball": 18.2, "isHighlight": false, "text": "Nehra to Pollard,no run,hurls it wide outside off, Pollard had moved across to try get to that, doesn't get bat on it"}, {"ball": 18.3, "isHighlight": false, "text": "Nehra to Pollard, $$FOUR$$ ,a touch short, sits up ofr Pollard who hits it with brutal power to the square-leg boundary for four"}, {"ball": 18.4, "isHighlight": false, "text": "Nehra to Pollard, $$OUT$$ ,got 'im! Nehra follows the batsman as Pollard backs away from leg stump, Pollard decides to go with the shot, ends up hitting it very high, Mohit Sharma at deep backward square leg continues CSK's trend of taking tough outfield catches today, this was in the air for ages, but Mohit judges it perfectly"}, {"ball": 18.4, "isHighlight": false, "text": "$$KA$$ $$Pollard$$ $$c$$ $$Sharma$$ $$b$$ $$Nehra$$ $$14$$ $$(12m$$ $$8b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$175.00$$"}, {"ball": 18.5, "isHighlight": false, "text": "Nehra to Rayudu,1 run,full ball on the stumps, drilled past the bowler, but Raina moves across from long-on to cut that off"}, {"ball": 18.6, "isHighlight": false, "text": "Nehra to Tare, $$OUT$$ ,Aditya Tare hit a first-ball six that is the most famous shot of his career so far in his previous match, this time he gets a first-ball duck, a pitched-up ball is outside edged and it ends as a simple catch to extra cover"}, {"ball": 18.6, "isHighlight": false, "text": "$$AP$$ $$Tare$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Nehra$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "Xaideez: \"I am still waiting for that 20 run over...\""}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Rayudu, $$OUT$$ ,and another one, Mumbai imploding here, Rayudu charges out and looks to hammer the ball over cover, can only provide an overhead catch to David Hussey, but is it a no-ball, taking many replays to decide, the third umpire thinks there is something behind the line, tight call, but the ump believes Mohit's heel was behind the line when his toe landed"}, {"ball": 19.1, "isHighlight": false, "text": "$$AT$$ $$Rayudu$$ $$c$$ $$Hussey$$ $$b$$ $$Sharma$$ $$2$$ $$(10m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$"}, {"ball": 19.1, "isHighlight": false, "text": "Kiraat: \"The now-famous Mumbai Meltdown\""}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to Kumar,1 run,shortish ball, Praveen wants to club it to midwicket, sends it towards long-off instead"}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Harbhajan Singh,1 run,slower one from Mohit, back-of-the-hand, wobbly seam short of length, Harbhajan was winding up for a big hit, but he can only dab this towards cover"}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Kumar, $$OUT$$ ,short of length ball, Praveen wants to clobber this over midwicket, he totally misses it and that crashes into the top of middle, once again the Mohit slower ball does the trick"}, {"ball": 19.4, "isHighlight": false, "text": "$$P$$ $$Kumar$$ $$b$$ $$Sharma$$ $$1$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to Ojha,1 run,short of length ball outside off, guided down to third man for a single"}, {"ball": 19.5, "isHighlight": false, "text": "Vineet Kumar Ve: \"And MM Sharma is now proud owner of Purple Cap.\""}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Harbhajan Singh, $$SIX$$ ,another slower one, Harbhajan spots this one, he can hit them big, he does this time, launching the ball high over long-on for a six to finish off the innings, Mumbai end on 173, is that enough? CSK probably ahead at this stage"}, {"ball": 19.6, "isHighlight": false, "text": "The Brabourne crowd kept waiting for the final flourish from Mumbai, but it never came as the wickets tumbled in the second half of the innings."}, {"ball": 19.6, "isHighlight": false, "text": "DM: \"Mumbai don't have a lineup with 8 batsmen who will score sometime or the other like KXIP, so they have to bank either upfront or low down - they tried the latter in UAE and bundled out under 130 all the time. They're packing the top order now and...well they are collapsing later but only after reaching 150 in the 17th over. This is MUCH better and will win more matches than lose.\""}, {"ball": 19.6, "isHighlight": false, "text": "Siddharth: \"Thats it.Wait for slow ball & whack it with all power.Learn from Harbhajan. :D\""}, {"ball": 19.6, "isHighlight": false, "text": "Idrees: \"@Xaideez perhaps that 20 run over will come next innings and if you were looking for that in Mumbai's batting then perhaps next match or season\""}, {"ball": 19.6, "isHighlight": false, "text": "Sagar: \"Mumbai short by \"those\" 20 runs... momentum with CSK...\""}], "name": "Chennai Super Kings v Mumbai Indians", "innings": "Mumbai Indians  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734045.html?innings=1;view=commentary", "match_num": 58}