{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$7.55pm$$  Ashish Nehra to bowl the first over. A delay to the start as some people stroll across the sightscreen."}, {"ball": 0, "isHighlight": false, "text": "$$7.50pm$$  James: \"One of the \"unsung heroes\" (insofar as you can have unsung heroes with Ravi Shastri commentating!) for KXIP this season has been Akshar Patel. Done a fine all round job.\" You may think he is unsung, but the national selectors have rewarded him with a place in the squad to Bangladesh."}, {"ball": 0, "isHighlight": false, "text": "Prashant: \"So either a team is going to win its first IPL, or second IPL, or third IPL.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.45pm$$  Saniul: \"Why drop Rishi Dhawan? He has been pretty utility all season. Can't a team EVER be brave enough and drop a foreign star, when he is not performing? Can't remember a single game this IPL where a side has played three foreigners.\" That's quite a rarity, think KKR did it in 2011, and Mumbai the next year."}, {"ball": 0, "isHighlight": false, "text": "\"KXIP again going without Shaun Marsh...\"their most consistent batsmen\"....not getting whats going in their mind...\" But who would you leave out, Sunny?"}, {"ball": 0, "isHighlight": false, "text": "arun8283: \"Can we just skip the formalities and say target is 195, csk needs 20 runs in last over, Dhoni facing MJ and start from there? 3 hours saved for a million fans each!\" No."}, {"ball": 0, "isHighlight": false, "text": "ram: \"this is an interesting match to watch. has a lot of one-on-one face-offs..ash vs maxi; johnson vs brendon(remember six of him off steyn); jadeja vs miller; mohit vs bailey(at death); last but not the least vohra vs ishwar \""}, {"ball": 0, "isHighlight": false, "text": "SRK: \"@Cricinfo, Why is no one asking to leave Bailey out? Surely, he's not been that great? Marsh deserves a place even if it means leaving Bailey or Johnson out. Surely, Sehwag can captain so Bailey can drop himself out?\""}, {"ball": 0, "isHighlight": false, "text": "Our man at the ground, Devashish Fuloria, says there only two shirts visible in the crowds - Dhoni and Maxwell. What a star Maxwell has become over the past few months. He hasn't been at his best in the past few matches though."}, {"ball": 0, "isHighlight": false, "text": "Arijit: \"Disappointed to see Rishi Dhawan miss out. He has been a better pick than Awana, who has struggled for consistency this term. Plus, he can always be handy with the bat.\""}, {"ball": 0, "isHighlight": false, "text": "$$7.30pm$$  Rohan: \"My prediction is that Sehwag sits out this time and Marsh comes in. Mitchell Johnson sits out and Sandeep Singh comes in! 4 international players would be Marsh, Maxwell, Miller and Bailey for KXIP! \" Interesting idea, we'll know whether the KXIP management go with it shortly."}, {"ball": 0, "isHighlight": false, "text": "$$Chennai$$ $$bowl$$  after winning the toss. MS Dhoni says his team's batting is a bit stronger than the bowling, which is why he wants to chase."}, {"ball": 0, "isHighlight": false, "text": "George Bailey says he would have wanted to chase as well. One change:  $$Sandeep$$ $$Sharma$$ $$in$$ $$for$$ $$Rishi$$ $$Dhawan$$ ."}, {"ball": 0, "isHighlight": false, "text": "No changes to the Super Kings XI. I mean the Chennai Super Kings of course."}, {"ball": 0, "isHighlight": false, "text": "$$7.25pm$$  Sushil: \"Maxwell will try to bounce back after his failure in last 3-4 innings. Dhoni will bring Badri as leggie in to get Maxwell. Ashwin so far looked ordinary he will also try to bowl out more importantly think out KXIP's explosive batsmen. What a game we have in our hand. IPL rocks!!\" We're almost at the toss. Let's see who gets a crack at whom first."}, {"ball": 0, "isHighlight": false, "text": "Siddharth: \"Tough Call for Bailey today ! Marsh or Johnson ? Remind you all, Johnson(From MI) thrashed CSK in last meet here at Wankhede. \""}, {"ball": 0, "isHighlight": false, "text": "Aneesh: \"Should McCullum open on Faf? Mac is not at all effective at number 4.\" And admittedly, he is one of the best hitters of pace bowling"}, {"ball": 0, "isHighlight": false, "text": "$$7.15$$ $$pm$$  In case anyone's wondering, Wankhede has not been the kindest place to either side. Both teams have negative records here. CSK four losses to three wins and Kings XI four losses to two wins."}, {"ball": 0, "isHighlight": false, "text": "\"Am I the only one want to see Marsh replacing Maxwell?\" It's been that kind of season, Arjun."}, {"ball": 0, "isHighlight": false, "text": "Murtaza: \"Punjab must go with 5 Bowlers, Keeping in mind that Csk got depth batting order\""}, {"ball": 0, "isHighlight": false, "text": "Mohan: \"Dont know if its Maxwell or Raina. Myself betting on Viru today. He hasnt made big score, always behaved sehwagesque. \""}, {"ball": 0, "isHighlight": false, "text": "$$7.00pm$$  Here's our  $$preview$$  to the game, and  $$here's$$  what Ajit Agarkar and Isa Guha have to say about the game."}, {"ball": 0, "isHighlight": false, "text": "Ashwin v Maxwell? Whose your money on?"}, {"ball": 0, "isHighlight": false, "text": "sg: \"KXIP havs an edge over CSK by winning both league matches.....looking for MaxivsAsh...\""}, {"ball": 0, "isHighlight": false, "text": "Eyon Shivraj: \"Looking forward to a big match today. I hope Maxwell had a good breakfast today, he needs to show up if KXI want to progress to their first finals!\""}, {"ball": 0, "isHighlight": false, "text": "Ajay Amritraj: \"That open challenge by Ashwin during post match interview...Hope it doesn't backfire... #CSK Fan \""}, {"ball": 0, "isHighlight": false, "text": "sugh: \"Ashwin has reputation of picking most prized wickets in big matches. I am sure ashwin will prevail over maxwell.\""}, {"ball": 0, "isHighlight": false, "text": "$$6.50pm$$  Greetings everyone, for Chennai Super Kings reaching the IPL finals is an annual ritual, for Kings XI Punjab reaching the final will mean breaking new ground."}, {"ball": 0, "isHighlight": false, "text": "Kings XI Punjab were the most impressive side in the league phase this season, CSK are the most impressive side over seven seasons of the IPL."}, {"ball": 0, "isHighlight": false, "text": "Which one will go through, to face KKR in the final on Sunday?"}, {"ball": 0.1, "isHighlight": false, "text": "Nehra to Sehwag,1 run,no boundary first ball from Sehwag, drops the ball at his feet and sets off"}, {"ball": 0.2, "isHighlight": false, "text": "Nehra to Vohra, $$FOUR$$ ,there is a first-ball four for Vohra though, poor ball on the pads, glanced down to fine leg for four, easily done"}, {"ball": 0.3, "isHighlight": false, "text": "Nehra to Vohra,no run,on the pads, clipped to square leg by Vohra"}, {"ball": 0.4, "isHighlight": false, "text": "Nehra to Vohra,1 run,angling across outside off, guided towards deep backward point"}, {"ball": 0.5, "isHighlight": false, "text": "Nehra to Sehwag,no run,on the pads, whipped to square leg where purple-cap holder Mohit Sharma fields, Nehra lucky to get away with that loose ball"}, {"ball": 0.6, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,Sehwag doesn't need much width to thrash the ball through the off side, short of length ball outside off, slashed through covers for four, second boundary of the over"}, {"ball": 0.6, "isHighlight": false, "text": "Idrees Kanchwal: \"Manan Vohra's game play (stance and movement at the pitch) looks very much like Kohli. Hope he can be even half as consistent as Kohli has been a quick fire 30-40 will help big time.\""}, {"ball": 1.1, "isHighlight": false, "text": "Pandey to Vohra,no run,Ishwar Pandey starts with a ball that nips away after pitching outside off, left alone"}, {"ball": 1.2, "isHighlight": false, "text": "Pandey to Vohra,no run,short of length ball is defended towards backward point"}, {"ball": 1.2, "isHighlight": false, "text": "Shankar: \"@ James... on Akshar Patel... its good for India and bad for fantasy lovers who will be missing one awesome uncapped player\""}, {"ball": 1.3, "isHighlight": false, "text": "Pandey to Vohra,no run,looks to drive that on the up, 128kph from Pandey, Vohra swishes at the back of length ball and misses, not too far outside off from Pandey"}, {"ball": 1.4, "isHighlight": false, "text": "Pandey to Vohra,no run,beaten outside off, Pandey getting the ball to move away just a touch, Vohra flirts with it and is beaten"}, {"ball": 1.4, "isHighlight": false, "text": "Matt: \"\"So either a team is going to win its first IPL, or second IPL, or third IPL.\" I think you could have correctly made that statement at the start of the tournament.\""}, {"ball": 1.5, "isHighlight": false, "text": "Pandey to Vohra,no run,bangs in short this time, gets higher than Vohra expected, he was shaping for the pull but it was too high for him to play the shot"}, {"ball": 1.6, "isHighlight": false, "text": "Pandey to Vohra,1 run,just the single off the over as Vohra guides the final ball towards third man"}, {"ball": 1.6, "isHighlight": false, "text": "Mohit Sharma to bowl"}, {"ball": 2.1, "isHighlight": false, "text": "Sharma to Vohra,no run,badly mistimed by Vohra, hit very high on the blade as he looked to launch the ball over the infield, lobs towards mid-on but lands well short"}, {"ball": 2.2, "isHighlight": false, "text": "Sharma to Vohra,no run,short of length ball outside off, 133kph, moving away and beats the bat as Vohra looks to guide the ball towards third man"}, {"ball": 2.3, "isHighlight": false, "text": "Sharma to Vohra,1 run,length ball angling in, a pretty shot from Vohra, flicking it away towards midwicket, but Ashwin stops it there with a dive, just two off the previous nine balls for Vohra"}, {"ball": 2.4, "isHighlight": false, "text": "Sharma to Sehwag,1 wide,short ball outside off, sails over Sehwag's head, called a wide"}, {"ball": 2.4, "isHighlight": false, "text": "Sharma to Sehwag,1 run,Sehwag lashes that on the up, CSK has a sweeper cover in place though it is the Powerplay overs, just the single for Sehwag"}, {"ball": 2.5, "isHighlight": false, "text": "Sharma to Vohra,1 run,off the bottom edge as Vohra looks to thrash the ball through the off side, the ball dribbles towards mid-off"}, {"ball": 2.5, "isHighlight": false, "text": "SD: \"Whichever side makes it to the final today, will breathe easier if Narine decides to choose his national team over his IPL side. \"  $$Narine's$$ $$dilemma$$ ."}, {"ball": 2.6, "isHighlight": false, "text": "Sharma to Sehwag, $$FOUR$$ ,they may have a man at sweeper cover, but there isn't one at deep point, which is where Sehwag dispatches this one"}, {"ball": 3.1, "isHighlight": false, "text": "Pandey to Vohra, $$SIX$$ ,Vohra had got only one off six Pandey deliveries last over, this time he has six off one, this was dropped short by Pandey, Vohra is good on the pull, he doesn't exactly middle it but that still flies over the wide long-on rope for six"}, {"ball": 3.2, "isHighlight": false, "text": "Pandey to Vohra,3 runs,short again, another pull, not middled, over midwicket though, and Vohra sprints back for the third"}, {"ball": 3.3, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,vintage Sehwag this, not too many people can guide a ball which is just outside off to the third man boundary like Sehwag can, waits for it and plays late, the wankhede roars it approval , chants of \"Viru, viru\""}, {"ball": 3.4, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,four more, this time off a leading edge as he looked to power a full ball over the leg side, the ball flies towards the point boundary"}, {"ball": 3.5, "isHighlight": false, "text": "Pandey to Sehwag,1 leg bye,Sehwag moves across the stumps, looking to guide the ball behind square leg, struck high on the pads and that was going over the stumps"}, {"ball": 3.6, "isHighlight": false, "text": "Pandey to Vohra, $$SIX$$ ,the over ends just as it began, with a six over long-on, Vohra again latches on to the short ball, cleanly struck and the run-rate has now topped 10"}, {"ball": 4.1, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,Sehwag thumps that on-the-up, almost flat-batted by Sehwag as he dismisses that between the bowler and mid-off"}, {"ball": 4.2, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,Sehwag! pitched up and well outside off, Sehwag pounce on it, hammers that between cover and extra cover, lofted hit for four"}, {"ball": 4.3, "isHighlight": false, "text": "Nehra to Sehwag, $$FOUR$$ ,four more, Sehwag arches back and steers this back of length ball past a diving short third man, delicately done, 55 for 0 now in the fifth over"}, {"ball": 4.4, "isHighlight": false, "text": "Nehra to Sehwag,1 wide,short and down the leg side"}, {"ball": 4.4, "isHighlight": false, "text": "Maddy: \"7 boundaries off last 9 balls. amazing stuff\""}, {"ball": 4.4, "isHighlight": false, "text": "Nehra to Sehwag,no run,punched into the ground by Sehwag, bounces over Nehra but doesn't beat mid-on, no time for a single"}, {"ball": 4.4, "isHighlight": false, "text": "Raj: \"40 runs of the last 10 balls-am I watching a game or playing a PS3 game...\""}, {"ball": 4.5, "isHighlight": false, "text": "Nehra to Sehwag,no run,Sehwag skips down the track, making some room as well, Nehra follows him and Sehwag can swing that one away over midwicket as he intended"}, {"ball": 4.6, "isHighlight": false, "text": "Nehra to Sehwag,1 run,length ball outside off, driven towards sweeper cover for a single"}, {"ball": 4.6, "isHighlight": false, "text": "indika chathura: \"Real Sehwag and real Nehra.. both are back..\""}, {"ball": 4.6, "isHighlight": false, "text": "Niju: \"Looks like Punjab has done their homework well. Maxie can sure take it on from here... what a terrific start by the Kings XI\""}, {"ball": 4.6, "isHighlight": false, "text": "Ketan: \"I cant even score these many runs on PC game!\""}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Sehwag,2 runs,length ball on middle stump, Sehwag whips that away towards deep midwicket"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Sehwag, $$SIX$$ ,everything going Punjab's way now, Sehwag backs away and though he didn't have too much room to work with, he upper cuts it, not quite off the middle, a thick edge of sorts, still flies over the third-man rope for six"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Sehwag,2 runs,whipped off the pads to backward square leg"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Sehwag,1 run,the famous Mohit back-of-the-hand slower ball, on a length and that is a mistimed lofted hit towards mid-on, bounces before reaching the fielder"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Vohra,2 runs,did I mention everything is going Kings XI's way? Vohra defends the ball towards cover and sets off for a tight single, throw comes in and there is an overthrow as well"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Vohra,no run,length ball, looks to work it away to the leg side, hit high on the pads"}, {"ball": 5.6, "isHighlight": false, "text": "Seventy off the Powerplay."}, {"ball": 5.6, "isHighlight": false, "text": "$$Time-out$$  Are this season's Kings XI the most exhilarating batting line-up in seven years of the IPL?"}, {"ball": 5.6, "isHighlight": false, "text": "Sembian: \"That overthrow actually saved a four from Sehwag!!\""}, {"ball": 5.6, "isHighlight": false, "text": "Ashwin is on as Super Kings look to staunch the flow of runs. ashwin from round the wicket"}, {"ball": 6.1, "isHighlight": false, "text": "Ashwin to Sehwag, $$SIX$$ ,first ball is hammered onto the sightscreen by Sehwag, a length ball is flat-batted over the bowler's head, gets a big step in before launching that one"}, {"ball": 6.2, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,reverse-sweep now from Sehwag, only a single towards backward point"}, {"ball": 6.2, "isHighlight": false, "text": "Ashwin from over the wicket"}, {"ball": 6.3, "isHighlight": false, "text": "Ashwin to Vohra,no run,a dot ball! CSK fans are cheering, defended by vohra"}, {"ball": 6.4, "isHighlight": false, "text": "Ashwin to Vohra,1 wide,going down the leg side"}, {"ball": 6.4, "isHighlight": false, "text": "Ashwin to Vohra,1 run,pushed towards point for a single"}, {"ball": 6.4, "isHighlight": false, "text": "Round the wicket"}, {"ball": 6.5, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,a trailing edge towards backward point for a single, brings up Sehwag's 50, the Wankhede crowd loves it, taken him only 21 balls"}, {"ball": 6.6, "isHighlight": false, "text": "Ashwin to Vohra,1 run,guided towards backward point for a single, haven't seen Sehwag sprint like this in a while"}, {"ball": 6.6, "isHighlight": false, "text": "Jadeja round the wicket"}, {"ball": 7.1, "isHighlight": false, "text": "Jadeja to Vohra,1 run,full ball is worked towards wide mid-on"}, {"ball": 7.2, "isHighlight": false, "text": "Jadeja to Sehwag,no run,length ball sliding down the leg side, Sehwag looks to work it toward square leg, off the pads"}, {"ball": 7.3, "isHighlight": false, "text": "Jadeja to Sehwag, $$SIX$$ ,'YESSSS!' shouts Shastri as Sehwag hammers a pitched-up ball over the bowler's head for six more, terrific hitting here, what an entertainer"}, {"ball": 7.4, "isHighlight": false, "text": "Jadeja to Sehwag,1 run,eased towards long-off for a single"}, {"ball": 7.4, "isHighlight": false, "text": "CSK Fan: \"Only 11 off last over, phew! I can finally breath now\""}, {"ball": 7.5, "isHighlight": false, "text": "Jadeja to Vohra,no run,solidly defended by Vohra as Jadeja fires the ball towards middle stump"}, {"ball": 7.6, "isHighlight": false, "text": "Jadeja to Vohra,1 wide,down the leg side, Vohra wants to sweep that but misses"}, {"ball": 7.6, "isHighlight": false, "text": "Jadeja to Vohra,2 runs,goes deep into the crease and clips the ball towards square leg, Sehwag gallops the first, so there's time for the second"}, {"ball": 7.6, "isHighlight": false, "text": "Ashwin round the wicket"}, {"ball": 8.1, "isHighlight": false, "text": "Ashwin to Sehwag,1 wide,way down the leg side"}, {"ball": 8.1, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,leg-stump line once more, Sehwag gets his front leg out of the way guides that towards cover"}, {"ball": 8.2, "isHighlight": false, "text": "Ashwin to Vohra,1 run,guided down towards backward point for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,full ball on off stump, dug out towards backward point for a single"}, {"ball": 8.3, "isHighlight": false, "text": "Over the stumps to Vohra"}, {"ball": 8.4, "isHighlight": false, "text": "Ashwin to Vohra,no run,carrom ball is defended to the off side"}, {"ball": 8.5, "isHighlight": false, "text": "Ashwin to Vohra,no run,pushed to the right of the bowler. Ashwin moves across and dives to cut that off"}, {"ball": 8.6, "isHighlight": false, "text": "Ashwin to Vohra,2 runs,down the leg side, a short-arm sweep sends the ball past short fine leg, a diving Mohit stops it in the deep"}, {"ball": 8.6, "isHighlight": false, "text": "Syamantak Basu: \"The only thing I can say right now: \"SEHWAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAG\"\""}, {"ball": 9.1, "isHighlight": false, "text": "Jadeja to Sehwag, $$FOUR$$ ,outside off, Sehwag looks to lash it through the off side, thick top edge sends it to the third man boundary"}, {"ball": 9.2, "isHighlight": false, "text": "Jadeja to Sehwag, $$FOUR$$ ,Sehwag is enjoying himself here, Jadeja drops it a touch short, Sehwag waits on the back foot and clobbers that to the wide long-on boundary"}, {"ball": 9.3, "isHighlight": false, "text": "Jadeja to Sehwag,1 bye,nearly had him! Sehwag looks to slug that over midwicket, he loses his shape and he doesn't connect with the ball, which slips past the leg stump for a bye"}, {"ball": 9.4, "isHighlight": false, "text": "Jadeja to Vohra,no run"}, {"ball": 9.5, "isHighlight": false, "text": "Jadeja to Vohra,1 run,looking to guide the ball to third man, but is beaten, that was perilously close to the top of off stump, the umpire thinks there was an edge as well"}, {"ball": 9.6, "isHighlight": false, "text": "Jadeja to Sehwag,1 run,slammed towards cow corner for a single"}, {"ball": 9.6, "isHighlight": false, "text": "Avik Sadhu: \"Is Sehwag saying something to the national selectors?\""}, {"ball": 9.6, "isHighlight": false, "text": "KumAR: \"Sehwag is upset that everyone talks only about Maxwell. He is out to prove them wrong!\""}, {"ball": 9.6, "isHighlight": false, "text": "muzzammil: \"The only player I have adore after Sachin, is Sehwag. He is the best entertainer, hands down. Even likes of Maxwell and Pollard doesn't emotes fear as a Sehwag on fire. Its like living my Chidlhood all over again.\""}, {"ball": 10.1, "isHighlight": false, "text": "Pandey to Sehwag,no run,a full toss just outside off, low on the bat and not timed, lucky for Sehwag that the ball didn't carry to mid-off"}, {"ball": 10.2, "isHighlight": false, "text": "Pandey to Sehwag,no run,full ball, this time Sehwag connects properly but he can't find the gap at extra cover"}, {"ball": 10.3, "isHighlight": false, "text": "Pandey to Sehwag,1 run,yorker on leg stump, superb delivery from Pandey , Sehwag manages to jam his bat down on that one, a single though the ball was dropped at the batsman's feet"}, {"ball": 10.3, "isHighlight": false, "text": "Vinay: \"Sehwag, you bespectacled wonder! Where have you been all these past few years? Tears in my eyes as I see your shot-making!\""}, {"ball": 10.4, "isHighlight": false, "text": "Pandey to Vohra, $$OUT$$ ,the first wicket, at long last for CSK, Raina takes the catch after Vohra  top edges a short ball towards midwicket, the ball goes very high and is swirling around. CSK have been superb in the outfield all season, Raina gives another example of that"}, {"ball": 10.4, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$c$$ $$Raina$$ $$b$$ $$Pandey$$ $$34$$ $$(50m$$ $$31b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$109.67$$"}, {"ball": 10.4, "isHighlight": false, "text": "Bad news for CSK fans is that the next man in is Glenn Maxwell."}, {"ball": 10.5, "isHighlight": false, "text": "Pandey to Sehwag,no run,yorker outside off, Sehwag can't get bat on it"}, {"ball": 10.6, "isHighlight": false, "text": "Pandey to Sehwag,1 run,whips this past mid-on for a single,only two off the over"}, {"ball": 10.6, "isHighlight": false, "text": "Ishwar Pandey - first over- 1 run, second over - 24 runs, third over - 2 runs"}, {"ball": 10.6, "isHighlight": false, "text": "A scoreline for Nelson fans.: 111 for 1 after 11 overs."}, {"ball": 11.1, "isHighlight": false, "text": "Nehra to Sehwag, $$SIX$$ ,outstanding hit from Sehwag, he has taken Nehra apart, this was back of a length ball from round the wicket, angling in towards Sehwag, who makes room and swings that over the bowler, the ball crashes into the advertising hoardings"}, {"ball": 11.2, "isHighlight": false, "text": "Nehra to Sehwag, $$SIX$$ ,six more! short of length again from Nehra, powerfully flat-batted by Sehwag, over long-on and way into the crowd, 'that was colossal,' rightly says the giantscreen"}, {"ball": 11.3, "isHighlight": false, "text": "Nehra to Sehwag,1 run,low full ball on legstump, Sehwag backs away and drives towards long-off for a single"}, {"ball": 11.4, "isHighlight": false, "text": "Nehra to Maxwell,1 wide,Nehra from over the wicket, a bouncer down the leg side, umpire takes a while to decide that that is a wide"}, {"ball": 11.4, "isHighlight": false, "text": "Nehra to Maxwell,no run,length ball pitching outside leg stump, Maxwell looks to flick it but misses and is hit on the pads"}, {"ball": 11.5, "isHighlight": false, "text": "Nehra to Maxwell, $$FOUR$$ ,a chip towards midwicket, didn't look to power that one, it was on the pads, he just needed it to get it over the midwicket man in the circle, he does and gets a boundary"}, {"ball": 11.6, "isHighlight": false, "text": "Nehra to Maxwell,2 runs,from round the wicket, a slower one, a bit of an inside-edge towards deep backward square leg, Maxwell puts the skates on after realising a second can be taken, back in time for two"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Sehwag,1 wide,Ashwin starts the over with a wide down the leg side"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Sehwag, $$SIX$$ ,length ball on middle and leg, Sehwag skips down the track and makes a touch of room and then an absolutely clean hit over the bowler's head,  sensational striking from Sehwag"}, {"ball": 12.2, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,full ball into the pads, pushed towards long-on for a single"}, {"ball": 12.2, "isHighlight": false, "text": "Here's Ashwin v Maxwell - does this battle even matter any more?"}, {"ball": 12.3, "isHighlight": false, "text": "Ashwin to Maxwell,1 run,from OVER the wicket, Maxwell clips it behind square leg for a single"}, {"ball": 12.4, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,flat-batted away towards deep midwicket for a single"}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Maxwell,1 wide,wild delivery way down the leg side, at least three feet down the leg side"}, {"ball": 12.5, "isHighlight": false, "text": "Dhoni seems to have hurt himself collecting that, was a tough take for him. The gloves are off, and he'll get some treatment."}, {"ball": 12.5, "isHighlight": false, "text": "Srinivas Goud: \"Nervous Nineties. To be clear, Nineties for Sehwag & Nervous for CSK.\""}, {"ball": 12.5, "isHighlight": false, "text": "Andrew: \"Someone was talking about CSK chasing 195 before the game? Good guess but Sehwag has thrown that completely out the window. What an innings!\""}, {"ball": 12.5, "isHighlight": false, "text": "Faraz: \"Chennai won the toss and elected to get thwacked first\""}, {"ball": 12.5, "isHighlight": false, "text": "Rumoured to be a rime-out, am not sure though."}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Maxwell, $$SIX$$ ,over the wicket, looked like a legbreak there, a length ball and Maxwell hammers that over long-on for six, first strike to Maxwell"}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin to Maxwell, $$OUT$$ ,but Ashwin gets the wicket he had talked up, this looked like a topspinner going straight on, it was well outside off, Maxwell looks to clobber that over cow corner, hasn't hit it far enough though and holes out, Ashwin is pumped, he runs towards Maxwell and blows a flying kiss, Dhoni is not too pleased with Ashwin's reaction"}, {"ball": 12.6, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Raina$$ $$b$$ $$Ashwin$$ $$13$$ $$(14m$$ $$6b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$216.66$$"}, {"ball": 13.1, "isHighlight": false, "text": "Jadeja to Miller,1 run,length ball from the wicket, Miller works this towards midwicket for a isngle"}, {"ball": 13.1, "isHighlight": false, "text": "SD: \"Well, Ashwin wins the much hyped Ashwin - Maxwell battle, but that doesn't matter at all at the moment. \""}, {"ball": 13.2, "isHighlight": false, "text": "Jadeja to Sehwag,1 run,wide and full from round the wicket, thumped towards sweeper cover for one more"}, {"ball": 13.3, "isHighlight": false, "text": "Jadeja to Miller,1 run,spinning in towards the off, worked towards midwicket for one more"}, {"ball": 13.4, "isHighlight": false, "text": "Jadeja to Sehwag,1 run,heading towards off stump from round the wicket, sliced towards deep extra cover"}, {"ball": 13.5, "isHighlight": false, "text": "Jadeja to Miller,1 run,slapped towards sweeper cover for one more"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja to Sehwag, $$FOUR$$ ,fierce hit from Sehwag, he was given width, Sehwag crashes that through the covers, Raina was the man in the deep, but even he isn't quick enough to cut that off"}, {"ball": 14.1, "isHighlight": false, "text": "Ashwin to Miller, $$FOUR$$ ,down the leg side from over the wicket, a delicate sweep past short fine leg for four, that line is inexcusable with fine leg in the circle"}, {"ball": 14.1, "isHighlight": false, "text": "Dhoni asks him to switch to round the wicket"}, {"ball": 14.2, "isHighlight": false, "text": "Ashwin to Miller, $$FOUR$$ ,another poor ball, sliding down the leg side, this time Miller glances it to the left of short fine leg for four more"}, {"ball": 14.3, "isHighlight": false, "text": "Ashwin to Miller,no run,defended by Miller"}, {"ball": 14.4, "isHighlight": false, "text": "Ashwin to Miller,1 run,worked away for a single to deep square leg, Sehwag on strike"}, {"ball": 14.5, "isHighlight": false, "text": "Ashwin to Sehwag,no run,the crowd is baying for sehwag's century, but they will have to wait, this ball is pushed back towards the bowler"}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin to Sehwag,1 run,sliced towards sweeper cover for a single, Sehwag moves on to 98, Ashwin 4-0-44-1, not what you want from your main bowler"}, {"ball": 15.1, "isHighlight": false, "text": "Pandey to Sehwag,1 run,a full toss, fairly high one, Sehwag can't put that away though, he can only punch it towards mid-off for a single"}, {"ball": 15.1, "isHighlight": false, "text": "paul: \"Ashwin was so keen on getting Maxwell he forgot the others.....\""}, {"ball": 15.2, "isHighlight": false, "text": "Pandey to Miller,1 run,lower full toss this time, driven to long-off for one more"}, {"ball": 15.3, "isHighlight": false, "text": "Pandey to Sehwag,no run,third full toss in a row, Sehwag again can't put it away, the expectant crowd is silenced briefly, that ball only went as far as midwicket"}, {"ball": 15.4, "isHighlight": false, "text": "Pandey to Sehwag,1 no ball,fourth full toss in a row, this one is too high, a no-ball"}, {"ball": 15.4, "isHighlight": false, "text": "Chris: \"1/44: KXIP should collectively blow Ashwin a kiss.\""}, {"ball": 15.4, "isHighlight": false, "text": "Pandey to Sehwag,1 run,low full toss this time, there is the century, second IPL century for Sehwag, second century of this season, Sehwag just pushes this one towards mid-off to get to the landmark, Vijay is the only other Indian batsman to have two IPL tons, Sehwag pumps his fists in celebration"}, {"ball": 15.5, "isHighlight": false, "text": "Pandey to Miller,1 run,short of length ball, slower and just outside off, slapped towards point where McCullum makes a diving stop"}, {"ball": 15.6, "isHighlight": false, "text": "Pandey to Sehwag, $$FOUR$$ ,another full toss from Pandey, this was low and wide outside off, Sehwag has to reach out for that, he manages to, and he manges to get enough power to send that away to the point boundary"}, {"ball": 15.6, "isHighlight": false, "text": "$$Time-out$$"}, {"ball": 15.6, "isHighlight": false, "text": "Suresh: \"Pandey: 3 ovrs: 11 runs(Master piece) , 1 Ovr - 24 runs \""}, {"ball": 15.6, "isHighlight": false, "text": "KP: \"On a regular day Ishwar pandey's figure would be called expensive but not today \""}, {"ball": 15.6, "isHighlight": false, "text": "Mohit Sharma to bowl."}, {"ball": 16.1, "isHighlight": false, "text": "Sharma to Miller, $$FOUR$$ ,what a hit that is! power form Miller as he tees off, it was just short of a yorker, Miller doesn't care, he sends that to the long-off boundary"}, {"ball": 16.2, "isHighlight": false, "text": "Sharma to Miller,1 run,low full toss just outside off, squeezed out towards point, there's a direct hit , CSK are sure they have their man, it's tight, Miller is saved by the frame, one shows him just behind the crease with the ball just about to hit the stumps, the next shows him across the crease with the bail off, Miller tells Sehwag he though he was out"}, {"ball": 16.3, "isHighlight": false, "text": "Sharma to Sehwag,1 run,full ball from round the wicket, Sehwag gets the front leg out of the way and tucks that towards midwicket"}, {"ball": 16.4, "isHighlight": false, "text": "Sharma to Miller, $$SIX$$ ,another full toss, Miller syas thank you very much and thumps that over long-on for a massive six"}, {"ball": 16.4, "isHighlight": false, "text": "Jayan Karthik P: \"I think its been a long time since we talked about Sehwag, I see lotta people misspelling his name on facebook :P\""}, {"ball": 16.5, "isHighlight": false, "text": "Sharma to Miller, $$FOUR$$ ,another low full toss outside off, Miller looks to slice that one, thick outside edge races past Dhoni for four more"}, {"ball": 16.6, "isHighlight": false, "text": "Sharma to Miller,1 run,another full toss, CSK have decided against pitching the ball it seems, whacked towards long-off for a single"}, {"ball": 16.6, "isHighlight": false, "text": "PC: \"If I were Sehwag's Project Manager I would have set him a goal of 150 :) Note: this is what i face everyday in office :((((\""}, {"ball": 17.1, "isHighlight": false, "text": "Jadeja to Miller,1 run,just outside off, crashed towards sweeper cover for a single"}, {"ball": 17.2, "isHighlight": false, "text": "Jadeja to Sehwag, $$SIX$$ ,humongous hit from Sehwag, what a shot to bring up the 200, 16 balls to go still! a length ball and Sehwag slams that over long-on way into the crowd"}, {"ball": 17.3, "isHighlight": false, "text": "Jadeja to Sehwag, $$FOUR$$ ,looks for another big hit, outside edge past Dhoni for four more, CSK not having any luck here"}, {"ball": 17.4, "isHighlight": false, "text": "Jadeja to Sehwag, $$SIX$$ ,six more for Sehwag, again a powerful flat-batted over long-on for six, that was outside off, Sehwag doesn't care"}, {"ball": 17.4, "isHighlight": false, "text": "Dhoni walks up to Jadeja and gives him some advice"}, {"ball": 17.5, "isHighlight": false, "text": "Jadeja to Sehwag,no run,full and wide outside off, Dhoni stops that with his pads"}, {"ball": 17.6, "isHighlight": false, "text": "Jadeja to Sehwag,1 run,superb fielding by Faf at point after Sehwag plays an inside-out shot, kept to a tight single"}, {"ball": 17.6, "isHighlight": false, "text": "Arvin: \"I think CSK should take off the match perspective and look to chase down the target in 14 or 15 overs.. Going by last few matches that is the way you have to approach big totals in T20\""}, {"ball": 18.1, "isHighlight": false, "text": "Nehra to Sehwag, $$OUT$$ ,the Sehwag show is over, end of an awesome innings, Faf takes a superb catch at extra cover to send back Sehwag, he had to make a lot of ground to get there, couple of other fielders around as well, but there is no confusion, Faf takes it, a full toss ends that innings, 122 for Sehwag, CSK fielders congratulate him, Sehwag salutes the crowd as he walks off,"}, {"ball": 18.1, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Nehra$$ $$122$$ $$(93m$$ $$58b$$ $$12x4$$ $$8x6)$$ $$SR:$$ $$210.34$$"}, {"ball": 18.1, "isHighlight": false, "text": "Kush: \"This Sehwag love-in needs suppressing! Does no one else think that someone of Sehwag's ability should have been more consistent and still playing for India?\" Boo! 8500 Test runs at nearly 50, with loads of match-winning innings not enough?"}, {"ball": 18.2, "isHighlight": false, "text": "Nehra to Miller, $$FOUR$$ ,another full toss, slugged towards midwicket for four more"}, {"ball": 18.3, "isHighlight": false, "text": "Nehra to Miller,1 run,nearly a yorker, even Miller can't get under that one, drilled towards long-on for a single"}, {"ball": 18.4, "isHighlight": false, "text": "Nehra to Bailey,1 run,short of length ball, punched towards long-on"}, {"ball": 18.5, "isHighlight": false, "text": "Nehra to Miller,1 run,low full toss on the pads, thwacked towards midwicket for a single"}, {"ball": 18.6, "isHighlight": false, "text": "Nehra to Bailey, $$OUT$$ ,another wicket for Nehra, Bailey is bowled as he looks to slog that one towards midwicket, that crashes into the base of middle stump, Nehra's final over costs him only 7 and gets two wickets"}, {"ball": 18.6, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$b$$ $$Nehra$$ $$1$$ $$(4m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 18.6, "isHighlight": false, "text": "Mohit to bowl the final over"}, {"ball": 19.1, "isHighlight": false, "text": "Sharma to Miller,1 run,a length ball is hammered towards wide long-off, that ball travelled real quick to the man at deep extra cover"}, {"ball": 19.1, "isHighlight": false, "text": "Jithen: \"Fancy a discussion on your favourite Sehwag innings? I would go with the 83 vs England that started the amazing chase.\" Galle double-century was pretty sweet as well"}, {"ball": 19.2, "isHighlight": false, "text": "Sharma to Saha, $$SIX$$ ,first-ball six for Saha, short of length ball ball is slugged over deep square leg, the man on the rope can only watch it sail over"}, {"ball": 19.2, "isHighlight": false, "text": "Dev: \"The stump cam view of Bailey's wicket was awesome. Like some of those 3D movies where the knife flies straight at you!\""}, {"ball": 19.3, "isHighlight": false, "text": "Sharma to Saha, $$OUT$$ ,Miller is run-out as he looked to steal a bye after Wridhhiman Saha doesn't connect with an outside-off ball, Miller dives but not in time to beat Dhoni's throw"}, {"ball": 19.3, "isHighlight": false, "text": "$$DA$$ $$Miller$$ $$run$$ $$out$$ $$38$$ $$(36m$$ $$19b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$200.00$$"}, {"ball": 19.3, "isHighlight": false, "text": "Can Kings XI top the 231 they managed against CSK in the previous game?"}, {"ball": 19.3, "isHighlight": false, "text": "Syamantak Basu: \"165 v South Africa in Kolkata, 2010. Watched it LIVE. Entertainment at its best!\""}, {"ball": 19.4, "isHighlight": false, "text": "Sharma to Johnson,1 run,short of length ball outside off, slashed towards cover for a single"}, {"ball": 19.4, "isHighlight": false, "text": "Saleel: \"oh, then it has to be Sehwag's brutal 79 against Pakistan in the opening match of the 2004 ODI series at Karachi. that innings just set the tone for the entire series.\""}, {"ball": 19.5, "isHighlight": false, "text": "Sharma to Saha,no run,Saha moves across the stumps, looks to scoop that over fine leg, this was full and just outside off, Saha doesn't connect"}, {"ball": 19.5, "isHighlight": false, "text": "KricLover: \"In the 1999 WC, when India scored that mammoth total against Sri Lanka, someone asked Geoff Boycott on what should Sri Lanka's strategy be to chase - his answer 'enjoy the lunch'. This is applicable to CSK today :)\""}, {"ball": 19.6, "isHighlight": false, "text": "Sharma to Saha, $$OUT$$ ,this time Saha connects, but he can only send the ball as far as the man at deep square leg, the Mohit slower one does the job once more, CSK pull things back slightly in the last few overs, but Sehwag had already done the damage, Kings XI end on 226"}, {"ball": 19.6, "isHighlight": false, "text": "$$WP$$ $$Saha$$ $$c$$ $$Smith$$ $$b$$ $$Sharma$$ $$6$$ $$(6m$$ $$4b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "Chennai Super Kings have a massive task ahead of them. The target of 227 will be the biggest chases in all Twenty20s"}, {"ball": 19.6, "isHighlight": false, "text": "Binura: \"Why is Dhoni relying on only 5 bowlers? Given that all of them were clobbered (spare Pandey if you will). He could have given Raina or Hussey a chance to break the partnerships right?\" That's a big gamble against a side batting so well"}, {"ball": 19.6, "isHighlight": false, "text": "$$Sehwag$$ : \"Whenever I went there to bat, and got out early, I got a call from my wife. My son's friends were also teasing him about his father not scoring runs, I told him, \"hold on beta, there is still time\" Last couple of games I wanted to focus on my batting, I had to win at least one game for Kings XI Punjab\""}, {"ball": 19.6, "isHighlight": false, "text": "A Sehwag Fan: \"Any innings played by sehwag..whether it is a 50 or a 100 or a 200..is exceptionally special!..considering the brutal manner in which he gets them!\""}, {"ball": 19.6, "isHighlight": false, "text": "$$9.50$$ $$pm$$  A few people at the start of comms had predicted this. That it wasn't going to be Maxwell or Miller or anyone else but that man. He started with some vintage drives and cuts through the off side and just picked up steam. Super Kings threw pace at him, they tried their spinners, they flattened their lengths, tossed it up and did just about everything but Sehwag would not be stopped tonight"}], "name": "Chennai Super Kings v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734047.html?innings=1;view=commentary", "match_num": 59}