{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$8$$ $$pm$$  KKR go into a huddle. Sehwag and Vohra walk in, to loud cheers. Morne Morkel's pace won't be as easy as Nehra's or Mohit's or Pandey's. He comes over the wicket"}, {"ball": 0, "isHighlight": false, "text": "Fast approaching the start time. Chinnaswamy is packed. The teams walk in to the middle one by one along with young kids - football style.. Football.. 12 days to go.."}, {"ball": 0, "isHighlight": false, "text": "$$7.40$$ $$pm$$  Last day to rack up all those important points in  $$the$$ $$fantasy$$ $$league$$ . Hurry hurry.. 20 mins to make final changes."}, {"ball": 0, "isHighlight": false, "text": "$$7.30$$ $$pm$$   $$KKR$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$they$$ $$will$$ $$bowl$$ . Kings XI make one change, bringing in Balaji for Sandeep. KKR go unchanged."}, {"ball": 0, "isHighlight": false, "text": "Gautam Gambhir said it's a chasing ground but he wants to do well in all three departments. I wish I could slow him down to record his words - the man is a talking ferrari. He had a smile on his face though.. Signs of things - KKR are a  $$bunch$$ $$of$$ $$happy$$ $$men$$ ."}, {"ball": 0, "isHighlight": false, "text": "Gowtham: \"Things I learned from the toss: 1. You need to perform in all 3 departments. 2. What Gautam already said in the press conference\""}, {"ball": 0, "isHighlight": false, "text": "Aditya Mandalem: \"I can't watch the telecast right now, but I'm trying to imagine Gambhir's speech there. Talking Ferrari? Is he faster than the guy who narrates us the Terms and Conditions of the Insurance Policy. All I can listen to is - Subjective to market risks.\" ---- You might have just given insurance companies an idea to pitch in a cricketer for their next round of adverts."}, {"ball": 0, "isHighlight": false, "text": "Sabari: \"Indian National Anthem... The one and only time where Gambhir's lips moves in slow motion... :)\""}, {"ball": 0, "isHighlight": false, "text": "Gareth: \"You feel this comes down to Maxwell vs YKP. The sides are well matched otherwise, it's just which one of the destroyers will fire up! Any other Aussies tuned in?\" --- Oh yes, there are a few. One posing as Bailey's mother too."}, {"ball": 0, "isHighlight": false, "text": "George: \"How refreshing it is to see Bailey's captaincy as opposed to Clarke's.Such a disarming smile and matter of fact post match quips.And no I am not the one posing as Bailey's mom!!!\""}, {"ball": 0, "isHighlight": false, "text": "$$7.20$$ $$pm$$  Ten minutes away from the toss. Here's a  $$list$$ $$of$$ $$young$$ $$players$$  who we think have been impressive in this IPL. Who else do you think should have made it to this list? Samson hasn't been included because he was already on the list this time last year."}, {"ball": 0, "isHighlight": false, "text": "Aman Parikh: \"Just like Saha is unlucky that he is playing in the era of Dhoni, Akshar might be unlucky too that Jadeja has recently established himself into the national team, and not Akshar might just be used as a backup. \""}, {"ball": 0, "isHighlight": false, "text": "Kaustubh: \"This years IPL is the best till date..hands down..be it catches (even the dropped one's), close chases (unread shall I say) and fight for playoffs and top 2 going till last league game...Muchas Gracias IPL!\" --- Some  $$interesting$$ $$umpiring$$ $$decisions$$  too, reinforcing the fact that we will be ruled by machines sooner than later."}, {"ball": 0, "isHighlight": false, "text": "$$7.00$$ $$pm$$  Forty six days, thousands of miles covered, countless minutes of our lives spent replacing 'Jumping jhapaak' with 'Bulava aaya' in our memories. Also some cricket came along the way. And now we have come to the  $$closing$$ $$time$$ . Almost. Before that though, there is the final of the seventh IPL season, no doubt between the two best teams throughout the season. Kings XI Punjab have brought a refreshing quality of gameplay this season, Knight Riders too have assumed unshakeable winning form. Knight Riders have been here before, Kings XI are here for the first time, the pitch that has been laid out is a 'belter' according to Simon Doull. And then this is Bangalore - ball flies a little further in Bangalore.  $$Clear$$ $$skies$$  after yesterday's storm. The crowd was lining up outside the Chinnaswamy as early as 5.30 pm. All set. Here is Karthik Krishnaswamy's  $$match$$ $$preview$$  which reiterates this as a competition between the best batting side and the best bowling side. This is Devashish Fuloria here. Karthik will take over for the second half."}, {"ball": 0, "isHighlight": false, "text": "Kings XI looked a balanced side before the start of the tournament and they proved it right on the field. On the other hand, Knight Riders were not one of the favourites to start with, but haven't they turned it around..?"}, {"ball": 0, "isHighlight": false, "text": "\"We have a point to prove, we have gelled so well as a team. Just one more game, we want to stick to basics,\" says David Miller"}, {"ball": 0, "isHighlight": false, "text": "\"i remember Dhoni starting the trend of \"sticking to the basics \" and is spread like a wildfire ..\" --- Not sure if it was Dhoni Chirag, but cricketers have always been an expressive lot.. 'right areas', 'natural game', 'follow the process', 'tracer bullet'.."}, {"ball": 0, "isHighlight": false, "text": "\"I always think at the start of the first match,OMG this tournament takes ages to complete,but now I think why this tournaments ends so quickly,\".. What we want is a year-long IPL, isn't it Vijay?"}, {"ball": 0, "isHighlight": false, "text": "Muqeet Ahmed: \"Test for Gambhir: Previously two times Indian and Australian Captain were against each other in IPL Final, and both times Aussies conquer the battle.\""}, {"ball": 0.1, "isHighlight": false, "text": "Morkel to Sehwag,1 leg bye,this one cuts in to the batsman, hits the pads and lobs up towards point. No bat on this, but they cross over"}, {"ball": 0.2, "isHighlight": false, "text": "Morkel to Vohra,2 runs,he gets on top of the bounce and dabs it past the left of the diving point fielder for a couple, he got behind the line nicely there"}, {"ball": 0.3, "isHighlight": false, "text": "Morkel to Vohra,no run,Shakib at midwicket dives to his left to cut off the chance of a single. Vohra pushed the length delivery to the leg side"}, {"ball": 0.4, "isHighlight": false, "text": "Morkel to Vohra, $$FOUR$$ ,no movement of the feet! Vohra pushes at it away from the body and gets a thick outside edge. There was just one slip in place, this went through third slip"}, {"ball": 0.4, "isHighlight": false, "text": "Third man goes finer"}, {"ball": 0.5, "isHighlight": false, "text": "Morkel to Vohra,2 runs,smartly done by Vohra! He dabs the back of length delivery through gully and because the third-man had moved finer, he gets an easy couple"}, {"ball": 0.6, "isHighlight": false, "text": "Morkel to Vohra,no run,loose shot! He throws his bat at this wide delivery, no movement of the feet, misses it completely"}, {"ball": 0.6, "isHighlight": false, "text": "Umesh from the other end."}, {"ball": 1.1, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,nice bit of outswing from the bowler and it beats the inside edge! Sehwag was looking to thrash it through cover, but over-accounted for the swing"}, {"ball": 1.2, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,fuller delivery on the stumps, some swing again, Sehwag punches it straight to mid-on"}, {"ball": 1.2, "isHighlight": false, "text": "Short cover point in place"}, {"ball": 1.3, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,surprises him with a short delivery! Sehwag ducks under it just in the nick of time"}, {"ball": 1.4, "isHighlight": false, "text": "UT Yadav to Sehwag,1 run,outside edge and Sehwag gets off the mark! There is no slip in place and Morkel does well at third man to cut the boundary off"}, {"ball": 1.5, "isHighlight": false, "text": "UT Yadav to Vohra,1 run,he is not moving his feet today! Manan tries to push at the full delivery away from the body and toe-ends it to mid-off. He is lucky that he didn't get too much bat on that one"}, {"ball": 1.6, "isHighlight": false, "text": "UT Yadav to Sehwag, $$FOUR$$ ,now this is classic Sehwag! Length ball, Sehwag brings his bat down in a quick swing and hammers it over the bowler's head"}, {"ball": 1.6, "isHighlight": false, "text": "Scoota: \"Sehwag almost never follows up one big innings with another... its one of his patterns\""}, {"ball": 2.1, "isHighlight": false, "text": "Morkel to Vohra,no run,he has looked good in defence, Vohra. Comes forward and pushes this length delivery to cover point"}, {"ball": 2.2, "isHighlight": false, "text": "Morkel to Vohra, $$FOUR$$ ,beautifully timed! Morkel bowls a full delivery on the middle stump and Vohra doesn't try to hit it too hard, just whips it over midwicket with a neat flick"}, {"ball": 2.3, "isHighlight": false, "text": "Morkel to Vohra,no run,stays in the crease and defends the length delivery to cover"}, {"ball": 2.3, "isHighlight": false, "text": "Slip comes out"}, {"ball": 2.4, "isHighlight": false, "text": "Morkel to Vohra,no run,good ball! The keeper goes up in appeal for a caught behind, Morkel joins in later. It was a back of length delivery and it shoots off the pitch before beating the outside edge, it was far away from the bat"}, {"ball": 2.5, "isHighlight": false, "text": "Morkel to Vohra,2 runs,and he bowls it on the pads again. Vohra plays the same shot as two balls ago, but there is a deep midwicket in place now"}, {"ball": 2.6, "isHighlight": false, "text": "Morkel to Vohra,no run,shortish delivery outside off with steep bounce, Vohra tries to ramp it over to the third-man boundary but makes no connection"}, {"ball": 3.1, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,cracking sound off the bat as Sehwag punches this length delivery to cover"}, {"ball": 3.2, "isHighlight": false, "text": "UT Yadav to Sehwag,no run,back of length delivery outside off, he gets good bounce on that one, Sehwag defends it back to the bowler"}, {"ball": 3.2, "isHighlight": false, "text": "cvenka: \"why no team able to realise the folly of putting punjab to bat first? they can they restrict it to below or par score? punjab is the team that crossed 200 runs more than twice while batting first. why our captains are going to learn?\" ---- KXIP's lowest score this season came batting first too.. against KKR"}, {"ball": 3.3, "isHighlight": false, "text": "UT Yadav to Sehwag,2 runs,that is a smart whip behind square on the leg side for a couple of runs! Sehwag pushes for the second as Tendo doesn't pick up cleanly at the boundary"}, {"ball": 3.4, "isHighlight": false, "text": "UT Yadav to Sehwag, $$OUT$$ ,Gambhir gobbles up the catch from his old friend! Sehwag was playing an ambitious pull of one that was not that short, and he got a big top edge towards mid-off where Gambhir takes an easy one"}, {"ball": 3.4, "isHighlight": false, "text": "$$V$$ $$Sehwag$$ $$c$$ $$Gambhir$$ $$b$$ $$UT$$ $$Yadav$$ $$7$$ $$(14m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$70.00$$"}, {"ball": 3.4, "isHighlight": false, "text": "Harish Varanasi: \"That's vintage Sehwag dismissal :(\""}, {"ball": 3.4, "isHighlight": false, "text": "Bailey comes in early today"}, {"ball": 3.5, "isHighlight": false, "text": "UT Yadav to Vohra,no run,he defends the first delivery back to the bowler"}, {"ball": 3.6, "isHighlight": false, "text": "UT Yadav to Vohra,1 run,good tight line from Umesh, the batsman pushes the 141 kph delivery towards mid-on with soft hands and calls for a single"}, {"ball": 4.1, "isHighlight": false, "text": "Morkel to Vohra,1 run,he is playing the waiting game, opens the face of the bat and runs it down to third man for a single"}, {"ball": 4.2, "isHighlight": false, "text": "Morkel to Bailey,1 run,now Bailey goes for a quick single, dabs this one to the on side and calls early"}, {"ball": 4.3, "isHighlight": false, "text": "Morkel to Vohra,no run,fires it full on the pads and Vohra misses out on some easy runs, it flicks the pads en route to the keeper"}, {"ball": 4.4, "isHighlight": false, "text": "Morkel to Vohra,2 runs,he is lucky this time as he finally tries to go for the big shot on this fuller delivery, aims for long-on, but this goes over cover, clears infield"}, {"ball": 4.4, "isHighlight": false, "text": "Reeba George: \"Excellent move from Bailey to come in at 3.Hope Dhoni learns from his exemplary captaincy to be flexible instead of blaming senior batsmen for their failure to chase the mammoth score KXII SET CSK the other night.Bailey's mom has every right to be chuffed!\""}, {"ball": 4.5, "isHighlight": false, "text": "Morkel to Vohra,2 runs,this one is off the middle! That takes some vertical distance but lands inside the boundary at deep midwicket, Yusuf keeps it in"}, {"ball": 4.6, "isHighlight": false, "text": "Morkel to Vohra,no run,quick short of length delivery outside off, Vohra tried to guide it to third man but misses"}, {"ball": 4.6, "isHighlight": false, "text": "Narine is on"}, {"ball": 5.1, "isHighlight": false, "text": "Narine to Bailey, $$OUT$$ ,and Narine strikes immediately! It's a wicket gifted by Bailey though. He walks into the shot and walks too far to the off side, missing the straighter delivery to be bowled behind his legs. KKR are on a roll now"}, {"ball": 5.1, "isHighlight": false, "text": "$$GJ$$ $$Bailey$$ $$b$$ $$Narine$$ $$1$$ $$(17m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$50.00$$"}, {"ball": 5.1, "isHighlight": false, "text": "Now Saha.. still no Maxwell"}, {"ball": 5.2, "isHighlight": false, "text": "Narine to Saha,no run,quicker delivery outside off, the batsman wants to cut it but gets beaten"}, {"ball": 5.3, "isHighlight": false, "text": "Narine to Saha,no run,tossed up and full on off, Saha drives but can't beat cover"}, {"ball": 5.4, "isHighlight": false, "text": "Narine to Saha,2 runs,full and flighted on the pads, this time Saha whips it through square leg for a couple of runs"}, {"ball": 5.5, "isHighlight": false, "text": "Narine to Saha,no run,he looks to push this flatter delivery to the leg side but gets a leading edge to cover, it was the other one"}, {"ball": 5.6, "isHighlight": false, "text": "Narine to Saha,no run,superb doosra bowled at pace! The batsman looks to push it to the leg side but gets beaten. What more, he falls over and the bails have been taken off by the keeper. The umpire wants to check for a stumping, but Saha is fine.. He never left the crease"}, {"ball": 5.6, "isHighlight": false, "text": "That over must have sent shivers in the KXIP camp"}, {"ball": 5.6, "isHighlight": false, "text": "Shakib to add more spice"}, {"ball": 6.1, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,flatter delivery on off, Vohra whips it to deep midwicket for a single"}, {"ball": 6.2, "isHighlight": false, "text": "Shakib Al Hasan to Saha,no run,tossed up delivery wide outside off, Saha lunges forward but gets beaten by the turn"}, {"ball": 6.3, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 run,tossed up on the stumps, Saha stretches forward and sweeps it behind square on the leg side"}, {"ball": 6.4, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,he waits in the crease and punches the flatter delivery to deep midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 run,flatter and on the stumps, Saha nudges it to square leg for a single"}, {"ball": 6.6, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,no run,waits in the crease and defends this one to cover"}, {"ball": 6.6, "isHighlight": false, "text": "Girish: \"Looks like today Manan Vohra will play a big innings! He has been consistent with 30s but never made a big score! He might repeat what Bisla did for KKR 2 years ago.\""}, {"ball": 6.6, "isHighlight": false, "text": "Solid start from Shakib too"}, {"ball": 7.1, "isHighlight": false, "text": "Chawla to Saha,2 runs,shorter delivery from Chawla, pulled hard in the gap at deep midwicket but this one is cut off by Pandey"}, {"ball": 7.2, "isHighlight": false, "text": "Chawla to Saha, $$FOUR$$ ,this one is not short but Saha scythes his bat at that one, this time he gets the timing to find the boundary at deep midwicket"}, {"ball": 7.3, "isHighlight": false, "text": "Chawla to Saha,1 run,he comes down the pitch and eases the tossed up delivery to long on"}, {"ball": 7.4, "isHighlight": false, "text": "Chawla to Vohra,no run,big spin for Chawla now, turns past the bat as the batsman tries to play a late cut"}, {"ball": 7.5, "isHighlight": false, "text": "Chawla to Vohra, $$SIX$$ ,he gets under it this time! This was fuller and flighted on off, Vohra whacks it over deep midwicket for the first six of the innings"}, {"ball": 7.6, "isHighlight": false, "text": "Chawla to Vohra,1 run,the bowler responds with a googly, Vohra punches this one to long-on off the back foot to keep the strike"}, {"ball": 7.6, "isHighlight": false, "text": "Shakib continues"}, {"ball": 8.1, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,no run,bowls an arm-ball that the batsman wanted to nudge to the leg side, but he gets an inside edge on to his pads"}, {"ball": 8.2, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,waits in the crease and dabs this one to gully for a quick single"}, {"ball": 8.2, "isHighlight": false, "text": "surya: \"The most irritating part of Sehwag going early is that there will be none who contest with Narine.Sehwag reserves his treatment for the mystery spinners the most.\""}, {"ball": 8.3, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 run,he is slightly beaten by the length on this one - expected it to be shorter - but manages to push it to long off for a single"}, {"ball": 8.4, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,flatter this time, the batsman waits in the crease and punches it to deep cover"}, {"ball": 8.4, "isHighlight": false, "text": "Don: \"@Reeba - Looks like Bailey to move up the order wasn't so excellent after all. If your a finisher normally then thats were you should stay, especially when you still have excellent batsmen who have done the job for you still to come in. When you mess around with the batting order unnecessarily it might come back to haunt you later, like what happened to RR .They had a settled line up but they choose to mess around with it and payed the price by not even making the play offs.\""}, {"ball": 8.5, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 run,fuller outside off, Saha is a confident sweeper, hits it to deep backward square leg with ease"}, {"ball": 8.6, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,no run,he looks for the late cut but is beaten as he plays inside the line"}, {"ball": 8.6, "isHighlight": false, "text": "It's not that Kings XI haven't been in a similar situation before. If they need a positive example, they should look to the match against CSK earlier when they scored 162 in the last 10."}, {"ball": 8.6, "isHighlight": false, "text": "samarth: \"Defensive tactics from Punjab out of nowhere. Something you would associate with teams like RCB n Delhi. Giving their best batsmen the chance to face most deliveries has been the key to there success this year. Why change it in the Final? Maxwell should have come out to bat at 3 or when Bailey got out and no later. This will cost them. Hope they recover though. \""}, {"ball": 8.6, "isHighlight": false, "text": "Chawla continues after the break"}, {"ball": 9.1, "isHighlight": false, "text": "Chawla to Saha,1 run,tossed up and full, pushed to mid-off for a single"}, {"ball": 9.2, "isHighlight": false, "text": "Chawla to Vohra,1 run,comes down the pitch and takes this flighted delivery on the full, drives it straight to long off"}, {"ball": 9.3, "isHighlight": false, "text": "Chawla to Saha,1 run,stays on back foot to a fuller delivery but manages to chop it towards point for a quick single"}, {"ball": 9.3, "isHighlight": false, "text": "Narayanan: \"Whatever it may be. this pitch doesn't look good for batting with spinners on.. 150-160 will be a decent score on big final to defend\""}, {"ball": 9.4, "isHighlight": false, "text": "Chawla to Vohra,no run,bowls a topspinner wide outside off, Vohra goes for a drive, expecting this to be googly, but this beats his outside edge"}, {"ball": 9.5, "isHighlight": false, "text": "Chawla to Vohra,1 run,he waits on the back foot and cuts this regular legspinner straight to short third man"}, {"ball": 9.6, "isHighlight": false, "text": "Chawla to Saha,no run,another topspinner outside off, Saha looks for a cross-batted slog but this one slips under his bat"}, {"ball": 9.6, "isHighlight": false, "text": "Jon: \"And the mistake of pushing Maxwell down the order is that it means closer to those big final spell of Narine. \""}, {"ball": 10.1, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,2 runs,flatter delivery on the stumps, the batsman goes deep in the crease and whips it to deep midwicket for a couple"}, {"ball": 10.2, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,no run,slower and outside off, Vohra looks to drag it to the leg side but makes no connection, Uthappa whips the bails off and asks the question. Vohra is safe, never moved his back foot"}, {"ball": 10.3, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,he stays back and punches the flatter delivery to deep midwicket"}, {"ball": 10.3, "isHighlight": false, "text": "Teja: \"I don't think KXIP strategy to send Bailey early was a bad idea after all. Bailey is kind of player who could stable the innings for a while Vohra is accelerating the innings, given that they had the likes of double Ms for a slog in the death. What made the difference is equally good strategy of bringing in Narine for an early strike. \""}, {"ball": 10.4, "isHighlight": false, "text": "Shakib Al Hasan to Saha,no run,nothing is working out for the batsmen today! Saha looks to reverse-paddle this one, but doesn't connect"}, {"ball": 10.5, "isHighlight": false, "text": "Shakib Al Hasan to Saha, $$SIX$$ ,now that sounds like a solid bat! It's marginally shorter from Shakib and Saha latches on to it, whacking it over deep midwicket with a powerful swing"}, {"ball": 10.6, "isHighlight": false, "text": "Shakib Al Hasan to Saha,no run,and he goes for a sweep to one that is wide outside off, misses"}, {"ball": 10.6, "isHighlight": false, "text": "This is stifling bowling from the spinners. The pitch has some spin, but it's not as tough as they are making it out to be. Just good bowling"}, {"ball": 11.1, "isHighlight": false, "text": "Chawla to Vohra,no run,comes down the pitch and yorks himself, digs it out to extra cover"}, {"ball": 11.2, "isHighlight": false, "text": "Chawla to Vohra,2 runs,comes down the crease and drives this fuller delivery inside out to wide long-off for a couple"}, {"ball": 11.3, "isHighlight": false, "text": "Chawla to Vohra,1 run,tossed up delivery, the batsman comes out of the crease and punches this to long on"}, {"ball": 11.4, "isHighlight": false, "text": "Chawla to Saha, $$SIX$$ ,flat and powerful! The batsman takes a small step out, gets a half-volley and he hammers it over long-off"}, {"ball": 11.5, "isHighlight": false, "text": "Chawla to Saha, $$SIX$$ ,and again! This is beautifully hit. Saha is quick on the feet, he comes out and surprises the bowler, who is tossing it up. Saha takes it on the half-volley and sends it over to the sight-screen. Huge hit this one"}, {"ball": 11.6, "isHighlight": false, "text": "Chawla to Saha,no run,flatter delivery now and he is lucky that Saha finds short third man with the cut shot"}, {"ball": 11.6, "isHighlight": false, "text": "That over has even things out a bit now"}, {"ball": 11.6, "isHighlight": false, "text": "Shakib again.."}, {"ball": 12.1, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,he comes out of the crease and Shakib responds with a quick shorter one, the batsman flatbats it to deep midwicket"}, {"ball": 12.2, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 leg bye,this stays a touch low outside off! Saha wanted to pull it over deep midwicket but gets hit on the pads, picks up a leg bye"}, {"ball": 12.3, "isHighlight": false, "text": "Shakib Al Hasan to Vohra,1 run,fires it full on the stumps, dug out to long on for a single"}, {"ball": 12.4, "isHighlight": false, "text": "Shakib Al Hasan to Saha,2 runs,another one! Not really.. This one just clears Yusuf at extra cover. Shakib fired it wide outside off and Saha only gets a toe to it"}, {"ball": 12.5, "isHighlight": false, "text": "Shakib Al Hasan to Saha,1 run,looks for a reverse sweep but Shakib has fired this full on the stumps, he can only push it to cover"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib Al Hasan to Vohra, $$FOUR$$ ,useful runs here now! The batsman shimmied down the pitch, got a yorker from Shakib, but he manages to squeeze it in the tiny gap between backward point and short third man"}, {"ball": 12.6, "isHighlight": false, "text": "MrGarreth: \"I can't believe that the one tieam that finally listened to most people's calls of bringing in their best hitters early has now, at the final, decided to go the route that killed the likes of RCB and DD. Madness from KXIP\""}, {"ball": 12.6, "isHighlight": false, "text": "Narine comes back"}, {"ball": 13.1, "isHighlight": false, "text": "Narine to Saha,no run,Saha swings across the line looking for the deep midwicket area, gets beaten as this one spins the other way"}, {"ball": 13.2, "isHighlight": false, "text": "Narine to Saha, $$SIX$$ ,he is not going to stop! Saha continues to swing across the line, this time he gets loads of bat and clears the deep midwicket boundary"}, {"ball": 13.3, "isHighlight": false, "text": "Narine to Saha, $$FOUR$$ ,and more! This one was flatter and turning in to Saha. He is good sweeper, and puller, he whacks this one behind square on the leg side.. Teases Morkel at the boundary"}, {"ball": 13.4, "isHighlight": false, "text": "Narine to Saha, $$FOUR$$ ,looks for a pull and gets an underedge! This one is between Robin's legs.. Saha has  $$fifty$$  already.. hello, Kings XIs are here finally"}, {"ball": 13.4, "isHighlight": false, "text": "Pratik: \"@McGarreth I don't think Miller and Maxwell could handle this turning wicket. It was better to give chance to Indian players who can handle spin much better\" --- I don't think the batsman are watching the turn.. They are not worrying about it and just going through with their shots"}, {"ball": 13.5, "isHighlight": false, "text": "Narine to Saha,1 run,now he watches this one closely and dabs it to cover for a quick single"}, {"ball": 13.5, "isHighlight": false, "text": "Nuetral_observe: \"Saha is taking Narine apart. Is Saha the Bisla of this IPL? IPL has a history of unsung heros in finals.\""}, {"ball": 13.6, "isHighlight": false, "text": "Narine to Vohra, $$FOUR$$ ,this is not what Gambhir wants to see! This is full on the pads, Vohra loves that length, he just has to get under it and smash it in the huge gap at cow corner. Now Vohra has a  $$fifty$$  too"}, {"ball": 13.6, "isHighlight": false, "text": "Nineteen off that over. Six overs to go and now this looks more and more like a Kings XI inninngs. Super stand this.. already 81 in 8.5 overs"}, {"ball": 13.6, "isHighlight": false, "text": "Morne comes back"}, {"ball": 14.1, "isHighlight": false, "text": "Morkel to Saha,1 run,length ball outside off, the batsman nudges it to gully for a single"}, {"ball": 14.2, "isHighlight": false, "text": "Morkel to Vohra, $$SIX$$ ,this is over the fence! How? Vohra clears the front leg, gets a length ball outside off and he chooses the slice.. His one hand came off the handle, so this shouldn't have gone far, but this clears the third man boundary"}, {"ball": 14.3, "isHighlight": false, "text": "Morkel to Vohra, $$FOUR$$ ,what a shot! This one has Sehwag written all over it.. Length ball on off, this is blasted over point and hits the boundary like a rocket"}, {"ball": 14.4, "isHighlight": false, "text": "Morkel to Vohra,1 run,Shakib was moved to deep backward point but this one lands safely ahead of him! Vohra was looking to go over long on but got a thick outside edge"}, {"ball": 14.5, "isHighlight": false, "text": "Morkel to Saha, $$SIX$$ ,short ball! This one is hooked over fine-leg and at Morke's place, this is alway going over... Bangalore has woken up.. KKR are now being stung the Punjabi way. Zinta is all smiles now"}, {"ball": 14.6, "isHighlight": false, "text": "Morkel to Saha,2 runs,fuller delivery on the stumps, now this is stylishly flicked in the gap at midwicket for a couple. That's century of the stand, that has come at the rate at which Gambhir talks. Manic."}, {"ball": 14.6, "isHighlight": false, "text": "$$73$$ $$runs$$ $$in$$ $$the$$ $$last$$ $$five$$ $$overs.$$"}, {"ball": 15.1, "isHighlight": false, "text": "Narine to Vohra,no run,looks to play the late cut but gets beaten"}, {"ball": 15.2, "isHighlight": false, "text": "Narine to Vohra,1 run,tossed up on the stumps, Vohra paddles it to deep backward square leg for a single to get Saha on strike"}, {"ball": 15.2, "isHighlight": false, "text": "Idrees: \"Uthappa's keepings has improved quite significantly this season. I remembered the 1st game in abu Dhabi against Mumbai where he missed a few stumpings off narine. Goods signs for India particularly with the form he is in with the bat as well.\" ----- sorry this came just before the stumping...needs to be put here"}, {"ball": 15.3, "isHighlight": false, "text": "Narine to Saha,1 run,goes down on his knee, looks for the deep midwicket boundary, gets a doosra, gets a thick top-edge! Narine calls for it, but he has to run towards mid-on .. he gets there and gets under it but  $$drops$$  it"}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Vohra,1 no ball,that is probably not going to hurt now because Vohra has been stumped! He was already outside the crease, looks to cut, gets beaten and is stumped easily. However, the umpire is checking if Uthappa has taken the ball in front of the stumps or not? Looks just about fine to me, but this could be a tight call here. The umpire has ruled in favour of Vohra.. It's a no-ball too because it was taken in front of the stumps"}, {"ball": 15.4, "isHighlight": false, "text": "Talk about bonuses.. Maxwell was here already and he has to go back and wait"}, {"ball": 15.4, "isHighlight": false, "text": "Narine to Vohra, $$FOUR$$ ,tossed up on off, this one is easier of the deliveries and Vohra smashes it down the ground.. Surya, at long-on, comes in and gets a hand, but can't keep it in"}, {"ball": 15.5, "isHighlight": false, "text": "Narine to Vohra,1 run,this one is another harmless delivery, Vohra is down on the knee and hammers it over midwicket, but this one doesn't go too far"}, {"ball": 15.6, "isHighlight": false, "text": "Narine to Saha,1 run,fuller on the pads, the batsman hammers it to deep midwicket for a quick single"}, {"ball": 15.6, "isHighlight": false, "text": "Sandeep B. Gaud: \"With the way things are unfolding, Sunil Narine must be rethinking if he got his priorities right all over again. You choose IPL over your national team?\""}, {"ball": 15.6, "isHighlight": false, "text": "Umesh now"}, {"ball": 16.1, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,the deluge is getting suffocating for KKR! Length ball outside off, Saha throws his bat at that and slices it through backward point for a boundary"}, {"ball": 16.2, "isHighlight": false, "text": "UT Yadav to Saha,no run,slower delivery on the leg stump line, Saha looks to pull that but misses"}, {"ball": 16.2, "isHighlight": false, "text": "Raghu Ifmr: \"Maxwell and Miller may not even get to bat tonight.. Saha and Vohra has just crashed KKR party plans\""}, {"ball": 16.3, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,slower and fuller outside off! Saha you brute beaut! He crashes it through extra cover.. no one moves.. Where can you place the fielders now"}, {"ball": 16.4, "isHighlight": false, "text": "UT Yadav to Saha,3 wides,all falling apart for KKR! Umesh bowls a slower one wide down the leg side, Robin doesn't collect it cleanly..Kings Xi are loving this"}, {"ball": 16.4, "isHighlight": false, "text": "UT Yadav to Saha,1 run,whoa! That made such a good noise off the bat! Length ball on off, Saha swings across the line but doesn't get the whole bat behind it, it falls in the gap between deep square leg and deep midwicket"}, {"ball": 16.5, "isHighlight": false, "text": "UT Yadav to Vohra,1 leg bye,fired on the pads, Umesh is lucky that the batsman doesn't get any bat on that.. it flicks the pads on its way to short fine leg"}, {"ball": 16.5, "isHighlight": false, "text": "Rakesh: \"This is excellent teamwork from Saha-Vohra....Hope Kohli-Yuvi, Dhoni-Raina learn from them. Both are supporting, talking to each other, encouraging, got set and started smashing ball all over the ground. \""}, {"ball": 16.5, "isHighlight": false, "text": "Andrew Strauss is here too"}, {"ball": 16.6, "isHighlight": false, "text": "UT Yadav to Saha, $$SIX$$ ,Whoa!! Saha flatbats this back of length delivery to the sight-screen. Who's been watching French open?"}, {"ball": 16.6, "isHighlight": false, "text": "The energy is infectious. I have goosebumps. The whole Punjab dugout is on its feet. The whole Bangalore is too"}, {"ball": 16.6, "isHighlight": false, "text": "Three overs to go.. who needs Maxwell and Miller? Chawla comes in"}, {"ball": 17.1, "isHighlight": false, "text": "Chawla to Vohra, $$OUT$$ ,he almost  $$fluffed$$  the chance! Vohra wanted to send this to MG Road, but gets a big edge that looped high up in the night sky. Chawla calls early, gets under it.. But the ball bobs out of his hands.. it actually hits him on his face.. and bounces of his mouth. He is relieved to see it's still in his hands later. Gambhir is relieved too.. Wait a second.. relief? who's next?"}, {"ball": 17.1, "isHighlight": false, "text": "$$M$$ $$Vohra$$ $$c$$ $$&$$ $$b$$ $$Chawla$$ $$67$$ $$(75m$$ $$52b$$ $$6x4$$ $$2x6)$$ $$SR:$$ $$128.84$$"}, {"ball": 17.1, "isHighlight": false, "text": "Saha on strike.."}, {"ball": 17.2, "isHighlight": false, "text": "Chawla to Saha, $$FOUR$$ ,murdered! Call 100.. this is carnage. Flatter deliver on off, Saha has whacked this so hard past the umpire that no one in the field moves"}, {"ball": 17.3, "isHighlight": false, "text": "Chawla to Saha,2 runs,comes down the pitch and drives it to deep extra cover, not much timing so this is stopped inside the boundary"}, {"ball": 17.3, "isHighlight": false, "text": "Bristolian: \"this is why i like IPL... the catches itself are worth watching... the truly brilliant catch of Pollard.... the simply gravity defying chris lynn catch.. and then this piyush chawla one...\""}, {"ball": 17.4, "isHighlight": false, "text": "Chawla to Saha, $$FOUR$$ ,flatter and wide outside off! Gimme more freebies, says Saha, before hammering it through cover off the back foot. The man was at extra cover, a bit too straight"}, {"ball": 17.5, "isHighlight": false, "text": "Chawla to Saha,1 run,tossed up wide outside off, Saha comes down the pitch and chips it over extra cover for a single"}, {"ball": 17.5, "isHighlight": false, "text": "Loud cheer. Maxwell takes strike"}, {"ball": 17.6, "isHighlight": false, "text": "Chawla to Maxwell, $$OUT$$ ,goes for the reverse sweep straightaway, it's in the air and it's gobbled up by the tower at short third man. Anyone else and this would have gone for a boundary, but Morkel's tall frame comes to the rescue."}, {"ball": 17.6, "isHighlight": false, "text": "$$GJ$$ $$Maxwell$$ $$c$$ $$Morkel$$ $$b$$ $$Chawla$$ $$0$$ $$(4m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 17.6, "isHighlight": false, "text": "only 11 runs, a good over in the context of the game"}, {"ball": 17.6, "isHighlight": false, "text": "Narine is back"}, {"ball": 18.1, "isHighlight": false, "text": "Narine to Saha,no run,bowls the doosra outside off, Saha swings across the line, misses"}, {"ball": 18.2, "isHighlight": false, "text": "Narine to Saha,no run,and again! this is wide outside off, the batsman misses the hoick"}, {"ball": 18.3, "isHighlight": false, "text": "Narine to Saha, $$SIX$$ ,why bowl filth when you are bowling well? Narine must wonder. He bowls a full toss on the pads and Saha has launched it over deep backward square leg"}, {"ball": 18.4, "isHighlight": false, "text": "Narine to Saha, $$FOUR$$ ,he waits deep in the crease, almost standing on the stumps, and pulls the length delivery across the line to deep midwicket boundary, just drops short of the boundary"}, {"ball": 18.5, "isHighlight": false, "text": "Narine to Saha, $$SIX$$ ,brilliant Saha brilliant! He has a century.. Kings XI take a bow! This is length ball and it's hammered over long on, the fielder gets a hand and pushes it over the boundary.. What entertainment."}, {"ball": 18.6, "isHighlight": false, "text": "Narine to Saha,1 leg bye,full on the pads, Narine appeals for lbw but the umpire is not interested. Should have been out for me"}, {"ball": 18.6, "isHighlight": false, "text": "129 runs in the last nine overs."}, {"ball": 18.6, "isHighlight": false, "text": "Umesh comes"}, {"ball": 19.1, "isHighlight": false, "text": "UT Yadav to Saha,no run,bowls a yorker outside off, the batsman cannot connect"}, {"ball": 19.2, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,goes down on his knee outside off early, and sweeps it in the gap at backward square leg, he falls over to the off side but he continues to feast"}, {"ball": 19.2, "isHighlight": false, "text": "Ramprashad : \"Punjab has foxed their opposition twice consecutively. Chennai and Kolkatta were focusing on Maxwell and Miller. Sehwag came from nowhere and killed Chennai's dream, and today Saha is about to kill Kolkatta's dream.\""}, {"ball": 19.3, "isHighlight": false, "text": "UT Yadav to Saha, $$FOUR$$ ,fuller on off, he can play in front of the wicket too sir! Miller is all smiles as Saha smashes it over extra cover"}, {"ball": 19.4, "isHighlight": false, "text": "UT Yadav to Saha,2 runs,fires this one on the block hole, Saha gets an inside edge to deep backward square leg, picks up a couple"}, {"ball": 19.4, "isHighlight": false, "text": "Zishan Ali Khan: \"This is brilliant. Such an exciting prospect specially because he is playing in the upcoming ODI series. Maybe the selection gave him this \"go crazy\" confidence.\""}, {"ball": 19.5, "isHighlight": false, "text": "UT Yadav to Saha,1 run,another good yorker, he gets an inside edge to short fine leg, who misfields.. but Miller will get a ball to play.. only single taken"}, {"ball": 19.6, "isHighlight": false, "text": "UT Yadav to Miller,1 run,fuller outside off, this is good bowling.. Miller drives it through off where the fielder at extra cover makes a good stop, keeps them to single"}, {"ball": 19.6, "isHighlight": false, "text": "What.an.innings! Saha you beauty. Who'd have thunk that? Last match Sehwag, now him. Kings XI, would you believe, were on 58 for 2 at the end of 10 overs. What followed for madness. Vohra played his part with 67 but Saha just kept going on for his shots.. 200 is a very very strong total and KKR will need to play out of their skins to get there.  Back in ten. Karthik will take over comms for the second half."}, {"ball": 19.6, "isHighlight": false, "text": "$$Manan$$ $$Vohra$$  : \"We just decided to take some time because the ball was gripping. We were going to go for after anyone who would have bowled the 14th - it was Narine - but we carried on with the plans. The ball is gripping on the surface, so i think our spinners should do well. \""}, {"ball": 19.6, "isHighlight": false, "text": "Bristolian: \"Wriddhiman Saha is an anagram of \"Disdain Harm Haw\" Disdain - the way saha treated KKR bowlers Harm - what saha caused KKR Haw - what the spectators exclaimed...\""}, {"ball": 19.6, "isHighlight": false, "text": "sidharth: \"200 is not an simple target at all. KKR has to bat well all the 20 overs. A few wicket here and there will give them a crushing defeat. Its been raining in Bangalore at later evenings. Hope nothing like that happens today\""}, {"ball": 19.6, "isHighlight": false, "text": "CricketFun: \"Everyone would have laughed at you, if you would have told them in the morning that #KXIP will score 199 with M&M getting 1 from 2, and #Narine going for 46 from 4..\""}, {"ball": 19.6, "isHighlight": false, "text": "Alexandr Steinb: \"Saha brilliance aside, I honestly think KXIP are 20 runs short today.\""}], "name": "Kolkata Knight Riders v Kings XI Punjab", "innings": "Kings XI Punjab  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734049.html?innings=1;view=commentary", "match_num": 60}