{"commentary": [{"ball": 0, "isHighlight": false, "text": "Here we go then. The umpires pull the lid off the IPL trophy and pull out the match ball. Robin Uthappa sprints into the middle, and Gautam Gambhir follows, shadow-practicing his front-foot defence. Not sure we'll be seeing too much of that shot. Who's going to take the new ball for Kings XI? It's Mitch."}, {"ball": 0, "isHighlight": false, "text": "J Ram is either a very optimistic KKR fan or a very pessimistic Kings XI fan or a very fanciful neutral. \"I think that the Kings XI are about 15-30 runs short today. Utthapa, Gambhir and Shakib will overhaul this fairly easily against the somewhat weak Kings XI bowling.\" Not saying it can't happen, but \"fairly easily\"?"}, {"ball": 0, "isHighlight": false, "text": "Hello, everyone. This is Karthik Krishnaswamy, taking over from DF. What an innings from Saha, eh? No side has ever chased 200 in an IPL final, but Knight Riders  $$came$$ $$pretty$$ $$close$$  in 2012, when another Indian wicketkeeper lit up the Chepauk."}, {"ball": 0.1, "isHighlight": false, "text": "Johnson to Uthappa, $$FOUR$$ ,what a lovely shot to start off with. Johnson bowls it full and wide, and Uthappa just leans into it to send it scurrying past cover."}, {"ball": 0.2, "isHighlight": false, "text": "Johnson to Uthappa,1 run,bit of inward movement there from an off-stump line, and Uthappa gets an inside-edge towards backward square leg"}, {"ball": 0.3, "isHighlight": false, "text": "Johnson to Gambhir,1 run,bit of swing away from Gambhir, and it's very full. Pokes it towards cover off the front foot."}, {"ball": 0.4, "isHighlight": false, "text": "Johnson to Uthappa, $$OUT$$ ,he's gone! Uthappa's incredible run has come to a soft end. It's angled wide outside off, not as full as that first-ball four, and Uthappa's bat turns in his hands as he tries to drive, and ends up slicing it to point, where Akshar gets on his toes to grab it above his head"}, {"ball": 0.4, "isHighlight": false, "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Patel$$ $$b$$ $$Johnson$$ $$5$$ $$(3m$$ $$3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$166.66$$"}, {"ball": 0.4, "isHighlight": false, "text": "Manish Pandey is in now"}, {"ball": 0.5, "isHighlight": false, "text": "Johnson to Pandey, $$FOUR$$ ,straight, back of a length, and Pandey whips it off his hip. It looked like it would go for a single, but it hurries away to the boundary, to the left of midwicket"}, {"ball": 0.6, "isHighlight": false, "text": "Johnson to Pandey,no run,bit of width, and Pandey is beaten as he chases at it without moving his feet"}, {"ball": 0.6, "isHighlight": false, "text": "Balaji now"}, {"ball": 1.1, "isHighlight": false, "text": "Balaji to Gambhir, $$FOUR$$ ,and he starts off with a wide half-volley that Gambhir presses confidently forward to before driving with a high elbow past cover"}, {"ball": 1.2, "isHighlight": false, "text": "Balaji to Gambhir,no run,pulls his length back a bit, and brings it closer to off stump, angling across. Gambhir has a look, but lets it go"}, {"ball": 1.3, "isHighlight": false, "text": "Balaji to Gambhir,2 runs,that's another wide half-volley. Even wider this time, and Gambhir has to reach across and play the flat-batted drive. David Miller makes a good stop, diving to his right from cover"}, {"ball": 1.4, "isHighlight": false, "text": "Balaji to Gambhir,1 run,slower ball, and Gambhir comes down the pitch before mistiming a swipe towards mid-on. Went off the inside half of the bat"}, {"ball": 1.5, "isHighlight": false, "text": "Balaji to Pandey,1 run,drifts onto the pads, but Akshar is on hand at deep midwicket to cut off that flick from Pandey"}, {"ball": 1.6, "isHighlight": false, "text": "Balaji to Gambhir,1 run,shortens his length a touch and angles it towards off stump. Gambhir waits on it and opens his bat-face to squirt it behind point"}, {"ball": 2.1, "isHighlight": false, "text": "Johnson to Gambhir,1 wide,that slingy left arm drops very low, and the attempted short ball slants well down the leg side. Gambhir moves himself out of the way"}, {"ball": 2.1, "isHighlight": false, "text": "vikas: \"How many times have we seen a consistent player throughout the tournment failing in the finals!!! Sachin in2011 finals,Gauti in 2012 IPL finals and Robin today\""}, {"ball": 2.1, "isHighlight": false, "text": "Johnson to Gambhir, $$FOUR$$ ,lovely shot. That isn't a half-volley, but Gambhir is in position early and right behind the line to drive this on the up to the left of point"}, {"ball": 2.2, "isHighlight": false, "text": "Johnson to Gambhir,1 wide,uh oh. Johnson's radar is going haywire here. Slides even further down the leg side this time"}, {"ball": 2.2, "isHighlight": false, "text": "Johnson to Gambhir,1 run,short ball, and it rises towards Gambhir's neck, but he's jumped up to get right over the ball and knock it down by his feet"}, {"ball": 2.3, "isHighlight": false, "text": "Johnson to Pandey,1 run,Pandey tries to clear his front leg for the slog, but Johnson's bowled a slower ball and he hasn't picked it. Ends up trying to flick and jams it into his pads"}, {"ball": 2.4, "isHighlight": false, "text": "Johnson to Gambhir,no run,that's full and angling into Gambhir's pads. Hits the bottom of his bat as he looks to flick"}, {"ball": 2.5, "isHighlight": false, "text": "Johnson to Gambhir,no run,that's short and wide, leaves Gambhir off the pitch with a bit of away movement. Gambhir jumps up and tries to get on top of the bounce but gets nowhere near the ball"}, {"ball": 2.6, "isHighlight": false, "text": "Johnson to Gambhir, $$FOUR$$ ,he's beaten the fielder. That's very full, and Gambhir skips quickly across his crease and drives with an open bat face to beat the cover fielder diving to his right"}, {"ball": 2.6, "isHighlight": false, "text": "Awana now"}, {"ball": 3.1, "isHighlight": false, "text": "Awana to Pandey,1 run,angles this one in towards off stump, and Pandey drives wristily towards mid-on"}, {"ball": 3.2, "isHighlight": false, "text": "Awana to Gambhir,1 run,lucky, lucky. Gambhir tries to flick this shortish ball and gets a leading edge that pops up over Virender Sehwag, who doesn't get near the ball as he turns around and runs back from midwicket"}, {"ball": 3.3, "isHighlight": false, "text": "Awana to Pandey, $$FOUR$$ ,nice placement. Comes down the pitch and flicks it uppishly but safely from off stump. Johnson chases from mid on but his slide is futile."}, {"ball": 3.4, "isHighlight": false, "text": "Awana to Pandey,no run,Pandey takes another step down the pitch and Awana shortens his length. Pandey calls \"no\" after punching into the covers"}, {"ball": 3.5, "isHighlight": false, "text": "Awana to Pandey,2 runs,that's short, and it sits up, and Pandey swivels into this pull. Deep square leg runs around to his left to cut it off on the boundary"}, {"ball": 3.6, "isHighlight": false, "text": "Awana to Pandey,1 run,makes room this time, and pushes the length ball towards cover with soft-ish hands"}, {"ball": 4.1, "isHighlight": false, "text": "Balaji to Pandey, $$FOUR$$ ,what a shot! Balaji angles it in and pitches it up. It's right in the slot, and Pandey punches it straight back over the umpire with a straight bat"}, {"ball": 4.2, "isHighlight": false, "text": "Balaji to Pandey,no run,slower ball, and Pandey plays it wristily back to the bowler"}, {"ball": 4.3, "isHighlight": false, "text": "Balaji to Pandey,no run,slower bouncer, this time, angled in from wide of the crease. Pandey is very early into the pull, and the ball goes bouncing down to the keeper"}, {"ball": 4.4, "isHighlight": false, "text": "Balaji to Pandey,1 run,that's a back-of-a-length ball, bottom-wristed away towards deep midwicket"}, {"ball": 4.5, "isHighlight": false, "text": "Balaji to Gambhir,1 run,another slower ball, and Gambhir, who has taken two steps down the pitch, adjusts to work it off his legs to square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Balaji to Pandey,2 runs,angles this into the pads, and Pandey picks up two with a nice bit of placement between short fine leg and deep square leg"}, {"ball": 5.1, "isHighlight": false, "text": "Awana to Gambhir,1 run,back of a length outside off, and Gambhir punches it in front of point"}, {"ball": 5.1, "isHighlight": false, "text": "Arun: \"Is Balaji the first player to play 3 IPL Finals for 3 different teams ?\" He was part of the 2010 CSK team and the 2012 KKR team, but didn't play either final"}, {"ball": 5.2, "isHighlight": false, "text": "Awana to Pandey,1 run,down the pitch, but he can't really time that flat-batted hit. Aims towards the covers, hits it down to long-off"}, {"ball": 5.3, "isHighlight": false, "text": "Awana to Gambhir,1 run,short ball, and Gambhir leans back to make himself room to chop it down towards deep backward point"}, {"ball": 5.4, "isHighlight": false, "text": "Awana to Pandey,5 runs,down the pitch once more, almost yorks himself and hits the low full-toss to Mitchell Johnson at mid-on. He throws hard at the stumps at the keeper's end, hits them, and gives away four overthrows as third man fails to cut it off at the boundary"}, {"ball": 5.5, "isHighlight": false, "text": "Awana to Gambhir,1 run,that's back of a length and straight. Gambhir jumps up and knocks it down into the off side for yet another well-run single"}, {"ball": 5.5, "isHighlight": false, "text": "Lots of good running here. Kings XI need to bowl some dot balls"}, {"ball": 5.6, "isHighlight": false, "text": "Awana to Pandey,2 runs,that's a waist-high full-toss, and Pandey mishits it down to deep backward square leg. The lack of timing on that swipe allows the batsmen to run two"}, {"ball": 5.6, "isHighlight": false, "text": "Here's spin, for the first time. Karanveer"}, {"ball": 6.1, "isHighlight": false, "text": "Karanveer Singh to Gambhir, $$OUT$$ ,and he's struck first ball! Gambhir comes down the track and heaves mightily at the ball without quite getting to the pitch of the ball. It goes high in the air and Miller, running to his left from long-on, takes it well inside the boundary"}, {"ball": 6.1, "isHighlight": false, "text": "$$G$$ $$Gambhir$$ $$c$$ $$Miller$$ $$b$$ $$Karanveer$$ $$Singh$$ $$23$$ $$(34m$$ $$17b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$135.29$$"}, {"ball": 6.1, "isHighlight": false, "text": "There were only eight dot balls in the Powerplay, and Knight Riders were batting very smartly until that shot from Gambhir. Yusuf Pathan comes in now, with 141 to get from 83"}, {"ball": 6.2, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$SIX$$ ,what a shot! it's full, and Pandey's swung cleanly through the ball to send it soaring over cover"}, {"ball": 6.3, "isHighlight": false, "text": "Karanveer Singh to Pandey,no run,shortens his length this time, and Pandey waits on it and slices it to point"}, {"ball": 6.4, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,this one pitches outside off and turns further away from off, and Pandey works his wrists to hit it towards midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Karanveer Singh to Pathan,no run,back of a length, and Yusuf plays watchfully towards cover"}, {"ball": 6.6, "isHighlight": false, "text": "Karanveer Singh to Pathan,1 run,Yusuf waits this time and plays it very late, with an open face, to short third man"}, {"ball": 6.6, "isHighlight": false, "text": "Aalhad Kulkarni: \"\"He didn't play either final\" Balaji did play 2008 final. He bowled the final over of the match for csk, had 1 to defend off the last ball\" Yes, but we were talking about playing for the winning finalist (Or so I thought)."}, {"ball": 6.6, "isHighlight": false, "text": ""}, {"ball": 6.6, "isHighlight": false, "text": "Bibhaw: \"Here's an interesting observation, KKR struck with first ball of spin and so did Punjab. Neck and Neck until now both these team.\""}, {"ball": 6.6, "isHighlight": false, "text": "They've taken a time-out, judging by the long ad break. A pensive-looking Gautam Gambhir's chewing down his nails in the KKR dugout"}, {"ball": 7.1, "isHighlight": false, "text": "Balaji to Pathan,no run,back of a length ball, angled in towards middle-and-off, and Yusuf plays it watchfully down the ground with a straight bat"}, {"ball": 7.2, "isHighlight": false, "text": "Balaji to Pathan,1 run,another slower short ball and Yusuf leans back to chop it towards point"}, {"ball": 7.3, "isHighlight": false, "text": "Balaji to Pandey,no run,angled towards off stump, length ball, and Pandey makes room to try and squeeze it past cover, but Bailey makes a diving stop"}, {"ball": 7.4, "isHighlight": false, "text": "Balaji to Pandey, $$FOUR$$ ,that's short, and Pandey is in the perfect position, having cleared his front leg, to swing cleanly and swat it to the straightish midwicket boundary"}, {"ball": 7.5, "isHighlight": false, "text": "Balaji to Pandey,1 run,tries a similar shot, but it's shorter and outside off, and he gets an inside-edge to the left of the keeper"}, {"ball": 7.6, "isHighlight": false, "text": "Balaji to Pathan,no run,that's fuller, and very straight. Yusuf didn't seem to be expecting that length, and he gets down low to nudge towards midwicket"}, {"ball": 8.1, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,angles this in, outside leg, and Pandey clips it towards square leg"}, {"ball": 8.2, "isHighlight": false, "text": "Karanveer Singh to Pathan, $$SIX$$ ,that's full and wide, and Yusuf has a lot of room to swing freely and launch it over extra cover, with the turn"}, {"ball": 8.3, "isHighlight": false, "text": "Karanveer Singh to Pathan, $$SIX$$ ,that's full again, tossed up, and not as wide, so this disappears over long-off instead. Miller almost got his hand to it, leaping and stretching himself painfully"}, {"ball": 8.4, "isHighlight": false, "text": "Karanveer Singh to Pathan,1 run,shortens his length this time, and Yusuf slaps it to deep point"}, {"ball": 8.5, "isHighlight": false, "text": "Karanveer Singh to Pandey,no run,that's back of a length, and straightens towards off stump. It seemed to stick on the pitch and Pandey gets an inside edge into the leg side"}, {"ball": 8.6, "isHighlight": false, "text": "Karanveer Singh to Pandey,no run,bit of loop this time, and Pandey is beaten trying to drive, as the ball dips and turns past his outside edge"}, {"ball": 8.6, "isHighlight": false, "text": "Akshar now, for the first time"}, {"ball": 9.1, "isHighlight": false, "text": "Patel to Pathan,1 run,that's fired into the pads from wide of the crease, and Yusuf works it towards midwicket"}, {"ball": 9.2, "isHighlight": false, "text": "Patel to Pandey,no run,length ball, and Pandey is forward to defend back to the bowler"}, {"ball": 9.3, "isHighlight": false, "text": "Patel to Pandey,no run,pushed through again, and Pandey pushes it to cover"}, {"ball": 9.4, "isHighlight": false, "text": "Patel to Pandey,1 run,gets a bit of a leading edge on this, ballooons safely down to long-on"}, {"ball": 9.5, "isHighlight": false, "text": "Patel to Pathan,no run,slides in from outside off, and Yusuf gets an inside edge onto his pads"}, {"ball": 9.6, "isHighlight": false, "text": "Patel to Pathan,no run,full, angled towards leg-and-middle, and Yusuf defends back to the bowler. That over took next to no time, and only cost Punjab 2 runs. Great start from Akshar"}, {"ball": 9.6, "isHighlight": false, "text": "Awana now"}, {"ball": 10.1, "isHighlight": false, "text": "Awana to Pandey, $$FOUR$$ ,that's short, that's wide, and Pandey has creamed that with a flat bat to the right of cover and well to the left of long-off."}, {"ball": 10.2, "isHighlight": false, "text": "Awana to Pandey, $$SIX$$ ,short again, and Pandey has pulled that high and hard over deep midwicket. Super 50 from the local boy"}, {"ball": 10.3, "isHighlight": false, "text": "Awana to Pandey,no run,that was hit hard, and Awana's done well to get down low and field it in his follow-through. It was full and Pandey threw everything at it"}, {"ball": 10.4, "isHighlight": false, "text": "Awana to Pandey,1 run,that's in the blockhole, and Pandey makes room to squirt it towrds cover."}, {"ball": 10.5, "isHighlight": false, "text": "Awana to Pathan,1 run,that's a low full-toss, and it's jammed down to long-off"}, {"ball": 10.6, "isHighlight": false, "text": "Awana to Pandey, $$SIX$$ ,slower ball, and Pandey has spotted that even before it left the bowler's hand. He clears his front leg, gets into a low crouch, and his bat makes a lovely sound as he swats it over cow corner"}, {"ball": 11.1, "isHighlight": false, "text": "Patel to Pathan,no run,full and stump-to-stump, and Yusuf is hit on the front pad as he tries to flick. Going down leg, though"}, {"ball": 11.2, "isHighlight": false, "text": "Patel to Pathan,no run,full again, and he's pushed that into the covers"}, {"ball": 11.3, "isHighlight": false, "text": "Patel to Pathan,1 run,pulls his length back a bit, and Yusuf flicks that off his hips to deep square leg"}, {"ball": 11.4, "isHighlight": false, "text": "Patel to Pandey,no run, $$dropped!$$  that was a strange shot from Pandey, trying to flick a shortish ball from outside off, and he gets a leading edge that pops over Bailey's head at cover. He gets an outstretched right hand to it, and it pops behind him, and he almost grabs the ball behind his back with his left hand"}, {"ball": 11.5, "isHighlight": false, "text": "Patel to Pandey,1 run,shortish ball, flicked towards deep square leg"}, {"ball": 11.6, "isHighlight": false, "text": "Patel to Pathan,1 run,back of a length ball, slides in with the angle, and he's flicked it towards midwicket"}, {"ball": 12.1, "isHighlight": false, "text": "Balaji to Pathan,2 runs,that's full and wide, and he's thrown his arms at it to slash it towards deep cover"}, {"ball": 12.2, "isHighlight": false, "text": "Balaji to Pathan, $$SIX$$ ,that's short, and Yusuf has pulled it from outside off, muscled it really, over the deep square leg boundary. All these short balls are sitting up nicely for the batsmen"}, {"ball": 12.3, "isHighlight": false, "text": "Balaji to Pathan,2 runs,that's full and wide, it's outside the tram-line, in fact, but Yusuf goes through with the big drive over cover, which is cut off by long-off running left"}, {"ball": 12.4, "isHighlight": false, "text": "Balaji to Pathan,1 run,he telegraphed that scoop, and Balaji bowls it full and wide. He goes through with the shot anyway, and it pops into the vacant square leg region"}, {"ball": 12.5, "isHighlight": false, "text": "Balaji to Pandey,1 run,Pandey tries to play that tennis-smash pull again, and it goes off the bottom of his bat towards long-off"}, {"ball": 12.6, "isHighlight": false, "text": "Balaji to Pathan, $$SIX$$ ,slower ball, full-toss, and Yusuf has his fourth six, launched clean and high over long-on. This is terrible bowling"}, {"ball": 12.6, "isHighlight": false, "text": "Gorango: \"I was surprised Awana was selected after a poor bowling show last game. I thought Sandeep unfairly missed out. Is it only me?\" No, you aren't. Loads of people have asked the same question. Awana and Balaji have now gone for 79 in seven overs."}, {"ball": 13.1, "isHighlight": false, "text": "Karanveer Singh to Pandey,no run,sees Pandey down the pitch, and bowls it well down the leg side. Pandey pads it away"}, {"ball": 13.2, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,that's a rubbish long-hop. Didn't seem to come out of his hand right, but Maxwell has done brilliantly to run to his right from long-on, cut off the pull, and fire in a powerful throw that erases any intention of running two"}, {"ball": 13.3, "isHighlight": false, "text": "Karanveer Singh to Pathan,1 wide"}, {"ball": 13.3, "isHighlight": false, "text": "Karanveer Singh to Pathan, $$OUT$$ ,he's gone! Yusuf goes big again, and gets a lot of elevation but not quite enough distance, and Maxwell takes a simple catch right on the edge of the rope at long-on"}, {"ball": 13.3, "isHighlight": false, "text": "$$YK$$ $$Pathan$$ $$c$$ $$Maxwell$$ $$b$$ $$Karanveer$$ $$Singh$$ $$36$$ $$(30m$$ $$22b$$ $$0x4$$ $$4x6)$$ $$SR:$$ $$163.63$$"}, {"ball": 13.4, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$SIX$$ ,Pandey, though, carries on as if nothing has happened. There was just a little bit of air on that, and he's swung it high and to the right of the long-on fielder"}, {"ball": 13.5, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 wide,sees Pandey come down the pitch and fires it down the leg side again. Pandey swivels right around to regain his crease"}, {"ball": 13.5, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$FOUR$$ ,short again, and Pandey has pummeled that away to the left of deep midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,back of a length, on off stump, and it's been slapped to deep cover"}, {"ball": 13.6, "isHighlight": false, "text": "Mitchell Johnson returns now. He has two overs left. Two very important overs, you'd think"}, {"ball": 14.1, "isHighlight": false, "text": "Johnson to Pandey,1 run,that's a wide slower ball, and Bailey's done well to cut off that flat-batted slap, diving to his left from cover"}, {"ball": 14.1, "isHighlight": false, "text": "Shakib now, on strike for the first time"}, {"ball": 14.2, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,no run,that's a low full-toss, angled in, and Shakib is hit on the pad trying to flick it"}, {"ball": 14.3, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,2 runs,that's short from Johnson and Shakib pulls it away. Akshar makes a super diving stop after running left from deep midwicket. Pushes it to Awana, who was running from the opposite direction, and he takes ages to get rid of the ball"}, {"ball": 14.4, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,2 runs,angles onto the pads again, but almost it's in the blockhole, and the batsmen run two after Shakib flicks it to the right of Awana at deep backward square leg"}, {"ball": 14.5, "isHighlight": false, "text": "Johnson to Shakib Al Hasan,no run,in the blockhole once more, very straight, and he's flicked it to midwicket. Bailey underarms a throw to the bowler's end, misses. Might have been close, since Pandey was dawdling outside his crease for a bit"}, {"ball": 14.6, "isHighlight": false, "text": "Johnson to Shakib Al Hasan, $$FOUR$$ ,whoa. That's stunning from Shakib. It's in the blockhole again, but he doesn't care. He walks across his stumps and nonchalantly flicks it over his shoulder, one bounce over the fine-leg boundary"}, {"ball": 14.6, "isHighlight": false, "text": "Atanu: \"Difference between the two sides so far is Akshar Patel, interesting to see how he finishes.\" Indeed. He's given away only five in his first two overs."}, {"ball": 15.1, "isHighlight": false, "text": "Patel to Pandey,1 run,that's pushed through, just outside off, and Pandey muscles it to long-off"}, {"ball": 15.1, "isHighlight": false, "text": "for the first time, the left-arm spinner is bowling to a left-hander. Left-arm over now"}, {"ball": 15.2, "isHighlight": false, "text": "Patel to Shakib Al Hasan, $$FOUR$$ ,Ah. Unlucky that, for Miller, who slides to his right from long-on to intercept that powerful drive from Shakib, but the ball still rolls back over the ropes"}, {"ball": 15.3, "isHighlight": false, "text": "Patel to Shakib Al Hasan, $$OUT$$ ,he's done it again, has he? Bailey turned the second Qualifier around with his run-out of Raina, and he's run Shakib out here, with another direct hit. Shakib mishit it towards cover, and Bailey runs to the ball in a flash, turns, and sends in a pinpoint throw that catches Shakib well short at the bowler's end as he looked to take a tight single"}, {"ball": 15.3, "isHighlight": false, "text": "$$Shakib$$ $$Al$$ $$Hasan$$ $$run$$ $$out$$ $$12$$ $$(10m$$ $$7b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$171.42$$"}, {"ball": 15.3, "isHighlight": false, "text": "Tendo is in. Pandey's on strike, though"}, {"ball": 15.4, "isHighlight": false, "text": "Patel to Pandey,1 run,that's a length ball, angling in towards the off stump, and Pandey makes himself room to run it off his bat-face towards deep point"}, {"ball": 15.5, "isHighlight": false, "text": "Patel to ten Doeschate,no run,that hurried through again and straightened just a little bit. Tendo is late on his flick and hits it back to the bowler off the outside half of his bat, almost a leading edge"}, {"ball": 15.6, "isHighlight": false, "text": "Patel to ten Doeschate, $$FOUR$$ ,that's four! Akshar drops short for once, and Tendo is in position to cut it powerfully past point"}, {"ball": 15.6, "isHighlight": false, "text": "Jay: \"If my maths is correct at ten minutes per match for strategic timeouts, that comes out to be 600 minutes lost to strategic timeouts which is the equivalent of ten hours which is around 3 IPL matches!\" I cannot vouch for your maths, but you may well be right."}, {"ball": 16.1, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$SIX$$ ,that is some shot. He made it look easy. It was a legbreak tossed up well outside off, but he's swatted that with a lot of bottom hand and hit it clean over long-on"}, {"ball": 16.2, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 run,tries a similar sort of shot, but it's too full to get under, and he's hit it along the ground towards long-on"}, {"ball": 16.3, "isHighlight": false, "text": "Karanveer Singh to ten Doeschate, $$OUT$$ ,Karanveer has his third! that's full and very wide again. Tendo tries to do a Pandey, looks to go over long-on, but he doesn't get the distance, and hits it straighter than he intended, and Miller is under it to take the catch well inside the boundary"}, {"ball": 16.3, "isHighlight": false, "text": "$$RN$$ $$ten$$ $$Doeschate$$ $$c$$ $$Miller$$ $$b$$ $$Karanveer$$ $$Singh$$ $$4$$ $$(6m$$ $$3b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$133.33$$"}, {"ball": 16.4, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$SIX$$ ,that's another six, third time he's hit one right after a wicket's fallen. Again he's gone over long-on, and again he's made a super connection"}, {"ball": 16.5, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$FOUR$$ ,moves his line from wide outside off to wide outside leg, and Pandey's swept it away powerfully, behind square"}, {"ball": 16.5, "isHighlight": false, "text": "Pandey pulled away from that, but Karanveer bowled anyway. Dead ball called"}, {"ball": 16.6, "isHighlight": false, "text": "Karanveer Singh to Pandey,1 wide,tries to go wide of off stump again, but overdoes it, and it's way wide of the tramline, and wide of the return crease as well"}, {"ball": 16.6, "isHighlight": false, "text": "Karanveer Singh to Pandey, $$OUT$$ ,oh no! Pandey's been hitting against the turn with a lot of success, but doesn't get hold of it this time. It's sliced up high over cover, and Bailey takes a simple catch. Super innings, and he raises his bat to the crowd as he walks off"}, {"ball": 16.6, "isHighlight": false, "text": "$$MK$$ $$Pandey$$ $$c$$ $$Bailey$$ $$b$$ $$Karanveer$$ $$Singh$$ $$94$$ $$(81m$$ $$50b$$ $$7x4$$ $$6x6)$$ $$SR:$$ $$188.00$$"}, {"ball": 16.6, "isHighlight": false, "text": "Piyush Chawla is in now, to join Suryakumar Yadav. Neither has faced a ball. Can they get 21 off 18?"}, {"ball": 17.1, "isHighlight": false, "text": "Patel to SA Yadav,1 run,that's flat, and angled towards the stumps again, and he's got an inside edge onto the front pad, trickles into the leg side"}, {"ball": 17.1, "isHighlight": false, "text": "over the wicket to the left-handed Chawla"}, {"ball": 17.2, "isHighlight": false, "text": "Patel to Chawla,1 wide,Chawla walks across his stumps, and it's called wide as Akshar fires it marginally down the leg side"}, {"ball": 17.2, "isHighlight": false, "text": "Patel to Chawla,1 run,slower now, and Chawla flicks it towards deep midwicket"}, {"ball": 17.3, "isHighlight": false, "text": "Patel to SA Yadav,1 run,another of those skidders homing into middle stump. Surya flicks it to midwicket"}, {"ball": 17.4, "isHighlight": false, "text": "Patel to Chawla,1 run,slides across Chawla, who opens his face and pokes it towards point"}, {"ball": 17.5, "isHighlight": false, "text": "Patel to SA Yadav,no run,that's flat and quick again, pushed through towards off stump, and he can only defend it back to the bowler"}, {"ball": 17.6, "isHighlight": false, "text": "Patel to SA Yadav,1 run,skids in towards off from back of a length, and they risk the quick single to Bailey at cover and pull it off fairly easily"}, {"ball": 17.6, "isHighlight": false, "text": "What a spell from Akshar. 4-0-21-0 when the match run rate is around 10 an over. Johnson now, to bowl his last over, with 15 required from 12"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to SA Yadav,2 runs,Surya slogs across the line from outside off, and doesn't really get hold of it, midwicket slides to his right to keep it down to two"}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to SA Yadav, $$OUT$$ ,that's full, angled towards off stump, and Surya looks to go leg side. Doesn't get hold of it at all, and Manan takes a simple catch at deep midwicket. Oh yes, it was the slower ball with the off-cutter action. May have deviated away from Surya after pitching"}, {"ball": 18.2, "isHighlight": false, "text": "$$SA$$ $$Yadav$$ $$c$$ $$Vohra$$ $$b$$ $$Johnson$$ $$5$$ $$(9m$$ $$6b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$83.33$$"}, {"ball": 18.2, "isHighlight": false, "text": "Narine's come in now. He's had a terrible day so far, with the ball and on the field. Can he do it with the bat?"}, {"ball": 18.3, "isHighlight": false, "text": "Johnson to Chawla,1 run,he's pushed this full ball towards mid-off, who throws to the batsman's end, but Narine's home safe"}, {"ball": 18.4, "isHighlight": false, "text": "Johnson to Narine,no run,Narine makes himself room, and Johnson follows him with the full ball. He swings and misses, and the ball rolls down, narrowly past leg stump, to the keeper"}, {"ball": 18.5, "isHighlight": false, "text": "Johnson to Narine,1 run,that's in the blockhole again, following Narine who's opened up his stance. He can only bunt it onto his front pad"}, {"ball": 18.6, "isHighlight": false, "text": "Johnson to Chawla, $$SIX$$ ,that's short, and that's six! He didn't seem to be in the best possible position to pull, but Chawla's got more than enough bat on it after walking across his crease to send it soaring over the deep backward square leg boundary"}, {"ball": 18.6, "isHighlight": false, "text": "After all those yorkers, why bowl the short ball? With that shot, it's now just five to get from the last over. Who will bowl it? It's Awana, who's had a shocker so far."}, {"ball": 19.1, "isHighlight": false, "text": "Awana to Narine,no run,that's a good yorker, and Narine gets it off the bottom of his bat, straight to cover. Pressure!"}, {"ball": 19.2, "isHighlight": false, "text": "Awana to Narine,1 run,whoa. Bailey dives to his left to make a super stop at midwicket after Narine flicks, and sends in a throw to the bowler's end. Narine was well short of his crease, but Awana was nowhere near the stumps, and Sehwag fumbles after backing up, but they don't run the overthrow"}, {"ball": 19.3, "isHighlight": false, "text": "Awana to Chawla, $$FOUR$$ ,low full-toss, and it's all over! Chawla makes himself room and slices it over point and it runs away for four. Chawla is running around the ground like a madman, before he's pulled down to the ground by his teammates who fall all over him and smother him into the turf. What a win this is for Knight Riders!"}, {"ball": 19.3, "isHighlight": false, "text": "And so it ends, this season, with dry ice, fireworks, and a torrential confetti downpour. We've had a great time bringing it to you, and we hope you've enjoyed our coverage as well. Thanks a lot for tuning in, match after match, and sending in your comments, even though you know it's physically impossible to put them all up. That's it for us from the final, and what a match it was too. Good night!"}, {"ball": 19.3, "isHighlight": false, "text": "$$Presentation$$ $$time!$$  The excitement's gotten to Ravi Shastri, who says it's been a fantastic final, and \"no team deserved to win.\""}, {"ball": 19.3, "isHighlight": false, "text": "After an incredible century to completely turn Kings XI's innings around after a slow start, Wriddhiman Saha has to make do with just the maximum sixes award.  $$The$$ $$Man$$ $$of$$ $$the$$ $$Match$$ $$award$$ $$goes$$ $$to$$ $$Manish$$ $$Pandey$$ ."}, {"ball": 19.3, "isHighlight": false, "text": "\"We have got four achievements, Ranji Trophy, Irani, cherry on the cake was the IPL,\" Pandey says, and misses out mentioning the Syed Mushtaq Ali Trophy, the third domestic tournament his team, Karnataka, won. \"I'm very optimistic, and I love to play the crunch game. We got ten in the first over, and that was the time I thought, if we kept doing that, we'll get 200.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$The$$ $$catch$$ $$of$$ $$the$$ $$season$$ $$goes$$ $$to$$ $$Kieron$$ $$Pollard,$$ $$for$$ $$his$$ $$catch$$ $$of$$ $$Kevon$$ $$Cooper$$  Shreyas Gopal, Mumbai Indians' Bangalore boy, collects it on his behalf. I got a little frazzled and thought Shreyas had won it."}, {"ball": 19.3, "isHighlight": false, "text": "$$Glenn$$ $$Maxwell$$ $$wins$$ $$an$$ $$award$$ $$for$$ $$the$$ $$maximum$$ $$sixes$$ $$for$$ $$the$$ $$season,$$ $$and$$ $$Akshar$$ $$Patel$$ $$wins$$ $$the$$ $$Emerging$$ $$Player$$ $$award$$"}, {"ball": 19.3, "isHighlight": false, "text": "\"I'm very proud I've beaten so many domestic and international players to No. 1,\" Akshar says. \"Our bowling coach Joe [Dawes] makes a lot of plans for different batsmen, and I've worked on those. I think I'm a batting allrounder, but after this performance, maybe bowling allrounder.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$Chennai$$ $$Super$$ $$Kings$$ $$win$$ $$the$$ $$Fair$$ $$Play$$ $$award$$ , which Mohit Sharma picks up."}, {"ball": 19.3, "isHighlight": false, "text": "$$Robin$$ $$Uthappa$$ $$gets$$ $$the$$ $$orange$$ $$cap$$ . \"It's been surreal,\" he says. \"I'm at a loss for words. I'm happy I've contributed in a meaningful manner. If I have to pick one innings, the one against Mumbai Indians, because I played with a broken toe, and I broke through a physical barrier.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$Mohit$$ $$Sharma$$ $$wins$$ $$the$$ $$purple$$ $$cap$$  \"I bowled a lot in the slog overs this season,\" he says. \"I learned a lot. I've discovered more weaknesses than strengths, so I'll work on those ahead of the next season.\""}, {"ball": 19.3, "isHighlight": false, "text": "Those orange and purple caps were more like helmets, made of some heavy, blingy material, and both Uthappa and Mohit struggled to put them on.  $$Glenn$$ $$Maxwell$$ $$is$$ $$the$$ $$MVP$$"}, {"ball": 19.3, "isHighlight": false, "text": "$$George$$ $$Bailey$$  says it was a match worthy of being a final. He congratulates KKR, and congratulates Manish Pandey for a \"ballsy innings.\""}, {"ball": 19.3, "isHighlight": false, "text": "\"We've got a special bunch of guys, we've had a wonderful tournament, and our guys can hold their heads high.\" Asked to talk about his memories of the season, he says, \"I enjoyed this one, I got to play a few games.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$Gautam$$ $$Gambhir$$  collects the winners' cheque for Rs. 15 crore, and has a broad grin on his face as he walks up to talk to Shastri. \"Where we were after first seven games, not many people thought we would be here,\" Gambhir says. \"They absorbed a lot of pressure, a lot of credit needs to go to the team."}, {"ball": 19.3, "isHighlight": false, "text": "\"This is a ground where it is very difficult to defend. We wanted to get it down to 5 overs, 50 or 60 to get. Manish played a fantastic innings, Yusuf chipped in, and Chawla hit that important six. Wriddhiman played an unbelievable innings. Manish is fearless.\""}, {"ball": 19.3, "isHighlight": false, "text": "Faras: \"Both innings had a costly drop. Narine dropped Saha on 60, and Saha almost doubled his scored after that drop. Panday was dropped on 60, and scored crucial (quick) 34 after the drop catch. \""}, {"ball": 19.3, "isHighlight": false, "text": "What a wonderfully controlled chase that was from Kolkata. It started with some really busy running during the Powerplay, in which they only played out eight dot balls. Manish Pandey then came up with a big shot whenever called upon to do so. Three times, he hit sixes immediately after KKR had lost a wicket."}, {"ball": 19.3, "isHighlight": false, "text": "Kings XI stayed in the game thanks to a superb spell from Akshar Patel, and Mitchell Johnson was one ball away from bowling a brilliant 19th over, before Chawla smashed that half-tracker out of the ground to leave them with just five to get from the last over."}, {"ball": 19.3, "isHighlight": false, "text": "Wriddhiman Saha put Kings XI in a brilliant position with the first-ever century in an IPL final, but his team might now wonder whether their slow start - they only scored 58 in their first ten overs - might have cost them the final."}, {"ball": 19.3, "isHighlight": false, "text": "$$Chawla$$ : \"The short ball was coming anytime,\" he says, when asked about that six off Johnson."}, {"ball": 19.3, "isHighlight": false, "text": "$$Shakib$$  \"Two times in three years. Can't feel better!\""}, {"ball": 19.3, "isHighlight": false, "text": "$$Narine$$  says there wasn't too much tension. \"Just wanted to make contact and give it to Piyush\""}, {"ball": 19.3, "isHighlight": false, "text": "\"Freaking fantastic!\" says an ecstatic Robin Uthappa."}, {"ball": 19.3, "isHighlight": false, "text": "$$Yusuf$$ $$Pathan$$ , the only player to win three IPL titles. \"I shouldn't have played that shot. We might have finished the match two overs earlier.\""}, {"ball": 19.3, "isHighlight": false, "text": "\"Incredible performance, nine games on the trot, true champions,\" says  $$Wasim$$ $$Akram$$  \"They enjoy each other's company and success.\""}, {"ball": 19.3, "isHighlight": false, "text": "$$Manish$$ $$Pandey$$  gives his home crowd a big wave, stump in one hand."}, {"ball": 19.3, "isHighlight": false, "text": "\"Wriddhiman Saha played a blinder of an innings and we needed someone to match that,\" says  $$ten$$ $$Doeschate$$ , when asked about Pandey's innings. \"It's just been a great final.\""}], "name": "Kolkata Knight Riders v Kings XI Punjab", "innings": "Kolkata Knight Riders  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/734049.html?innings=2;view=commentary", "match_num": 60}