{"commentary": [{"ball": 0, "isHighlight": false, "text": "Nayar and Rahane to open for Rajasthan. Punjab will open with left-arm spin"}, {"ball": 0, "isHighlight": false, "text": "$$Toss:$$ $$Punjab$$ $$win$$ $$the$$ $$toss$$ $$and$$ $$will$$ $$bowl$$"}, {"ball": 0, "isHighlight": false, "text": "One change for Punjab. Murali Kartik is in for Rishi Dhawan. One for Rajasthan as well. Brad Hodge is sick, says Watson, and Steve Smith comes in."}, {"ball": 0, "isHighlight": false, "text": "Bare wicket compared to the grassy one in Abu Dhabi, and Watson says the players will have to adjust to that. Bailey says it is difficult to know what will be a good score on different surfaces"}, {"ball": 0, "isHighlight": false, "text": "$$5.50pm$$ $$local$$ $$time$$  Game seven upon us tonight, with Rajasthan taking on Punjab. Toss in ten minutes"}, {"ball": 0, "isHighlight": false, "text": "-------- Are Chris Gayle and Kevin Pietersen in your  $$Cricinfo$$ $$Fantasy$$ $$XI$$ ? Both of them have missed a couple of games with injury, so you might want to substitute them out for a bit."}, {"ball": 0, "isHighlight": false, "text": "If Fantasy isn't your cup of tea, but you believe you have all the answers on cricket... well, we have all the questions.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  is here."}, {"ball": 0.1, "isHighlight": false, "text": "Patel to Nayar,no run,gentle length ball on the pad, nudged away"}, {"ball": 0.2, "isHighlight": false, "text": "Patel to Nayar,no run,tossed up a bit around middle, he plays for some turn, there isn't any, and a leading edge rolls to the off side"}, {"ball": 0.3, "isHighlight": false, "text": "Patel to Nayar,1 run,goes back now to punch this length ball in front of square on the leg side"}, {"ball": 0.4, "isHighlight": false, "text": "Patel to Rahane,no run,flights it just outside off, Rahane comes forward, it comes in a tad, and runs off an inside edge to leg"}, {"ball": 0.5, "isHighlight": false, "text": "Patel to Rahane, $$FOUR$$ ,tosses it up much wider now, Rahane steps out, stretches a bit, and lifts it flat over extra cover"}, {"ball": 0.6, "isHighlight": false, "text": "Patel to Rahane,1 run,flatter and quicker one knocked down the ground for a single to long off"}, {"ball": 0.6, "isHighlight": false, "text": "Mitchell Johnson to run in"}, {"ball": 0.6, "isHighlight": false, "text": "Sushil: \"KXIP set to make joke of another chase I guess\""}, {"ball": 1.1, "isHighlight": false, "text": "Johnson to Rahane,no run,starts with a good length ball on middle and leg, Rahane carefully nudges it square"}, {"ball": 1.2, "isHighlight": false, "text": "Johnson to Rahane, $$FOUR$$ ,tries a short ball, and even as it climbs onto Rahane, he swivels to pull it in the air to the deep backward square leg boundary"}, {"ball": 1.3, "isHighlight": false, "text": "Johnson to Rahane,3 runs,now he leans into a length ball going across him, hasn't timed it that well, and it slows down as it approaches the deep extra cover boundary, and is pulled back"}, {"ball": 1.4, "isHighlight": false, "text": "Johnson to Nayar,no run,moves across to off stump, pushes forward and defends this length delivery to covers"}, {"ball": 1.5, "isHighlight": false, "text": "Johnson to Nayar,no run,143.7 kph from back of a length, Nayar is walking across again, and has little room to do anything but guide it to point, not getting the run"}, {"ball": 1.6, "isHighlight": false, "text": "Johnson to Nayar,no run,moves to off stump and pushes another tight delivery to covers"}, {"ball": 1.6, "isHighlight": false, "text": "Siddartha Khand: \"Err, whose that guy who looks like a certain Mitchell Johnson, only he's being carted around all around the park in the last two matches?\""}, {"ball": 1.6, "isHighlight": false, "text": "Here's Awana"}, {"ball": 2.1, "isHighlight": false, "text": "Awana to Rahane,no run,tries to force this good length ball from just outside off, but turns it straight to mid on"}, {"ball": 2.2, "isHighlight": false, "text": "Awana to Rahane,1 run,waits on this length ball now, it holds its line outside off, and he guides it to third man"}, {"ball": 2.3, "isHighlight": false, "text": "Awana to Nayar,2 runs,Nayar gets one away finally, shuffles across and swings hard through square leg, it is cut off by the deep fielder running from fine leg"}, {"ball": 2.4, "isHighlight": false, "text": "Awana to Nayar, $$SIX$$ ,Nayar tees off now, picks this from a length and sends it soaring over the long on boundary"}, {"ball": 2.5, "isHighlight": false, "text": "Awana to Nayar,no run,mistimes a forcing stroke in front of square on the leg side"}, {"ball": 2.6, "isHighlight": false, "text": "Awana to Nayar, $$OUT$$ ,Rahane's gone, there was no single here, he had rushed too far up the pitch, Nayar whipped this to Bailey's left at mid on, took a couple of steps out and stopped, the captain is quick to the ball and scores a direct hit, Rahane had already given up trying to regain his ground, he had no chance"}, {"ball": 2.6, "isHighlight": false, "text": "$$AM$$ $$Rahane$$ $$run$$ $$out$$ $$13$$ $$(13m$$ $$8b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$162.50$$"}, {"ball": 3.1, "isHighlight": false, "text": "Balaji to Samson,no run,defends a good length ball on off"}, {"ball": 3.2, "isHighlight": false, "text": "Balaji to Samson,no run,beats him with a similar delivery outside off"}, {"ball": 3.3, "isHighlight": false, "text": "Balaji to Samson, $$FOUR$$ ,shot, he's leaned into this drive, timed it on the up, and placed it past short extra cover's dive"}, {"ball": 3.4, "isHighlight": false, "text": "Balaji to Samson,no run,comes in with the angle and is pushed down the track"}, {"ball": 3.5, "isHighlight": false, "text": "Balaji to Samson,no run,jumps out of the crease now, bowler shortens the length, and Samson knocks it back"}, {"ball": 3.6, "isHighlight": false, "text": "Balaji to Samson, $$SIX$$ ,hello, this has been picked up from just back of a length and dispatched with disdain over the deep midwicket boundary"}, {"ball": 4.1, "isHighlight": false, "text": "Awana to Nayar,1 wide,tries to pull this short of a length ball but misses as it carries down leg"}, {"ball": 4.1, "isHighlight": false, "text": "Awana to Nayar,2 runs,Nayar tries to deposit Awana over deep midwicket, but he gets too much underneath this length ball and it sails high before plonking down well inside the rope"}, {"ball": 4.2, "isHighlight": false, "text": "Awana to Nayar,1 run,angled across him now, and he flashes it past point's dive, third man runs across"}, {"ball": 4.3, "isHighlight": false, "text": "Awana to Samson,no run,calmly moves forward and pushes a good length ball to extra cover"}, {"ball": 4.4, "isHighlight": false, "text": "Awana to Samson, $$FOUR$$ ,some hitting from Samson, this is not short at all, but he's picked it up so cleanly, it flies to the deep midwicket rope"}, {"ball": 4.5, "isHighlight": false, "text": "Awana to Samson,1 run,a slower one into the pads now, it pops up in the air as he nudges it, but falls in the gap at square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Awana to Nayar,no run,Nayar cannot find the timing Samson has, he tries to pull this too hard, but mishits it, couple of bounces to mid on"}, {"ball": 5.1, "isHighlight": false, "text": "Johnson to Samson,1 run,flicks a full delivery in the air off the pads, mid on runs it down to his right"}, {"ball": 5.2, "isHighlight": false, "text": "Johnson to Nayar,2 runs,Nayar mishits another slog, but will get two more as it is wide of deep midwicket"}, {"ball": 5.3, "isHighlight": false, "text": "Johnson to Nayar,no run,holds its line and bounces outside off, Nayar tries to run it to third man but is beaten"}, {"ball": 5.3, "isHighlight": false, "text": "Captaincy: \"Watson showing his good captaincy there, sending Samson one down, giving young player a chance like Warne and Dravid used to do.\""}, {"ball": 5.4, "isHighlight": false, "text": "Johnson to Nayar,(no ball)  $$FOUR$$ ,hammered down the ground, umpire Bowden stretches his right hand to signal no-ball and at the same time, also gets out of the way as Nayer cracks this pitched up ball straight back"}, {"ball": 5.4, "isHighlight": false, "text": "Johnson to Nayar, $$FOUR$$ ,makes good use of the free hit, goes back in the crease and slogs hard over midwicket"}, {"ball": 5.5, "isHighlight": false, "text": "Johnson to Nayar,no run,beaten again, 138.4 kph back of a length and moving away outside off, Nayar follows it in vain"}, {"ball": 5.6, "isHighlight": false, "text": "Johnson to Nayar,1 run,goes across, Johnson pitches it up on off, and Nayar keeps strike, easing it to long on"}, {"ball": 6.1, "isHighlight": false, "text": "Kartik to Nayar, $$OUT$$ ,Kartik strikes first ball, umpire Erasmus thinks awhile before raising his finger, Nayar struck in front missing a sweep to one that does not turn, but that has pitched just outside leg"}, {"ball": 6.1, "isHighlight": false, "text": "$$AM$$ $$Nayar$$ $$lbw$$ $$b$$ $$Kartik$$ $$23$$ $$(31m$$ $$20b$$ $$2x4$$ $$1x6)$$ $$SR:$$ $$115.00$$"}, {"ball": 6.1, "isHighlight": false, "text": "harkmug: \"Not sure about this *bold* captaincy by Watson. As the best batsman in that lineup, one would expect him to open or come in one-down. What is he waiting for? He isn't even bowling these days.\""}, {"ball": 6.1, "isHighlight": false, "text": "He is in now"}, {"ball": 6.2, "isHighlight": false, "text": "Kartik to Watson,1 run,flighted full and angled into the pad, turned to deep midwicket"}, {"ball": 6.3, "isHighlight": false, "text": "Kartik to Samson,no run,full on leg again, Samson clips it straight to midwicket"}, {"ball": 6.4, "isHighlight": false, "text": "Kartik to Samson,no run,flighted once more, and does not turn, nudged to midwicket"}, {"ball": 6.5, "isHighlight": false, "text": "Kartik to Samson, $$SIX$$ ,this one will go, he tosses it up just outside off this time, Samson makes some room outside leg, and lofts, very cleanly once more, over extra cover"}, {"ball": 6.6, "isHighlight": false, "text": "Kartik to Samson,1 run,goes on the pads again, is nudged square on the leg side"}, {"ball": 7.1, "isHighlight": false, "text": "Patel to Samson,1 run,moves forward and drives a full one to long off"}, {"ball": 7.1, "isHighlight": false, "text": "Ram: \"The confidence of these young Indian batsmen when they play for Rajasthan Royals is remarkable. For Eg. Yusuf Pathan, when he used to play for RR, was a match winner with both bat and ball. After he left RR, his confidence and performance dropped to base. Same applies to Rahane,Trivedi and even Jadeja. Their Coach and Team management should be remarkable\""}, {"ball": 7.2, "isHighlight": false, "text": "Patel to Watson,no run,appeal for leg-before as he pushes forward, but this was doing too much with the angle"}, {"ball": 7.3, "isHighlight": false, "text": "Patel to Watson,no run,goes back to punch it to the bowler"}, {"ball": 7.4, "isHighlight": false, "text": "Patel to Watson, $$FOUR$$ ,again he goes back, has some width this time, and cuts hard to the third man rope with the man up in the ring"}, {"ball": 7.5, "isHighlight": false, "text": "Patel to Watson,no run,a touch fuller and square driven to backward point"}, {"ball": 7.6, "isHighlight": false, "text": "Patel to Watson,no run,pitched up and angled into middle and leg, defended"}, {"ball": 8.1, "isHighlight": false, "text": "Kartik to Samson,1 run,shortish, punched off the back foot to long off"}, {"ball": 8.2, "isHighlight": false, "text": "Kartik to Watson,2 runs,has a go at this full delivery but mishits it through midwicket, will pick up two"}, {"ball": 8.3, "isHighlight": false, "text": "Kartik to Watson,no run,looks to step out, Kartik shortens it, and Watson defends it square on off"}, {"ball": 8.4, "isHighlight": false, "text": "Kartik to Watson,no run,overpitched outside off now, and Watson has slammed it straight to extra cover"}, {"ball": 8.5, "isHighlight": false, "text": "Kartik to Watson,1 run,drags the length back just a bit, Watson punches it from the crease to extra cover"}, {"ball": 8.6, "isHighlight": false, "text": "Kartik to Samson, $$SIX$$ ,Samson continues to hit cleanly, this is overpitched on the stumps, and he's gone dead straight over the bowler, and over the rope"}, {"ball": 9.1, "isHighlight": false, "text": "Patel to Watson, $$FOUR$$ ,Watson tries to mow his big slog sweep, manages only an inside edge that somehow eludes his stumps"}, {"ball": 9.2, "isHighlight": false, "text": "Patel to Watson,no run,smacks a pull to midwicket now"}, {"ball": 9.3, "isHighlight": false, "text": "Patel to Watson,no run,goes hard again, but now he finds the bowler"}, {"ball": 9.4, "isHighlight": false, "text": "Patel to Watson, $$FOUR$$ ,Watson is determined to go after everything, he carts this full delivery to Miller who makes ground to his right at long on but  $$drops$$  it, and it runs behind him into the boundary"}, {"ball": 9.5, "isHighlight": false, "text": "Patel to Watson,no run"}, {"ball": 9.6, "isHighlight": false, "text": "Patel to Watson,no run,quick, full and angled into off, defended carefully"}, {"ball": 9.6, "isHighlight": false, "text": "Manu: \"Watson should open with Rahane. Nayar is a more than useful batsman but not quite opening material. He should be used in the traditional all-rounder's position. You can't have a classical batsman and a fringe player open, you need one attacking option upfront. \""}, {"ball": 10.1, "isHighlight": false, "text": "Balaji to Samson,1 run,almost a run out, a slower length ball is turned through midwicket, Samson wants the second, but Maxwell releases the ball quickly even as he falls to the ground, Samson dives back, direct hit could have meant trouble"}, {"ball": 10.2, "isHighlight": false, "text": "Balaji to Watson,1 run,very full and angled in from wide of the crease, driven to long on"}, {"ball": 10.3, "isHighlight": false, "text": "Balaji to Samson,1 run,slow, short and very wide, he wants to attack it but is done in by the lack of pace"}, {"ball": 10.4, "isHighlight": false, "text": "Balaji to Watson, $$FOUR$$ ,Watson lofts this pitched up ball over extra cover now, stretches forward and powers it away"}, {"ball": 10.5, "isHighlight": false, "text": "Balaji to Watson, $$SIX$$ ,overpitched straighter now, and Watson cracks it over the bowler"}, {"ball": 10.6, "isHighlight": false, "text": "Balaji to Watson,no run,slower outside off, flashed to backward point"}, {"ball": 11.1, "isHighlight": false, "text": "Kartik to Samson, $$FOUR$$ ,Samson picks the gap at deep midwicket, this is full and angled in, and he clears front leg to swing it away"}, {"ball": 11.2, "isHighlight": false, "text": "Kartik to Samson,1 run"}, {"ball": 11.3, "isHighlight": false, "text": "Kartik to Watson,2 runs,full outside off now, Watson smears it over extra cover, work for the sweeper, he nearly overruns it, but manages to save the boundary"}, {"ball": 11.4, "isHighlight": false, "text": "Kartik to Watson, $$FOUR$$ ,Watson uses his reach, reaches the pitch of this one outside off and swats it straight down the ground"}, {"ball": 11.5, "isHighlight": false, "text": "Kartik to Watson, $$SIX$$ ,one more, this is overpitched on middle and leg, Watson clears front leg and smacks it high and straight"}, {"ball": 11.5, "isHighlight": false, "text": "over the stumps now"}, {"ball": 11.6, "isHighlight": false, "text": "Kartik to Watson,1 wide,full and wide down leg"}, {"ball": 11.6, "isHighlight": false, "text": "Kartik to Watson,3 runs,Watson tries a huge slog sweep to one bowled outside leg, outside edge flies to short third man's left, he messes up the stop"}, {"ball": 11.6, "isHighlight": false, "text": "Ekamra: \"KXIP has become the new RCB. Their bowlers are leaking runs in every possible way and their batsmen have the ability to chase any score\""}, {"ball": 12.1, "isHighlight": false, "text": "Awana to Watson,1 run,full on off and middle, drilled down to long on"}, {"ball": 12.2, "isHighlight": false, "text": "Awana to Samson,no run,slower length ball on off, knocked back down the track"}, {"ball": 12.3, "isHighlight": false, "text": "Awana to Samson,1 run,follows him as he makes room outside leg, Samson lofts the length ball, couple of bounces to long off"}, {"ball": 12.4, "isHighlight": false, "text": "Awana to Watson,no run,cracks this overpitched ball for extra cover"}, {"ball": 12.5, "isHighlight": false, "text": "Awana to Watson, $$SIX$$ ,a full toss angled in, Watson wallops it high over deep midwicket"}, {"ball": 12.6, "isHighlight": false, "text": "Awana to Watson,1 run,another full toss, Watson goes after it, but this time it travels flat and on the bounce to deep midwicket, will take him to 50 off 28"}, {"ball": 12.6, "isHighlight": false, "text": "Shakib: \"KXIP have chased it in one game and it's like people are expecting their line-up to be able to do it every single time. Sure, great batting line-up to chase 200 quite regularly but this is only the 2nd game.\""}, {"ball": 13.1, "isHighlight": false, "text": "Patel to Watson, $$OUT$$ ,gone now, goes down for another slog sweep, misses, and Patel hits middle with a full delivery angled in"}, {"ball": 13.1, "isHighlight": false, "text": "$$SR$$ $$Watson$$ $$b$$ $$Patel$$ $$50$$ $$(30m$$ $$29b$$ $$5x4$$ $$3x6)$$ $$SR:$$ $$172.41$$"}, {"ball": 13.2, "isHighlight": false, "text": "Patel to Binny,1 run,drives a full one to long off"}, {"ball": 13.3, "isHighlight": false, "text": "Patel to Samson,no run,flat, quick, on a length, pushed back"}, {"ball": 13.4, "isHighlight": false, "text": "Patel to Samson,no run,goes across to off, this is fuller, and he knocks it back again"}, {"ball": 13.5, "isHighlight": false, "text": "Patel to Samson,1 run,goes deep in the crease to punch to midwicket"}, {"ball": 13.6, "isHighlight": false, "text": "Patel to Binny,1 run,comes down the track, but Patel's quick and flat delivery is hard to get underneath, and he has to nudge it to leg"}, {"ball": 14.1, "isHighlight": false, "text": "Kartik to Binny,1 run,comes out, swings, manages a thick inside edge through midwicket"}, {"ball": 14.2, "isHighlight": false, "text": "Kartik to Samson,1 run,leaves the crease, pushes it through extra cover"}, {"ball": 14.3, "isHighlight": false, "text": "Kartik to Binny,2 runs,swept hard off middle, deep square leg will get to it with a run to his right"}, {"ball": 14.4, "isHighlight": false, "text": "Kartik to Binny, $$SIX$$ ,steps out now, is not to the pitch, but goes through with a mighty loft, and clears wide long off"}, {"ball": 14.5, "isHighlight": false, "text": "Kartik to Binny,1 run,goes back to force a length ball to long on"}, {"ball": 14.6, "isHighlight": false, "text": "Kartik to Samson,1 run, $$dropped$$ , he jumps out and slams it into Kartik, and it rolls away into the off side, shout of 'catch it', that was struck very hard, and slipped through the bowler's fingers"}, {"ball": 15.1, "isHighlight": false, "text": "Johnson to Samson,1 run,chips a full one over cover"}, {"ball": 15.2, "isHighlight": false, "text": "Johnson to Binny,no run,tries to make room and upper cut, but is beaten by the bounce on this back of a length ball"}, {"ball": 15.3, "isHighlight": false, "text": "Johnson to Binny, $$OUT$$ ,Miller's 'caught' one this time, but it has still not gone to hand, Binny mishits a slog, Miller runs forward at long on, it bursts through his wrists, but he has a second line of defence, the gap between his legs, it lodges between his thighs, he puts his hand underneath to prevent it from slipping out, but all credit to the legs there"}, {"ball": 15.3, "isHighlight": false, "text": "$$STR$$ $$Binny$$ $$c$$ $$Miller$$ $$b$$ $$Johnson$$ $$12$$ $$(11m$$ $$8b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$150.00$$"}, {"ball": 15.4, "isHighlight": false, "text": "Johnson to Samson,1 run"}, {"ball": 15.5, "isHighlight": false, "text": "Johnson to Smith,1 run,goes across to a 139.8 kph full one and turns it square on the leg side"}, {"ball": 15.6, "isHighlight": false, "text": "Johnson to Samson,no run,hits this full delivery straight to cover"}, {"ball": 16.1, "isHighlight": false, "text": "Awana to Smith, $$FOUR$$ ,full into the pad, Smith shuffles a bit, and manages to run it fine"}, {"ball": 16.2, "isHighlight": false, "text": "Awana to Smith,1 run,slower length ball on off, turned to deep midwicket"}, {"ball": 16.3, "isHighlight": false, "text": "Awana to Samson, $$SIX$$ ,Awana pings it back of a length outside off and Samson goes to fifty with a flat-batted straight six"}, {"ball": 16.4, "isHighlight": false, "text": "Awana to Samson,2 runs,swings hard again but toe-ends it to extra cover this time"}, {"ball": 16.5, "isHighlight": false, "text": "Awana to Samson, $$OUT$$ ,gone now, backs away to leg, Awana hits the blockhole, and the stumps, as Samson misses"}, {"ball": 16.5, "isHighlight": false, "text": "$$SV$$ $$Samson$$ $$b$$ $$Awana$$ $$52$$ $$(68m$$ $$34b$$ $$3x4$$ $$4x6)$$ $$SR:$$ $$152.94$$"}, {"ball": 16.6, "isHighlight": false, "text": "Awana to Faulkner,no run,a full delivery driven to mid off"}, {"ball": 17.1, "isHighlight": false, "text": "Balaji to Smith,2 runs,full and wide, hit through cover, Kartik and Miller converge on the ball, Miller picks it up, Kartik avoids dashing into him"}, {"ball": 17.2, "isHighlight": false, "text": "Balaji to Smith, $$FOUR$$ ,a full toss outside off is smashed back down the ground, and beats long on and long off"}, {"ball": 17.3, "isHighlight": false, "text": "Balaji to Smith, $$FOUR$$ ,a wide yorker now, but in vain, third man is up and Smith squeezes it wide of the fielder"}, {"ball": 17.4, "isHighlight": false, "text": "Balaji to Smith,no run,full and wide once more, but fortunately for Balaji, it is driven straight to backward point"}, {"ball": 17.5, "isHighlight": false, "text": "Balaji to Smith, $$FOUR$$ ,a low full toss around off now, Smith shuffles a bit and whips it past short fine leg"}, {"ball": 17.6, "isHighlight": false, "text": "Balaji to Smith,1 run,yet another full toss, outside off, to end the over, driven to the sweeper"}, {"ball": 18.1, "isHighlight": false, "text": "Johnson to Smith,1 bye,misses a slower length ball angled across him, but they scamper a bye as keeper cannot collect cleanly"}, {"ball": 18.2, "isHighlight": false, "text": "Johnson to Faulkner, $$SIX$$ ,mid off is up, this is pitched up, outside off, and Faulkner lifts it calmly over the fielder"}, {"ball": 18.3, "isHighlight": false, "text": "Johnson to Faulkner,1 bye,beaten by a slower one now as he swings in the air, but they earn another bye as it bounces before the keeper, who does not collect it again"}, {"ball": 18.4, "isHighlight": false, "text": "Johnson to Smith,1 leg bye,moves outside off and tries to lift it over leg, but misses, and it scoots behind square off the pad"}, {"ball": 18.5, "isHighlight": false, "text": "Johnson to Faulkner,no run,Johnson's hit Faulkner on the side of the helmet here, the bouncer's climbed onto the batsman, who was attempting a hook before recoiling as the missile headed for his head"}, {"ball": 18.6, "isHighlight": false, "text": "Johnson to Faulkner,no run,a widish slow bouncer to finish off, Faulker swings and misses"}, {"ball": 19.1, "isHighlight": false, "text": "Balaji to Smith,1 run,full and wide to start the last over, driven to the sweeper"}, {"ball": 19.2, "isHighlight": false, "text": "Balaji to Faulkner,1 run,attacks another full one outside off but can only hit it along the ground to long off"}, {"ball": 19.3, "isHighlight": false, "text": "Balaji to Smith,1 run,this is very wide outside off, he tries to turn it to the leg side, does that, but quite weakly"}, {"ball": 19.4, "isHighlight": false, "text": "Balaji to Faulkner,1 run,low and wide full toss dragged to deep midwicket"}, {"ball": 19.5, "isHighlight": false, "text": "Balaji to Smith, $$FOUR$$ ,Balaji staying wide outside off and Smith's going off this time, a full toss is lifted easily over extra cover"}, {"ball": 19.6, "isHighlight": false, "text": "Balaji to Smith,no run,a wide yorker to end with, Smith misses it"}, {"ball": 19.6, "isHighlight": false, "text": "Punjab have another big chase on their hands but the ground is small and the pitch is flat, although Nayar says the outfield is slow"}], "name": "Rajasthan Royals v Kings XI Punjab", "innings": "Rajasthan Royals  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729291.html?innings=1;view=commentary", "match_num": 7}