{"commentary": [{"ball": 0, "isHighlight": false, "text": "Duminy to bowl"}, {"ball": 0, "isHighlight": false, "text": "$$News$$ : MS Dhoni has said that Bravo could miss \"4 to 5 weeks\" of the IPL after a bad fall in the last game. \"Sad that he won't be part of the dressing room, hope he recovers soon.\""}, {"ball": 0, "isHighlight": false, "text": "That's a blow for Super Kings. Bravo has been an integral part of their side as an allrounder."}, {"ball": 0, "isHighlight": false, "text": "Five minutes from the start."}, {"ball": 0, "isHighlight": false, "text": "Sriram: \"Nice to see Dhoni ringing in changes. It doesnt normally happen early. Happy to see Faf back in team. Can be the Mr Consistent after Hussey left.\""}, {"ball": 0, "isHighlight": false, "text": "Prashanth: \"Baba Aparajith would have been a better choice than Mithun Manhas.\""}, {"ball": 0, "isHighlight": false, "text": "MrGarreth: \"Struggle to see why Delhi didn't make any changes. Will they wait until they lose to address their issues? Clearly they need an extra batter. Perhaps de Kock for Neesham? Neesham not doing much with the ball anyway...\""}, {"ball": 0, "isHighlight": false, "text": "$$Toss$$ : Dhoni has won the toss and Super Kings will  $$bat$$ $$first$$ . No Pietersen today as well so it's Karthik leading Daredevils again."}, {"ball": 0, "isHighlight": false, "text": "Dhoni announced three changes - Bravo (obviously), Ashish Nehra and Pawan Negi miss out. Hilfenhaus, Mithun Manhas and Ishwar Pandey come in. No Badree today, contrary to our expectations."}, {"ball": 0, "isHighlight": false, "text": "Delhi are  $$unchanged$$ ."}, {"ball": 0, "isHighlight": false, "text": "Gareth: \"Its not about holding Badree back. Because of their squad they really need an international who can bowl seam (bravo or hilfy) as they have Indian spinners. Badree was always an odd buy for CSK given their tactics. \""}, {"ball": 0, "isHighlight": false, "text": "K.SivaKumar: \"Dhoni is holding back Badree for later part. He don't want to expose him early to other teams. Also Badree will be more effective in India pitches compared to UAE :).\""}, {"ball": 0, "isHighlight": false, "text": "Kaushik: \"Its weird to see Delhi has more chennai born players than Csk\""}, {"ball": 0, "isHighlight": false, "text": "$$5.50pm$$ : Good day to you all and it is Chennai Super Kings and Delhi Daredevils today in Abu Dhabi. Both cities are miles away from Abu Dhabi so no home advantage."}, {"ball": 0, "isHighlight": false, "text": "The toss will be on in ten minutes. Will CSK play Badree? Will Pietersen be fit? We shall find out. Although, if you guys had a chance to see KP's picture of his injured finger on Twitter, it didn't look encouraging.  $$Here$$ $$it$$ $$is$$ ."}, {"ball": 0, "isHighlight": false, "text": "Are Chris Gayle and Kevin Pietersen in your  $$Cricinfo$$ $$Fantasy$$ $$XI$$ ? Both of them have missed a couple of games with injury, so you might want to substitute them out for a bit."}, {"ball": 0, "isHighlight": false, "text": "If Fantasy isn't your cup of tea, but you believe you have all the answers on cricket... well, we have all the questions.  $$CricIQ$$ $$-$$ $$The$$ $$Greatest$$ $$Test$$ $$Ever$$  is here."}, {"ball": 0.1, "isHighlight": false, "text": "Duminy to Smith,1 wide,starts off with a wide down the leg side, Smith was looking to pull that"}, {"ball": 0.1, "isHighlight": false, "text": "Duminy to Smith,1 run,drifts down the leg side again and he pulls and finds fine leg"}, {"ball": 0.2, "isHighlight": false, "text": "Duminy to McCullum,1 run,tossed up and full, he comes forward and clips it to square leg"}, {"ball": 0.2, "isHighlight": false, "text": "Nathan Coulter-Nile. who did the fielding has hobbled off the field.Must have pulled something on the dive. DD a fast bowler short already?"}, {"ball": 0.3, "isHighlight": false, "text": "Duminy to Smith,1 run,he goes back and works it to mid-on"}, {"ball": 0.4, "isHighlight": false, "text": "Duminy to McCullum,no run,this time McCullum gives the charge but he can only force it to mid-off"}, {"ball": 0.5, "isHighlight": false, "text": "Duminy to McCullum,no run,he rocks back and cuts but can't beat extra cover"}, {"ball": 0.6, "isHighlight": false, "text": "Duminy to McCullum,no run,tossed up and he pushes it back to the bowler"}, {"ball": 0.6, "isHighlight": false, "text": "Arsalan: \"Poor team selection from both sides. Badree's inclusion should have been a no-brainer for CSK. And Neesham's performance in the last 2 matches should've been enough for him to make way for Parnell. Players like K Jadhav S Tiwary and R Sharma also deserve a chance instead of Agarwal M Tiwary and S Nadeem.\""}, {"ball": 1.1, "isHighlight": false, "text": "Mohammed Shami to Smith, $$FOUR$$ ,this was the right length for Smith to pull, length ball a touch wide outside off, Smith fetches that and pulls along the ground wide of midwicket"}, {"ball": 1.2, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,decent shout for an lbw? Straightens and hits him on the top flap as he stays on the back foot, looked close though, appeal turned down, the commentators reckoned that was hitting the stumps"}, {"ball": 1.3, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,this one moves away and he pokes at it, nearly edges it"}, {"ball": 1.4, "isHighlight": false, "text": "Mohammed Shami to Smith,2 runs,fuller and towards the stumps and he whips it away wide of square leg"}, {"ball": 1.5, "isHighlight": false, "text": "Mohammed Shami to Smith, $$FOUR$$ ,sped away quickly, this was too full and wide outside off, Smith gets across and smashes it along the turf wide of cover"}, {"ball": 1.6, "isHighlight": false, "text": "Mohammed Shami to Smith,no run,full and straying on the pads, clips the pads as he looks to flick it away"}, {"ball": 1.6, "isHighlight": false, "text": "hkumar: \"People who're commenting against DD retaining their team need to understand that you need to persist with a team for some time so that it actually acts like a team. Constant cutting and trimming will not help that effort.\""}, {"ball": 2.1, "isHighlight": false, "text": "Nadeem to McCullum,1 run,arm ball, this was drifting in from Nadeem and he looked to drive wide of cover but got an inside edge, close call"}, {"ball": 2.2, "isHighlight": false, "text": "Nadeem to Smith,1 run,once again looks to force it away and he mistimes it to mid-on"}, {"ball": 2.3, "isHighlight": false, "text": "Nadeem to McCullum,2 runs,this was drifting on the pads, he clips it away wide of short fine leg, McCullum slips as he completes the first run"}, {"ball": 2.4, "isHighlight": false, "text": "Nadeem to McCullum, $$FOUR$$ ,tossed up, invites McCullum to use his feet, comes down the pitch and lofts him over mid-off"}, {"ball": 2.5, "isHighlight": false, "text": "Nadeem to McCullum,1 run,he rocks back and slaps it wide of cover but extra cover picks up"}, {"ball": 2.6, "isHighlight": false, "text": "Nadeem to Smith,no run,squared up for turn, he tamely pushes it to the off side"}, {"ball": 3.1, "isHighlight": false, "text": "Unadkat to McCullum,no run,JP Duminy  $$drops$$  a sitter! The dropped catches epidemic spreads, Length ball and McCullum chips it ever so tamely to short cover, Duminy had it covered, don't ask me how that slipped out"}, {"ball": 3.2, "isHighlight": false, "text": "Unadkat to McCullum, $$OUT$$ ,okay forget about the drop! Daredevils make amends for it, McCullum dances down the track to Unadkat and looks to smash it over the on side, ends up getting an outside edge that loops wide of slip and goes to the substitute Parnell at short third man"}, {"ball": 3.2, "isHighlight": false, "text": "$$BB$$ $$McCullum$$ $$c$$ $$sub$$ $$(WD$$ $$Parnell)$$ $$b$$ $$Unadkat$$ $$9$$ $$(15m$$ $$10b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$90.00$$"}, {"ball": 3.3, "isHighlight": false, "text": "Unadkat to Raina,no run,he gets forward and steers it to point"}, {"ball": 3.4, "isHighlight": false, "text": "Unadkat to Raina,1 run,keeps him on the back foot this time as he pushes it to third man"}, {"ball": 3.5, "isHighlight": false, "text": "Unadkat to Smith,1 run,this was full outside the off stump and he drills it down the ground to long-on"}, {"ball": 3.6, "isHighlight": false, "text": "Unadkat to Raina,no run,he makes a bit of room and he punches it square on the off side"}, {"ball": 3.6, "isHighlight": false, "text": "karandeep nagpa: \"Dropped catch din't cost much to DD but to me it did. Duminy was the captain of my fantasy team. :( #Disappointed\""}, {"ball": 4.1, "isHighlight": false, "text": "Mohammed Shami to Smith,1 run,swinging in on the middle stump and he knocks it towards mid-on"}, {"ball": 4.2, "isHighlight": false, "text": "Mohammed Shami to Raina,no run,he fires that full outside the off stump and he looks to jam it out but misses"}, {"ball": 4.3, "isHighlight": false, "text": "Mohammed Shami to Raina,1 run,didn't play that one very well, it was full and he manages to get his bat down and gets an outside edge to third man"}, {"ball": 4.4, "isHighlight": false, "text": "Mohammed Shami to Smith,1 run,this was a length ball on the off stump and he mistimes the pull, seen a few of those"}, {"ball": 4.5, "isHighlight": false, "text": "Mohammed Shami to Raina,2 runs,this was shorter and he swivels to pull but doesn't force it away, places it wide of square leg"}, {"ball": 4.6, "isHighlight": false, "text": "Mohammed Shami to Raina,no run,Shami squares him up with beautiful away swing, this moves away late and Raina was chasing it"}, {"ball": 5.1, "isHighlight": false, "text": "Unadkat to Smith,no run,keeps it nice and straight, goes back and defends"}, {"ball": 5.2, "isHighlight": false, "text": "Unadkat to Smith,no run,doesn't give him much room as he steers it to point"}, {"ball": 5.2, "isHighlight": false, "text": "Coulter-Nile will be kept off the field indefinitely"}, {"ball": 5.3, "isHighlight": false, "text": "Unadkat to Smith,1 leg bye,confusion in the running, slower ball and Smith was too early on the pull, deflects off the body and rolls past the keeper, Parnell takes aim at the bowler's end and had it been a direct hit Smith would have been out"}, {"ball": 5.4, "isHighlight": false, "text": "Unadkat to Raina,1 run,makes room and steers it wide of point"}, {"ball": 5.5, "isHighlight": false, "text": "Unadkat to Smith,1 run,good slower all from round the wicket, he can only defend it to the on side, takes a run"}, {"ball": 5.6, "isHighlight": false, "text": "Unadkat to Raina,1 run,slower ball on the pads and he works it to square leg"}, {"ball": 5.6, "isHighlight": false, "text": "Manu: \"It's nice to see that Chennai are back to the sedate start mode :) That should help them stop losing games, huge totals put the CSK bowlers and fielders under pressure to fight off complacency.\""}, {"ball": 5.6, "isHighlight": false, "text": "Neesham to bowl"}, {"ball": 6.1, "isHighlight": false, "text": "Neesham to Raina,no run,starts off with a full toss and Raina misses out, can only mistime it to short midwicket"}, {"ball": 6.2, "isHighlight": false, "text": "Neesham to Raina, $$FOUR$$ ,this was pitched up wide outside off, in Raina's hitting zone, lofts through the line and clears cover, long-on cannot cut it off"}, {"ball": 6.3, "isHighlight": false, "text": "Neesham to Raina,1 run,angles it across and he slices it wide of backward point"}, {"ball": 6.4, "isHighlight": false, "text": "Neesham to Smith,1 run,gives him width and he deliberately angles it down to third man, Unadkat does really well to keep it to a single"}, {"ball": 6.5, "isHighlight": false, "text": "Neesham to Raina,1 run,shorter this time from Neesham and Raina angles this to third man"}, {"ball": 6.5, "isHighlight": false, "text": "Sunjay: \"very nice seeing shami almost getting 150 k's! so far he's been keeping fit. India might have finally a good quickie, what with his seam position and reverse swing.\""}, {"ball": 6.6, "isHighlight": false, "text": "Neesham to Smith,2 runs,on the pads and he works it wide of midwicket"}, {"ball": 6.6, "isHighlight": false, "text": "For those who've just joined us, Coulter-Nile went off the field in the first over after sliding to stop the ball. Must have pulled a hamstring"}, {"ball": 7.1, "isHighlight": false, "text": "Duminy to Raina,1 run,he rocks back and knocks it towards cover"}, {"ball": 7.2, "isHighlight": false, "text": "Duminy to Smith,no run,missed out, this was short and Smith could only smack this back to Duminy"}, {"ball": 7.3, "isHighlight": false, "text": "Duminy to Smith,1 run,this was short and wide outside off, he makes room and cuts wide of point"}, {"ball": 7.4, "isHighlight": false, "text": "Duminy to Raina,no run,flatter one and Raina is happy to defend"}, {"ball": 7.5, "isHighlight": false, "text": "Duminy to Raina,no run,makes a hint of room and Duminy follows him by drifting on the pads, he can only drive back to the bowler"}, {"ball": 7.6, "isHighlight": false, "text": "Duminy to Raina,1 run,tossed up and he comes forward and drives to long-off"}, {"ball": 7.6, "isHighlight": false, "text": "The strategic time out"}, {"ball": 7.6, "isHighlight": false, "text": "G Rajaraman tweets: \"Don't understand @DelhiDaredevils reluctance to play Quinton de Kock ahead of Jimmy Neesham. But I guess Guru @Gary_Kirsten knows! #CSKvsDD\""}, {"ball": 8.1, "isHighlight": false, "text": "Neesham to Raina,1 run,Raina makes room to a fuller ball and drives but can't beat mid-off"}, {"ball": 8.2, "isHighlight": false, "text": "Neesham to Smith, $$FOUR$$ ,that was flat, this was dropped fractionally short, Smith read the length early and pulled him flat over square leg, one bounce and over"}, {"ball": 8.3, "isHighlight": false, "text": "Neesham to Smith,1 leg bye,drifts on the pads and he looks to work it away, drops to the off side"}, {"ball": 8.4, "isHighlight": false, "text": "Neesham to Raina,1 wide,this was drifting down the leg side, too short and he looked to pull"}, {"ball": 8.4, "isHighlight": false, "text": "Neesham to Raina,1 run,this was driven to the front of mid-off and Raina really had to hurry, the throw was wide"}, {"ball": 8.5, "isHighlight": false, "text": "Neesham to Smith,1 run,worked away wide of square leg"}, {"ball": 8.6, "isHighlight": false, "text": "Neesham to Raina,no run,Raina makes a bit of room and looks to smash that over the off side and he's beaten"}, {"ball": 9.1, "isHighlight": false, "text": "Duminy to Smith,1 run,this was flatter and shorter, he makes room and cuts him down to sweeper cover"}, {"ball": 9.2, "isHighlight": false, "text": "Duminy to Raina,1 run,this was drifting on middle and leg and he sweeps him firmly to deep square leg"}, {"ball": 9.3, "isHighlight": false, "text": "Duminy to Smith,1 run,comes forward and he knocks it to the on side"}, {"ball": 9.4, "isHighlight": false, "text": "Duminy to Raina,2 runs,he comes down the track and lofts over extra cover"}, {"ball": 9.5, "isHighlight": false, "text": "Duminy to Raina,1 run,he comes down the track again and he chips this just over the bowler's head, but there was a short run"}, {"ball": 9.6, "isHighlight": false, "text": "Duminy to Raina, $$FOUR$$ ,picks the vacant area, this was drifting on the pads, Raina shuffled across early and neatly chipped it over short fine leg"}, {"ball": 9.6, "isHighlight": false, "text": "Umesh: \"Mithun Manhas is Pujara of Chennai. Good technique is not required in T20 Cricket, but big hitting is must. I cant see Mithun batting before Ashwin in this line up. \""}, {"ball": 10.1, "isHighlight": false, "text": "Nadeem to Smith,1 run,he goes back and punches this to the off side"}, {"ball": 10.2, "isHighlight": false, "text": "Nadeem to Raina, $$SIX$$ ,that was clean! Tossed up by Nadeem and Raina went down the track and took it downtown, the ball clears the straight boundary"}, {"ball": 10.3, "isHighlight": false, "text": "Nadeem to Raina,2 runs,tossed up on the pads and Raina gets on his knee early and slogs him behind square, deep square leg picks up"}, {"ball": 10.4, "isHighlight": false, "text": "Nadeem to Raina,2 runs,flatter one and he drills it down to long-on"}, {"ball": 10.5, "isHighlight": false, "text": "Nadeem to Raina,1 run,skids through and he shuffles and clips it wide of square leg"}, {"ball": 10.6, "isHighlight": false, "text": "Nadeem to Smith, $$OUT$$ ,the arm ball gets him! From round the wicket, this one came back in with the arm. skidded through and hit the stumps, Smith was rooted to the crease, left a big gap"}, {"ball": 10.6, "isHighlight": false, "text": "$$DR$$ $$Smith$$ $$b$$ $$Nadeem$$ $$29$$ $$(51m$$ $$28b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$103.57$$"}, {"ball": 11.1, "isHighlight": false, "text": "Vijay to Raina, $$FOUR$$ ,Raina welcomes Vijay with a spanking cut wide of cover, dropped a bit too short"}, {"ball": 11.2, "isHighlight": false, "text": "Vijay to Raina, $$FOUR$$ ,back to back fours, this was tossed up outside off and he reaches out and drives wide of point and down to third man"}, {"ball": 11.3, "isHighlight": false, "text": "Vijay to Raina,no run,a bit too short and he finds cover"}, {"ball": 11.4, "isHighlight": false, "text": "Vijay to Raina, $$FOUR$$ ,poor over this, Vijay strays down leg, fine leg leg was up, Raina sweeps fine and it's an easy boundary"}, {"ball": 11.5, "isHighlight": false, "text": "Vijay to Raina,1 run,takes a single down to long-on"}, {"ball": 11.6, "isHighlight": false, "text": "Vijay to du Plessis,no run,missed out, he drills it back to the bowler"}, {"ball": 12.1, "isHighlight": false, "text": "Neesham to Raina,1 run,slower ball and he deftly edges it to third man"}, {"ball": 12.2, "isHighlight": false, "text": "Neesham to du Plessis,no run,this one skidded through quickly and hit the back pad, looked like drifting down leg"}, {"ball": 12.3, "isHighlight": false, "text": "Neesham to du Plessis,no run,that's the line! Neesham bowls it on the corridor outside off and the ball shapes away late, fizzes past the edge"}, {"ball": 12.4, "isHighlight": false, "text": "Neesham to du Plessis,1 run,punches it to the off side and sets off, had to scamper because the throw to the bowler's end was wide"}, {"ball": 12.5, "isHighlight": false, "text": "Neesham to Raina,no run,drifting down the leg side and nearly clipped the trouser on the way through"}, {"ball": 12.6, "isHighlight": false, "text": "Neesham to Raina,2 runs,full outside the off stump and he squirts it wide of point and that's his fifty!"}, {"ball": 13.1, "isHighlight": false, "text": "Duminy to du Plessis,2 runs,he stays back and knocks it to the off side"}, {"ball": 13.2, "isHighlight": false, "text": "Duminy to du Plessis,1 run,he makes room and drives him wide of cover"}, {"ball": 13.3, "isHighlight": false, "text": "Duminy to Raina,1 run,he makes room and cuts him wide of cover"}, {"ball": 13.4, "isHighlight": false, "text": "Duminy to du Plessis,1 run,this was fuller and flatter, he fetches that from outside off and pulls in front of square"}, {"ball": 13.5, "isHighlight": false, "text": "Duminy to Raina,2 runs,fired full on the pads and he whips it to deep square leg and Unadkat dives and does well to save the boundary, he too looks to have hurt himself"}, {"ball": 13.5, "isHighlight": false, "text": "He's okay now"}, {"ball": 13.6, "isHighlight": false, "text": "Duminy to Raina,2 runs,down leg and swept fine and Unadkat has to do the chasing again"}, {"ball": 13.6, "isHighlight": false, "text": "It's the  $$time$$ $$out$$"}, {"ball": 13.6, "isHighlight": false, "text": "Varun: \"Struggling to understand the reason behind giving Vijay an over. Duminy was bowling well and would have completed his quota of 4 overs. And Neesham would have bowled better than that over of Vijay anytime. Not good captaincy there.\""}, {"ball": 14.1, "isHighlight": false, "text": "Neesham to du Plessis, $$FOUR$$ ,too good for the boundary rider! This was too full and wide outside off, Faf shuffled a long way to meet the ball, placed wide of cover and the sweeper couldn't stop it"}, {"ball": 14.2, "isHighlight": false, "text": "Neesham to du Plessis,1 run,slower ball and he mistimes it to cover"}, {"ball": 14.3, "isHighlight": false, "text": "Neesham to Raina,no run,this was jammed full outside off, looks to dig it out"}, {"ball": 14.4, "isHighlight": false, "text": "Neesham to Raina, $$OUT$$ ,Raina's caught by his former CSK team-mate, this was a length ball, Raina stayed at the crease and looked to clear long-on, didn't get the distance, Vijay takes the skier well in front of the rope"}, {"ball": 14.4, "isHighlight": false, "text": "$$SK$$ $$Raina$$ $$c$$ $$Vijay$$ $$b$$ $$Neesham$$ $$56$$ $$(52m$$ $$41b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$136.58$$"}, {"ball": 14.4, "isHighlight": false, "text": "Dhoni walks out"}, {"ball": 14.5, "isHighlight": false, "text": "Neesham to du Plessis,1 run,aimed for the yorker but it was a low full toss clipped away to midwicket"}, {"ball": 14.6, "isHighlight": false, "text": "Neesham to Dhoni,2 runs,stays beside the line and he steers it to third man, Nadeem slips, what's happening with the Daredevils fielders today?"}, {"ball": 15.1, "isHighlight": false, "text": "Nadeem to du Plessis,2 runs"}, {"ball": 15.2, "isHighlight": false, "text": "Nadeem to du Plessis,2 runs,he had to hurry there, cut wide of cover and Dhoni had to scamper the second, throw just wide of the bowler's stumps"}, {"ball": 15.3, "isHighlight": false, "text": "Nadeem to du Plessis,1 run,gets forward and drives wide of cover"}, {"ball": 15.4, "isHighlight": false, "text": "Nadeem to Dhoni,1 run,skidded through and clipped wide of square leg"}, {"ball": 15.5, "isHighlight": false, "text": "Nadeem to du Plessis,1 run,he goes for the slog and gets an inside edge that trickles past the stumps"}, {"ball": 15.6, "isHighlight": false, "text": "Nadeem to Dhoni,1 run,stays back and chops it wide of point"}, {"ball": 15.6, "isHighlight": false, "text": "Coulter-Nile is injured and off the field"}, {"ball": 16.1, "isHighlight": false, "text": "Unadkat to Dhoni,2 runs,good running, Dhoni stays back and clips it wide of midwicket and charges off aiming to take a couple, Unadkat does the chasing and the throw was wide at the batsman's end"}, {"ball": 16.2, "isHighlight": false, "text": "Unadkat to Dhoni,1 leg bye,tries to flick and he gets hit on the pads, not sure if there was an inside edge, could have missed leg, Illingworth not convinced"}, {"ball": 16.3, "isHighlight": false, "text": "Unadkat to du Plessis,1 run,full and wide outside off and driven wide of cover"}, {"ball": 16.4, "isHighlight": false, "text": "Unadkat to Dhoni,2 runs,punches it towards point and Tiwary needlessly fires the throw towards the stumps, it was wide and nobody backing up"}, {"ball": 16.5, "isHighlight": false, "text": "Unadkat to Dhoni, $$SIX$$ ,power, height and distance! That kept going and going....Dhoni down the track to a length ball and he slammed that into orbit over long-on, went several miles up in the air"}, {"ball": 16.6, "isHighlight": false, "text": "Unadkat to Dhoni, $$FOUR$$ ,this time he fires it full on the stumps, Dhoni drives firmly wide of extra cover, the field was up"}, {"ball": 17.1, "isHighlight": false, "text": "Mohammed Shami to du Plessis, $$SIX$$ ,clears the long boundary! This was short of a length and Faf was in position early for the pull, picked the length and clubbed it over deep midwicket"}, {"ball": 17.2, "isHighlight": false, "text": "Mohammed Shami to du Plessis, $$OUT$$ ,Vijay's catching the skiers tonight, this was a length ball and Faf made room to clear long-on, he closed the face of the bat as he made contact and hence didn't hit it well enough, Vijay under it at long-on"}, {"ball": 17.2, "isHighlight": false, "text": "$$F$$ $$du$$ $$Plessis$$ $$c$$ $$Vijay$$ $$b$$ $$Mohammed$$ $$Shami$$ $$24$$ $$(31m$$ $$17b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$141.17$$"}, {"ball": 17.2, "isHighlight": false, "text": "Sir Jadeja in"}, {"ball": 17.3, "isHighlight": false, "text": "Mohammed Shami to Dhoni, $$SIX$$ ,this is bad bowling, nobody patrolling the deep on the off side and he bowls it short and wide outside off, Dhoni airborne as he slaps it flat over deep point"}, {"ball": 17.4, "isHighlight": false, "text": "Mohammed Shami to Dhoni,no run,short ball and a slower one, he softly pulls it to short fine leg"}, {"ball": 17.5, "isHighlight": false, "text": "Mohammed Shami to Dhoni,2 runs,slower ball and he drills it down the track and wide of mid-on"}, {"ball": 17.6, "isHighlight": false, "text": "Mohammed Shami to Dhoni,1 run,another slower ball and shorter and he checks the pull to short fine leg"}, {"ball": 17.6, "isHighlight": false, "text": "Siva Kumar: \"That SIX from Dhoni is the best shot I've seen him play in a while. He's not getting to bat much these days in 20-20 matches. Great Shot..\""}, {"ball": 18.1, "isHighlight": false, "text": "Unadkat to Dhoni,1 run,keeper up to the stumps, slower ball and he looks to slog and he mistimes it to long-on"}, {"ball": 18.2, "isHighlight": false, "text": "Unadkat to Jadeja,1 run,fires this one full on the stumps and he flicks it to square leg"}, {"ball": 18.3, "isHighlight": false, "text": "Unadkat to Dhoni, $$FOUR$$ ,heads up Jaydev! That was smashed with such force and Unadkat did well to get his head out of the way, full ball and Dhoni made room and smashed that down the ground"}, {"ball": 18.4, "isHighlight": false, "text": "Unadkat to Dhoni, $$OUT$$ ,Agarwal nearly spilled that! Slower ball and short, Dhoni rocked back to pull and it was flat over square leg, Agarwal in the deep ran to his left and grabbed at it, it popped out and he tried taking it in the second attempt and it slipped out again but he managed in the third attempt"}, {"ball": 18.4, "isHighlight": false, "text": "$$MS$$ $$Dhoni$$ $$c$$ $$Agarwal$$ $$b$$ $$Unadkat$$ $$32$$ $$(21m$$ $$15b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$213.33$$"}, {"ball": 18.5, "isHighlight": false, "text": "Unadkat to Jadeja, $$SIX$$ ,this was pitched up outside off and he picked the length and slammed it over long-on"}, {"ball": 18.6, "isHighlight": false, "text": "Unadkat to Jadeja, $$OUT$$ ,Unadkat gets him with the slower ball, it was short and Jadeja swiveled and looked to pull it to fine leg, just shaved the face of the bat on the way to Karthik"}, {"ball": 18.6, "isHighlight": false, "text": "$$RA$$ $$Jadeja$$ $$c$$ $$†Karthik$$ $$b$$ $$Unadkat$$ $$7$$ $$(8m$$ $$3b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$233.33$$"}, {"ball": 19.1, "isHighlight": false, "text": "Mohammed Shami to Manhas, $$FOUR$$ ,falls inches short of the rope, this was too short and wide outside off, Manhas hops and upper cuts it down to third man, a little more power and it would have gone all the way"}, {"ball": 19.2, "isHighlight": false, "text": "Mohammed Shami to Manhas,1 wide,loses control of this and it's wide down the leg side"}, {"ball": 19.2, "isHighlight": false, "text": "Mohammed Shami to Manhas,3 runs,fuller ball and he makes room and places it wide of long-off, Duminy does really well to slide and cut it off"}, {"ball": 19.3, "isHighlight": false, "text": "Mohammed Shami to Ashwin,1 run,slower ball and Ashwin clears the front leg and slogs it wide of midwicket"}, {"ball": 19.3, "isHighlight": false, "text": "Suman Dustakar: \"By seeing Dhoni's shot to unadkat, i feel bowlers also should wear helmet..!!\""}, {"ball": 19.4, "isHighlight": false, "text": "Mohammed Shami to Manhas,2 runs,fuller ball and he drills it down the ground, Manhas did well to push for the second"}, {"ball": 19.5, "isHighlight": false, "text": "Mohammed Shami to Manhas, $$OUT$$ ,that was a quiet dismissal indeed! Shami fired this full on the stumps and Manhas drilled it down the pitch, Ashwin had set off and had to quickly turn around, Shami back flicked it to the stumps and Ashwin was short, there was barely an appeal and nor did the umpire raise the finger, Ashwin didn't wait and walked off, for a second we didn't know what was going on!"}, {"ball": 19.5, "isHighlight": false, "text": "$$R$$ $$Ashwin$$ $$run$$ $$out$$ $$1$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 19.6, "isHighlight": false, "text": "Mohammed Shami to Manhas, $$FOUR$$ ,Manhas makes room and caves a full ball over point to finish the innings with a boundary"}, {"ball": 19.6, "isHighlight": false, "text": "177 is a very competitive score on this surface under lights. Super Kings were undone by a fantastic innings from Maxwell the other night, but can Daredevils find their 'Maxwell'? Duminy's in good touch. The top order will need to get them off to a good start in the face of this target.  Join us shortly for the chase."}], "name": "Chennai Super Kings v Delhi Daredevils", "innings": "Chennai Super Kings  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729293.html?innings=1;view=commentary", "match_num": 8}