{"commentary": [{"ball": 0, "isHighlight": false, "text": "$$9.50pm$$ $$IST$$  Here come the Delhi openers, Mayank Agarwal and M Vijay. Ishwar Pandey takes the new ball"}, {"ball": 0.1, "isHighlight": false, "text": "Pandey to Agarwal,no run,starts with a short of length ball, defended to the off side"}, {"ball": 0.2, "isHighlight": false, "text": "Pandey to Agarwal,1 run,a touch shorter, 134kph, slapped firmly towards point where a diving Raina keeps them to a single"}, {"ball": 0.3, "isHighlight": false, "text": "Pandey to Vijay,no run,length ball this time, Vijay defends his first ball"}, {"ball": 0.4, "isHighlight": false, "text": "Pandey to Vijay, $$FOUR$$ ,drops it short, Vijay lifts that on the up, good contact to launch that over cover, a couple of bounces before reaching the boundary"}, {"ball": 0.5, "isHighlight": false, "text": "Pandey to Vijay,no run,good riposte from Pandey, gets the ball to curl away outside off, past the outside edge"}, {"ball": 0.6, "isHighlight": false, "text": "Pandey to Vijay,1 run,keeps it close to off, guides this down towards third man"}, {"ball": 0.6, "isHighlight": false, "text": "Abhishek: \"Nice to see Ishwar Pandey in the wings for CSK today... I wonder why teams are not picking the Domestic Heroes in their playing XI and persisting with old warhorses... Kedhar Jadhav, Anureet Singh, Parvez Rasool, Jalaj Saxena, Sandeep Sharma atleast deserve a look-in in their respective franchises... Rishi Dhawan, K L Rahul, Akshar Patel and Jasprit Bumrah are the few lucky ones though... \""}, {"ball": 1.1, "isHighlight": false, "text": "Hilfenhaus to Vijay,no run,pitched up by Hilfenhaus, defended towards point"}, {"ball": 1.2, "isHighlight": false, "text": "Hilfenhaus to Vijay,1 run,keeps it around off stump, a thick inside edge sends the ball towards midwicket for a single"}, {"ball": 1.3, "isHighlight": false, "text": "Hilfenhaus to Agarwal,no run,Mayank wanted to smash that out of the park, he had decided even before the ball was delivered, Hilfenhaus drops it short and Mayank can't get anywhere near the ball as he half-heartedly attempts a slog"}, {"ball": 1.4, "isHighlight": false, "text": "Hilfenhaus to Agarwal,no run,defended behind point"}, {"ball": 1.5, "isHighlight": false, "text": "Hilfenhaus to Agarwal,no run,good stuff from hilfenhaus, cutting away after pitching just outside off, too much movement for Mayank to deal with, he's beaten"}, {"ball": 1.6, "isHighlight": false, "text": "Hilfenhaus to Agarwal,1 run,pushed towards mid-off for a single, just two off that Hilfenhaus over"}, {"ball": 1.6, "isHighlight": false, "text": "Anoop: \"I almost asked why Sehwag is not opening. He seems to be synonymous with Delhi.\""}, {"ball": 2.1, "isHighlight": false, "text": "Pandey to Agarwal, $$OUT$$ ,there have been plenty of dropped catches this season, but this time Raina takes a terrific catch, Mayank has flopped, a length ball and Mayank wanted to play that inside-out, bat turns as he plays that and the ball loops towards cover, Raina has some ground to cover, he sprints to his left and pouches that one"}, {"ball": 2.1, "isHighlight": false, "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Raina$$ $$b$$ $$Pandey$$ $$2$$ $$(8m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$28.57$$"}, {"ball": 2.2, "isHighlight": false, "text": "Pandey to Vijay,no run,back of a length ball, defended off the front foot to the off side"}, {"ball": 2.3, "isHighlight": false, "text": "Pandey to Vijay,no run,short of length ball is swatted to midwicket"}, {"ball": 2.4, "isHighlight": false, "text": "Pandey to Vijay,1 run,this time the ball cuts in, cramping up the batsman, who tucks the ball towards square leg"}, {"ball": 2.5, "isHighlight": false, "text": "Pandey to Karthik,2 runs, $$dropped$$ , pitched up this time, thick edge after the ball moves away, but that is put down by Ashwin at first slip, very tough low chance that"}, {"ball": 2.6, "isHighlight": false, "text": "Pandey to Karthik,no run,beaten outside off, Chennai's bowling has begun well here"}, {"ball": 3.1, "isHighlight": false, "text": "Sharma to Vijay, $$FOUR$$ ,lovely use of the wrists! This was a half volley on the stumps, shuffles across the stumps, works the wrists and places it wide of midwicket"}, {"ball": 3.2, "isHighlight": false, "text": "Sharma to Vijay,no run,this one goes past the gap between bat and the pad, nips back in as he looks to drive, goes past the off stump"}, {"ball": 3.3, "isHighlight": false, "text": "Sharma to Vijay, $$OUT$$ ,Faf du Plessis has pulled off quite a stunner! Vijay looked to clear the straight boundary, it was high in the air and du Plessis was running back from mid-off, the running catches are the toughest, hung on to it and fell backwards"}, {"ball": 3.3, "isHighlight": false, "text": "$$M$$ $$Vijay$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Sharma$$ $$11$$ $$(15m$$ $$12b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$91.66$$"}, {"ball": 3.4, "isHighlight": false, "text": "Sharma to Karthik,no run,nipped back in a bit too much and hit him high on the thigh pad, stifled appeal, Karthik was anyway yards out of his crease"}, {"ball": 3.5, "isHighlight": false, "text": "Sharma to Karthik,no run,chips down the track and he drives him to cover"}, {"ball": 3.6, "isHighlight": false, "text": "Sharma to Karthik,2 runs,close call for Karthik as he gets an inside edge that trickles past the stumps"}, {"ball": 3.6, "isHighlight": false, "text": "Allen: \"I don't think any of the teams playing in this season has a home advantage in UAE. But if Kochi Tuskers would have played, they are the favorites to the people in UAE.\"  True that!"}, {"ball": 4.1, "isHighlight": false, "text": "Pandey to Tiwary,no run,this one moves away from him and he pokes his bat at it"}, {"ball": 4.2, "isHighlight": false, "text": "Pandey to Tiwary, $$OUT$$ ,Faf du Plessis is pulling off stunners out of habit tonight! Take a bow! Tiwary made a lot of room and charged down the track looking to clear the off side, unfortunately he made too much room and the ball spooned off the bottom of the bat, du Plessis ran backwards at mid-off and hung on on the dive just as the ball was leaving him, du Plessis covered a lot of ground getting to the ball, amazing stuff"}, {"ball": 4.2, "isHighlight": false, "text": "$$MK$$ $$Tiwary$$ $$c$$ $$du$$ $$Plessis$$ $$b$$ $$Pandey$$ $$0$$ $$(3m$$ $$2b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$"}, {"ball": 4.3, "isHighlight": false, "text": "Pandey to Karthik,1 run"}, {"ball": 4.4, "isHighlight": false, "text": "Pandey to Duminy,no run,that was a good shout for an lbw! Pitched on middle and was coming back in, Duminy trapped on the back foot, looked adjacent but may have been a tad high"}, {"ball": 4.5, "isHighlight": false, "text": "Pandey to Duminy,no run,drifts down the leg side and surprisingly no wide called"}, {"ball": 4.6, "isHighlight": false, "text": "Pandey to Duminy,no run,this was moving away from him and he flashed at it"}, {"ball": 4.6, "isHighlight": false, "text": "Nandakiran N: \"Some top class catches taken by CSK in the tournament that is so clouded with misfields and dropped catches. \""}, {"ball": 5.1, "isHighlight": false, "text": "Sharma to Karthik,no run,this was short and wide outside the off stump, he flashes and misses"}, {"ball": 5.2, "isHighlight": false, "text": "Sharma to Karthik,1 run,he stays right back at the crease and knocks it to the off side and sets off"}, {"ball": 5.3, "isHighlight": false, "text": "Sharma to Duminy,2 runs,he comes round the wicket, width and he pushes at it and gets an outside edge to third man"}, {"ball": 5.4, "isHighlight": false, "text": "Sharma to Duminy,1 run,nearly dragged that onto his stumps!Fetches that from wide outside off and he gets an inside edge that rolls past the stumps"}, {"ball": 5.5, "isHighlight": false, "text": "Sharma to Karthik,1 run,nips back in and he opens the face of the bat and knocks it wide of slip"}, {"ball": 5.6, "isHighlight": false, "text": "Sharma to Duminy,1 run,how many inside edges have we seen already? Fetches that from outside off, looks to drive straighter, edges past the stumps"}, {"ball": 6.1, "isHighlight": false, "text": "Pandey to Duminy,no run,struck on the pads and the ball rolls to the off side"}, {"ball": 6.2, "isHighlight": false, "text": "Pandey to Duminy,2 runs,good length outside the off stump and he cuts him down to third man"}, {"ball": 6.3, "isHighlight": false, "text": "Pandey to Duminy,3 runs,clips it to the leg side and it was racing away to long leg and Sharma did a fine job sliding to cut that off"}, {"ball": 6.4, "isHighlight": false, "text": "Pandey to Karthik,1 run,stays beside the line and angles it down to third man"}, {"ball": 6.5, "isHighlight": false, "text": "Pandey to Duminy,3 runs,he gives him width and he chops it wide of backward point and they take three"}, {"ball": 6.6, "isHighlight": false, "text": "Pandey to Karthik, $$FOUR$$ ,crashed that past the gap! This was on a good length wide outside off, slapped that wide if backward point"}, {"ball": 7.1, "isHighlight": false, "text": "Sharma to Duminy,1 run,Duminy looking scratchy again, another inside edge to the leg side"}, {"ball": 7.2, "isHighlight": false, "text": "Sharma to Karthik,1 run,fullish outside off and he drives to Faf at short cover, slight fumble"}, {"ball": 7.3, "isHighlight": false, "text": "Sharma to Duminy,1 run,shorter ball outside off and he angles him down to third man"}, {"ball": 7.4, "isHighlight": false, "text": "Sharma to Karthik,1 run,good length on the stumps and he clips him wide of square leg"}, {"ball": 7.4, "isHighlight": false, "text": "sridhar: \"Why is Jadhav not being preferred over Tiwary? Surely, in this format, he is the better bet. Also, he had a great domestic T20. \""}, {"ball": 7.5, "isHighlight": false, "text": "Sharma to Duminy,1 run,gives him some width and he angles him just wide of point and down to third man"}, {"ball": 7.6, "isHighlight": false, "text": "Sharma to Karthik,no run,not sure what happened there, he was looking to drive, the keeper was up and the ball lobbed off Dhoni's glove and dropped short of Ashwin at short third man, not sure if there was an edge, ashwin didn't really go for it"}, {"ball": 8.1, "isHighlight": false, "text": "Smith to Duminy, $$OUT$$ ,Smith's got the big wicket of Duminy first ball! Pitched on middle and leg, the ball skidded through and went on straight, Duminy was trapped on the back foot and plumb in front"}, {"ball": 8.1, "isHighlight": false, "text": "$$JP$$ $$Duminy$$ $$lbw$$ $$b$$ $$Smith$$ $$15$$ $$(18m$$ $$14b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$107.14$$"}, {"ball": 8.1, "isHighlight": false, "text": "It's the  $$time$$ $$out$$"}, {"ball": 8.1, "isHighlight": false, "text": "Mahesh Balaji: \"No spin in the opening overs!! Two normal medium pace bowlers opening the bowling and they carry on to complete their spells too… A very peculiar unusual thing in today's T20 & IPL trend which was considered very usual and normal during the 90's!!\""}, {"ball": 8.1, "isHighlight": false, "text": "Taylor walks in"}, {"ball": 8.2, "isHighlight": false, "text": "Smith to Taylor,1 wide,Smith totally loses control of that and sprays it wide down leg"}, {"ball": 8.2, "isHighlight": false, "text": "Smith to Taylor,1 run,full and wide outside off and he drives him wide of backward point"}, {"ball": 8.3, "isHighlight": false, "text": "Smith to Karthik,1 run,this swings in quite sharply and clips his pads as he looks to clip it away"}, {"ball": 8.4, "isHighlight": false, "text": "Smith to Taylor,no run,full in length outside the off stump and softly pushed to mid-off"}, {"ball": 8.5, "isHighlight": false, "text": "Smith to Taylor,no run,punched towards backward point and they don't push the single"}, {"ball": 8.6, "isHighlight": false, "text": "Smith to Taylor,1 run,bowls from wide of the crease, full and driven to short cover and they take a quick single"}, {"ball": 8.6, "isHighlight": false, "text": "Harish Paddy: \"And to think Dhoni commented during India's tour of NZ that Ishwar Pandey wasn't ready for international cricket and yet Ishant Sharma kept getting selected for the ODIs and kept bowling 130kph short balls with a horrendously scrambled seam position only to be hammered all over the park. Confounding to say the least.\""}, {"ball": 9.1, "isHighlight": false, "text": "Hilfenhaus to Taylor, $$FOUR$$ ,that was a gift, friendly full toss on the pads, all he had to do was shuffle slightly and work it wide of the keeper"}, {"ball": 9.2, "isHighlight": false, "text": "Hilfenhaus to Taylor, $$OUT$$ ,Hilfy gets the line and length spot on this time! The away swinger gets him, swung away from the middle stump, Taylor was compelled to  go for the drive, thick outside edge to Dhoni"}, {"ball": 9.2, "isHighlight": false, "text": "$$LRPL$$ $$Taylor$$ $$c$$ $$†Dhoni$$ $$b$$ $$Hilfenhaus$$ $$6$$ $$(7m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$100.00$$"}, {"ball": 9.2, "isHighlight": false, "text": "One way traffic in Abu Dhabi tonight"}, {"ball": 9.3, "isHighlight": false, "text": "Hilfenhaus to Neesham,2 runs,gets good inswing to Neesham, he gets an inside edge to the on side"}, {"ball": 9.4, "isHighlight": false, "text": "Hilfenhaus to Neesham,1 run,this one swings away and he drives him wide of cover"}, {"ball": 9.5, "isHighlight": false, "text": "Hilfenhaus to Karthik,no run,Karthik was trapped by the swing, this one moved away sharply and he flashed at it"}, {"ball": 9.6, "isHighlight": false, "text": "Hilfenhaus to Karthik,no run,short of a length and he stays back and defends"}, {"ball": 9.6, "isHighlight": false, "text": "Indranil: \"@Harish...To be honest though he bowled well..he took wickets of domestic players only..thanks to some mind blowing fielding..so don't see where the \"international\" debate comes in..and Dhoni knows his players more than anyone\""}, {"ball": 10.1, "isHighlight": false, "text": "Smith to Neesham,no run,full outside off and he pushes at it and misses"}, {"ball": 10.2, "isHighlight": false, "text": "Smith to Neesham,1 run,full outside off and he drives down the ground to long-off"}, {"ball": 10.3, "isHighlight": false, "text": "Smith to Karthik, $$FOUR$$ ,nicely played, the keeper was up, a hint of width, no slip and he gently steered this down to third man"}, {"ball": 10.4, "isHighlight": false, "text": "Smith to Karthik,1 run,full on the off stump and he drives him down to long-off"}, {"ball": 10.5, "isHighlight": false, "text": "Smith to Neesham,2 runs,he steers it square of the wicket on the off side for a couple"}, {"ball": 10.6, "isHighlight": false, "text": "Smith to Neesham,2 runs,gets an inside edge to the leg side and they run hard for the second"}, {"ball": 10.6, "isHighlight": false, "text": "DM: \"Well, Ishwar will make his debut this year now that he is playing for CSK....no reason to argue about the previous series.\""}, {"ball": 11.1, "isHighlight": false, "text": "Jadeja to Karthik,no run,flatter one and he's hit on the pads"}, {"ball": 11.2, "isHighlight": false, "text": "Jadeja to Karthik,1 run,Karthik plays the reverse sweep and he plays it off the back of the bat, Dhoni meanwhile anticipates it well and quickly stretches his right leg and deflects the ball to short third man, clever footwork by MSD"}, {"ball": 11.3, "isHighlight": false, "text": "Jadeja to Neesham,2 runs,short outside off and he punches it wide of point"}, {"ball": 11.4, "isHighlight": false, "text": "Jadeja to Neesham,no run"}, {"ball": 11.5, "isHighlight": false, "text": "Jadeja to Neesham, $$FOUR$$ ,they need plenty more of those, tossed up on middle and leg and he slogs him over midwicket"}, {"ball": 11.6, "isHighlight": false, "text": "Jadeja to Neesham, $$FOUR$$ ,back to back boundaries, this was dropped short and wide outside off, Neesham places it well wide of short third man and point, good placement and timing"}, {"ball": 11.6, "isHighlight": false, "text": "Ashwin now"}, {"ball": 12.1, "isHighlight": false, "text": "Ashwin to Karthik, $$OUT$$ ,One Chennai boy bowls another, Ashwin was bowling round the wicket, Karthik made a lot of room early on looking to push it to the off side, he may have expected turn but it went straight through and knocked the middle stump"}, {"ball": 12.1, "isHighlight": false, "text": "$$KD$$ $$Karthik$$ $$b$$ $$Ashwin$$ $$21$$ $$(50m$$ $$22b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$95.45$$"}, {"ball": 12.2, "isHighlight": false, "text": "Ashwin to Nadeem,no run,he comes forward and drives to the off side"}, {"ball": 12.3, "isHighlight": false, "text": "Ashwin to Nadeem,no run,he gets forward and pushes it to mid-off"}, {"ball": 12.4, "isHighlight": false, "text": "Ashwin to Nadeem,no run,hit on the pads as he looks to sweep but it may have pitched outside leg"}, {"ball": 12.5, "isHighlight": false, "text": "Ashwin to Nadeem,1 run,stays back and gets an outside edge to the off side"}, {"ball": 12.6, "isHighlight": false, "text": "Ashwin to Neesham,1 run,pushes it with soft hands towards point and sets off"}, {"ball": 12.6, "isHighlight": false, "text": "zion: \"Why is everyone thinking playing for CSK assures your spot in Indian team, then jakati should have played long back and Badrinath would be regular member.. Its only if you perform well in a already well performing members of CSK. Take examples of Jadeja he was not from csk when he debut nor awana or rahane its talent that matters\""}, {"ball": 13.1, "isHighlight": false, "text": "Jadeja to Neesham,no run,stays back and punches it to the off side"}, {"ball": 13.2, "isHighlight": false, "text": "Jadeja to Neesham,1 run,skids through but he manages to clip it to the on side"}, {"ball": 13.3, "isHighlight": false, "text": "Jadeja to Nadeem,1 run,gets forward and punches it to long-off"}, {"ball": 13.4, "isHighlight": false, "text": "Jadeja to Neesham,2 runs,skids through and he clips it towards midwicket for a couple"}, {"ball": 13.5, "isHighlight": false, "text": "Jadeja to Neesham, $$OUT$$ ,straight to deep midwicket, Neesham attempts to slog that for a six over deep midwicket, fetches it from outside off, it went flat to Raina, seven down, can Daredevils at least reach 100?"}, {"ball": 13.5, "isHighlight": false, "text": "$$JDS$$ $$Neesham$$ $$c$$ $$Raina$$ $$b$$ $$Jadeja$$ $$22$$ $$(17m$$ $$15b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$146.66$$"}, {"ball": 13.6, "isHighlight": false, "text": "Jadeja to Mohammed Shami,1 run,flatter one and he whips it wide of square leg"}, {"ball": 14.1, "isHighlight": false, "text": "Ashwin to Mohammed Shami,1 wide,he fires this one wide down the leg side"}, {"ball": 14.1, "isHighlight": false, "text": "Ashwin to Mohammed Shami,no run,this was fired through again but on the stumps and defends"}, {"ball": 14.2, "isHighlight": false, "text": "Ashwin to Mohammed Shami, $$OUT$$ ,after two quick deliveries Ashwin tosses this one up ever so slowly, the point was to tempt Shami into going for the big hit and he does just that, played away from the body and he miscued it to McCullum at long-off"}, {"ball": 14.2, "isHighlight": false, "text": "$$Mohammed$$ $$Shami$$ $$c$$ $$McCullum$$ $$b$$ $$Ashwin$$ $$1$$ $$(2m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$"}, {"ball": 14.3, "isHighlight": false, "text": "Ashwin to Unadkat,no run,round the wicket and fired that wide outside off"}, {"ball": 14.4, "isHighlight": false, "text": "Ashwin to Unadkat,no run,quicker one and he gets forward to defend"}, {"ball": 14.5, "isHighlight": false, "text": "Ashwin to Unadkat,no run,looked like the one that straightened, Unadkat was squared up and beaten"}, {"ball": 14.6, "isHighlight": false, "text": "Ashwin to Unadkat,no run,rocks back and cuts to point"}, {"ball": 14.6, "isHighlight": false, "text": "Delhi effectively 9 down because Coulter-Nile isn't padded up"}, {"ball": 15.1, "isHighlight": false, "text": "Jadeja to Nadeem,no run,makes room to drive and he misses it"}, {"ball": 15.2, "isHighlight": false, "text": "Jadeja to Nadeem,1 run,flatter one and he makes room and drives to deep cover"}, {"ball": 15.3, "isHighlight": false, "text": "Jadeja to Unadkat,1 run,pushes it softly towards point and sets off"}, {"ball": 15.4, "isHighlight": false, "text": "Jadeja to Nadeem, $$OUT$$ ,That's the game! Coulter-Nile will not bat, this was tossed up outside off and Nadeem made room to carve that over cover, Raina ran to his right at cover and took the catch easily at the edge of the circle"}, {"ball": 15.4, "isHighlight": false, "text": "$$S$$ $$Nadeem$$ $$c$$ $$Raina$$ $$b$$ $$Jadeja$$ $$3$$ $$(12m$$ $$8b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$37.50$$"}, {"ball": 15.4, "isHighlight": false, "text": "Super Kings win by a whopping 93 runs and their biggest IPL win. Raina really should be the Man of the Match tonight. Those three splendid catches - 2 from du Plessis, one from Raina, left Daredevils shell shocked early. No recovery stand after that. A forgetable night for Delhi. All six CSK bowlers picked wickets."}, {"ball": 15.4, "isHighlight": false, "text": "$$Dinesh$$ $$Karthik$$ : \"Coulter-Nile will be out for some time, pulled his hamstring. To have lost him that early was a blow for us. The target was gettable if we batted better, the ball was seaming. Under the lights it was doing a bit more. I would have batted second anyway had I won the toss.\""}, {"ball": 15.4, "isHighlight": false, "text": "$$Presentation$$ :"}, {"ball": 15.4, "isHighlight": false, "text": "$$Dhoni$$ : \"Complete performance. Catches win matches. This was a perfect game for us, bit of help for fast bowlers. Seven batsmen should be good enough. We had a day off and fielding is something we always emphasise on and it can be a benchmark for forthcoming games.\""}, {"ball": 15.4, "isHighlight": false, "text": "$$Raina$$ $$is$$ $$the$$ $$Man$$ $$of$$ $$the$$ $$Match$$ : \"We bowled really well. We won because of the fielding. I looked to be positive till the last ball. The pitch was doing something. The new ball does do more under lights. I think Ishwar Pandey won us the game today. I've managed to play so many games for CSK because of my fitness as it is very hot in Chennai so you need to keep fit.\""}, {"ball": 15.4, "isHighlight": false, "text": "So a slightly early finish today. That's it from us here tonight. The action continues tomorrow. Thanks for your company!"}], "name": "Chennai Super Kings v Delhi Daredevils", "innings": "Delhi Daredevils  innings", "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729293.html?innings=2;view=commentary", "match_num": 8}