[
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729281.html?innings=1;view=commentary",
    "name": "Delhi Daredevils v Royal Challengers Bangalore",
    "commentary": [
      {
        "ball": 0,
        "text": "Bangalore jog out into the field, their captain carrying the ball in his hands. Behind them come Delhi's openers M Vijay and Mayank Agarwal. Mitchell Starc is revving up, with the crowd chanting with the countdown clock",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$6.20$$ $$pm$$  We're about 10 minutes away from the start of the match. Aside from the surprising exclusion, Bangalore have also gone for two promising Indian talents in Yuzvendra Chahal and Sachin Rana",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "avi: \"I am sure R Sharma must be most relieved person after hearing that Gayle is not playing\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Sumeet Vaidya: \"Elected to chase. Well, what do you expect if Kohli is captain :)\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Venkat Sravanth: \"Is Bangalore trying to set an even playing field for Delhi by compensating KP's loss with the dropping of Gayle? Or do they seriously believe that Gayle's not good enough to be in the XI??\" It might be something relating to his fitness. Remember he has a pretty dodgy knee",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$Bangalore$$ $$have$$ $$won$$ $$the$$ $$toss$$ $$and$$ $$elect$$ $$to$$ $$bowl$$ . Nic Maddinson, Mitchell Starc, AB de Villiers and Albie Morkel are the overseas players.  $$No$$ $$Chris$$ $$Gayle$$ $$then$$ , at least from what Virat Kohli said at the toss. The pitch is good and hard, he adds and would be good for the batsmen and he preferred to restrict Delhi and then chase them down.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Dinesh Karthik who is leading Delhi says Ross Taylor, Jimmy Neesham, Wayne Parnell and JP Duminy are his overseas players and praised the balance of the side.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$5.55$$ $$pm$$  Oh, just in case you've not got it down, Dan Vettori still a practicing cricketer in the international arena has swapped his playing jersy for the coach's hat this season. Parthiv Patel calls him \"chilled out\" which really isn't breaking news, is it?",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Madhushekar : \"I am a Bangalorean how can I support them when they dont have a single player from karnataka. The domestic irani and one day champs. So much for this tournament fostering franchise loyalty. Enjoyed domestic season more\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "James: \"Any side that can include Gayle, Kohli, AB and Yuvraj in its top and middle order must be in with a chance. The 2 best (on current form) limited overs batsmen in the world. Plus Chris Gayle.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Umm Abeeha: \"Delhi's best chance is to ask Bangalore to bat, try to restrict them to under 150 (hope Duminy bowls to Gayle opening over)and then look to chase it with Duminy, Taylor, De Kock and Indian support cast of Karthik, Tiwary and M Vijay..\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$5.30$$ $$pm$$  We're into the second day and this time the action shifts to Sharjah where Delhi and Bangalore begin to bury the disappointments of the previous season. In apology for such an unimaginative introduction let me plug in Abhishek Purohit's  $$preview$$ as quickly as possible",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Jose: \"Yesterday, three who are keen to get an entry/re-entry into the India team failed -- Gauti, Yusuf, & Uthappa. Today, another one has to try to prevent a possible exit -- Yuvi. Wish him all the success. For his sake, and for his good friend Kohli's sake. Between the two teams, Bangalore looks stronger in batting (especially with KP not playing for Delhi), and Delhi looks better in bowling. T-20, being a mirage, what looks right need not be, by the time you crawl up to the mirage!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$CricIQ$$  got off to a blistering start yesterday with, with Philckt topping the daily leaderboard with 3317 points and taking home huge prizes. We are into Day 2 of the season now, and it's another chance to stake your claim at The Greatest Test Ever, and book a seat at Lord's for the India v England Test this summer.  $$Play$$ $$here.$$",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Starc to Agarwal,no run,crisply punched into the covers as he leans forward to the fuller delivery angled across him",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Starc to Agarwal,1 wide,teases the batsman outside off again but he goes a bit too far there",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Starc to Agarwal,2 runs,slices it to deep third man who slaps the ball back into the field of play. Full and slated wide again. Had to reach for it",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Starc to Agarwal,no run,strides forward and drills another solid drive into the covers",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Starc to Agarwal,1 run,walks at the bowler as Starc manages a bit of inward dip. Agarwal uses it and flicks through midwicket",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "Starc to Vijay,no run,dug in short on middle, defended",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Starc to Vijay,no run,some late inward movement again but Vijay negotiates it well with a front foot defensive",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Albie Morkel from the other end",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Morkel to Agarwal,1 run,starts off short and it's pulled to deep midwicket. Seemed a little cramped there which limited his timing a bit",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Vishnu Mohan: \"Seriously, how come Mayank is preferred than Sourabh Tiwary or Kedhar Jadhav?? #stunned\" Cause the other two don't open",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Morkel to Vijay,no run,fullish and outside off and Morkel even gets a bit of nibble away. Vijay leaves it watchfully",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Morkel to Vijay,1 run,back of a length and angled in at him, clipped off his thighs to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "1.4",
        "text": "Morkel to Agarwal,no run,poor shot selection there. Keeps it back of a length and refuses him any room to free those arms. Agarwal is on the front foot and goes for a flat-batted pull. Hits high on the bat and drops just short of mid-on",
        "isHighlight": true
      },
      {
        "ball": "1.5",
        "text": "Morkel to Agarwal,1 run,shortish and outside off, dabbed behind point for a quick single",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Morkel to Vijay,no run,fullish and just outside off, strides forward and defends to point. Yuvraj sends in a throw at the non-strikers'",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Starc to Agarwal,1 run,145kph, that's his main threat and he almost had his man. Fullish and curling in rather late. Agarwal had to adjust his shot and block and gets more of an inside edge",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Starc to Vijay, $$SIX$$ ,picked away, that's a Vijay special! It was full and on the pads, a very strong area for the opener. Ensured his front foot was not in the way and an effortless whip of the wrists sends the ball beyond the square leg boundary",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "Starc to Vijay,no run,pulls his length back a bit and directs the ball wider of off stump, Vijay prefers not to play",
        "isHighlight": false
      },
      {
        "ball": "2.4",
        "text": "Starc to Vijay,1 run,nicely bowled, but Vijay negotiates the inswing well. Clips into the midwicker region for a single",
        "isHighlight": false
      },
      {
        "ball": "2.5",
        "text": "Starc to Agarwal,no run,shortish and angled across him, Agarwal made room outside leg and looks to carve it over point. Beaten",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Starc to Agarwal, $$OUT$$ ,he seemed a little too generous with that pull shot despite being late on it once before. Starc digs it in and it comes in at an awkward bounce, there is also a bit too much pace on the ball and he splices it to square leg",
        "isHighlight": true
      },
      {
        "ball": "2.6",
        "text": "$$MA$$ $$Agarwal$$ $$c$$ $$Kohli$$ $$b$$ $$Starc$$ $$6$$ $$(14m$$ $$10b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$60.00$$",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Morkel to Vijay,no run,back of a length on off stump, Vijay covers the line and blocks it",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Morkel to Vijay,1 run,too straight and Vijay is comfortable clipping it away to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Dinesh Karthik, the captain, takes guard",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Morkel to Karthik, $$OUT$$ ,golden duck for the captain! What a ripper from Albie! Gets one to straighten and extracts a bit more bounce as well. All that combine to claim a faint edge as Karthik prodded forward and the keeper did the rest",
        "isHighlight": true
      },
      {
        "ball": "3.3",
        "text": "$$KD$$ $$Karthik$$ $$c$$ $$†Patel$$ $$b$$ $$Morkel$$ $$0$$ $$(2m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Arjun: \"You know.. the crowd support in UAE got me thinking.. What if every Indian T20 started off with 1-2 weeks in a different off-beat location where cricket can be promoted? For locations that are further away from India, there could be a few days break in between. That way.. we can ensure franchises build teams for all conditions too.\"",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Morkel to Tiwary,no run,back of a length and outside off, left alone",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Morkel to Tiwary,1 run,skips down the track as Albie fires at his pads, Tiwary the new batsman, gets an inside edge that wanders into the leg side",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Morkel to Vijay,no run,more shape away and Vijay was left groping at it. No foot movement as he hung his bat and the good length ball darts across the outside edge",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Sam Richards: \"yesterday gambhir went for a duck and Kolkata won, so now will Delhi will win today\" Bowling change, Varun Aaron",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Aaron to Tiwary, $$OUT$$ ,what a soft dismissal, caught down the leg side! Kohli high-fives his bowler and Bangalore are jubilant. Tiwary shuffled across to try and glance it fine but the ball, just short of a good length, runs off the face and Parthiv collects another simple catch",
        "isHighlight": true
      },
      {
        "ball": "4.1",
        "text": "$$MK$$ $$Tiwary$$ $$c$$ $$†Patel$$ $$b$$ $$Aaron$$ $$1$$ $$(4m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$33.33$$",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "JP Duminy has a slip, Aaron around the stumps",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Aaron to Duminy,no run,back of a length and outside off, JP shoulders arms",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Aaron to Duminy,no run,nice little stroke. Covered his stumps and angled the shortish ball outside off to point. Very compact",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Aaron to Duminy,no run,short of a length and outside off, Duminy looks to run it down the third man but doesn't get the requisite amount of bat on it",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Aaron to Duminy,no run,good length and angled in at middle. Turned away to square leg",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Tariq: \"So much for all the hype about reformed Delhi team……looks like same old team with no changes in performance.\"",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Aaron to Duminy,no run,that's a  $$wicket-maiden$$ . Aaron digs this is short and gets it to rise around chest-high. Duminy dead bats it into the leg side.",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Morkel to Vijay, $$FOUR$$ ,short fine leg makes a mess of it. He had to move to his left a bit but the ball sneaks under his dive. Albie is not pleased as Vijay's flick gets four more than it deserved",
        "isHighlight": true
      },
      {
        "ball": "5.2",
        "text": "Morkel to Vijay,2 runs,good length ball on off stump, Vijay comes forward and blocks to mid-on. A ricochet off the stumps at the bowler's end fetches an overthrow",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "Morkel to Vijay,1 run,goes slower, think it was the offcutter. Vijay is wise to it and drops it into the off side for a quick single",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "Viral Bhatt: \"Towards the start of this match, few would have expected this out of Bangalore's bowling attack and look what these 3 pacers have done. They've simply annihilated Delhi's back-bone. If they are able to keep the same momentum for rest of the season, Bangalore will be the team to beat, especially when they already have such a formidable batting order. Loads of work needs to be done by Duminy and Taylor in this match though.\"",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Morkel to Duminy, $$FOUR$$ ,gorgeous shot! Didn't do much more than present a full face to the overpitched delivery but he had just timed it so well",
        "isHighlight": true
      },
      {
        "ball": "5.4",
        "text": "$$Allan$$ $$Donald$$ $$the$$ $$bowling$$ $$coach$$ $$for$$ $$Bangalore$$ $$says$$ $$Chris$$ $$Gayle$$ $$has$$ $$a$$ $$bit$$ $$of$$ $$a$$ $$back$$ $$issue$$",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "Morkel to Duminy,1 run,corrects slides it off the open face to deep third man for a single",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Morkel to Vijay,1 run,fullish and angling in at him, Vijay is forward and flicks away to deep midwikcet",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "kailesh: \"@tariq .... its just the first match ... you got to have some patience .. its a new look team and hence it will gain momentum gradually as the tournament progresses .. \"",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Aaron to Vijay,no run,shortish on middle and off, Vijay stands up tall and blocks",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Aaron to Vijay,no run,lazy waft outside off and he's beaten again. Aaron goes fishing outside off stump and gets a bit of away swing to bolster his case, but the edge is not forthcoming",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Aaron to Vijay,no run,145kph, that's some excellent aggression from the quick bowler. Saw the batsman backing away and followed him with a bouncer.",
        "isHighlight": true
      },
      {
        "ball": "6.4",
        "text": "Aaron to Vijay,2 wides,back of a length and slanting down the leg side, the glance doesn't connect and the keeper makes a hash of it to allow an extra run in addition to the wide",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Aaron to Duminy,1 wide,short ball angled at leg stump, JP moves across to the off side to pull it down to fine leg but doesn't connect",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Aaron to Duminy,no run,slapped away to point and Yuvi tumbles to his right to halt it in its tracks",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Aaron to Duminy,1 run,this time he slaps it into the gap in the covers, but there is protection in the deep. Shouldn't offer width if he goes back of a length",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Aaron to Vijay,1 run,fires in a yorker just outside off and Vijay guides it to deep third man and we'll have the first strategic time out",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "anurag: \"what happened to Aaron :)\" Ten dots in two overs",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Arsalan Ahmed: \"What are Delhi thinking, leaving Taylor to bat at 6? Whatever happened to giving your impact players more time in the middle to get you to a better score?\" Chahal into the attack",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Chahal to Vijay, $$OUT$$ ,Vijay's beaten and the off stump is knocked back! What a way to debut for your new franchise! It was a rapid legspinner which drifted in on middle and straightens just enough after pitching. Vijay was looking to guide it down to third man again. A lot of bemused looks as they check if it was bowled or stumped or if the keeper disturbed the bails. The third ump is roped in and replays show he is bowled neck and crop",
        "isHighlight": true
      },
      {
        "ball": "7.1",
        "text": "$$M$$ $$Vijay$$ $$b$$ $$Chahal$$ $$18$$ $$(40m$$ $$20b$$ $$1x4$$ $$1x6)$$ $$SR:$$ $$90.00$$",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Ross Taylor is the new batsman",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Chahal to Taylor,no run,googly to the new batsman and Taylor had no clue. Gets an inside edge onto pad but there was no short leg",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Chahal to Taylor,no run,more turn for his leggies. It's the kind that is just enough to trouble the batsman. Taylor looks to defend and is beaten",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Chahal to Taylor,no run,flighted on middle, Taylor plants his bat in front of pad and defends",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Chahal to Taylor,1 run,thick outside edge that evades the slips. Taylor was bringing a closed defensive face down on the ball and is deceived",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Chahal to Duminy,no run,nice, tight line on off stump. Duminy is forward and blocks",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Aaron to Taylor,1 run,back of a length and outside off, steered to deep third man",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "Aaron to Duminy,no run,presents an angled blade to the back of a length ball outside off. Can't beat point",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "back over the wicket now",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Aaron to Duminy,no run,145kph, another terrific bouncer. Duminy is way too late on the hook shot and it was way too high to control it too. Rose to the crest on the helmet, but the top edge falls just short of the onrushing keeper",
        "isHighlight": true
      },
      {
        "ball": "8.4",
        "text": "Aaron to Duminy,1 run,full and slid across him, driven through to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "8.4",
        "text": "Senthil Mohan: \"Delhi badly needs Pietersen here. Not just because of this collapse. They have good players. Just need to gain momentum which can be given only by Pietersen. \"",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Aaron to Taylor,1 run,taps and runs to point as he rides the bounce on this shortish ball outside off",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Around the wicket again",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Aaron to Duminy,1 run,wide yorker, Duminy nudges into the covers and races off for the single",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Bangalore have taken 50 minutes to complete nine overs",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Chahal to Duminy,1 run,tossed up nicely on off stump, he hits it with the turn to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Chahal to Taylor,1 run,stays back to try and read the turn off the deck and dabs it in front of point for a single",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Chahal to Duminy,no run,Chahal throws himself to his left and stops the attempted single as Duminy nudged down the ground.",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Chahal to Duminy,2 runs,comes down the track and looks to whip through the on side, but this is the wrong 'un and he gets a leading edge that just lobs over the bowler. Chahal leaped as high as he could, but he was just not tall enough",
        "isHighlight": true
      },
      {
        "ball": "9.5",
        "text": "Chahal to Duminy,4 wides,that stayed so low! Gripped the pitch and turned down the leg side and deceived both the batsman and the keeper",
        "isHighlight": true
      },
      {
        "ball": "9.5",
        "text": "Chahal to Taylor,1 run,stays deep in his crease and late cuts it down to deep third man",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Chahal to Duminy,no run,he was backing away and ended up struggling to reach a googly that was pitched short and spinning wider of him. Can't beat point",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Ashok Dinda now",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Dinda to Taylor,1 run,back of a length and outside off, Taylor is back and punches into the covers to bring up the fifty",
        "isHighlight": true
      },
      {
        "ball": "10.2",
        "text": "Dinda to Duminy,1 run,pulls the pace off it this time as he attempts an offcutter which he angles across the left-hander. Duminy steers it down to third man",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Dinda to Taylor,1 run,low full toss shaping in at off stump, Taylor was forward and punches to long-off",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Dinda to Duminy,2 runs,digs it in short but it doesn't rise high enough. Duminy is in position for the pull and keeps it down nicely. Deep square leg runs around to his right to cut it off",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Dinda to Duminy,2 runs,full and outside off, Duminy pushes to mid-off who has a shy at the stumps and gives away an overthrow",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Dinda to Duminy,2 runs,picked away off his toes as Dinda search for the blockhole ends up a half-volley. Couple to the left of long-on",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Billybob: \"Delhi batting line up is all wrong. I mean why is Ross Talyor an quality international player coming in at 6 behind Tiwary and Karthik who are not.\"",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Chahal to Taylor,1 run,drifts it in on off stump and then snares some lovely turn away from the bat. Taylor opens the face and plays it with soft hands into the covers",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Chahal to Duminy,no run,the wrong 'un dips on him and Duminy who was expecting the leg spinner was looking for a nudge to midwicket and misses",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Chahal to Duminy,1 run,strides down the track and succeeds in getting it to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Chahal to Taylor,1 run,shortish and outside off, Taylor goes back and cuts to point who misfields and the two batsman hesitate in the middle of the pitch wondering if they should go for the single. By the time the ball is taken control of though, they rush through for the single",
        "isHighlight": true
      },
      {
        "ball": "11.5",
        "text": "Chahal to Duminy,1 run",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Chahal to Taylor,1 run,flighted on off stump and it skids quite low onto the bat, Taylor pushes to long-off",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Sandeep raghuva: \"Dinda started again from where he left in the last time.. 9 overs in 1st over.. will expect some more expensive overs from him later on!!\"",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Dinda to Taylor,1 run,drills the low full toss to the sweeper. He's starting to look comfortable out there",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "Dinda to Duminy,1 run,opens the face to slice this full delivery outside off to deep cover",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Dinda to Taylor,1 wide,goes for the wide yorker but he toes outside the marker",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Dinda to Taylor,2 runs,keeps it right up there on off stump, Taylor's forward and drives it through the covers. Starc is very good in the deep as he slides down on it and and throws the ball in one motion",
        "isHighlight": true
      },
      {
        "ball": "12.4",
        "text": "Dinda to Taylor, $$FOUR$$ ,neatly picked away as Dinda goes off line. It was the slower ball off the back of the hand. Taylor knew fine leg was inside the circle and glances it away",
        "isHighlight": true
      },
      {
        "ball": "12.5",
        "text": "Dinda to Taylor,1 run,wide yorker draws him forward as he steers it off the open face to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Dinda to Duminy,1 run,full and outside off, Duminy pushes to long-off",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Sagar: \"50% dot balls, not acceptable. Delhi should get back to basics and minimize dots and rotate strike... good bowling by B'lore\"",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "JP Duminy has become the 40th batsman to score 1000 runs in the tournament. Here's Yuvraj Singh with the ball",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Yuvraj Singh to Duminy,1 run,comes down the track to take advantage of the flight. Meets it on the full and whips it between long-on and deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Yuvraj Singh to Taylor,1 run,shortish and outside off, he rocks back and cuts to deep point",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Yuvraj Singh to Duminy,1 run,quicker and flatter on off stump, he goes back and punches to long-on",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Yuvraj Singh to Taylor,1 run,loads of flight on this as Taylor lashes to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Yuvraj Singh to Duminy,no run,stays a bit low as he tosses it up outside off. Goes on with the arm as JP bottom edges it",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Yuvraj Singh to Duminy,1 run,flighted on middle, Duminy pushes it down the ground to long-on. That's the second and final strategic time out of the innings",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Chahal to Duminy,1 run,googly to start and this time Duminy is aware of it, goes back and punches it down to long-off",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Chahal to Taylor,1 run,such lovely drift he's getting. Sneaks in towards leg stump but it gets some turn after pitching and takes the outside edge towards point",
        "isHighlight": true
      },
      {
        "ball": "14.3",
        "text": "Chahal to Duminy,1 run,rocks back and cuts to deep point",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Chahal to Taylor,no run,this almost turned square! Loads of flight just outside off and lured the batsman into pushing at it. Gripped the deck and spun well past the outside edge",
        "isHighlight": true
      },
      {
        "ball": "14.5",
        "text": "Chahal to Taylor,no run,that could have been close! It was a shorter ball and he looked to dab it in front of point for a quick single. Kohli swoops on the ball and sends in the throw in one motion. Rosco has to pull out a full-length dive as well and it saves him, just about",
        "isHighlight": true
      },
      {
        "ball": "14.6",
        "text": "Chahal to Taylor,no run,goes for the late cut, but still can't beat Kohli",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Yuvraj Singh to Duminy, $$SIX$$ ,peppers the sightscreen after skipping down the track. Yuvi fires in a flatter ball but he get under the ball and muscled it over the top",
        "isHighlight": true
      },
      {
        "ball": "15.2",
        "text": "Yuvraj Singh to Duminy,1 run,shortish and darted in on off stump, he shuffles across and works it wide of where mid-on would have been. Yuvi himself rushes after it",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Yuvraj Singh to Taylor,1 run,he's concentrating on a quicker pace now after that six. Taylor stays back and cuts behind point.",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Yuvraj Singh to Duminy,1 run,punched down the ground to long-on where AB is lurking. No double there",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Yuvraj Singh to Taylor,1 run,this time there was flight available, but Taylor is not quite comfortable against the slower bowlers. Misses out as his swipe can only reach deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Yuvraj Singh to Duminy,1 run,shortish ball outside off, pulled to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Mitchell Starc comes back",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Starc to Duminy,1 no ball,pulls out the scoop, but it wasn't the right ball for it. Leg-stump yorker that wanders through to the keeper. Oh, but wait, he has overstepped!",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "$$Free$$ $$hit$$ $$ball$$",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Starc to Duminy,1 run,slower short ball and Duminy was just a little too exuberant. Mistimes the pull and finds deep square leg",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Around the wicket",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Starc to Taylor,2 runs,excellent work from Dinda at the third man boundary! Short and wide outside off as he threw his bat at it. Gets a thick outside edge that seemed set for four, but he hunted it down well",
        "isHighlight": true
      },
      {
        "ball": "16.3",
        "text": "Starc to Taylor,1 run,sets himself up well outside off and Starc bowls it full and further wide, slices it away to deep point",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "zaheer: \"Chahal record has been if not excellent then very good so far in T20s, 20 wkts in 28 odd matches and most imp. having an economy under 6 is brilliant.\"",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Starc to Duminy,2 runs,fires it in full on middle stump as Duminy clears his front leg and squeezes it out to the right of deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Starc to Duminy,1 run,low full toss on leg stump, swung away to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Starc to Taylor,no run,has a giant smile on his face after executing the perfect wide yorker to keep Taylor quiet",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "NAUGHTY BLOOM: \"With Neesham and Parnel yet to come, Delhi can definitely look to put a fighting total on board.. I can smell 140-45 on the board!!\"",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Dinda to Duminy,2 runs,full on off stump, drilled past Virat at mid-off but he hares after it and keeps it to a couple",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Dinda to Duminy, $$SIX$$ ,misses the mark with his length and Duminy gets under it and smacks it beyond the long-off boundary. So clean",
        "isHighlight": true
      },
      {
        "ball": "17.3",
        "text": "Dinda to Duminy, $$FOUR$$ ,cleared his front leg away to whip the fuller delivery on leg stump away to the square leg boundary. Such quick hands and that's his fifty as well",
        "isHighlight": true
      },
      {
        "ball": "17.4",
        "text": "Dinda to Duminy,1 run,switches to a slower pace as he goes for the offcutter outside off, Duminy goes back and cuts to deep point",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Dinda to Taylor,no run,that's better. He gets his yorker right and it's quick enough to beat Taylor's lash outside off stump",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Dinda to Taylor,1 run,goes for the slower ball and it ends up a low full toss, Taylor steers it to deep point",
        "isHighlight": false
      },
      {
        "ball": "18.1",
        "text": "Starc to Taylor,no run,heaves down the wrong line and misses out on a length delivery. Starc better be a lot fuller or a lot shorter than that",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Starc to Taylor, $$FOUR$$ ,blindly swings again and this time he gets the benefit of a thick outside edge that scurries away to the third man boundary. That was the offcutter and it did deceive the batsman",
        "isHighlight": true
      },
      {
        "ball": "18.3",
        "text": "Starc to Taylor,no run,knows Taylor was setting up for the fuller ball and gives him a short one. Isn't able to adjust and misses on the pull shot. Kicks the turf in disgust",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Starc to Taylor, $$FOUR$$ ,another slower ball as he rolls his fingers down the side of the ball. Taylor plants his front foot down the line and goes for that big golf swing again. Another outside edge, another third man boundary. Starc throws his head back",
        "isHighlight": true
      },
      {
        "ball": "18.5",
        "text": "Starc to Taylor,1 run,swiped away into the leg side as this is fullish on middle and leg",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Starc to Duminy, $$FOUR$$ ,there were two before it but this is the first one off the middle. Clears his front leg to lash a fullish delivery over the head of Kohli at mid-off",
        "isHighlight": true
      },
      {
        "ball": "19.1",
        "text": "Dinda to Taylor, $$FOUR$$ ,starts off with a full toss that is way too wide to become anything but a boundary through point. Taylor had to reach for it but he did manage to connect it well enough to beat the boundary rider",
        "isHighlight": true
      },
      {
        "ball": "19.2",
        "text": "Dinda to Taylor,2 runs,full and outside off again as Taylor lashes it right through Yuvi at backward point. But third man mops up",
        "isHighlight": false
      },
      {
        "ball": "19.3",
        "text": "Dinda to Taylor,no run,he's disgusted with himself after missing out on that. Smacks his pad with the bat as this full length ball that was asking to be smashed out of the ground ends up not even getting an edge",
        "isHighlight": false
      },
      {
        "ball": "19.4",
        "text": "Dinda to Taylor,1 run,wide yorker drilled down the ground to bring up the hundred partnership",
        "isHighlight": true
      },
      {
        "ball": "19.5",
        "text": "Dinda to Duminy, $$SIX$$ ,mauled into the crowd behind deep midwicket! It was the slower ball and he'd picked it early and though the bat turned in his hands, it sailed past the ropes",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "Dinda to Duminy, $$FOUR$$ ,deep midwicket has a chance this time but Maddinson has rushed in too much and makes a mess of what should have been a simple catch. Low full toss on middle and Duminy hoicked it off the front foot and gets a boundary for his trouble",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "$$8.15$$ $$pm$$  It was all Bangalore in the first six-seven overs but Delhi hung in there and exploded in the final overs. JP Duminy provided the momentum and his 67 off 48 has set up a \"competitive total\" according to him. There were a couple of gaffes in the field in the final two overs and Ashok Dinda leaked over 50 in his spell",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "\"Unfortunate to lose as many wickets at the top,\" says Duminy, \"After 10 overs we knew we can get around to 140. Definitely competitive. It's a two-paced pitch, new ball had variable bounce. First six overs is key. Hopefully I can make a dent too\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "\"They got away from us a bit in the last four overs,\" Albie Morkel said. \"It's a bit slow and it's tough to play aggressive shots. [Strong top six but] We're gonna have to bat well. We still have to get those runs, swing with the new ball and if we can get through that and build a foundation.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "greecedevil: \"and that's half centuries for Duminy and Dinda!!! Kohli will not be a good captain. Aaron and Albie did not finish their quotas even when they are much better than Dinda.\"",
        "isHighlight": false
      }
    ],
    "innings": "Delhi Daredevils  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2014/engine/match/729281.html?innings=2;view=commentary",
    "commentary": [
      {
        "ball": 0,
        "text": "Here come Banglaore's openers. Parthiv Patel and Nic Maddinson, sporting a Draco Malfoy hairstyle.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "JP Duminy to bowl, getting the ball to spin away to the left-handers",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Duminy to Patel,no run,length ball is pushed back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Duminy to Patel,no run,looking to push this towards mid-on, misses and is hit on the pads, that was sliding down",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Duminy to Patel,no run,pushed towards cover this time",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Duminy to Patel,1 run,first run for Bangalore, steered towards cover",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "Duminy to Maddinson, $$FOUR$$ ,Maddinson has a reputation for being a hitter, he starts off his innings by skipping down and launching the ball over the off side, in front of point  for four",
        "isHighlight": true
      },
      {
        "ball": "0.6",
        "text": "Duminy to Maddinson,no run,blocked off the back foot towards point",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Ashok Dinda not the most popular man among Cricinfo readers at the moment.",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Mohammed Shami to Patel,1 run,short of length ball from Shami, nurdles the ball towards square leg for a single",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Mohammed Shami to Maddinson,no run,cramps up Maddinson, back of length once more, Maddinson squirts that away to the leg side",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Mohammed Shami to Maddinson,no run,beaten outside off, great line there, bounce as well as he drops it a touch shorter",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Idrees Kanchwal: \"Dinda clearly must be getting more tweets now than even kohli \"",
        "isHighlight": false
      },
      {
        "ball": "1.4",
        "text": "Mohammed Shami to Maddinson,no run,again not given much room for Maddinson, following him on legstump, defended",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Mohammed Shami to Maddinson, $$OUT$$ ,there's the first wicket for Delhi, a shortish ball down the leg side, wasn't the most threatening delivery, Maddinson wanted to pull that away, can only glove it away, easy catch for the keeper",
        "isHighlight": true
      },
      {
        "ball": "1.5",
        "text": "$$NJ$$ $$Maddinson$$ $$c$$ $$†Karthik$$ $$b$$ $$Mohammed$$ $$Shami$$ $$4$$ $$(6m$$ $$6b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$66.66$$",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Here's Kohli",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Mohammed Shami to Kohli, $$FOUR$$ ,great effort from the keeper Karthik there, flinging himself to his left to nearly grab that one off Kohli, who just glanced that leg-side delivery",
        "isHighlight": true
      },
      {
        "ball": "2.1",
        "text": "Parnell to Patel,no run,short of length ball outside off, defended towards point",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Parnell to Patel,2 runs,drops it shorter, defended for a single, and there is amisfield as there's some awkward bounce for Mayank Agarwal",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "Parnell to Patel, $$FOUR$$ ,this is a shot Parthiv plays well, the ball is dropped short by Parnell, Parthiv is quickly onto it, pulling it away in front of midwicket for four",
        "isHighlight": true
      },
      {
        "ball": "2.4",
        "text": "Parnell to Patel,no run,Parthiv defends this one",
        "isHighlight": false
      },
      {
        "ball": "2.5",
        "text": "Parnell to Patel,no run,a yorker from Parnell, 140.4kph, Parthiv gets his bat down in time to keep that one out",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Parnell to Patel,1 run,this time the pull doesn't quite work, a bottom edge onto the body as he throws his bat at that one",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Mohammed Shami to Patel,no run,140kph, just too much pace. Angles a bouncer across him and Parthiv looks to drag it into the leg side with a pull. Comfortably beaten",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Mohammed Shami to Patel,no run,his shot selection is better this time but Shami manages a bit of seam away from this back of a length delivery and beats him again",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Mohammed Shami to Patel,1 wide,I though that hit the thigh pad but the umpire reckons there was no contact. Back of a length down the leg side. He goes for the flick and has no success connecting",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Mohammed Shami to Patel,2 runs,this one doesn't rise and Parthiv latches onto a pull to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Abhishek Jayswa: \"Not popular?? Dinda is favorite bowler of all Delhi supporters.\"",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Mohammed Shami to Patel,no run,139kph, another terrific bouncer! Parthiv continues taking it his hook shot had no chance of connecting. Little question asked but he hadn't touched that",
        "isHighlight": true
      },
      {
        "ball": "3.5",
        "text": "Mohammed Shami to Patel, $$FOUR$$ ,what a response! Charges him and pummels the fuller delivery to the long-on boundary.",
        "isHighlight": true
      },
      {
        "ball": "3.6",
        "text": "Mohammed Shami to Patel, $$FOUR$$ ,goes down again and it made an awkward clink as it struck the bat on the splice. Just about clears a back-pedaling mid-off and scurries away",
        "isHighlight": true
      },
      {
        "ball": "4.1",
        "text": "Parnell to Kohli,no run,fullish and around the off stump, defended off the front foot",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "slip in place for Kohli",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Parnell to Kohli,no run,gets back in line with the shortish ball and flicks to midwicket",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Parnell to Kohli,no run,hint of seam away and Kohli has to check his back-foot punch into the covers",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Parnell to Kohli, $$FOUR$$ ,full and angled across him, Kohli swings from the crease and gets a thick outside edge that flies away to the third man boundary, despite Rahul Sharma's tumbling effort",
        "isHighlight": true
      },
      {
        "ball": "4.5",
        "text": "Parnell to Kohli,1 run,143kph, shortish and angled across him, Kohli looks to steer it down to third man but bottom edges it. The non-striker sees the ball going into a gap behind the wickets and rushes up for a single",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Parnell to Patel, $$FOUR$$ ,spots the batsman charging and digs it in short, but makes the mistake of bowling wide. Parthiv slaps it over point. Thumping boundary",
        "isHighlight": true
      },
      {
        "ball": "4.6",
        "text": "Shahbaz Nadeem is into the attack, with the beginnings of a Hashim Amla beard",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "anshu: \"Patel has habit of getting out on leg spinner often trying big shots, Rahul Sharma has good chance against him and Kohli too as pitch is double paced\"",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Nadeem to Kohli,1 run,flat delivery to start off and Kohli stays on the back foot and pushes to long-off",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Nadeem to Patel, $$SIX$$ ,bowls a terrible long hop and Parthiv shuffles across and mauls it miles into the square leg boundary. Kohli enjoyed that. Smacked it out of the ground and we need a new ball",
        "isHighlight": true
      },
      {
        "ball": "5.3",
        "text": "Nadeem to Patel,no run,he was moving outside off again and Nadeem follows him with a fuller delivery. The slash doesn't beat point",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Nadeem to Patel, $$FOUR$$ ,pulls out the sweep and it's timed extremely well. He's not bothered with keeping the ball down and why should he when he hits it in the gap",
        "isHighlight": true
      },
      {
        "ball": "5.5",
        "text": "Nadeem to Patel,1 run,pushed through on off stump as Parthiv taps it into the covers and goes to the other end",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Nadeem to Kohli,1 run,flighted on off stump, Kohli calmly pushes it to long-on to raise his team's fifty. That's also the strategic time-out",
        "isHighlight": true
      },
      {
        "ball": "5.6",
        "text": "Inu Mhase: \"I wanted to see Gayle and Patel opening the batting today.. Interesting to see how the 2 guys with exactly opposite postures looks at the crease.. Would Patel be visible??\" Here's Duminy from around the stumps",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Duminy to Kohli,no run,goes on with the arm as Kohli taps it to backward point",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Duminy to Kohli,no run,shimmies down the pitch but he pulls the length back and Kohli can only nudge it to square leg",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Yuvi's waiting under the helmet",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Duminy to Kohli,2 runs,a little too straight with a good length ball and Kohli clips it away to long leg",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Duminy to Kohli,1 run,flatter delivery on middle and off, Kohli's wrists though work the ball to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Duminy to Patel,1 run,judges the ball to be short and he waits on the back foot before whipping it down to long-on",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Duminy to Kohli,1 run,punched to the right of long-on as they milk the offspinner",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Nadeem to Kohli,no run,flights outside off and gets a bit of turn off this deck. Kohli is lured into poking at it and it goes down to point",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Nadeem to Kohli,no run,comes down the track and thumps it into the covers",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Nadeem to Kohli,2 runs,skids in with the arm, but it had started short and Kohli slaps it away to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Nadeem to Kohli,1 run,flighted on middle but he had come down the track and made room for himself to drive to long-off",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "rahul: \"@Inu Mhase: Haven't you seen Patel and Hayden batted together when opening together for Chennai:)\"",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Nadeem to Patel,no run,clears his front leg to chop this short ball on middle into the covers",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Nadeem to Patel,1 wide,terrible delivery as he bowls it flat and well down the leg side. Parthiv looks to help it away, but doesn't succeed",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Nadeem to Patel,1 run,he almost falls over in his attempt to make room. So much effort into his shots and it only ends up a single to long-off as he flat-bats the short ball",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Rahul Sharma's legspinners now",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Sharma to Patel,no run,goes for a big appeal as he sweeps across the line of a good length ball. But the impact was outside off",
        "isHighlight": true
      },
      {
        "ball": "8.2",
        "text": "Sharma to Patel,1 run",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Sharma to Kohli,no run,tossed up on off stump, Kohli lunges forward and blocks into the covers",
        "isHighlight": false
      },
      {
        "ball": "8.4",
        "text": "Sharma to Kohli,1 run,makes room outside leg as he advances and drills the shortish ball through the covers",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Sharma to Patel, $$OUT$$ ,races blindly down the track and goes for a hack across the line. The ball, a simple one on a good length, sneaks between bat and pad and rattles into off stump",
        "isHighlight": true
      },
      {
        "ball": "8.5",
        "text": "$$PA$$ $$Patel$$ $$b$$ $$Sharma$$ $$37$$ $$(39m$$ $$28b$$ $$5x4$$ $$1x6)$$ $$SR:$$ $$132.14$$",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "It's Yuvi and Kohli at the crease again",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Sharma to Yuvraj Singh,1 run,gets a bit of turn as he pushes the batsman back in his crease. Flicked to long leg",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Harish: \"Patel has been doing the same thing ever since he played for India when he was 17 . Hit few great shots , get into the twenties or thirties , get out . That's why he has'nt lived that much in our hearts neither in the team . \"",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Pace against Yuvi, Shami's back",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Mohammed Shami to Yuvraj Singh,no run,predictably its the short ball on middle and off stump. Yuvi has to jump off his feet and drop it at his feet with soft hands",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Mohammed Shami to Yuvraj Singh,1 wide,short delivery that is just a shade down the leg side. That's rather harsh as the ball sailed over his hips as he was a little cramped up while playing the pull",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Mohammed Shami to Yuvraj Singh, $$FOUR$$ ,that was a snorter of a bouncer. The eyes came off the ball and he was mostly taking evasive action when the bat sort or jutted out and the top edge was taken to run away to the boundary at long leg",
        "isHighlight": true
      },
      {
        "ball": "9.3",
        "text": "Mohammed Shami to Yuvraj Singh,no run,goes fullish on leg stump and Yuvi is rooted to the crease as he blocks",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Mohammed Shami to Yuvraj Singh,1 run,stands and hoicks and the bat turns in his hands and he skies the ball over the slips. Taylor ran back but couldn't get under it",
        "isHighlight": true
      },
      {
        "ball": "9.5",
        "text": "Mohammed Shami to Kohli,no run,rock-solid forward defensive from Kohli at the other end",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Mohammed Shami to Kohli,no run,fullish on off stump, he goes forward and blocks into the covers. Searches for the single to keep strike but Yuvi says no",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Sharma to Yuvraj Singh, $$SIX$$ ,away she goes. Flat, hard and just over the ropes. Sharma flighted it on leg stump and he swung for the fences",
        "isHighlight": true
      },
      {
        "ball": "10.2",
        "text": "Sharma to Yuvraj Singh,1 run,blazed down the ground! Another one that's flighted on off stump and it was struck with considerable disdain. Vijay had to pull out a top effort to stop that. Kohli was in trouble of being beheaded there",
        "isHighlight": true
      },
      {
        "ball": "10.3",
        "text": "Sharma to Kohli,1 run,full toss on off stump, Kohli flicks to deep midwicket. Took the toe end there",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Sharma to Yuvraj Singh,no run,strides down the wicket to block the flighted delivery that is pushed across him",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Sharma to Yuvraj Singh,1 run,charges him again and he yorks himself. Jams the bat down on the ball and collects a single to point",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Sharma to Kohli,1 run,tapped away through the covers. Sharma tries to toss this up outside Kohli's reach as he was advancing but it was easily controlled",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Jimmy Neesham takes over from Shami",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Neesham to Kohli,1 run,skips down the track and thumps it down to long-off. The bat turns in his hands, Kohli's timing hasn't been all that impressive in this innings",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Yuvraj is surveying the field. Deep backwards square leg and Long-off are back",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Neesham to Yuvraj Singh,no run,looks to ramp it to third man as he waits for the short ball, but does it a second longer. Not pleased with himself",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Neesham to Yuvraj Singh, $$FOUR$$ ,that sat up for Yuvi and he's walloped it to the square leg boundary. Neesh bowls waist-high short ball and it was the slower one as well. Comfortably dispatched. The ball seems to have caught the cables of the spider-cam and usually it provides grounds for a dead ball, but the umpires give a little leeway",
        "isHighlight": true
      },
      {
        "ball": "11.4",
        "text": "Neesham to Yuvraj Singh,no run,comes down the track and carves a full and wide delivery to point",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Neesham to Yuvraj Singh,1 run,another back of the hand slower ball which Yuvi steers behind point and Kohli scurries through for a quick single",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Neesham to Kohli,1 run,big ol full toss and Kohli has calmly slapped it away to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Rajat: \"Yuvi is best when he is trying to behead the partner at other end. Hopefully I don't jinx him :)\" He seems to be getting that swing back, yes. Except Shami's pace troubled him big time. Anyway, it's Wayne Parnell now",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Parnell to Kohli,1 run,that's a dolly and he's  $$dropped$$  it at short fine leg! Neesham, what have you done?! Clipped uppishly but straight to the man, at abound waist high and at a very comfortable pace coming at him. But it pops in and then pops out",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "Parnell to Yuvraj Singh,no run,stays back to steer the good length ball behind point",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Parnell to Yuvraj Singh,no run",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Parnell to Yuvraj Singh,1 run,bit of room on offer and he essays a late cut to find deep third man",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Amit: \"Surely Shami had to stay on there and try to finish Yuvraj off. Karthik can't afford to take this down to the last over - not enough runs to play with.\"",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Parnell to Kohli,no run,skips down the track but the ball seems to stop on the pitch before reaching him. Gets hit high on the bat as he pushes into the covers. Fell not too far away from the fielder either",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Parnell to Kohli,1 run,another  $$drop$$  and it's Agarwal in the square boundary on the off side. Raced down the track and slapped a short ball hard and flat. the fielder had to run in and come forward but he spills it",
        "isHighlight": true
      },
      {
        "ball": "13.1",
        "text": "Neesham to Kohli, $$SIX$$ ,do not drop me, says Kohli with a punishing six over extra cover. Overpitched outside off and he waded into the shot and timed it perfectly",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Neesham to Kohli,1 run,whipped away into the leg side as those strong wrists take over",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Neesham to Yuvraj Singh,1 run,waist-high full toss and Yuvi swipes it away to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Neesham to Kohli,no run,outside edge off the slower ball outside off. Tries to steer it down to third man but it bounces short of the keeper",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Salman1508: \"Is Kohli trying to be Yuvi here? \"",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Neesham to Kohli,1 run,full on off stump, Kohli drills it down to long-on",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Neesham to Yuvraj Singh, $$SIX$$ ,fullish and outside leg stump and Yuvi's helped it on its way. Lands among the Bangalore players in the dug out and he has a big smile on his face while punching gloves with his captain",
        "isHighlight": true
      },
      {
        "ball": "13.6",
        "text": "Rahul Sharma's back",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Sharma to Kohli, $$SIX$$ ,and he's sent packing over long-on. Races down and gets to the pitch. Doesn't bother about how it's going to turn and just launches it into the night sky",
        "isHighlight": true
      },
      {
        "ball": "14.2",
        "text": "Sharma to Kohli, $$SIX$$ ,this one is hit with the turn and he's raises the fifty partnership with a glorious shot over extra cover. Didn't get to the pitch as much as the last ball and had to sort of reach for it, but his timing was still top-notch",
        "isHighlight": true
      },
      {
        "ball": "14.3",
        "text": "Sharma to Kohli,1 run,stays back as he knows this will be flatter and clips it to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Sharma to Yuvraj Singh, $$SIX$$ ,drags it short as he fears Yuvi's trip down the track. But it was such a long hop that he has time to pull it to the long leg boundary",
        "isHighlight": true
      },
      {
        "ball": "14.5",
        "text": "Sharma to Yuvraj Singh,no run,backs away to the flatter ball outside off and chops it to cover",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Sharma to Yuvraj Singh,1 run,short again but this was just a touch quicker and Yuvi pulls to long-on. That is now the strategic time out",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Harshal: \"@Salman. Maybe, but even when Kohli's not in good nick, he's still going at better than a run a ball.\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Jude: \"In the space of 2 overs RR came down from 8.1 to 4.4. Remarkable effort and game lost the balance well behind\" Prompts Shami to come back into the attack",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Mohammed Shami to Yuvraj Singh,1 run,slower ball outside off, Yuvi waits for it and thumps it to deep cover",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Mohammed Shami to Kohli,1 run,overpitched outside off, Kohli's flashing blade gives work for the sweeper",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Mohammed Shami to Yuvraj Singh,no run,slower short ball and he's deceived Yuvi. Set up for the pull shot and then realises it was not coming on and just lets it through to the keeper",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Mohammed Shami to Yuvraj Singh,no run,spears it in on middle and he was looking to clip to midwicket. Gets a leading edge to point. Squared Yuvi up there. Shami's been brilliant today",
        "isHighlight": true
      },
      {
        "ball": "15.5",
        "text": "Mohammed Shami to Yuvraj Singh,no run,another slower bouncer and though Yuvi goes through with the shot this time he has trouble connecting",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Mohammed Shami to Yuvraj Singh, $$SIX$$ ,long-on watches it clear his head and thud into the advertising boards. Pitches it up in his arc and Yuvi's big back lift comes down in a thunderous swing",
        "isHighlight": true
      },
      {
        "ball": "15.6",
        "text": "sree: \"Karthik has a lot to learn as captain. When you have Kohli and Yuvi batting with 58 needed off 45 balls, you go for wickets, not for economy. economy doesn't work on these guys!\"",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Nadeem to Kohli,1 run,low full toss to start his spell and Kohli drives to long-on",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Nadeem to Yuvraj Singh, $$SIX$$ ,terrible line from Nadeem. On the pads and he's swept him miles into the boundary behind square leg. Yuvi against this kind of spin is no contest at all.",
        "isHighlight": true
      },
      {
        "ball": "16.3",
        "text": "Nadeem to Yuvraj Singh,(no ball)  $$FOUR$$ ,that's a full toss over the waist and he has pulled it over short find leg to take him to his fifty on Bangalore debut",
        "isHighlight": true
      },
      {
        "ball": "16.3",
        "text": "Nadeem to Yuvraj Singh,1 run,flighted on off stump, he lunges forward to block and picks up a single square on the off side",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Nadeem to Kohli,1 run,races down the track and lofts it down towards long-on. Falls short of Vijay who was diving forward. They pick up the runs needed to pick up the victory and a very comprehensive one at that",
        "isHighlight": true
      },
      {
        "ball": "16.4",
        "text": "That's this game done and dusted. Tomorrow is a double header, so join us at 4 pm as the caravan continues gathering momentum. This is Alagappan Muthu, happy to type my last word tonight",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "$$Yuzvendra$$ $$Chahal$$ $$is$$ $$Man$$ $$of$$ $$the$$ $$Match$$  \"Its my second match in the IPL, I played one for Mumbai. I got confidence seeing the first ball turn. It is great to have the support of the captain Kohli, choosing me as the spinner over a player like Murali in the squad\"",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "\"That's what I was telling Yuvi in the middle, if those were mis-hits they wouldn't have gone to hand\" Virat Kohli says. \"It was a 170-plus track and to hold them down to 145 was big. Chahal did extremely well, Varun as well and Mitch too. [Yuvraj]He's won us two world cups, he's a proven match-winner and it's important to back a player like that.\"",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "\"Didn't bat well enough though Taylor and Duminy had a great partnership,\" says  $$Dinesh$$ $$Karthik$$ , the stand-in captain for Delhi. \"They batted well, kept playing their shots, came off, bad fielding. It looks like that when the opponent is hammering you. It's the first game of the season and we're getting used to who performs which role and it's important for us to learn and come back in the next game. Duminy absorbed the pressure brilliantly and hit some lusty blows at the end\"",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "\"About 90% runs of Yuvi came off bad deliveries today. I missed those sweet cover drives and classy late cuts off good deliveries that find the boundary more often than not.\" Those might not be too far off, Sahil",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "$$9.45$$ $$pm$$  Kohli jumps on Yuvi as they walk back to the pavilion savouring a job well done. Their bowlers set things up by blasting out the Delhi top order. They stuck in there when Duminy and Taylor were building that partnership and in the chase Yuvraj Singh found form with 52 off 29. He was treated to some terrible bowling and he took complete advantage",
        "isHighlight": false
      }
    ],
    "name": "Delhi Daredevils v Royal Challengers Bangalore",
    "innings": "Royal Challengers Bangalore  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598008.html?innings=1;view=commentary",
    "name": "Royal Challengers Bangalore v Kolkata Knight Riders",
    "commentary": [
      {
        "ball": 0,
        "text": "Gambhir and Bisla to open. Henriques has the new ball",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Follow this game on our new-age social scorecard. The  $$ESPNcricinfo$$ $$Match$$ $$Companion$$  is the only platform where cricket meets social media.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$3.30$$ $$pm$$ $$Kohli$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$RCB$$ $$will$$ $$bowl$$",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Kohli says RCB want to make use of some grass on the pitch and feels it will settle down later in the evening.  $$KL$$ $$Rahul$$ , the young Karnataka batsman, comes in for left-arm spinner Murali Kartik, indicating how Kohli expects the pitch to play",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Two, in fact, three changes for KKR. Pradeep Sangwan is in for Laxmi Ratan Shukla. Brett Lee makes way for Ryan McLaren. Indian fast bowler in for Indian allrounder, overseas fast bowler out for overseas allrounder. And Balaji takes his place back from Shami Ahmed",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Matt: \"Why, why why is BMac not playing? I thought KKR had batting issues...\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Siddarth: \"So now we have the bowling mentor(lee) sitting out with his disciples playing.. see the IPL can do strange things :)\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$3.15$$ $$pm$$  Hello, hello, another double header today, the first one in Bangalore, the second in Pune.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "RCB's season so far - a close win, a close defeat, and a thrashing of Sunrisers. KKR's season so far - a comprehensive win followed by a comprehensive defeat. Here's what Gautam Gambhir  $$has$$ $$to$$ $$say$$ . Also here is that keen blogger Ryan ten Doeschate on how  $$the$$ $$KKR$$ $$support$$ $$staff$$  get the side through the maddening schedule of the IPL.",
        "isHighlight": true
      },
      {
        "ball": 0,
        "text": "Pariksheet: \"Going by the law of average, Virat Kohli won't be among the runs today. That leaves Gayle to be the obvious choice for my Fantasy team captain.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Ahmad: \"Ryan ten Doeschate is paying the price of not being a star or from a leading test playing nation. About time he gets a go in this IPL , KKR dont want to be in a position , later in the tournament , where they require players who have only been warming benches.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "----------------------------------------------------------------------- We are back to where it all began. RCB v KKR at the Chinnaswamy. Anyone remember the stunning  $$Game$$ $$1$$ $$of$$ $$the$$ $$first$$ $$ever$$ $$IPL$$ , when Brendon McCullum went bonkers in Bangalore?",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "McCullum has joined the KKR line-up in time for this game. Can he help them turn it around today? Here's  $$the$$ $$preview$$  to the game.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "In case McCullum plays, you might want to have him in your  $$Fantasy$$ $$XI$$ . There are daily prizes to be won, so who knows. Make your Fantasy changes now, for both matches today. Reckon KKR can stop RCB in their tracks?  $$Predict$$  the results of the IPL games, and get in line for some really cool prizes.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "While you wait for the game to start... Ever seen a cricket match being played on a railway track? Check out our fan gallery on  $$The$$ $$Stands$$ . You could have your cricket pictures featured here too.  $$Here's$$ $$how$$ .",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Henriques to Bisla,no run,swinging away very full, around off, patted away softly",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Henriques to Bisla,1 wide,angled down the leg side on a good length",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Wide slip",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Henriques to Bisla,no run,flashes at a pitched up outswinger widish outside off and is beaten",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Henriques to Bisla,no run,angled in to off now, fullish and straightening, he eases it towards mid off",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Henriques to Bisla,1 run,pushes a length ball softly from the crease, it rolls on the pitch towards leg, Henriques after it, Gambhir after the run, they collide, Gambhir makes it, and exchanges a cold stare with the bowler",
        "isHighlight": true
      },
      {
        "ball": "0.5",
        "text": "Henriques to Gambhir,1 run,short and into the body, hooked confidently to deep square",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "More words between Gambhir and Henriques",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Henriques to Bisla, $$OUT$$ ,the Henriques move works for RCB, he strikes first over, short outside off,  Bisla on his toes to try and cut it, spoons it to point, it is dying in front of him, he tumbles to take it",
        "isHighlight": true
      },
      {
        "ball": "0.6",
        "text": "$$MS$$ $$Bisla$$ $$c$$ $$Rahul$$ $$b$$ $$Henriques$$ $$1$$ $$(4m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$20.00$$",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "RP Singh",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Singh to Gambhir,no run,banged in short as Gambhir comes out right away, he adjusts to push it to off",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Singh to Gambhir,no run,short again, Gambhir cannot time the cut, too much bounce, Kohli charges across from cover, Gambhir wants the single and is halfway down the pitch, Kallis sends his back, Gambhir had no chance had Kohli's throw hit, but the fielder was off balance and got rid of the ball too soon",
        "isHighlight": true
      },
      {
        "ball": "1.3",
        "text": "Singh to Gambhir,no run,turned to square leg, again Gambhir is rather eager to take the run, not getting it",
        "isHighlight": false
      },
      {
        "ball": "1.4",
        "text": "Singh to Gambhir, $$FOUR$$ ,short again, and now Gambhir is ready to crack it past cover",
        "isHighlight": true
      },
      {
        "ball": "1.5",
        "text": "Singh to Gambhir,2 runs,almost plays on a flail to a back of a length ball outside off, rolls past the keeper who is not able to stop it",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Singh to Gambhir, $$FOUR$$ ,shot! Gambhir's come out and lofted this cleanly and powerfully over extra cover's jump",
        "isHighlight": true
      },
      {
        "ball": "1.6",
        "text": "vibhash: \"Not sure if Kohli was trying to hit stumps or Gambhir on that throw. His missed Gambhir with a lesser distance than the stumps.\"",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Henriques to Kallis,no run,shortish and swinging away, lots of bounce, left alone",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Henriques to Kallis,no run,stifled appeal for lbw as Kallis misses the whip to leg and is hit on the pad",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Henriques to Kallis,1 run,this time he connects with a very full one on the pads and sends it to fine leg",
        "isHighlight": false
      },
      {
        "ball": "2.4",
        "text": "Henriques to Gambhir, $$FOUR$$ ,nice, on the pads again, and Gambhir picks it elegantly off middle and leg, and sends it racing in the air through midwicket",
        "isHighlight": true
      },
      {
        "ball": "2.5",
        "text": "Henriques to Gambhir,no run,shortish, outside off, attempted dab from Gambhir, and he's beaten",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Henriques to Gambhir,2 runs,waits a touch and runs a length ball wide of third man, Murali tries to stop the ball with his foot, slight fumble and they take two",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Unadkat",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Unadkat to Kallis,no run,pitched up, around off, driven to extra cover",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Unadkat to Kallis,no run,wider, Kallis goes harder at it, mishits the drive to mid off",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Unadkat to Kallis,no run,slower one from Unadkat now, Kallis surprised, starts to go for the drive, then tries to run it fine in the end, misses",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Unadkat to Kallis, $$FOUR$$ ,Kallis is let off, he was getting impatient, mishit a slog to midwicket, Kohli went for the non-striker's stumps, missed and there was no one backing up, Unadkat can;t even let out his frustration",
        "isHighlight": true
      },
      {
        "ball": "3.5",
        "text": "Unadkat to Kallis,no run,beaten again outside off with one angled slowly across",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Unadkat to Kallis,1 run,walks out now, tries to work it to leg, gets a leading edge to covers for a tight single",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Henriques to Kallis,no run",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Henriques to Kallis,no run,this time he times the straight drive well, but Henriques gets the right foot across in time even as he falls over",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Henriques to Kallis, $$FOUR$$ ,no stopping this, Kallis moves out and towards leg, creates space and lifts a length ball over the bowler",
        "isHighlight": true
      },
      {
        "ball": "4.4",
        "text": "Henriques to Kallis,1 run,chops a length ball down to third man",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Henriques to Gambhir,no run,tries to come down and go through the off side, can;t connect with a length ball close to off",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Henriques to Gambhir,1 run,this came in from outside off, he guides it to third man",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Alabhya: \"Kallis is looking off-colour yet again. KKR needs his solidity for middle order to perform.\"",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Muralitharan comes on",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Muralitharan to Gambhir, $$FOUR$$ ,comes down right away, tossed up delivery, he takes it on the full and puts it away through extra cover",
        "isHighlight": true
      },
      {
        "ball": "5.2",
        "text": "Muralitharan to Gambhir,1 no ball,tries to sweep one angled in full, misses, no-ball signalled, free hit coming up, that is a big no ball",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Muralitharan to Gambhir, $$FOUR$$ ,Gambhir bends the knee and heaves from outside off, and gets enough connection to hit it over mid on",
        "isHighlight": true
      },
      {
        "ball": "5.3",
        "text": "Muralitharan to Gambhir,1 run,Gambhir flowing as always against spin, goes back and across and nudges off the pads to square leg",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Muralitharan to Kallis,1 run,spins in sharply from outside off, Kallis nudges it behind square, short fine leg throws it to the keeper, who breaks the stumps but the ball is out of his hand, Gambhir would have made it anyway",
        "isHighlight": true
      },
      {
        "ball": "5.5",
        "text": "Muralitharan to Gambhir,no run",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Muralitharan to Gambhir,2 runs,that hurried into the left-hander with the angle, he went back to drag a pull in the air over square leg, Gambhir has to dive in for the second, better throw would have had him in trouble, it was a wide one",
        "isHighlight": true
      },
      {
        "ball": "5.6",
        "text": "Ram: \"GG reaches 30+, gets out playing a rash shot. This seems to be the general trend. Will he change it this time around?\"",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Vinay Kumar on",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Vinay Kumar to Kallis,1 run,good length just outside off, dabbed to third man",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "round the stumps",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Vinay Kumar to Gambhir,no run,tries to pull a short and wide one outside off, misses",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Vinay Kumar to Gambhir,no run,he's eyeing the leg side, turns it from outside off to midwicket, falls short of Gayle tumbling to his right",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Vinay Kumar to Gambhir,no run,beaten now as he flashes to a length ball outside off",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Vinay Kumar to Gambhir,1 run,slices a pitched up delivery down to third man",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Vinay Kumar to Kallis,1 run,length ball on off and middle, pushed down to long on",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Carlos: \"Kohli is too aggressive to be dhoni's successor...May be 20/20 and ODI but test matches no way......way tooo aggressive\"",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Muralitharan to Kallis,1 run,eases a tossed up ball to long on",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Muralitharan to Gambhir,1 run,shortish and angled in, pulled to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Muralitharan to Kallis,1 run,swept from outside off, but straight to deep square",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Muralitharan to Gambhir,no run,comes down the track, tries to push to off, off the inner part of the bat to the bowler",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Muralitharan to Gambhir, $$FOUR$$ ,tossed up on middle, slogged hard, slogged cleanly to the deep midwicket boundary",
        "isHighlight": true
      },
      {
        "ball": "7.6",
        "text": "Muralitharan to Gambhir,no run,well played in the end, goes back to a length ball and cuts from close to off, diving stop at backward point by AB",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Vinay Kumar to Kallis, $$OUT$$ ,Kallis has picked out sweeper cover, he was struggling to time them, comes out, backing away towards leg, and swings hard, straight into the hands of the fielder",
        "isHighlight": true
      },
      {
        "ball": "8.1",
        "text": "$$JH$$ $$Kallis$$ $$c$$ $$Henriques$$ $$b$$ $$Vinay$$ $$Kumar$$ $$16$$ $$(29m$$ $$19b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$84.21$$",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Abhishek: \"Seems like Murali's powers are waning.It's time for RCB to give Vettori a go.He can be useful with the bat too!!!\"",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "Vinay Kumar to Gambhir,1 run,dropped softly behind square on off for a quick single",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Vinay Kumar to Pathan, $$FOUR$$ ,he's lifted his first ball over the bowler for four, pitched up, he plonks front foot and goes through with the swing, easy",
        "isHighlight": false
      },
      {
        "ball": "8.4",
        "text": "Vinay Kumar to Pathan, $$FOUR$$ ,powerful cut, widish from Vinay and YK's flashed it past backward point's dive",
        "isHighlight": true
      },
      {
        "ball": "8.5",
        "text": "Vinay Kumar to Pathan, $$FOUR$$ ,lovely wrists, YK on fire, short, into the body, but not getting up too much, he swats it behind square even as he swivels, no chance for fine leg",
        "isHighlight": true
      },
      {
        "ball": "8.6",
        "text": "Vinay Kumar to Pathan,1 run,presses right forward to push towards covers for a single",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Sharad Sharma: \"Yusuf! You are not on my fantasy team. Please stop.\"",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Hasan: \"Any deal available today on Yusuf Pathan ?\" All discount sales cancelled on early signs",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Muralitharan to Pathan,1 leg bye,comes forward to a slowly tossed up offspinner and gets it behind square leg, Murali appeals for lbw, that wasn't a bad shout, probably too much angle with the turn",
        "isHighlight": true
      },
      {
        "ball": "9.2",
        "text": "Muralitharan to Gambhir,1 leg bye,goes back outside leg to a tossed up delivery angled in, rolls fine off pad",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Muralitharan to Pathan,1 run,nicely stretching forward to nudge to square leg",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Muralitharan to Gambhir,1 run,goes back again to a length ball and punches to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "9.5",
        "text": "Muralitharan to Pathan,no run,looks to stretch forward, it is flighted fuller, he softly defends onto the pitch",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Muralitharan to Pathan,no run,quicker offbreak nudged to square leg",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "ankur: \"Why is it so that players perform so well when we do not include them in our fantasy team :'( :'(\"",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "RP Singh back",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Singh to Gambhir,1 run,first ball Gambhir walks across and down the pitch, but cannot time the clip off the pad, in the air down to deep square",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Singh to Pathan,no run,yorker, on off stump, patted back to the bowler",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Singh to Pathan,1 run,he gets away, swings hard at a short ball, edge flies over short extra cover and lands at vacant mid off",
        "isHighlight": true
      },
      {
        "ball": "10.4",
        "text": "Singh to Gambhir,1 run,angled in full at leg, he drives it down to long off",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Singh to Pathan,2 runs,hasn;t timed this pull, got it from close to the toe end, still deep square has a lot of ground to cover and has to slide across to stop the boundary",
        "isHighlight": true
      },
      {
        "ball": "10.6",
        "text": "Singh to Pathan,1 run,overpitched just outside off, drilled powerfully down the ground, long off fields",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Unadkat back",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Unadkat to Pathan, $$SIX$$ ,this could be YK's evening, he's picked this length ball casually from off, and it's flown high into the crowd beyond the deep square leg rope",
        "isHighlight": true
      },
      {
        "ball": "11.2",
        "text": "Unadkat to Pathan,1 run,wanted to go big on the leg side again, saw this was slightly shorter and wider, he drops it softly to point",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Unadkat to Gambhir,no run,short, around off, Gambhir tries to reach for it, but misses",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Unadkat to Gambhir,1 run,goes across and runs a back of a length  ball down to third man",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Unadkat to Pathan,1 run,close, very close, pushes off the front foot towards extra cover, Kohli with the one-handed pick-up and lob, misses once again, Yusuf is relieved",
        "isHighlight": true
      },
      {
        "ball": "11.6",
        "text": "Unadkat to Gambhir,1 run,chopped down to third man for one",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Krish: \"If it's Yusuf's evening, it's the death of all the fantasy teams.\"",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Henriques to Gambhir, $$FOUR$$ ,Gambhir shuffles outside off, bends the knee and times the paddle high over square leg",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "Henriques to Gambhir,1 run,across and outside off to try it again, sees it wider outside off and runs it to third man",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Henriques to Pathan,1 run,shortish, not much bounce, swatted wide of deep square, they'll have to settle for one, got to the fielder quickly",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Henriques to Gambhir,1 run,overpitched, around off, mistimes a forcing stroke down to long off",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Nas: \"All these praises for Yusuf is going to make him throw away his wicket\"",
        "isHighlight": true
      },
      {
        "ball": "12.5",
        "text": "Henriques to Pathan, $$OUT$$ ,and YK;s holed out, straight into the hands of long on, slower one, attempted legcutter that's drifted in fullish, he can't resist it and has a go, picks out the man in the deep",
        "isHighlight": true
      },
      {
        "ball": "12.5",
        "text": "$$YK$$ $$Pathan$$ $$c$$ $$Vinay$$ $$Kumar$$ $$b$$ $$Henriques$$ $$27$$ $$(22m$$ $$17b$$ $$3x4$$ $$1x6)$$ $$SR:$$ $$158.82$$",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Some timing, Nas",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Henriques to Tiwary,1 run,runs it wide of backward point for one",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Kartik: \"@Nas: you have a bright future in commentary... what a curse , omg , my captain , sob .....\"",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Darshil: \"@ Nas.. Just gave my board exams.. predict my results too..\"",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Unadkat to Tiwary, $$FOUR$$ ,down the track, ends up slicing it high towards third man, who goes for the catch, tumbles forward, but it bounces in front, fine effort from Vinay",
        "isHighlight": true
      },
      {
        "ball": "13.2",
        "text": "Unadkat to Tiwary,1 run,away to third man again, safely this time",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Unadkat to Gambhir,2 runs,dabbed to the keeper's left, whose throw it way off target at the non-striker's, and they take another",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Unadkat to Gambhir,1 run,back of a length, another guide to third man for a single, that is fifty for Gambhir",
        "isHighlight": true
      },
      {
        "ball": "13.5",
        "text": "Unadkat to Tiwary,1 run,nudges a short one square to leg",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Unadkat to Gambhir,no run,short and quick, he tries a pull and misses",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Sharad Sharma: \"Nas, you get another one out and I will make YOU the captain of my fantasy team :P\"",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Muralitharan to Tiwary, $$FOUR$$ ,he's got four for this, skips out, and chips it awkwardly over extra cover, beats long off running across",
        "isHighlight": true
      },
      {
        "ball": "14.2",
        "text": "Muralitharan to Tiwary,no run,down the track again, finds midwicket now",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "Muralitharan to Tiwary,1 run,goes back, it is angled in, hit in front of square leg",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Muralitharan to Gambhir,1 run,straightens from round the stumps, he runs it wide of short third man",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Muralitharan to Tiwary,1 run,worked to midwicket for one more",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Muralitharan to Gambhir,1 run,mistimes a pull to a length ball, to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Vipin Raghuwanshi: \"Fantasy League teaches us that,\" We have to cling onto something that we think is good enough\". We need to stick to a player we think is good enough to win us some points.\"",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Unadkat to Gambhir,no run,short, wide and moving away, Gambhir misses the cut",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Unadkat to Gambhir,1 run,this time he cannot beat Gayle at backward point, but goes through for one",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Unadkat to Tiwary,2 runs,neat stop from Agarwal at fine leg, Tiwary top-edging a swat, bounces and is about to go over the boundary, Agarwal jumps and slaps it back in",
        "isHighlight": true
      },
      {
        "ball": "15.4",
        "text": "Unadkat to Tiwary,no run",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Unadkat to Tiwary,1 run,down the track, not much timing as he hits it down to long off",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Unadkat to Gambhir, $$SIX$$ ,short and rising, he pulls it from outside off stump and just manages to clear the deep square leg rope",
        "isHighlight": true
      },
      {
        "ball": "15.6",
        "text": "Gambhir having a discussion with umpire Rauf, about whether the short ball was too short",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Vinay Kumar to Tiwary,1 run,steered to third man for a single",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Vinay Kumar to Gambhir, $$OUT$$ ,Gambhir goes, clears front leg and slogs, edge flies high and bowler settled under it",
        "isHighlight": true
      },
      {
        "ball": "16.2",
        "text": "$$G$$ $$Gambhir$$ $$c$$ $$&$$ $$b$$ $$Vinay$$ $$Kumar$$ $$59$$ $$(75m$$ $$46b$$ $$7x4$$ $$1x6)$$ $$SR:$$ $$128.26$$",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Priya: \"YP has been a disappointment for KKR for the price he was bought for, across seasons. Not enough bang for the buck.\"",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "Vinay Kumar to Tiwary,5 runs,overthrows, four of them, second time today, Tiwary helps a short ball on the bounce to short fine leg, from where RP goes for the striker;s end, misses, and there is no one to cut it off in time, Vinay makes it known that the throw should have been to his end, Tiwary would have struggled",
        "isHighlight": true
      },
      {
        "ball": "16.4",
        "text": "Vinay Kumar to Morgan,no run,around the blockhole, patted back to the bowler",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Vinay Kumar to Morgan,no run,and another one in the same spot, Morgan shuffles across but can only squeeze it back",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Vinay Kumar to Morgan,1 leg bye,hit high on the pad as he tries to swing a length ball to square leg",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Yuvaraja: \"Moral of the story: Always have Gambhir and Vinay kumar in your team\"",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Singh to Morgan,2 runs,powers an overpitched delivery over extra cover, hasn;t timed it and long off gets around to it",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Singh to Morgan, $$OUT$$ ,a disappointed Morgan has to go, he's slammed a low full toss from close to the toe end to the substitute Christian at long on",
        "isHighlight": true
      },
      {
        "ball": "17.2",
        "text": "$$EJG$$ $$Morgan$$ $$c$$ $$sub$$ $$(DT$$ $$Christian)$$ $$b$$ $$Singh$$ $$2$$ $$(4m$$ $$5b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$40.00$$",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Timely blow for RCB",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Singh to Tiwary,no run,tries to heave it from wide outside off to square leg and misses by a long way",
        "isHighlight": false
      },
      {
        "ball": "17.4",
        "text": "Singh to Tiwary,1 run,now he's run it straight to point, very full outside off and he cannot beat the fielder",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Singh to Bhatia,1 wide,straight down the leg side on a good length",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Singh to Bhatia,1 run,pushes a high full toss to long on",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Singh to Tiwary, $$OUT$$ ,higher full toss, swung straight to midwicket on the edge of the circle, they check for the no-ball for height, but he's just about okay, KKR losing their way, like the KKR of old used to",
        "isHighlight": true
      },
      {
        "ball": "17.6",
        "text": "$$MK$$ $$Tiwary$$ $$c$$ $$de$$ $$Villiers$$ $$b$$ $$Singh$$ $$23$$ $$(27m$$ $$16b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$143.75$$",
        "isHighlight": true
      },
      {
        "ball": "18.1",
        "text": "Vinay Kumar to Bhatia,2 runs,Bhatia's creamed this to the right of deep midwicket, who's taken it inside the rope, the momentum has carried him over. but he's got rid of the ball before, lobbing it towards deep square running across",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Vinay Kumar to Bhatia, $$FOUR$$ ,nice, Bhatia bends the knee and paddles a full and slower one past short fine leg",
        "isHighlight": true
      },
      {
        "ball": "18.3",
        "text": "Vinay Kumar to Bhatia, $$FOUR$$ ,Bhatia playing a little late gem, fine leg is back, but he's got a lot of bat on the pull off the bouncer, and beaten him quite easily",
        "isHighlight": true
      },
      {
        "ball": "18.4",
        "text": "Vinay Kumar to Bhatia,1 run,low full toss, mishit down the ground, Bhatia slow to start running, single taken in the end",
        "isHighlight": false
      },
      {
        "ball": "18.5",
        "text": "Vinay Kumar to McLaren,no run,Vinay angles it in full around the blockhole, McLaren has to push it back",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Vinay Kumar to McLaren,2 runs,turns a length ball through square leg and makes it back for two",
        "isHighlight": false
      },
      {
        "ball": "19.1",
        "text": "Singh to Bhatia,1 run,around the blockhole outside off, squeezed to point",
        "isHighlight": false
      },
      {
        "ball": "19.2",
        "text": "Singh to McLaren, $$OUT$$ ,a very low full toss, almost a yorker, McLaren hits it close to the pitch to leg and goes for the single, RP has an easy run out, as he hits the stumps direct",
        "isHighlight": true
      },
      {
        "ball": "19.2",
        "text": "$$R$$ $$McLaren$$ $$run$$ $$out$$ $$2$$ $$(6m$$ $$3b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$66.66$$",
        "isHighlight": false
      },
      {
        "ball": "19.3",
        "text": "Singh to Bhatia, $$OUT$$ ,another one gone, length ball on middle, Bhatia gets across, bends the knee and misses the paddle, RP strikes",
        "isHighlight": true
      },
      {
        "ball": "19.3",
        "text": "$$R$$ $$Bhatia$$ $$b$$ $$Singh$$ $$13$$ $$(12m$$ $$7b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$185.71$$",
        "isHighlight": false
      },
      {
        "ball": "19.4",
        "text": "Singh to Narine,1 run,full toss on the pads swung out to deep square leg",
        "isHighlight": false
      },
      {
        "ball": "19.5",
        "text": "Singh to Sangwan,no run,he backs away to leg, RP follows him further down leg, he misses with the flick, but that hits the pad on its way to the keeper,",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Singh to Sangwan, $$FOUR$$ ,a high full toss outside off, he swings hard, and a thick edge beats the keeper fine on the off side",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "KKR were 95 for 2 in the 13th over when Yusuf Pathan got out. And they kept losing wickets after that",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "Singh: \"lets be fair to KKR here, 95/2 in 13 overs and ending at 154 is Okay to me. Someone from the top order had to fire to get a bigger score and noone did so, they have ended up at a reasonably decent score of 154.. I dont see the fuss here (comments like Pack of cards). KKR can win from here.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "sammydude: \"A pack of cards will fall much slower than the KKR batsmen!\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Shreesha Bhat: \"Dinesh Karthik and Vinay Kumar... bet nobody, absolutely nobody expected them both to be holding the orange and purple caps at any stage of IPL\"",
        "isHighlight": false
      }
    ],
    "innings": "Kolkata Knight Riders  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598008.html?innings=2;page=1;view=commentary",
    "name": "Royal Challengers Bangalore v Kolkata Knight Riders",
    "commentary": [
      {
        "ball": 0,
        "text": "Gayle and Agarwal to open, McLaren with the new ball",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "McLaren to Gayle,no run,gets across and pushes a length ball angled across in front of cover, wants the single, has to get back quickly",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "McLaren to Gayle,no run,going across him with the angle again, slightly shorter, and he shoulders arms",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "McLaren to Gayle,no run,makes him play, he pushes a good length ball towards mid off",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "McLaren to Gayle, $$FOUR$$ ,short, Gayle swivels and pulls it hard, in the air over forward square leg",
        "isHighlight": true
      },
      {
        "ball": "0.5",
        "text": "McLaren to Gayle,no run,skips down the pitch and looks to deposit the length ball over mid on, misses",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "McLaren to Gayle,no run,nice, making him play around off, and leaving him with the angle, very close to the outside edge, good bounce too",
        "isHighlight": true
      },
      {
        "ball": "0.6",
        "text": "Kallis to bowl",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Kallis to Agarwal, $$FOUR$$ ,full, wide, Agarwal reaches for it, and slices it over backward point",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Kallis to Agarwal,1 run,stays on the crease and runs a length ball outside off to third man",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Kallis to Gayle,1 run,length on the pads, calmly turned through square leg",
        "isHighlight": false
      },
      {
        "ball": "1.4",
        "text": "Kallis to Agarwal,no run,pitched up on the stumps, he is across in the crease to block",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Kallis to Agarwal,no run,loud appeal from Kallis for caught behind, Agarwal going for an awkward pull, replays show it hit the thigh pad before going low to the keeper, was there a bottom edge before that, not sure",
        "isHighlight": true
      },
      {
        "ball": "1.6",
        "text": "Kallis to Agarwal,1 run,worked to deep square leg off the pad",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "McLaren to Agarwal,no run,shortish and wide, swinging away a tad, Agarwal goes after it and is beaten",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "McLaren to Agarwal,no run,wow, that is a ripper, banged in short of a length, and takes off and swerves away, Agarwal's bat far away from it as he wafts",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "McLaren to Agarwal,1 wide,now this one is angled in and moves down leg",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "McLaren to Agarwal, $$OUT$$ ,no problems with the edge this time, Agarwal trying to dab a shortish and wide one, healthy edge to the keeper",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "$$MA$$ $$Agarwal$$ $$c$$ $$†Bisla$$ $$b$$ $$McLaren$$ $$6$$ $$(10m$$ $$8b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$75.00$$",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "two slips",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Ritesh: \"Give Pathan a bowl - might work against gayle\"",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Chiro: \"Teams get more scared these days when Gayle has a relaxed start...\"",
        "isHighlight": false
      },
      {
        "ball": "2.4",
        "text": "McLaren to Kohli,no run,checks the push to a straightening full ball outside off, to covers",
        "isHighlight": false
      },
      {
        "ball": "2.5",
        "text": "McLaren to Kohli,1 run,short, Kohli adjusts to open the face and runs it to third man",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "McLaren to Gayle, $$SIX$$ ,Gayle has massacred this short ball for six over long on, it came quickly onto him, he didn;t look like he'd got much on the pull, all deception, it;s rocketed rows into the crowd",
        "isHighlight": true
      },
      {
        "ball": "3.1",
        "text": "Kallis to Kohli,no run,pushes a pitched up ball wide of mid on",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Kallis to Kohli,no run,across and behind the line to defend a back of a length ball",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Kallis to Kohli,no run,he lost control of this swing, one hand coming off hand in the followthrough, beaten on the length ball outside off",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Kallis to Kohli,no run,guides a short of a length ball to point",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Kallis to Kohli,no run,full toss, but Kohli's turned this straight to midwicket, smiles sheepishly after that",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Kallis to Kohli,no run,not hitting the gaps, Kohli, it's a maiden as he comes out and squeezes a full one to cover",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Narine to Gayle",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Narine to Gayle,no run,tossed up offbreak, pitches on leg, spins across, blocked off the front foot",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Narine to Gayle,no run,flatter, bounces as it spins away, punched to cover",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Narine to Gayle,1 run,tossed up fuller around off, he comes forward and runs it behind point",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Narine to Kohli,no run,works an offspinner to midwicket",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Narine to Kohli,1 run,shortish and quick, Kohli goes for the pull, mishits it in the air down the ground to long on",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Narine to Gayle,no run,tries to sweep an offbreak but is beaten as it moves away outside off",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Two tight overs and the rate is touching nine",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "McLaren to Kohli,1 wide,full and angled fast down the leg side, neat take by the keeper",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "McLaren to Kohli, $$FOUR$$ ,Kohli gets moving, takes a step out and heaves a short of a length ball past midwicket",
        "isHighlight": true
      },
      {
        "ball": "5.2",
        "text": "McLaren to Kohli,no run,reaches out and pushes a pitched up ball to extra cover",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "McLaren to Kohli, $$FOUR$$ ,full, Kohli swipes, mid on is up, and he gets enough bat on it to lift it over the fielder",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "McLaren to Kohli,1 run,good length and straightening, he opens the face and runs it down to third man",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "McLaren to Gayle, $$SIX$$ ,whack! good length, Gayle sends it soaring over wide long on, gets front foot a few inches outside leg and picks it from around off",
        "isHighlight": true
      },
      {
        "ball": "5.6",
        "text": "McLaren to Gayle, $$SIX$$ ,massive, six over cover, shifts further outside leg stump now, crouches and lifts an overpitched one over the infield, it lands comfortably over the rope, insane timing and power this man has",
        "isHighlight": true
      },
      {
        "ball": "5.6",
        "text": "Ronak Agrawal: \"One big over and rate is 8 ;)\"",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Narine to Kohli,no run,reaches out and hits a length ball to point",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Narine to Kohli,no run,dabs an offbreak from off to short third",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Narine to Kohli,1 run,straightening outside off, pushed wide of cover",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Narine to Gayle,1 run,overpitched on the pads, worked to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Narine to Kohli, $$FOUR$$ ,offspinner bounces big on Kohli, but how well has he handled that, bends, delays the cut and hits the gap between short third man and backward point, lovely",
        "isHighlight": true
      },
      {
        "ball": "6.6",
        "text": "Narine to Kohli,1 run,keeps strike with a single through the off side",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "VPS: \"Gayle is Fantasy cricket's elite.\"",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Nas: \"The two tight overs just woke the two giants up. The rampage begins\"",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Balaji to Kohli,1 run,pitched up on the stumps, eased down to long on",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Balaji to Gayle,no run,slowish length ball going across, Gayle shoulders arms",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Balaji to Gayle,1 run,width, lots of it, Gayle reaches across and drills it past point's dive, good work from the sweeper to stop it",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Balaji to Kohli,no run,beaten by a slower one angled in and bouncing, dies in front of the keeper",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Balaji to Kohli,no run,holds its line on off, good length, Kohli runs it to point",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Balaji to Kohli, $$FOUR$$ ,overpitched, and Kohli's sent it scorching along the ground to the deep extra cover rope, intent, full of intent",
        "isHighlight": true
      },
      {
        "ball": "7.6",
        "text": "Dammodara: \"How do you Describe Gayle's foot work? He don't move his feet at all.. But the pace he generates with his bat may be the fastest in the business...\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Saugat: \"If any of these two survives, it would be easier than a cakewalk for RCB - we saw that against SRH the other day. In fact a walk through the cake will have more friction.\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Sangwan comes on",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Sangwan to Gayle, $$FOUR$$ ,gentle length ball outside off, and Gayle has scythed that past the man at mid off, who had only a few feet to cover to his right, he still couldn't get to it",
        "isHighlight": true
      },
      {
        "ball": "8.2",
        "text": "Sangwan to Gayle,1 run,hit hard down to long on",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Sangwan to Kohli, $$SIX$$ ,outstanding timing, shortish and sitting up, Kohli;s banished that several rows over deep midwicket with a swift pull",
        "isHighlight": true
      },
      {
        "ball": "8.4",
        "text": "Sangwan to Kohli, $$SIX$$ ,over fine leg now, Kohli doing everything to show RCB don't entirely depend on Gayle, shortish again, and he swivels to pull, edge flies over the boundary",
        "isHighlight": true
      },
      {
        "ball": "8.5",
        "text": "Sangwan to Kohli,(no ball) 1 run,high full toss, Kohli swats it to off for a single",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Sangwan to Gayle,no run,short of a length, Gayle does not go after the width, guides it tamely to point",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Sangwan to Gayle,no run,around the blockhole, Gayle pats it back",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Balaji to Kohli, $$OUT$$ ,Balaji's slower one does it, Kohli comes out and slices it to sweeper cover running in",
        "isHighlight": true
      },
      {
        "ball": "9.1",
        "text": "$$V$$ $$Kohli$$ $$c$$ $$Morgan$$ $$b$$ $$Balaji$$ $$35$$ $$(31m$$ $$27b$$ $$4x4$$ $$2x6)$$ $$SR:$$ $$129.62$$",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Kohli is cross about something, now he and Gambhir walk angrily towards each other, reminiscing their days together in Delhi, another Delhi man, Bhatia intervenes to avoid a possible collision and pats Kohli on the back to send him on his way",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Balaji to de Villiers,no run,pitched up on the stumps, pushed to mid on",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Balaji to de Villiers,no run,ending on off from a length, pushed to mid on again",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Shashank Shekhar Mishra: \"This is what i hate about Kohli, he is a good cricketer but his on field aggression is somewhat unnecessary and unacceptable.\"",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Balaji to de Villiers,no run,Balaji getting in some quiet slower ones in, AB walks out, he shortens the length, and he has to drop it onto the pitch",
        "isHighlight": false
      },
      {
        "ball": "9.5",
        "text": "Balaji to de Villiers,1 run",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Balaji to Gayle, $$FOUR$$ ,third man is up, even if he was back, he would have struggled to stop this, Gayle has cut it so savagely backward of point",
        "isHighlight": true
      },
      {
        "ball": "10.1",
        "text": "Sangwan to de Villiers,no run,tries to sweep one angling far away outside off, misses it",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Sangwan to de Villiers,1 run,Balaji saves four with a sprawl to his right, AB connecting with the paddle this time",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Sangwan to Gayle,1 run,very low full toss, Gayle squeezes it down to long on",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "yogi: \"@Shashank To be fair to him he has been pretty relaxed this IPL but he is definitely not the only one to be blamed in the incident.\" True, it was Gambhir at the other end, not Rahul Dravid",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Sangwan to de Villiers,1 run,flayed down to sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Sangwan to Gayle, $$SIX$$ ,short ball, there is a man at deep midwicket, but Gayle's pulled it flat and well out of the reach of that fielder",
        "isHighlight": true
      },
      {
        "ball": "10.6",
        "text": "Sangwan to Gayle,2 wides,he is ready with a foreboding backlift, but this one is too far outside off, keepre fails to gather",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Sangwan to de Villiers, $$FOUR$$ ,AB's getting the width to murder them through extra cover, he's timed it too well this time, and the placement is wide enough of the sweeper",
        "isHighlight": true
      },
      {
        "ball": "11.1",
        "text": "Balaji to Gayle,no run,slower and full, he tries to reach for it, misses",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Balaji to Gayle,1 run,bat in front of pad to ease a pitched up ball to long off",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Balaji to de Villiers,1 run, $$dropped$$ , touch chance, AB slapping a short ball high to the left of short extra cover, Tiwary goes leaping, but it goes down",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Balaji to Gayle,no run,pushes an overpitched one to extra cover",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Kapil: \"Good.. Gambhir won't repeat the error of dropping Lee and playing McLaren again.. And why isn't Kallis bowling to Gayle.. he is master at bowling good short stuff pointing head/body\"",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Balaji to Gayle,1 wide,oops, he lost this one, very high full toss past the batsman, bounces close to the keeper",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Balaji to Gayle, $$SIX$$ ,that has been carted into outer space, and has then been pulled down by gravity miles beyond deep midwicket, length around off, Gayle taking care of it",
        "isHighlight": true
      },
      {
        "ball": "11.6",
        "text": "Balaji to Gayle,no run,nice recovery from Balaji, slowish and full around the blockhole, Gayle swings and gets an inside edge onto boot",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Narine back, they need wickets",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Narine to de Villiers, $$FOUR$$ ,outside edge, past slip, carrom ball moving away, AB had no clue about it",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "Narine to de Villiers,1 run,worked through midwicket from outside off",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "tushar: \"That ball almost landed on my lap... I'm sitting in Delhi BTW\"",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Narine to Gayle,no run,pushes front foot forward, waits, and lets this offbreak pass by him outside off",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Narine to Gayle,no run,tossed up, he comes forward and defends to point",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Narine to Gayle,1 run,thick inside edge to the leg side as he gets forward to defend, and that is another fifty in the IPL for Chris Gayle, Chinnaswamy is generous is in the applause",
        "isHighlight": true
      },
      {
        "ball": "12.6",
        "text": "Narine to de Villiers,no run,tries to reverse paddle, but misses, appeal for lbw turned down",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Kallis to Gayle,1 run,overpitched from round the stumps, powered wide of the sweeper, who does well to get around to it",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Kallis to de Villiers,1 run,walks outside off, and hits a very full one down the ground",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "abhijit pore: \"Had Bhatia not intervened, they would have hit each other. Both of them should be disciplined and banned for a match.\"",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Tshepiso: \"Gayle, Kohli and De Villiers in the same team, what more else would you wish for???\"",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Kallis to Gayle,no run,slow and full and wide, Gayle reaches out and stabs it to point",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Kallis to Gayle,no run,slow bouncer, Gayle cannot get bat to it as he tries the help it fine",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "John: \"whenever Gayle is playing...dont go inside the stadium...stay outside the stadium and start collecting the balls which are coming ur way....if u do this for one year, you can start your own store to sell Semi-New balls.\"",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Kunaal: \"@ Tushar - Yup, it flew above my house before making a boomerang to your place in Delhi. I am in Singapore, BTW.\"",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Kallis to Gayle,no run,in the blockhole outside off, even Gayle has to squeeze it to the bowler",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Kallis to Gayle,1 wide,full, wide, way too wide outside off",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Kallis to Gayle,2 runs,low full toss, point takes pace off the shot with a dive, Gayle charges back for the second and just makes it, better throw and he was gone",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Sagar: \"The problem with KKR is - they are persisting way too long with Kallis. Although, he is one of the greatest to have played the game, the KKR management needs to understand that they are doing a blunder by keeping guys like Tendo on bench. The 4 overseas players for KKR should be Morgan, Tendo, Narine and Brendon M.\"",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Narine to de Villiers,no run,misses as he flashes at an offbreak outside off",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Narine to de Villiers,no run,pushed to extra cover",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "Narine to de Villiers,no run",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Narine to de Villiers,1 run,straight and quick, AB deep in the crease to push to long on",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Narine to Gayle,1 run,sharp single, pushed off the front foot to cover and AB makes it comfortably",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Narine to de Villiers,no run,beats him outside off with a straighter and quicker one that AB plays well inside the line of, he's had little clue about Narine this innings",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Kallis to Gayle,no run,low full toss hit to extra cover",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Kallis to Gayle,no run,nice work from Kallis, gets it around the blockhole first, and then gets the boot out to stop the hit from Gayle",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Kallis to Gayle, $$SIX$$ ,fullish length this time, and Gayle punishes it, slamming it over long off",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "round the stumps",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Kallis to Gayle,(no ball)  $$SIX$$ ,no difference to Gayle, uses the angle into him to shovel it over wide long on, making some room outside leg to swing big, it is also a no ball",
        "isHighlight": true
      },
      {
        "ball": "15.4",
        "text": "Kallis to Gayle, $$FOUR$$ ,Gayle getting it done with, full toss outside off, and a slice takes it over backward point",
        "isHighlight": true
      },
      {
        "ball": "15.5",
        "text": "Kallis to Gayle,no run,short, and he lets it go outside off",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Kallis to Gayle,1 run,heaves at a full toss, thick edge runs down to third man",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Bhatia in the firing line",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Saugat: \"I think the Orange Cap should be awarded to Gayle even before the IPL begins, . What difference does it make? He's gonna take it anyway!\"",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Paresh: \"@Sagar: You just read my mind. I think at some stage management (not just KKR, but others as well, if you know what I mean) have to take tough calls in favor of the team/competition...\"",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Bhatia to Gayle,1 run,slow and full, quietly pushed to covers for one",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Bhatia to de Villiers,no run,walks outside off, Bhatia takes it away from the right hander slowly, AB beaten on the cut",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "Bhatia to de Villiers, $$SIX$$ ,slow length ball sitting up, AB makes room and swats it over the straight boundary",
        "isHighlight": true
      },
      {
        "ball": "16.4",
        "text": "Bhatia to de Villiers,1 run,drills an overpitched one to wide long off",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Bhatia to Gayle,1 wide,good length ball straight and down the leg side",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Bhatia to Gayle,1 run,very full, Gayle makes some room, and eases it through the off side",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Bhatia to de Villiers,no run,pitched up and disdainfully driven through the off side, but extra cover in the way",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Ankit Bhutoria: \"Why take a strategic time out now, as no amount of strategy can bring KKR back into this game?\"",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Balaji to Gayle,no run,slow length ball, tries to steer it to third man, misses",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Balaji to Gayle, $$SIX$$ ,short, Gayle swivels and pulls, again it appears he hasn;t timed it, but try telling the man at deep square leg that, he had no chance as it sailed over",
        "isHighlight": true
      },
      {
        "ball": "17.3",
        "text": "Balaji to Gayle,1 wide,slanted too wide across the left-hander",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Balaji to Gayle, $$SIX$$ ,that will be that, he banishes a length ball high over long on to end with nine sixes",
        "isHighlight": true
      },
      {
        "ball": "17.3",
        "text": "$$The$$ $$Huddle$$  - have you been to one yet? - is set to begin.  $$Join$$ $$in$$",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "That does it for another Gayle storm. Hop over to  $$Pune$$ $$v$$ $$Rajasthan$$  now.",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Gayle is Man of the Match, well of course. Gayle: \"You can put the boundary wherever you want, I'll take on the challenge. I'm hungry, I need some food [what his Twitter feed will say tonight].\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "$$Kohli$$ : \"Its done, what is done on the field is done [his spat with Gambhir]. Great game for us. When you know Gayle is leaving the ball, the opposition has to be more worried than when he is hitting it.\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "$$Gambhir$$ : \"It happens in the heat of the moment. We dont need to carry it off the field. It is a tough sport, no love lost. All credit to Chris, he took the game away from us. We were in the same position last year as well. Hopefully we can turn it around. You have to get 160-170 here when you bat first. It is not like Kolkata or other venues where 140 is fine.\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Another team Gayled today. Nuff said.",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Kohli gets the orange cap for being the leading run-getter this season for now",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "stogy: \"Yes, Ankit. I can imagine Gayle also using the strategic time out to maximum effect, telling AB, \"Yes, I am planning to continue hitting the ball really hard\" and AB answering \"ermm yes erm erm... good idea. Great strategy\"\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Jayesh: \"RCB should change their team name to GCB = Gayle Challengers Bangalore! :)\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Kumar Saurabh: \"Well..its a dangerous bell ringing for other teams. He just hits it so effortlessly...god.\"",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Somesh: \"Believe me , teams are making 15-20 less runs -- just to prevent a century from Gayle. Call it strategy!\"",
        "isHighlight": false
      }
    ],
    "innings": "Royal Challengers Bangalore  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598009.html?innings=1;view=commentary",
    "name": "Pune Warriors v Rajasthan Royals",
    "commentary": [
      {
        "ball": 0,
        "text": "$$8.00pm$$  Danny Morrison is back to calling Rajasthan Royals as the double-Rs. The countdown is on as we're set to go.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$7.50pm$$  Plenty of Luke Wright fans on today. Here's Praharsha: \"Luke Wright's T20 strike rate is 138 when compared to Finch's 136 and Luke is more than handy with the ball. PWI have surely missed a firepower trick!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Debi Prasad: \"I want to see RR doing well this year (may be win the title), even though I am a SRH fan. The reason is one man, Dravid. He is most probably playing his last IPL and I want to see him go away with a hurrah, unlike Dada.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Aqil: \"Pune paid loads for the likes of Mendis and Richardson... no where to be seen!\" Kane Richardson had to be one of the strangest picks at the auction. That much money for an unproven specialist quick?",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Is there a single person happy with the teams picked today? Ashish: \"Where is RR hiding Owais Shah. I feel he should be picked in the side over the so called Sanath Jayasurya Avatar (Perera).\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Sanju Z: \"Spare a thought for Steve Smith. He was Pune's best player last season, was the second best player for Australia in India (other than Clarke) and still can't get a game..\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$7.40pm$$  Cobra Jain: \"Seriously no steven smith again? Mathews should give him a chance\" And also, Luke Wright, who has had a terrific time with England in T20s over the past year. But Finch comes in as Pune desperately look for some firepower at the top of the order, with Robin Uthappa struggling for form and Manish Pandey picking up another duck.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Anirudh: \"if pune fail again, with the likes of yuvi, ross, mathews , they must really make some big decisions( mathew- captain?)\".",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "\"I think it's a travesty that Pune keep ignoring Tamim Iqbal. He's just the type who can give them a blazing start. Send Uthappa down the order!\" Mohammed Surti and other angry Tamim fans, he's not in India for the IPL as Bangladesh have a Zimbabwe tour starting within a week.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "James: \"Big team news from Rajasthan: Watson, Tait out due to injuries. Also big team news from Rome. Pope still Catholic.\" Ha ha!",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Kalyan: \"Finch should make the team irrespective how others are playing in the team. He provides the flying start which will help the likes of Yuvi and Taylor to cash on later!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Figgy: \"How on earth is Luke Wright not getting in this Warriors side especially considering their performance so far? Some of the selections from the teams are costing them games so far this year, I think this could be another one and this is set to be another one.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$Toss$$  Rahul Dravid calls 'Tails,' and Dravid wins the toss.  $$Rajasthan$$ $$will$$ $$bat$$ . Dravid says the track looks good, and that it might get slower later in the evening. Mathews says he wasn't sure what he would have done if he won the toss, though he thinks the surface may be a bit two-paced.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Big team news from  Rajasthan:  $$Watson,$$ $$Tait$$ $$and$$ $$Rahul$$ $$Shukla$$ $$out$$  due to injuries. Faulkner, Harmeet and Kushal Perera in (are you happy Farook?) .",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "For Pune, Marlon Samuels and Manish Pandey are out. Aaron Finch and Yuvraj Singh take their place.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Have you seen our new  $$Match$$ $$Companion$$ , where cricket meets social media.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "And our daily Google Hangout  $$The$$ $$Huddle$$  is live now. Isa Guha and Aakash Chopra are the guests today as the gang takes an offbeat look at events in the IPL.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$7.20pm$$  Well, Chris Gayle has again done what Chris Gayle does best, dispatching bowlers to all parts of the Chinnaswamy Stadium. Nine sixes in his innings as Kolkata Knight Riders, like so many teams before them, had no way of stopping Gayle.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Now, the focus shifts to Pune, where the Warriors take on Rajasthan Royals.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Mayank: \"hoping for a yuvi-uthappa show today. this batting line up is too good to miss-out again.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Farook: \"really looking forward for Kushal Perera to get another chance... Please RR one more chance... sob..\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$7.00pm$$  Pune are desperately in need of a turnaround. Can Yuvraj Singh's return do the trick for them? Here's our  $$preview$$  to the game.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Given the sort of recent T20 form he's had, Yuvraj is perhaps a shoo-in for your  $$Fantasy$$ $$XI$$ . Or do you fancy Kevon Cooper? Make your changes well in time, so that you are in contention for the daily prizes. You could also  $$predict$$  the results of the games on our Tata Motors T20 predictor game, and be in line for some really cool prizes.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "While you wait for the game to start... Ever seen a cricket match being played on a railway track? Check out our fan gallery on  $$The$$ $$Stands$$ . You could have your cricket pictures featured here too.  $$Here's$$ $$how$$ .",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Kumar to Perera, $$OUT$$ ,fantastic start for Pune, all those Kushal Perera fans get to watch him for just one ball, the first ball pitches on middle and off, moves back a touch and that was going on to hit middle, plumb lbw, golden duck for Perera, he should have been forward to that, stuck in the crease and the ball keeps low",
        "isHighlight": true
      },
      {
        "ball": "0.1",
        "text": "$$MDKJ$$ $$Perera$$ $$lbw$$ $$b$$ $$Kumar$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Diwakar: \"I still dont understand why Ravi Sastry shouts so much!!! someone tell him he already has a mike in his hand\"",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Kumar to Dravid,no run,full ball angling in, Dravid gets forward and pushes towards mid-off, Bhuvneshwar can be a handful with the new ball",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Kumar to Dravid,no run,another lbw shout, but this one was was sliding down so Dravid survives",
        "isHighlight": true
      },
      {
        "ball": "0.4",
        "text": "Kumar to Dravid,1 run",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "Kumar to Rahane,2 runs,moves across to tuck the ball towards square leg for a couple",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Kumar to Rahane, $$FOUR$$ ,pitched up and on the pads, easy put away that, eased towards the midwicket boundary for four",
        "isHighlight": true
      },
      {
        "ball": "0.6",
        "text": "Farook: \"No Kushal Perera for the rest of the season i guess... :'( sob...\"",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Satwik: \"Danny Morrison always appears extra excited while referring to the Delhi Daredevils as the \"DOUBLE DEES!!!!\"\"",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Dinda to Dravid,no run,Dinda, with the trademark headband and the huge leap before delivering, starts with a full ball outside off, left alone",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Dinda to Dravid,no run,back of length ball outside off, mistimes a drive towards cover",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Salman Ali: \"Do these franchises have 30 days return guarantee for these bench warmers?\" Haven't seen the contracts Salman.",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Dinda to Dravid, $$FOUR$$ ,lovely from Dravid, brilliantly timed by Dravid, it was a bit overpitched and Dravid leans into that off drive, perfectly finding the gap",
        "isHighlight": true
      },
      {
        "ball": "1.4",
        "text": "Dinda to Dravid,2 runs,on the pads, helped down towards fine leg where Bhuvneshwar does well to stop a boundary",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Dinda to Dravid,1 run,length ball outside off, another badly timed shot, the ball rolls towards cover, a single is taken",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Dinda to Rahane,no run,length ball that slants in towards off, solidly defended back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Rohit Raja: \"@Diwakar : Not just that. Shastri knows 5 words in every local language. He loves screaming something before the toss.\"",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Kumar to Dravid,no run,defended back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Kumar to Dravid,no run,length ball is defended towards cover off the front foot",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Bhuta: \"Am I the only one who is still in denial about Dravid retiring from international cricket?! He is one of the main reasons why I watch the Rajasthan Royals matches. I miss you Rahul!!\" Doubt you are alone, Bhuta",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Kumar to Dravid,1 no ball,overstepped, but it was a beautiful delivery from Bhuvesnhwar, moves in and beats the bat outside off",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Kumar to Dravid, $$FOUR$$ , $$free-hit$$ , pitched up and that is thrashed back past the bowler along the ground for four, Dravid puts some serious effort behind that drive",
        "isHighlight": true
      },
      {
        "ball": "2.4",
        "text": "Kumar to Dravid,no run",
        "isHighlight": false
      },
      {
        "ball": "2.5",
        "text": "Kumar to Dravid,1 run,on the pads, clipped behind square leg by Dravid",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Kumar to Rahane,no run,back of length ball outside off, defended towards cover, a tidy over despite the no-ball and the free-hit",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Aman: \"@Satwik:What do you say about \"You Betcha!\" :P\"",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Mathews to Dravid,no run,Dravid looks to hammer the ball through the off side, but perhaps since he's going so hard at the ball, he can't time it, the ball rolls towards cover",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Mathews to Dravid, $$FOUR$$ ,beautifully done by Dravid, given some width by Mathews, he caresses that past point, no attempt to club the ball, races to the point boundary",
        "isHighlight": true
      },
      {
        "ball": "3.3",
        "text": "Mathews to Dravid,1 leg bye,on the pads, Dravid looks to clip that to the leg side again, misses, off the pads for a leg-bye",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Mathews to Rahane,1 run,opens the face to guide the ball towards third man for a single",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "James: \"Bhuta, for me one of the joys of the IPL is watching the recently retired greats one last time, such as Warne, Gilly, Murali, Dravid, Sachin (oops!!). Pity Lara never signed.\"",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Mathews to Dravid, $$FOUR$$ ,Pune have bowled too many on leg stump, gifting runs really, this one angles in and that is clipped to backward square leg for four",
        "isHighlight": true
      },
      {
        "ball": "3.6",
        "text": "Mathews to Dravid,no run,thick inside-edge as Dravid looks to drive straight, the ball dribbles towards the leg side",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Vivek: \"I always wondered, if T20 is all about hitting sixes, i should be watching none other than Gayle, but i always wait to watch Dravid bat and i like to watch him even more than i do for Gayle. !!!!!\"",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Dinda to Rahane, $$FOUR$$ ,classical from Rahane, that was overpitched and outside off, Rahane gets forward and eases that through cover for four, effortless from Rahane, top shot that",
        "isHighlight": true
      },
      {
        "ball": "4.2",
        "text": "Dinda to Rahane,no run,that one lifted a lot more than Rahane expected, he's completely taken by surprise, and he is struck on the thumb as he looks to defend, that was 135.7kph from Dinda",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Dinda to Rahane,1 run,defended to the leg side for a quick single",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Dinda to Dravid,no run,back of a length ball, driven towards short cover by Dravid",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Rahul Ramesh: \"How many of you miss Lance Klusener? I wish he was here in IPL. He would smashed all bowlers out of the park.\"",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Dinda to Dravid, $$FOUR$$ ,lovely from Dravid, picking the gap to perfection, the second stunning off drive this over, this time Dravid sends it past cover",
        "isHighlight": true
      },
      {
        "ball": "4.5",
        "text": "devesh: \"Who would have thought that Dravid's fans would get to watch him bat only in T20's?\"",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Dinda to Dravid,1 run,flicks it away in front of square leg for a single",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Vaaalpaiyan: \"@James : If I am right, couple of years back Lara was once available for Auction, and none of the Teams were interested in him.\"",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Vineet: \"I prefer a classic cover drive for four over a humongous six any day :)\"",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Sharma to Dravid,no run,Draivd gets forward and defends the first ball of spin in the match, from Rahul Sharma",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "A cat is sprinting across the outfield, briefly halting play and getting Shastri extremely excited.",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Sharma to Dravid,1 run,pushed towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "Sharma to Rahane,no run,drops it a bit short, stays in the crease and defends to the off",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Sharma to Rahane,1 run,pitched up and on the pads, clipped towards square leg",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "'Cat me if you can,' says the giant screen. Awful!",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "Sharma to Dravid,1 run,short of length ball outside off, slapped through cover",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Sharma to Rahane,1 run,Rahane sends the final ball of the over towards extra cover for a quick single",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Venkat: \"Shastri doesn't need a Cat-alyst to get excited .. does he?\"",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Yuvraj Singh to Rahane,no run,pitched up and that is defended off the front foot to the off side, Yuvraj bowling now",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Yuvraj Singh to Rahane,1 run,that keeps a bit low, slides on towards leg stump, stays in the crease and works it to the leg side",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Yuvraj Singh to Dravid,1 run,stretches forward and drives it towards long-off",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Yuvraj Singh to Rahane,1 run,a graceful drive towards long-off, all along the ground",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Yuvraj Singh to Dravid,1 run,whips a fuller ball towards wide long-on",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Yuvraj Singh to Rahane,1 run,short of length ball just outside off, defended towards cover",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Sharma to Rahane,no run,spinners doing a decent job here, first ball is pushed towards cover",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Sharma to Rahane,2 runs,drops it short this time, ricks back and slaps it towards deep point for a couple, the fifty comes up",
        "isHighlight": true
      },
      {
        "ball": "7.3",
        "text": "Sharma to Rahane,no run,another dot ball, blocked towards point this time",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Vikas: \"After all , it has just come to watch some Cri-Cat\"",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Sharma to Rahane,1 run,full ball on leg stump, driven along the ground for a single to long-on",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Sharma to Dravid,1 run,a bit short once more from Rahul Sharma, Rahul Dravid gets back and slaps it towards sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Sharma to Rahane,1 run,length ball on the pads, nurdled towards square leg",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "ShastriBot: \"It was a cataclysmic event.\" A reference to the strategic time-out?",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Indrasis: \"Was that Schroedinger's cat in the outfield?\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "vibhash: \"If Mcgrath was playing, Shastri would have said - thats setting cat among the pigeons.\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Sathia Jobe: \"Enough of the Cat comments guys. It just came for a lil Cat-ch Up !\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "James: \"Guys, no more please! I'll be cat-atonic!\" Okay James. End of feline jokes on Cricinfo comms.",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Yuvraj Singh to Rahane,1 run,too short from Yuvraj, he gets away with it though, Rahana can only pull that towards long-on for a single",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "Yuvraj Singh to Dravid,no run,short again, Dravid backs away and cuts towards cover, straight at the fielder",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Yuvraj Singh to Dravid, $$FOUR$$ ,pitched up this time, Dravid makes a bit of room, slices that off the back foot past point for four",
        "isHighlight": true
      },
      {
        "ball": "8.4",
        "text": "Yuvraj Singh to Dravid,no run,again looks to hit the ball towards point, but can't beat the fielder",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Yuvraj Singh to Dravid,1 run,backs away and carves the power towards sweeper cover for a single",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Yuvraj Singh to Rahane,1 run,length ball is twirled towards midwicket for a single",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Marsh to Rahane, $$FOUR$$ ,Mitchell Marsh is into the attack, he overpitches and that is powered over mid-off for four, doesn't quite hit it as well as he would have liked, but easily clears mid-off",
        "isHighlight": true
      },
      {
        "ball": "9.2",
        "text": "Marsh to Rahane,1 run,a quick single to short fine leg",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Marsh to Dravid,no run,length ball on off stump is blocked back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Marsh to Dravid, $$FOUR$$ ,length ball on the pads, Dravid places this wonderfully, flicking it away wide of the man at deep square leg",
        "isHighlight": true
      },
      {
        "ball": "9.5",
        "text": "Marsh to Dravid,1 leg bye,on the pads once more, Dravid looks to nudge it to square leg, off the pads for a leg-bye",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Marsh to Rahane,1 run,back of a length ball on off stump, clipped behind square leg for a quick run, this wasn't as well judged as the previous tight runs, a direct hit and Dravid would have been run out there, Dinda missed, Dravid had given up, but he survives",
        "isHighlight": true
      },
      {
        "ball": "10.1",
        "text": "Mathews to Rahane,1 run,slower ball to start from Mathews, turned towards square leg",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Mathews to Dravid,no run,a yorker on legstump, can't do much with that",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Mathews to Dravid, $$FOUR$$ ,pitched up and Dravid looks to thrash that through the leg-side, he connects with that slower one, and sends it to the wide long-on boundary, just lands short of the rope",
        "isHighlight": true
      },
      {
        "ball": "10.4",
        "text": "Mathews to Dravid,no run,looked to force that through the off side but a thick inside-edge sends the ball towards midwicket",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Mathews to Dravid,2 runs,a powerful straight drive down the ground, T Suman makes a good stop at long-on, but after stopping it he isn't exactly sure where the ball is, he looks around in desperation before spotting it behind him",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Mathews to Dravid,1 run,punched down the ground for a single",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Sharma to Dravid,1 run,horrible delivery from Rahul Sharma, Rahul Dravid should have smashed that short one to of the park, he can only send it towards long-on",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Sharma to Rahane, $$OUT$$ ,terrific catch that by Mathews, Rahane made room and looked to crash that past short cover, it was flying fast and low, Mathews gets quickly down to his right to clasp that and break a big partnership",
        "isHighlight": true
      },
      {
        "ball": "11.2",
        "text": "$$AM$$ $$Rahane$$ $$c$$ $$Mathews$$ $$b$$ $$Sharma$$ $$30$$ $$(46m$$ $$27b$$ $$3x4$$ $$0x6)$$ $$SR:$$ $$111.11$$",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Stuart Binny is the new man, thought they would have sent Hidge in",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Sharma to Binny,no run,big shout for lbw, surely an inside-edge there, or else he was a goner, a length ball pitching in line and hitting middle and leg, that hit pad first, that should have been out",
        "isHighlight": true
      },
      {
        "ball": "11.4",
        "text": "Sharma to Binny,1 run,Binny chips the ball towards long-off, just lands short of the fielder there",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Sharma to Dravid,1 run,shortish ball, another boundary ball that but Dravid can only send it to wide long-on for a single",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Sharma to Binny,no run,Binny goes for the sweep, haven't seen many of those yet today, can't place it wide of short fine leg",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Yuvraj Singh to Dravid,1 run,drives that along the ground towards long-off, the half-century comes up for Dravid, second of the season for him",
        "isHighlight": true
      },
      {
        "ball": "12.1",
        "text": "Anurag Acharya: \"I'll take an innings as this from Dravid any day compared to Gayle's earlier one. I mean, as much as I love Gayle hitting sixes, all those 9 he hit tonight give me less satisfaction than Dravid's single beautiful cut shot.\"",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "Yuvraj Singh to Binny,1 wide,slanting down the leg side, wide",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "Yuvraj Singh to Binny, $$OUT$$ ,Binny's troubled, and short, stay is over, he was expected to come out and slog, he charges out, Yuvraj lands it short, Binny had to reach out for that one, can't connect it properly and the ball loops to long-on for an easy catch",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "$$STR$$ $$Binny$$ $$c$$ $$Marsh$$ $$b$$ $$Yuvraj$$ $$Singh$$ $$1$$ $$(5m$$ $$4b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$25.00$$",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "AJ: \"This game is causing me a lot of headaches, i always like to root for the underdogs, one team even though they won the 1st IPL are considered perenial underdgos, while the other is surely one. I think i'll go for the PWI this time around!\"",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Yuvraj Singh to Dravid,1 run,backs away and slaps the ball towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "DravidFan: \"I wish Dravid scores at least one century in this format before he retires.\"",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Yuvraj Singh to Hodge,no run,Hodge, the leading run-scorer in T20s, defends his first ball to the off side",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Yuvraj Singh to Hodge,1 run,whips this towards deep square leg for a single",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Yuvraj Singh to Dravid,1 run,eased towards long-on for a single",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Geethike: \"@Anurag Acharya, I am pretty sure Gayle's innings would win you more matches ;)\" Can't argue with that.",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Mathews to Dravid,1 run,low full toss, eased towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "paladin: \"@anurag - i guess thats the difference between art and cricket - always a question of how much you can score and not how !\"",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Mathews to Hodge,no run,full ball, worked towards midwicket",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Avijeet: \"@Anurag Acharya: I bet you like Dilip Kumar's B/W flicks more than Nolan's batman trilogy.\"",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Mathews to Hodge,no run, $$dropped$$ , it was a tough chance for Mathews, it was the slower offspinner, Hodge was fooled by that one, a leading edge pops back towards the bowler, Mathews has to dives to his right to take that, he gets a hand on it but can't connect",
        "isHighlight": true
      },
      {
        "ball": "13.4",
        "text": "Mathews to Hodge,1 run,punched towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Mathews to Dravid,1 run,full ball on off stump, Dravid eases that towards sweeper cover, only a single though",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Mathews to Hodge,1 run,played with soft hands towards point for a quick single",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Hariiii: \"@Geethike: As much as I love winning the games, its not always about that..especially when it involves my man Rahul Dravid :)\"",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Asim: \"Remembering how wonderfully he adapted himself to ODIs, I am sure Dravid would have been able to adapt himself to T20 too - and be a force like Gayle - in his prime. He is the eternal learner, he may still do it though\"",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Yuvraj Singh to Hodge,1 run,short of length ball just outside off, slapped in front of point, a misfield allows a single",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Ravi: \"Surely the law of diminishing marginal utility doesn't apply to classical Dravid strokes.\"",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Yuvraj Singh to Dravid, $$OUT$$ ,another superb catch, ends Dravid's innings, Dravid got a bit of width, and he looked to power that past cover, played it in the air to the left of Ross Taylor, who moved across and plucked it with one hand, 54 off 48 for Dravid, too slow? or built a platform?",
        "isHighlight": true
      },
      {
        "ball": "14.2",
        "text": "$$R$$ $$Dravid$$ $$c$$ $$Taylor$$ $$b$$ $$Yuvraj$$ $$Singh$$ $$54$$ $$(57m$$ $$48b$$ $$8x4$$ $$0x6)$$ $$SR:$$ $$112.50$$",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "Yuvraj Singh to Yagnik, $$FOUR$$ ,length ball outside off, Dishant Yagnik, who has shown he has plenty of confidence, opens the face and plays the ball late, just past the keeper, terrific shot first up",
        "isHighlight": true
      },
      {
        "ball": "14.4",
        "text": "Yuvraj Singh to Yagnik,no run,gets forward and defends this one",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Yuvraj Singh to Yagnik, $$FOUR$$ ,another four, a reverse-sweep this time, didn't look particularly pretty but he connected well and send that to the point boundary",
        "isHighlight": true
      },
      {
        "ball": "14.6",
        "text": "Yuvraj Singh to Yagnik,1 run,works this towards square leg for a single",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Sharma to Yagnik,2 runs,length ball outside off, wristy shot sends the ball towards long-on",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Sharma to Yagnik,no run,well outside off, Yagnik again wants to play that late dab, he misses out",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Sharma to Yagnik,1 run,he gets deep in the crease and tucks the ball towards midwicket for a single",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Mohit Ranka: \"I heard a collective sigh of all the cricinfo users on that dravid's dismissal!\"",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Sharma to Hodge,1 run,shortish ball spinning away, Hodge deflects that towards backward point for a single",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Sharma to Yagnik, $$OUT$$ ,oh dear, one of the strangest shots to get dismissed, he tried a Dilscoop, getting into position really early and waiting for the ball to arrive, doesn't connect properly though and lobs it towards short third man, he falls over as he plays the shot as well",
        "isHighlight": true
      },
      {
        "ball": "15.5",
        "text": "$$DH$$ $$Yagnik$$ $$c$$ $$Suman$$ $$b$$ $$Sharma$$ $$12$$ $$(8m$$ $$8b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$150.00$$",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Waqaas Rumani: \"Argh ! The Dravid Nostalgia ! But my favourite moment in Cricket T20 has been Dravid hitting 3 sixes in a row in his only T20 International match. I never ever even could dream of him attempting such a thing leave alone doing it !\"",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Sharma to Faulkner,no run,terrific spell from Rahul comes to an end, an outside off ball is missed by Hodge",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Mazhar Mohammad: \"I am very much interested in knowing how cricinfo filters out user comments for posting. Do you have a team who read through all the comments or is it controlled by a machine based on some user defined algorithm???\" I'm reading the lot.",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Mathews to Hodge,1 run,full ball on the pads, nudged just behind square leg for a single",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Mathews to Faulkner,2 runs,slower offcutter from Mathews, clipped towards midwicket for a couple",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "Mathews to Faulkner,1 run,full ball just outside off, Hodge squeezes that towards mid-off",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Mathews to Hodge,1 run,pitched up and that is powered towards sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Mathews to Faulkner,no run,another slower one, defended back towards the bowler by Faulkner, Mathews moves across to his right to stop that",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Mathews to Faulkner,1 run,full ball on the stumps, Hodge can't put it away, mistimes his shot towards long-on",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Pavan: \"Does anyone remember his 50 off 22 balls against NZ in Hyderabad in 2003? He played that knock when T20 style of batting never existed.\"",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Kumar to Faulkner, $$SIX$$ ,rubbish full toss, 'get that out of my sight,' says Faulkner as he pummels that over long-on for six",
        "isHighlight": true
      },
      {
        "ball": "17.2",
        "text": "Kumar to Faulkner,1 run,dabbed to gully for a single",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Kumar to Hodge,no run,slower one, looks to force that through the off side but Hodge misses",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "\"So, looks like we have to impress you somehow to have our comments posted? Let me make a start - You are the best Cricket reporter I have ever come across.\" Flattery never works, Raj.",
        "isHighlight": false
      },
      {
        "ball": "17.4",
        "text": "Kumar to Hodge,2 wides,way too wide outside off stump, Hodge tries to reach that one but falls over in his attempt",
        "isHighlight": false
      },
      {
        "ball": "17.4",
        "text": "Kumar to Faulkner,1 run,looks for the big hit over the off side this time, a thick outside edge sends the ball bouncing away towards third man",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Kumar to Hodge,no run,wide and full, looks to power that through the off side, Hodge misses out, he was hoping that would be called a wide, it isn't",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Kumar to Hodge, $$FOUR$$ ,another full ball outside off, carved past point for four, Taylor overran that as he tried to field that from sweeper cover",
        "isHighlight": true
      },
      {
        "ball": "18.1",
        "text": "Dinda to Faulkner,1 run,punched towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Dinda to Hodge,1 run,pitched up, and that is again slammed towards long-on",
        "isHighlight": false
      },
      {
        "ball": "18.3",
        "text": "Dinda to Faulkner,no run,full and just outside off, the batsman can't get under that one, can only push the ball back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Dinda to Faulkner,1 run,a low full toss just outside off, hacked towards long-on for a single",
        "isHighlight": false
      },
      {
        "ball": "18.5",
        "text": "Dinda to Hodge,1 run,keeps it full and outside off, thrashed towards sweeper cover for another single",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Dinda to Faulkner,no run,full ball outside off again to round off an excellent over, the batsman moves across and looks to flick it down the leg side, doesn't connect properly",
        "isHighlight": false
      },
      {
        "ball": "19.1",
        "text": "Kumar to Hodge, $$FOUR$$ ,good start to the over for Rajasthan, a full ball,very wide from Bhuvneshwar, Hodges reaches out and connects well, sends that past point for four",
        "isHighlight": true
      },
      {
        "ball": "19.2",
        "text": "Kumar to Hodge,1 run,short of length and outside off, slapped towards cover for a single",
        "isHighlight": false
      },
      {
        "ball": "19.3",
        "text": "Kumar to Faulkner, $$FOUR$$ ,length ball and that is powered to midwicket for four, an almighty heave",
        "isHighlight": true
      },
      {
        "ball": "19.4",
        "text": "Kumar to Faulkner,1 run,powerful hit down the ground, but not powerful enough to beat the man at long-on",
        "isHighlight": false
      },
      {
        "ball": "19.5",
        "text": "Kumar to Hodge, $$FOUR$$ ,full and wide once  more from Bhuvneshwar, Hodge hammers that behind point for four more, Yuvraj dives at backward point but he can't get near that one",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "Kumar to Hodge,1 leg bye,short ball that the batsman wants to send over midwicket, doesn't connect well, the ball dribbles along the pitch and Rajasthan end on 145 for 5",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "$$9.20$$ $$pm$$  Not sure whether that's enough for Rajasthan. Pune have quite a strong batting line-up, with plenty of match-winners. Pune haven't won a match, though, in a long, long time. Will the streak finally end today? Back soon for the chase. Will get my dinner in the meantime.",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Oliver: \"If I said this in person, I might have been attacked by an angry mob, but since I'm on the internet...Dravid batted too slow and wasted deliveries that could have been used up more bountifully by Hodge, Faulkner and Cooper (gulp). #dravidisactuallymyfavbatsman\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Prashant: \"Is the opposite of a come-back, a go-back? Coz that's what Kumar has done. Gets a wicket first ball, finishes with 4-0-41-1\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Cricket simpleton: \"Certain bowlers are not designed for death overs . Moises, Bhuvi,trivedi, praveen kumar are such bowlers who can inflict damage in the early overs . why does not these international players/captains cant use their resources in a different way. #last over agonies\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "AppleBite: \"Gosh, i wish there was a side panel to this live commentary where all the fans like us could put our feed-backs and comments. Publishing 1 comment out of 100 is really not worthy for all us fans who keep constantly writing to you guys !\" AppleBite, meet Cricinfo's  $$Match$$ $$Companion$$ .",
        "isHighlight": false
      }
    ],
    "innings": "Rajasthan Royals  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598009.html?innings=2;page=1;view=commentary",
    "name": "Pune Warriors v Rajasthan Royals",
    "commentary": [
      {
        "ball": 0,
        "text": "$$9.35pm$$  Chase isn't too far off. Pune fans perhaps have  $$this$$ $$scorecard$$  framed in their houses, it was the last time Pune won a game. They have lost 11 in a row since.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Tushar: \"Applebite... you lucky fella.... I am still waiting for my comment to be posted.... Got married meantime and travelled the world as well.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "AJ: \"I am going to stick my neck out and say that Robin Uthappa is going to play a match winning innings or may be Ross Taylor or even Yuvi, or even Angelo Matthews\" Or Mitch Marsh, or Bhuvneshwar Kumar, or Rahul Sharma, or ...",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Aditya: \"\"Fantastic last over good to see 4-1-4-1-4-1\"",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Harmeet Singh to Uthappa,no run,Rajasthan open with Harmeet, a star of the U-19 World Cup last year, first ball is defended",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Harmeet Singh to Uthappa,1 run,a touch short and that is eased towards mid-on for a single",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Harmeet Singh to Finch,1 wide,down the leg side, and that is a free run",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Harmeet Singh to Finch,no run,length ball, Finch backed away from the stumps, a long way from the stumps, and thumped the ball towards cover, couldn't beat cover",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Harmeet Singh to Finch, $$FOUR$$ ,first boundary of the innings, gets down on one knee and sweeps that firmly to the square-leg boundary",
        "isHighlight": true
      },
      {
        "ball": "0.5",
        "text": "Harmeet Singh to Finch,no run,Finch is moving around a lot in the crease, again he is way beyond leg stump, looking for a big hit, he misses and Yagnik breaks the stumps, Finch is in though",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Harmeet Singh to Finch,no run,short of length ball is defended to the right of the bowler, six off the first over",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Karthik: \"Great to see Harmeet get an opportunity! Ian Chappell was  $$full$$ $$of$$ $$praise$$  labelling him as one of the best spinners in cricket right now during the U-19 World Cup!\"",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Sreesanth to Uthappa,no run,a length ball to start from Sreesanth, up against his friend Robin Uthappa, who drives the ball towards mid-on",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Sreesanth to Uthappa,1 run,full ball that is punched towards mid-on, Uthappa pushes for the single, it is an easy one in the end as Sid Trivedi misfields",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Sreesanth to Finch,no run,short of length ball outside off, Finch slaps it to point",
        "isHighlight": false
      },
      {
        "ball": "1.4",
        "text": "Sreesanth to Finch,no run,inside-edge onto the pads and the ball rolls towards the off side, a muted lbw appeal from Sreesanth (not a phrase you hear often)",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Sreesanth to Finch,no run,backs away and looks to hammer the ball through the off side, short of length ball outside off, Finch misses",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Sreesanth to Finch, $$SIX$$ ,pitched up and that is launched over long-on for six, super hit that, clean as they come",
        "isHighlight": true
      },
      {
        "ball": "1.6",
        "text": "Apologies for the Uthappa/Yagnik mix-up in the previous over, fixed it.",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Harmeet Singh to Uthappa, $$FOUR$$ ,too short, much too short from Harmeet, Uthappa waits for the ball to arrive and then clubs it over midwicket",
        "isHighlight": true
      },
      {
        "ball": "2.2",
        "text": "Harmeet Singh to Uthappa, $$FOUR$$ ,short again from Harmeet, this is too easy for Uthappa, can slam it where he wants, picks out midwicket, a flat-batted heave for four",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "Harmeet Singh to Uthappa,1 run,fuller and that is driven along the ground towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "2.4",
        "text": "Harmeet Singh to Finch, $$SIX$$ ,massive! Finch is on a mission here, he's been told to go out there and provide an explosive start to the innings, which Pune have sorely missed, skips down the track and lofts that over long-on for six",
        "isHighlight": true
      },
      {
        "ball": "2.5",
        "text": "Harmeet Singh to Finch,1 run,nearly gone this time, an inside-edge rolls past the stumps, Uthappa wants one, Finch reacts late but he manages to make it",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Harmeet Singh to Uthappa,1 run,tapped to short midwicket for a single that ends an expensive over",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Sreesanth to Uthappa, $$SIX$$ ,this is more of the Uthappa we say several years ago, he plants his front foot forward and whacks a short of length ball over long-on for a huge six",
        "isHighlight": true
      },
      {
        "ball": "3.2",
        "text": "Sreesanth to Uthappa,2 runs,a full toss as a yorker goes wrong, whipped down towards fine leg, seemed headed for a four, but Kevon Cooper manages to stop that from reaching the rope",
        "isHighlight": true
      },
      {
        "ball": "3.3",
        "text": "Sreesanth to Uthappa,(no ball)  $$FOUR$$ ,oh dear, Rajasthan are getting a right hammering here, Sreesanth oversteps, and to make it worse Uthappa steps forward and carves that past extra cover for four, this is turning out to be a massive over",
        "isHighlight": true
      },
      {
        "ball": "3.3",
        "text": "Sreesanth to Uthappa, $$SIX$$ ,oh dear, Sreesanth in meltdown here, as he bowls a waist-high full toss on leg stump, Uthappa picks that up and sends it over the square-leg rope for six, that was so close to being a height no-ball",
        "isHighlight": true
      },
      {
        "ball": "3.4",
        "text": "Sreesanth to Uthappa,1 run,defended to the off side for a single that brings up the 50, within the fourth over! carnage",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Sreesanth to Finch,1 run,short of length ball on off stump, punched down the ground for a single, 134.4kph from Sreesanth",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "I remember watching Uthappa (when he was with RCB) take apart Sreesanth (when he was with Kings XI) with RCB chasing down a huge score. Think that game was in 2010.",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Sreesanth to Uthappa,no run,short of length and just outside off, guided towards point by Uthappa",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Faulkner to Finch,1 leg bye,an lbw first up from Faulkner, but that pitched outside leg",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Faulkner to Uthappa,1 run,length ball outside off. defended towards cover for a quick single",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Faulkner to Finch, $$FOUR$$ ,Finch taking his job of giving a flying start seriously here, he crunches this one length ball over cover for four, it wasn't off the middle of the bat but had enough power on it",
        "isHighlight": true
      },
      {
        "ball": "4.4",
        "text": "Faulkner to Finch,1 run,a crisp drive towards mid-off, but not enough to beat the fielder there",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Faulkner to Uthappa, $$OUT$$ ,what. a. catch. sensational from Dravid, Uthappa was looking to hammer that length ball over the leg side, Dravid was at short midwicket and that ball was travelling, he sticks out his right hand and plucks an astonishing one-handed catch, the reflexes of the 40-year-old doesn't seem to be too bad",
        "isHighlight": true
      },
      {
        "ball": "4.5",
        "text": "$$RV$$ $$Uthappa$$ $$c$$ $$Dravid$$ $$b$$ $$Faulkner$$ $$32$$ $$(19m$$ $$16b$$ $$3x4$$ $$2x6)$$ $$SR:$$ $$200.00$$",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Taylor is the new batsman",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Faulkner to Taylor,no run,length ball is driven towards cover to end the over, what a frenetic start to the chase, Rajasthan need a miracle to win this one",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Cooper to Finch,no run,Cooper's first ball is full, Finch drives it back to the bowler",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "The  $$Uthappa-Sreesanth$$ $$match$$  I was talking about.thanks to Indrasis for the link.",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Cooper to Finch, $$FOUR$$ ,looks for the big hit and get a thin edge instead, past the stumps and the keeper for four, all going Pune's way here",
        "isHighlight": true
      },
      {
        "ball": "5.3",
        "text": "Cooper to Finch,no run",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Cooper to Finch,1 leg bye,full and on the pads, defended to the leg side for a single",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "Cooper to Taylor,1 run,full ball heading for middle and off, dug out towards mid-on",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "Anirudh: \"Loving the spirit of oldies on the field!!!\"",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Cooper to Finch,no run,worked towards midwicket, dot ball to end the Powerplay",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Several people mailing this in. Aditya M: \"Dravid fans, start again the praise for the legend. My contribution - This guy is as fit now as he's when he caught Moin Khan in 2000 at Gabba.\"",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Faulkner to Taylor,1 run,short of length and angling away, guided down to third man for a single",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Faulkner to Finch,no run,length ball is driven towards short cover",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Faulkner to Finch,no run,Finch hasn't looked entirely at ease in this innings, plenty of mis-hits, and missed swipes, here's one more, looking to club the ball to midwicket but doesn't connect",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Faulkner to Finch,1 run,full ball on the pads, dribbled away for a bye",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Faulkner to Taylor,1 run,128.8kph from Faulkner, a short ball that is defended for a single, Taylor gets on his toes to get on top of that one",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Faulkner to Finch,no run,shortish, slapped towards cover",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Sid Trivedi is on",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Trivedi to Taylor,1 run,length ball on offstump, outside edges the ball towards backward point",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Trivedi to Finch,1 wide,down the leg side and that's another free run, something Rajasthan can't afford",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Trivedi to Finch, $$FOUR$$ ,short of length ball sliding into the pads, easy for Finch, he takes care to place that wide of short fine leg and picks up another boundary",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Trivedi to Finch,no run,guided to short third man this time",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Trivedi to Finch, $$FOUR$$ ,short of length ball, too wide from Trivedi, Finch carves that behind point for four more, Dravid claps to encourage his bowler, but this match is pretty much over now",
        "isHighlight": true
      },
      {
        "ball": "7.5",
        "text": "Trivedi to Finch,no run,length ball on off stump, defended back to the bowler, 'Bowling, bowling,' shouts Yagnik",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Trivedi to Finch,2 runs,on off stump, chopped towards sweeper cover, pushing hard for the second",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Strategic time-out, spend it watching this  $$video$$  of great Dravid catches. Thanks for the link AJ.",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Murali Mohan: \"Okay, this catch from Dravid just about cancels the countless ones he dropped in the slips towards the end of his career.. *Shuts down the comp and starts to run*\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Vibhanshu: \"Excellent start by PWI. Looks like all they needed was a little \"Finch\" to wake them up from their slumber during the powerplays.\" Tip to commenters, I'm partial to bad puns.",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Aditya M: \"I actually want to publish a Novel I've written for a long time now, but couldn't gather up the courage to approach a publisher. That comment of mine you published gave me a lot of courage. Those are my first published words.\" Glad to help.",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Harmeet Singh to Taylor,no run,Harmeet is back, length ball to start, it is defended to the off side",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "Harmeet Singh to Taylor,no run,gives it some flight, defended to the off side",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Harmeet Singh to Taylor,no run,a touch short, and a bit of width, but Harmeet escapes, Taylor could have hammered that one, but he doesn't beat backward point",
        "isHighlight": false
      },
      {
        "ball": "8.4",
        "text": "Harmeet Singh to Taylor,1 run,eases this towards sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Harmeet Singh to Finch,no run,a touch short once more, slapped towards short cover where the substitute Sachin Baby makes a good stop",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Harmeet Singh to Finch,2 runs,just outside off, squeezed towards deep point, a misfield allows the batsmen to come back for the second",
        "isHighlight": true
      },
      {
        "ball": "8.6",
        "text": "Fred: \"Harmeet is good young bloke... so unfortunate to let him bowl in this treacherous format. Will be good for him, if he spends his younger days in longer format.\" He doesn't get too many games with Mumbai in the Ranji trophy either, as they have a glut of left-arm spinners.",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Trivedi to Taylor,no run,back of a length ball is defended to backward point",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Trivedi to Taylor,1 run,too short and down the leg side, guided down to fine leg",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Trivedi to Finch,no run,finch again skips away from leg stump, looks to power the ball through the off , but he misses, the ball slides between his body and the stumps, great take by the keeper",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Hiten Dave: \"I wonder if the players themselves play the fantasy league...\"",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Trivedi to Finch,1 run,eased to long-on for a single",
        "isHighlight": false
      },
      {
        "ball": "9.5",
        "text": "Trivedi to Taylor,1 run,length ball is tapped towards long-on for leisurely single",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Trivedi to Finch,2 runs,chipped towards long-on, this time for a couple, no need for anything rash here from Pune, this game is well in hand",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Anshul Goel: \"@ Siddarth.. The Uthappa-Sreesanth encounter of 2010 you mentioned; just saw RCB squad, only two players are in current team, Kohli and Vinay kumar.. Chennai and Mumbai have done well to retain the core.\"",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Shounak Abhyankar: \"Hiten Dave: I bet Chris Gayle does and has himself as the captain of his team.. ;)\"",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Cooper to Taylor,1 run,a misfield at short cover allows a single, Cooper is back on",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Cooper to Finch,1 run,mistimed drive towards mid-off",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Cooper to Taylor,1 run,guided down to third man, a hint of width, that was enough for the batsman",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Cooper to Finch,no run,length ball is punched back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Cooper to Finch, $$SIX$$ ,a full toss on leg stump, easy put away for Finch, sends it over the square leg rope to bring up his half-century",
        "isHighlight": true
      },
      {
        "ball": "10.6",
        "text": "Cooper to Finch,no run,pitched up, and that drive can't beat the bowler",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Ashok: \"@Hiten Dave - You are forgetting that the IPL itself is a \"fantasy game\" played by a wealthy few Indian billionaires! :)\"",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Harmeet Singh to Taylor,no run,Taylor goes for his favourite midwicket swipe but that spins away from him outside off",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Harmeet Singh to Taylor, $$SIX$$ ,this time it is on a length and on the pads, Taylor brings out his awesome slog-sweep that made him a crowd favourite in Bangalore in the first few seasons of the IPL, he dispatches that over midwicket for six",
        "isHighlight": true
      },
      {
        "ball": "11.3",
        "text": "Harmeet Singh to Taylor,2 runs,too short from Harmeet, Taylor waits on the backfoot and slaps that towards sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Harmeet Singh to Taylor,no run,wanted to club that one as well, but mistimes it back towards the bowler",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Harmeet Singh to Taylor,no run,Harmeet giving the ball an astonishing amount of air, great to see that he has the confidence to do that even after getting a pasting, Taylor goes for a big shot over the off side, inside-edges it, and the ball bounces to the keeper",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Harmeet Singh to Taylor, $$OUT$$ ,reward for Harmeet, he continues to flight it, Taylor connects with the slog-sweep but Hodge joins the list of oldies taking astonishing catches by latching on to that at the midwicket boundary, stretches out and jump as he clasps that overhead",
        "isHighlight": true
      },
      {
        "ball": "11.6",
        "text": "$$LRPL$$ $$Taylor$$ $$c$$ $$Hodge$$ $$b$$ $$Harmeet$$ $$Singh$$ $$17$$ $$(30m$$ $$20b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$85.00$$",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Faulkner to Finch, $$FOUR$$ ,beautiful shot from Finch, overpitched and on off stump, gracefully pushed back past the bowler for four",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "Faulkner to Finch,no run,length ball on middle stump, defended from the crease",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Faulkner to Finch,1 run,full ball outside off, guides this towards point for a single",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Faulkner to Yuvraj Singh,no run,wants to help that short one towards fine leg, can't connect properly though",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Ram: \"Got to give it to the crowds of pune to turn out even when their team was not performing well, absolutely jam packed and the players giving them something to cheer about\"",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Faulkner to Yuvraj Singh,no run,Yuvraj not looking comfortable yet, looking to tuck the ball to the leg side, struck on the pads, ball rolls to the off side",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "sahil: \"great sight that.....harmeet flighting each ball to taylor in a T20 match...they dont make such bowlers any more !!!\"",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Faulkner to Yuvraj Singh,no run,goes for a flat-batted slap towards long-on, badly mistimes it, ball dribbles towards mid-on",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Sathia Jobe: \"Taylor kept swinging at him from Ball One. He might have just picked the wrong guy. Daring Over by Harmeet !. Guys got Guts !\"",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "ashish: \"Harmeet Singh reminds me of the times when as a kid when we played cricket the guy who bowled the slowest ball was the toughest to hit. Looks as if you can plonk him anywhere in the ground but really end up going as far as the bowler.....\"",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Trivedi to Finch,1 run,short of length ball on off stump, defended towards mid-on, sets off for a quick single, Finch was gone if that hit, he even gave up, but the throw missed, Finch is annoyed with himself",
        "isHighlight": true
      },
      {
        "ball": "13.2",
        "text": "Trivedi to Yuvraj Singh,no run,length ball on off stump, an outside edge sends the ball in front of point",
        "isHighlight": false
      },
      {
        "ball": "13.3",
        "text": "Trivedi to Yuvraj Singh,1 run,short of length slower ball on the pads, eased in front of square leg for a single, Yuvraj is off the mark",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Trivedi to Finch,1 run,short of length again, only 115.4kph, still the ball rises, defended behind point",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Trivedi to Yuvraj Singh,no run,an edge sends the ball towards cover",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Trivedi to Yuvraj Singh,no run,short of length ball on off stump, defended to the off side by Yuvraj",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Cooper to Finch,1 run,a low full toss outside off, should have been put away, finch can only club it along the ground to long-off, Finch angry at missing out",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Cooper to Yuvraj Singh,1 run,a yorker on leg stump, Yuvraj squeezes it out towards square leg",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Sudhindra: \"People are talking about every bowler in the IPL from Harmeet Singh to Sunny Gupta, but no one ever seems to mention Trivedi. He's been one of the most consistent bowlers for RR right from IPL-1\"",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "Cooper to Finch,1 run,length ball is heaved towards long-on for one more",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "sam: \"The only guy who I think can even better Gayle when on song is Yuvi. Waiting for him to get into some form...\"",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Cooper to Yuvraj Singh,1 run,length ball outside off, sent down towards third man for a single",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Cooper to Finch,1 run,short and wide, slapped towards sweeper cover for another single",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Cooper to Yuvraj Singh,no run,length ball outside off, driven towards cover by Yuvraj",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Abhinav: \"Like a true fan I am still hoping for an RR win. Given that Pune were restricted to 99 before, the asking rate here is more.\"Naren: \"I applaud Dravid as well for sticking with Harmeet. Any other captain might have taken him off after the early onslaught.\"",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Trivedi to Finch,1 run,short of length ball from Trivedi, 121kph, worked towards the leg side for a single",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Trivedi to Yuvraj Singh, $$SIX$$ ,oh beautiful, there's what the fans came to see, Yuvraj Singh's effortless six hitting, that was short of length, disdainfully put away over wide long-on by Yuvraj",
        "isHighlight": true
      },
      {
        "ball": "15.3",
        "text": "Trivedi to Yuvraj Singh,1 run,a single to the off side now",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Trivedi to Finch,1 run,skipping away from the stumps, Trivedi follows him, Finch is cramped up, defends to short midwicket",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Trivedi to Yuvraj Singh,1 run,length ball on legstump, Yuvraj helps that along towards deep square leg, a good bit of fielding by Harmeet near the rope",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Trivedi to Finch,1 run,back of length slower ball, 112.8kph, defended towards mid-on for a single",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Andrew: \"@Sudhindra: You are very correct in saying that Trivedi is consistent - one or two wickets per match, economy between 7.50 and 9 but that's the very reason he flies under the radar. Would I have him on my team? Sure. Equally, however, neither would I count on him to be my match-winner (a la Malinga, Steyn, etc).\"",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "$$Time-out$$ $$time$$",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Faulkner to Finch,no run,an appeal for lbw, but that was pitching outside leg",
        "isHighlight": true
      },
      {
        "ball": "16.2",
        "text": "Faulkner to Finch,1 wide,down the leg side, tried to flick it to fine leg but he missed out",
        "isHighlight": false
      },
      {
        "ball": "16.2",
        "text": "Faulkner to Finch,no run,short of a length, defended off the back foot",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "Faulkner to Finch,no run,low full toss outside off, punched towards deep extra cover",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Faulkner to Finch,1 run,eased towards mid-on for a single",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Vatsala Goyal: \"If I were Dravid I would instruct my players to spend the entire strategic time out forming a circle around Finch and staring him down. Scaring him into wanting to get out seems to be RR's only hope of victory\"",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Faulkner to Yuvraj Singh,1 run,full ball on the pads, drops it to the left of the bowler for a single",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "ranjan: \"sreesanth to bowl 2 more overs. A sadist's delight!\"",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Faulkner to Finch, $$OUT$$ ,Faulkner gets his wicket, a full ball uproots the middle stump, and ends a match-winning innings from Finch",
        "isHighlight": true
      },
      {
        "ball": "16.6",
        "text": "$$AJ$$ $$Finch$$ $$b$$ $$Faulkner$$ $$64$$ $$(71m$$ $$53b$$ $$6x4$$ $$3x6)$$ $$SR:$$ $$120.75$$",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Cooper to Yuvraj Singh,no run,full and wide, Yuvraj looks to guide towards third man and misses",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Punit: \"Andrew, you can't expect every player to be a match-winner\"",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Cooper to Yuvraj Singh, $$FOUR$$ ,length ball on the pads, 133.4kph, easy put away, glanced down to fine leg for four",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Cooper to Yuvraj Singh,no run,full ball on middle, driven towards extra cover",
        "isHighlight": false
      },
      {
        "ball": "17.4",
        "text": "Cooper to Yuvraj Singh,1 run,full again from Cooper, dug out towards long-off for a single",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Cooper to Mathews,1 run,pitched up again, eased towards mid-on for one more",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "MJain: \"match-winning innings .... its not done yet ... Sreesanth gonna take hat-trick in the next over\"",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Cooper to Yuvraj Singh,1 run,length ball outside off, a regal drive sends the ball towards sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "18.1",
        "text": "Sreesanth to Yuvraj Singh,no run,length ball on middle stump, defended down the track",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Sreesanth to Yuvraj Singh, $$FOUR$$ ,cracking hit from Yuvraj, Shastri says, \"when he hits them, they stay hit,\", it was a booming lofted straight drive from Yuvraj, four to go now",
        "isHighlight": true
      },
      {
        "ball": "18.3",
        "text": "Sreesanth to Yuvraj Singh,no run,full ball is squeezed out to the off side",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Sreesanth to Yuvraj Singh, $$SIX$$ ,Yuvraj hits it out of the park and the 11-match losing streak is over, it was on the pads and that is effortlessly deposited into the crowd beyond midwicket",
        "isHighlight": true
      },
      {
        "ball": "18.4",
        "text": "Huge relief for the Pune Warriors. They had begun so well last season, winning three out of four, and then barely won a game for the rest of the season. They started this year with a couple of defeats, prompting a re-jig at the top of the order. It paid off, and how. Uthappa and Finch killed off this chase in the Powerplay.",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "$$Robin$$ $$Uthappa:$$  \"We really needed this. We have worked hard as a team. Donald has helped everybody keep calm, deal with the pressure. I think we have got a hang of this wicket now, it is a young wicket, it is still settling in, it will take time to become a flat Twenty20 wicket. I was pleased to get the team off to a good start, we have been a bit apprehensive with our approach, probably because of the losses before.\"",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Here's the latest  $$points$$ $$table$$ .",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Piyush: \"Lots of you might find it weird, but according to me MOM should be Rahul Sharma, he brought the run rate in check when Rahane and Dravid were scoring easily.\"",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Jey: \"I'll probably give the MoM to Yuvi for 3 reasons. 1. 2/27 2. 28 of 23 3. Fantasy captain. Ting. sorry. still thinks he is a part of kings xi\"",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Man of the Match is  $$Aaron$$ $$Finch$$ : \"It was nice, we knew we had to get off to a good start, the wicket gets a bit slower and lower as the ball gets older. Credit goes to Uthappa, 32 off 16 really set us up. Today was our day, it was nice to get away with it. I thought our bowlers did a great job to restrict them after that partnership between Rahul and Rahane.\"",
        "isHighlight": false
      }
    ],
    "innings": "Pune Warriors  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598011.html?innings=1;view=commentary",
    "name": "Mumbai Indians v Pune Warriors",
    "commentary": [
      {
        "ball": 0,
        "text": "Ponting and Tendulkar out to open. Ponting to take strike. Finch to open with his slow left-armers, surprise, surprise",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$3.35$$ $$pm$$ $$Ponting$$ $$wins$$ $$the$$ $$toss$$ $$and$$ $$MI$$ $$will$$ $$bat$$",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Both sides are unchanged, say the captains. Now that is something you don't see too often in the IPL",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Atul: \"@Kiran in banking terms Maxwell is Cash Reserve Ratio !\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Fox: \"A million dollars. A tour of India. Free cricket coaching from Ricky Ponting, Sachin Tendulkar, Jonty Rhodes and Anil Kumble. I wish I was Glenn Maxwell.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "kiran: \"In banking terms we call maxwell a \"non-performing asset\"\" An idle asset would be more like it, kiran",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Priyesh M: \"Mitchell Marsh bats at 7/8 and bowls 1 over. I refuse to believe he's a better batsman than wright or smith. If you want a batsman, play steve smith and if you want an allrounder play luke wright. Mitchell Marsh? really?\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Mick: \"I wonder if the likes of Maxwell and Smith are being rested for the Ashes.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Anuapm Sarkar: \"Did PWI forget Steve Smith contribution of last year? Taylor should make way for him.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Naveen: \"Enough of 'Ponting-Tendulkar' walking together, blah blah...! They need runs now..!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Dave: \"Million Dollar Man Maxwell must be having a ball. Getting a truckload of cash for sitting on his backside game after game!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Ankit Mehta: \"It really baffles me with MI...what were they thinking when they picked up Maxwell for a million bucks and now dont play him....why go through all that trouble, if you didnt want him in the XI?\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "vivek nair: \"The strategy of MI is pretty clear - Maxwell will be unleashed in the latter part of the IPL - the business end of it! The early parts - anyway, MI breezes through all the matches.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "NITIN FULORIA: \"Both Maxwell and Smith should get an opportunity to play today for their respective teams. They must be waiting to unleash and perform at this level!\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Nitin Jauhari: \"At least one thing good with Ponting's captaincy that he brings luck in winning tosses and wins them regularly.\"",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "$$3.15$$ $$pm$$  Game 15 of IPL '13. Mumbai Indians v Pune Warriors. Big question - will Pondulkar/Tonting be separated for today's game? With the riches at their disposal, Mumbai Indians are usually quick to tinker",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Pune have limited burgeoning history by ending the longest losing streak in the IPL",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "------------------------------------------------------------------------------------- Today's matches are the closest contests the IPL has to derbies. The first game is between Mumbai Indians and Pune Warriors. Here's our  $$preview$$  to the match.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "The game starts in a few hours so you should update your  $$T20$$ $$Fantasy$$ $$teams$$  now. Even if you are falling behind on the overall leader board, there are  $$daily$$ $$prizes$$  to be won, so get selecting now.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "If managing a playing XI is not your cup of tea, that's alright - there's still plenty to win on ESPNcricinfo.  $$Guess$$ $$the$$ $$winners$$  of each match, and you could be in line for huge prizes.",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "",
        "isHighlight": false
      },
      {
        "ball": 0,
        "text": "Have a look at  $$The$$ $$Stands$$  - ESPNcricinfo's latest initiative to bring our readers on-board. The Stands is where you can do match reports for us, have your say on burning issues, get your cricket pictures showcased to the world, and submit articles on cricketing topics that interest you.",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Finch to Ponting,1 run,flighted full toss, pushed to the leg side",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Finch to Tendulkar,no run,comes forward and nudges a length ball to the leg side softly",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Finch to Tendulkar,no run,coming in with the angle, he stays on the crease and pushes to the bowler",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Finch to Tendulkar,no run,that almost popped back to the bowler, Sachin trying to paddle from off stump, got a leading edge",
        "isHighlight": true
      },
      {
        "ball": "0.5",
        "text": "Finch to Tendulkar,no run,full, angled in, turned to midwicket",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Finch to Tendulkar,2 runs,shortish, he goes for the pull, but he's not timed it all all, it loops just over mid on running to his right, and is stopped inside the rope with a slide",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Bhuvneshwar to try and swing it now",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Kumar to Ponting,no run,now Ponting nearly pops one back to the bowler, this comes in sharply from back of a length, he tried turning it to leg, leading edge died halfway down the pitch",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Kumar to Ponting,no run,full, wide, he reaches it, and pushes, straight to backward point",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Kumar to Ponting, $$FOUR$$ , $$chance$$ , huge inswinger, Ponting sucked into the drive, it swerves in, takes a thin inside edge, but Uthappa is not able to get there with a dive",
        "isHighlight": true
      },
      {
        "ball": "1.4",
        "text": "Kumar to Ponting,no run,and again, alarming inswing for Bhuvneshwar, Ponting forward again, the ball sneaks in through the gate, this time Uthappa collects and appeals, in vain",
        "isHighlight": true
      },
      {
        "ball": "1.5",
        "text": "Kumar to Ponting, $$FOUR$$ ,this came in as well, but was short, and that will do for Ponting, as he thumps it over midwicket with one of his pulls, one bounce and over",
        "isHighlight": true
      },
      {
        "ball": "1.6",
        "text": "Kumar to Ponting,no run,pitched up, and now he's hesitant to get forward, moves across and plays it out from the crease",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Harit Gautam: \"Bhuvi to try and swing. These 2 to try and see if they can still score.\"",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Dinda on, wide slip in",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Dinda to Tendulkar,1 wide,pitched up, swinging away, starting too far outside off",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Dinda to Tendulkar, $$FOUR$$ , $$chance$$ , very tough, Dinda overcompensating by floating one into the pads, Sachin flicks in the air, inches past Bhuvi's dive at short fine leg",
        "isHighlight": true
      },
      {
        "ball": "2.2",
        "text": "Dinda to Tendulkar, $$FOUR$$ ,classic Tendulkar, good length delivery sent racing through extra cover with that back-foot punch",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "Dinda to Tendulkar, $$FOUR$$ ,pitched up, swinging away, Sachin pushes at it, thick edge flies in the air high and behind point",
        "isHighlight": true
      },
      {
        "ball": "2.4",
        "text": "Dinda to Tendulkar, $$FOUR$$ ,four in four, Dinda overpitches, Sachin slams it powerfully past mid off's dive",
        "isHighlight": true
      },
      {
        "ball": "2.4",
        "text": "Hassan: \"Today is the day when Ponting and Tendulkar will prove everyone wrong.\"",
        "isHighlight": false
      },
      {
        "ball": "2.5",
        "text": "Dinda to Tendulkar,no run,moves across and outside off, opens the face to a length ball, finds point",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Dinda to Tendulkar,no run,goes across looking to swing this short one away, but it bounces too much",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Kunal: \"Ponting will his signature pull shot while Sachin with trademark back-foot cover drives and straight drives - feel like their combined age is 40.\"",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Rahul Sharma comes on",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Sharma to Ponting,no run,straightens on leg stump, loud shout from the bowler for lbw, turned down, marginal call, that was probably clipping leg",
        "isHighlight": true
      },
      {
        "ball": "3.2",
        "text": "Sharma to Ponting,no run,flighted high full toss too, Ponting cannot put it away, pushes it to square leg",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Sharma to Ponting,1 run,now he drags it very short, but Ponting's pull finds deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Sharma to Tendulkar,1 run,tossed up full outside off, he does not time the drive, picks one to wide long off",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Sharma to Ponting,1 run,quicker and very full on off, he leans across to turn it through midwicket",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Shivam: \"This is poor from Matthews. Kumar was troubling Ponting, why remove him after just 1 over, especially as he bowls better with the new ball!\"",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Sharma to Tendulkar, $$FOUR$$ ,Tendulkar is racing away, clears front leg to a tossed up overpitched ball and slams it down the ground past the non-striker",
        "isHighlight": true
      },
      {
        "ball": "3.6",
        "text": "No Bhuvi, Angelo will try himself",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Fox: \"yes.. oh yes!! It is the day! :)\"",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Mathews to Ponting,no run,pitched up straight outside off, he comes forward and checks a push to the bowler",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Mathews to Ponting,no run,pushed to cover",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Mathews to Ponting,1 run,slow from a good length, he waits and turns it to square leg",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "loyamohit: \"All bowlers want to have their pie in the scoring rate\"",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Mathews to Tendulkar,no run,walks out and tries to blast an outswinger through the off side, misses, he means it today, really does",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Mathews to Tendulkar,no run,turned eagerly from off but straight to midwicket",
        "isHighlight": false
      },
      {
        "ball": "4.5",
        "text": "Sanjith Raju: \"Mathews need to take a leaf out of dhonis book. bowl out bhuvaneshwar at the start of the innings\"",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Mathews to Tendulkar,1 run,straightens outside off, he is crisply forward to drive it wide of mid off for a single",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Ian: \"Quick, stop the comments about a partnership between two legends... You'll jinx it!\"",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Sharma to Tendulkar,no run,short and sitting up outside off, but he's slapped it to extra cover",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Sharma to Tendulkar,no run,comes out and drives but finds deepish mid on",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "Sharma to Tendulkar,no run,tossed up, mid on is straightish and Tendulkar's powerful drive is cut off by Yuvraj there",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Sharma to Tendulkar, $$FOUR$$ ,straightforward  $$chance$$  at mid on, Tendulkar slogs one in the air, it is dying on Yuvraj, not only does he make an absolute mess of it as he bends down, he allows it to go through him for four more",
        "isHighlight": true
      },
      {
        "ball": "5.5",
        "text": "Sharma to Tendulkar, $$SIX$$ ,and Tendulkar rubs it in, backing away and having another powerful swipe next ball, over deep midwicket",
        "isHighlight": true
      },
      {
        "ball": "5.6",
        "text": "Sharma to Tendulkar,1 run,makes some room and squeezes an overpitched ball to covers",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Mathews to Tendulkar,no run,short, widish, he tries to upper cut, is beaten by the carry",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Mathews to Tendulkar,1 run,only seldom you see Tendulkar go after every ball, comes out and has a heave, thick edge flies down to third man",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Mathews to Ponting,1 run,the pull does not quite come off, this is a slow bouncer, Ponting does well to control it through square leg in the end",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Sushil: \"Yuvraj should make up today with his batting for the drop of Scahin's catch\"",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Mathews to Tendulkar,2 runs,one more misfield, Pune losing it, Tendulkar whipping one from off to midwicket, where Rahul Sharma tumbles awkwardly and lets it through",
        "isHighlight": true
      },
      {
        "ball": "6.5",
        "text": "Mathews to Tendulkar,1 run,overpitched, timed nicely, but the sweeper is in position",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Mathews to Ponting,1 run,chips a length ball over the bowler, long on keeps them to one",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Dixit: \"The way Sachin is playing today its hit out or get out. Till now its working..\"",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Yuvi comes on",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Yuvraj Singh to Ponting, $$OUT$$ ,Has he got Ponting first ball? They are checking whether it carried to shortish backward point, it has been taken cleanly by the fielder low to his left, the question is whether Ponting drove it into the pitch first, replays show that ain't the case, and Yuvraj has broken the partnership",
        "isHighlight": true
      },
      {
        "ball": "7.1",
        "text": "$$RT$$ $$Ponting$$ $$c$$ $$Nayar$$ $$b$$ $$Yuvraj$$ $$Singh$$ $$14$$ $$(33m$$ $$17b$$ $$2x4$$ $$0x6)$$ $$SR:$$ $$82.35$$",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "KKD Karthik, in red-hot form",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Yuvraj Singh to Karthik,no run,floated very full outside off, mistimed drive towards point",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Yuvraj Singh to Karthik,1 run,full, he drives down to long off to get off the mark",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Avish : \"Dixit, sometimes hit out or get out is the best way to get some good form going!\"",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Yuvraj Singh to Tendulkar,1 run,very flat to Tendulkar, who is neatly forward to push to long off",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Karthik pulls out just as Yuvraj is about to deliver, movement around the sightscreen",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Yuvraj Singh to Karthik,no run,slow and full, straightening outside off, defended",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Yuvraj Singh to Karthik,no run,bounces from a good length now, pushed back to the bowler",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Finch gets another over",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Anurag: \"Another good thing tendulkar's doing today is not taking suicidal runs. He's been run out two of the previous three innings\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Yuvraj's not quite made up for that drop yet, but this is a mighty fine start with the ball from him",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Finch to Tendulkar, $$FOUR$$ ,floated up low full toss on leg, he gets the front leg across, and bends to paddle it very fine",
        "isHighlight": true
      },
      {
        "ball": "8.2",
        "text": "Finch to Tendulkar, $$OUT$$ ,excellent effort from Mitch Marsh on the edge of the long on boundary, looked like he'd lost it, but he's recovered to take it over his head and tumbled down hard with the effort, Finch slowing it down further and tossing it up, Sachin left the crease immediately to have a go, but wasn't to the pitch, had to reach out and ended up skying it",
        "isHighlight": true
      },
      {
        "ball": "8.2",
        "text": "$$SR$$ $$Tendulkar$$ $$c$$ $$Marsh$$ $$b$$ $$Finch$$ $$44$$ $$(38m$$ $$29b$$ $$7x4$$ $$1x6)$$ $$SR:$$ $$151.72$$",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "He's smashed it around today, but fallen to a slow left-armer again",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Finch to Karthik,1 run,nudged off the pad square on leg",
        "isHighlight": false
      },
      {
        "ball": "8.4",
        "text": "Finch to Sharma,1 run,flat, good length, some turn outside off, Rohit stays on the crease and punches to long off",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Finch to Karthik,1 run",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Sreekanth: \"All good things come to an end.\"",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Finch to Sharma,1 run,slow, on a good length, gentle, tight stuff, punched down to long on",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "manu: \"Seems hit out or get out way worked for sachin... and finally its better to get out caught at boundary, trying for a six, rather than a run out trying for a single... !!!\"",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Bhuvi is back",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Kumar to Sharma,1 run,short of a length, nice bounce, he is on the toes to drop it in front of cover",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Kumar to Karthik,no run,reaches forward to a fullish delivery and works it past the non-striker, mid on gets around",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Kumar to Karthik,1 run,full and angled in to off, he is moving forward and across and pushes it down the ground",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Kumar to Sharma,1 run,forward elegantly to open the face and runs it wide of point",
        "isHighlight": false
      },
      {
        "ball": "9.5",
        "text": "Kumar to Karthik, $$FOUR$$ ,shot, DK displays the form he is, walks out, stops and swats a shortish delivery behind square leg",
        "isHighlight": true
      },
      {
        "ball": "9.6",
        "text": "Kumar to Karthik,1 run,holding its line outside off from a good length, he slaps it down to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "loyamohit: \"The most high rated talent is in the middle ....\"",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Rahul Sharma back",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Sharma to Karthik,1 run,shortish and quick outside off, cut hard, but Yuvraj stops it with a dive at backward point",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Sharma to Sharma, $$FOUR$$ ,that skidded and bounced from good length, Rohit tried to punch it off the back foot, thick edge flies through vacant slip",
        "isHighlight": true
      },
      {
        "ball": "10.3",
        "text": "Sharma to Sharma,no run,very full on off, patted down to the bowler",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Sharma to Sharma,1 run,skidding away widish, dabbed to short third",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Sharma to Karthik,1 run,tossed up full, whipped against the turn to long on",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Sharma to Sharma,no run,DK rushes up for  the single, but the ball has gone to shortish midwicket with Rohit's clip, and he's got to turn back",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "KM: \"Ponting has looked out of sorts, really, in this IPL, not once has he even touched a strike rate of 100. Furthermore, he's been putting pressure on SRT. Even looking at the match against RCB, Pointing played out 32 balls for 28 runs, whereas SRT has 27 (21). Clearly, Ponting is not doing much to earn his place as a batsman - more so as an international player. All that said, if his captaincy is worth all that he's occupying - this really being a decision for the MIs think-tank to make - he should be made to open, given the chances of his scoring runs are maximum with fielding restriction.\"",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Yuvraj Singh to Karthik, $$FOUR$$ ,that came in with the angle, bounced too, but DK is in another zone at the moment, where such deliveries are only to be smashed over midwicket with a quick pull",
        "isHighlight": true
      },
      {
        "ball": "11.2",
        "text": "Yuvraj Singh to Karthik, $$FOUR$$ ,now he's lofted over extra cover, forward on the knee to the pitch and lovely connection, also becomes the leading run-getter again this season",
        "isHighlight": true
      },
      {
        "ball": "11.3",
        "text": "Yuvraj Singh to Karthik,1 run,pushed on the off side for a single",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Yuvraj Singh to Sharma,1 run",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Yuvraj Singh to Karthik,no run,punched to short extra cover's right and stopped with a quick dash",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Yuvraj Singh to Karthik,1 run,dabbed late wide of short third man",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Sharma to Karthik,no run,comes out, sees the length is not quite full and cuts, to point",
        "isHighlight": false
      },
      {
        "ball": "12.2",
        "text": "Sharma to Karthik,no run,tries to run a quick and fullish one to third man, misses",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Sharma to Karthik,1 run,flat, quick and short, he hasnt got hold of the pull, picks up one through midwicket",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Sharma to Sharma,no run,Rohit in a tangle with one that straightens and comes on quickly around off and middle, rolls into pad and onto the pitch",
        "isHighlight": true
      },
      {
        "ball": "12.5",
        "text": "Sharma to Sharma,no run",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Sharma to Sharma,1 run,flighted low full toss pushed wide of long on",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Ian: \"@KM- I think Ponting offers a lot more than just his skill as a batsman. As Australia's captain for a number of years, I think it's fair to say that he's the most experienced and arguably the best captain in world cricket right now. Also, his fielding is electric!\"",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Mathews to Sharma,1 run,chops a length ball coming in on off, behind point",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "yogi: \"Excellent spell from rahul sharma on a flat track. He could have had a wicket and conceded 4 runs less if yuvi had caught that.\"",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Mathews to Karthik, $$SIX$$ ,short, into the body, DK has casually moved across and swung it over the fine leg boundary",
        "isHighlight": true
      },
      {
        "ball": "13.3",
        "text": "Mathews to Karthik,2 runs,overpitched on the stumps, he goes across and whips it wide of deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Mathews to Karthik,1 run,low full toss driven down to long off, serious timing on that from DK",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "AaruC: \"This may be a controversial opinion, but I don't think Ponting was ever a great captain. He led a great team, yes. But like Taylor or even Steve Waugh, he at no point built the team that was word class, he just inherited it.\"",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Mathews to Sharma,1 run,whips a full delivery down to long on",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Rajesh Bharwad: \"Over rated (Sharma) and under rated (DK) talent are in the middle..\"",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Mathews to Karthik,1 run,forward quickly but hits the drive into the pitch and takes the single as it dribbles down to long on",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "vivek: \"Both the captains in this match don;t deserve a place in the team...\"",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Dinda back after his expensive over",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Dinda to Karthik,2 runs,nicely on top of the bounce to punch wide of sweeper cover and comes back for two",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Sekhar: \"Talking about greatness, one aspect of greatness is to create something great which is what Steve Waugh did. Another aspect is to sustain the greatness which is what Ponting did. And both deserve credit.\"",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Dinda to Karthik, $$FOUR$$ ,that was technically a chance, but Dinda did well to not be in the way when the drive rocketed straight back",
        "isHighlight": true
      },
      {
        "ball": "14.3",
        "text": "Dinda to Karthik,2 runs,he is placing them too easily in the gaps, wills a good length delivery away from the sweeper with a wristy punch",
        "isHighlight": false
      },
      {
        "ball": "14.4",
        "text": "Dinda to Karthik,1 run,hangs the bat out very late and picks up one to third man",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Dinda to Sharma,no run,gets the bouncer, and weaves out of the line",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Dinda to Sharma,2 runs, $$dropped$$  by his Mumbai team-mate and friend Nayar, who makes a good fist of it as he runs in from sweeper cover and dives forward but the mistimed lofted drive pops out",
        "isHighlight": true
      },
      {
        "ball": "14.6",
        "text": "Mitch Marsh  $$makes$$ $$the$$ $$mandatory$$ $$one$$ $$over$$ $$appearance$$  comes on now",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Taha: \"Ponting was a great captain in his own way.The way he led from the front was something steve waugh and taylor never matched.in the most hopeless situations(eg.Ashes 2005) ponting played innings of sheer class and rescued Australia.\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Shaurya : \"So happy for DK here. I have always believed he is greatly under-rated as compared to this abilities. Here is hoping that this IPL will get him back into the national side!\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Nitin Fuloria: \"I think Dinda is a good fast bowler. He bowls his heart out. But 20-20 is too harsh on him.\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Mayank Srivastava: \"Very poor captaincy from Angelo. He is far too much shuffling his bowlers. Has utilized Rahul Sharma's full quota of overs. Removed Bhuvi when he bowled a good over at the start and troubled Ponting.\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Rohit: \"I think Ponting became a much better captain after all the greats in his team retired.\"",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Marsh to Karthik, $$OUT$$ ,and he's needed one ball to strike, and DK is the man to go, offcutter coming in a long way, hitting him in front as he comes forward, not much doubt about that",
        "isHighlight": true
      },
      {
        "ball": "15.1",
        "text": "$$KD$$ $$Karthik$$ $$lbw$$ $$b$$ $$Marsh$$ $$41$$ $$(38m$$ $$29b$$ $$4x4$$ $$1x6)$$ $$SR:$$ $$141.37$$",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Pollard walks in",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Marsh to Pollard,1 wide,short of a length and angled down the leg side",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "yogi: \"@Nitin Fuloria Not to be harsh but, the criteria for being a good bowler can't be bowling your heart out and the reason Dinda struggles is due to his inconsistency. His first two balls were a wide outside the off stump and a full ball on the pads with fine leg inside the circle that went for four.\"",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Marsh to Pollard,no run,yorker, on the stumps, Pollard gets legs out of the way and keeps it out",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Marsh to Pollard,no run,a slower one now, some display of variety from Marsh, Pollard hit high on the pad as he fails to turn it to leg",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Marsh to Pollard,1 run,overpitched on the pads, turned softly behind square leg",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Marsh to Sharma,no run,not getting the single, pushes a length ball to short extra and sets off, Pollard tells him to go back",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Marsh to Sharma,1 run,slower one coming in, turned through square leg, man from the deep runs in and keeps them to one",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "manoj: \"Rohit is doing what Ponting did, building pressure on his partner.. And he is not the captain of the team too!!!\"",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Dinda to Sharma,2 runs,full and wide, he reaches out and gets it wide of third man, Nayar with a sprint and a sprawling dive saves the boundary",
        "isHighlight": true
      },
      {
        "ball": "16.2",
        "text": "Dinda to Sharma, $$SIX$$ ,that'll go, Rohit getting under this overpitched delivery and hammering it high over long off",
        "isHighlight": true
      },
      {
        "ball": "16.3",
        "text": "Dinda to Sharma,(no ball)  $$SIX$$ ,how did that go for six, it was a slower one, and Rohit seemed to have mistimed the pull off the front foot, but it has sailed comfortably over wide long on, and Dinda has also overstepped",
        "isHighlight": true
      },
      {
        "ball": "16.3",
        "text": "Dinda to Sharma,no run,around the blockhole outside off, Rohit throws the bat at it, keeper does well to stop the screaming thick inside edge",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Dinda to Sharma,2 runs,elegant, and effective, makes you wonder why he can't pull it off more often, forward to ease it through extra cover, and needs a dive from long off to save four",
        "isHighlight": true
      },
      {
        "ball": "16.5",
        "text": "Dinda to Sharma,1 run,low full toss, he can;t get hold of the slog over midwicket",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Dinda to Pollard,1 run,good length, Pollard powers it along the ground to long off",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Marsh to Pollard,no run,length ball into middle and leg, worked straight to midwicket, Yuvraj throws at the striker's and it hits Pollard who is bending to make his ground, a few stares exchanged,",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Marsh to Pollard, $$FOUR$$ ,slow bouncer, into the body, Pollard has swivelled and hooked it to the deep square leg boundary",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Marsh to Pollard, $$SIX$$ ,it's Pollard time, gets under a length ball and sends it rocketing high over deep midwicket, that didn;t like it was every going to come down",
        "isHighlight": true
      },
      {
        "ball": "17.4",
        "text": "Marsh to Pollard,1 run",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Marsh to Sharma, $$FOUR$$ ,high full toss, Rohit backs away to leg and swings hard, ends up slicing it high and wide of third man",
        "isHighlight": true
      },
      {
        "ball": "17.6",
        "text": "Marsh to Sharma, $$SIX$$ ,that is through the hands of Taylor at long off, length ball drilled flat in the air, Taylor has hands outstretched over his head, but it zooms through",
        "isHighlight": true
      },
      {
        "ball": "18.1",
        "text": "Mathews to Pollard,no run,full and wide, Pollard finds point as he reaches for it",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Mathews to Pollard,1 run,around the blockhole, Pollard manages a thick inside edge past the stumps",
        "isHighlight": false
      },
      {
        "ball": "18.3",
        "text": "Mathews to Sharma, $$FOUR$$ ,another full toss outside off, and Rohit sends it to the deep extra cover rope with a step back in the crease and a crack of the bat",
        "isHighlight": true
      },
      {
        "ball": "18.4",
        "text": "Mathews to Sharma,1 run,in the blockhole once more, Rohit backing away but cannot turn it past backward point",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Damandeep: \"I think Rohit Sharma just made Manoj eat his words\"",
        "isHighlight": false
      },
      {
        "ball": "18.5",
        "text": "Mathews to Pollard,2 runs,heaves a very full one through midwicket, and it goes slowly enough into the outfield for them to come through for two",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Mathews to Pollard,1 run,low full toss, Pollard drills it down the ground, long on gets around in time",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Dinda entrusted with the final over, gulp",
        "isHighlight": false
      },
      {
        "ball": "18.6",
        "text": "Vaibhav: \"Rohit plays his innings in two phases..First as a sidekick to the batsman in form and second as aggressive stroke player when the team finally needs him.But the problem as an Indian fan is that for India he plays first phase similarly but never advances to second phase.\"",
        "isHighlight": false
      },
      {
        "ball": "19.1",
        "text": "Dinda to Pollard,1 run,dabs a low full toss wide of point",
        "isHighlight": false
      },
      {
        "ball": "19.2",
        "text": "Dinda to Sharma,1 run,around the blockhole outside off, squeezed out to the sweeper, so far, so good from Dinda",
        "isHighlight": false
      },
      {
        "ball": "19.2",
        "text": "ram: \"Love watching Rohit at his best. Its almost like he is waving a wand around. There is a combination fo power, timing & grace which is bewitching.\"",
        "isHighlight": false
      },
      {
        "ball": "19.3",
        "text": "Dinda to Pollard,1 run,tries to play the ramp from well outside off, mishits it to square leg",
        "isHighlight": false
      },
      {
        "ball": "19.4",
        "text": "Dinda to Sharma, $$SIX$$ ,and another six carries just over Ross Taylor's hands at long off, and that is fifty for Rohit Sharma, he's taken his time as always, and exploded",
        "isHighlight": true
      },
      {
        "ball": "19.5",
        "text": "Dinda to Sharma, $$SIX$$ ,Dinda losing it again, full toss on middle and off, Rohit sends it smoking wide of deep midwicket",
        "isHighlight": true
      },
      {
        "ball": "19.6",
        "text": "Dinda to Sharma,1 run,swings yet another full toss out to long on",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Rohit was 15 off 17, he;s taken 47 off his last 15. And Dinda has equalled the worst bowling figures in an IPL innings. He's not exactly a T20 bowler, can bowl the yorkers, but too inconsistent",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "APOORVAGJ: \"What wrong did Bhuvaneshwar Kumar do to deserve just two overs? He couldn't have been worse than Dinda as a death bowler.\"",
        "isHighlight": false
      }
    ],
    "innings": "Mumbai Indians  innings"
  },
  {
    "url": "http://www.espncricinfo.com/indian-premier-league-2013/engine/match/598011.html?innings=2;view=commentary",
    "name": "Mumbai Indians v Pune Warriors",
    "commentary": [
      {
        "ball": 0,
        "text": "Back for the chase. Finch and Uthappa will open for Pune",
        "isHighlight": false
      },
      {
        "ball": "0.1",
        "text": "Johnson to Finch, $$OUT$$ ,bowled him first ball, full and fast inswinger, and Finch has played all around it, what a ripper to get first up",
        "isHighlight": true
      },
      {
        "ball": "0.1",
        "text": "$$AJ$$ $$Finch$$ $$b$$ $$Johnson$$ $$0$$ $$(1m$$ $$1b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$0.00$$",
        "isHighlight": false
      },
      {
        "ball": "0.2",
        "text": "Johnson to Taylor,no run,inswinger again, this time around off stump, pushed to the leg side",
        "isHighlight": false
      },
      {
        "ball": "0.3",
        "text": "Johnson to Taylor, $$FOUR$$ ,full and straightening just outside off, Taylor doing well to squeeze it past point",
        "isHighlight": true
      },
      {
        "ball": "0.4",
        "text": "Johnson to Taylor,1 wide,swings in from good length now, and carries down the leg side",
        "isHighlight": false
      },
      {
        "ball": "0.4",
        "text": "Johnson to Taylor,no run,swings in on middle stump, softly played out to midwicket",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "Johnson to Taylor,no run,angled across on off stump, pushed off the front foot to covers",
        "isHighlight": false
      },
      {
        "ball": "0.5",
        "text": "Aashay: \"First ball ducks seem in vogue this season\"",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Johnson to Taylor,no run,back of a length, pushed quietly to extra cover",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "Ponting in discussion with Ojha, who will bowl now",
        "isHighlight": false
      },
      {
        "ball": "0.6",
        "text": "FreeOpinion: \"ICC or Aussie Board should allow out-of-form players to play with their IPL jerseys in ODI,Tests.. watson will bowl, johnson will swing and pointing might captain again :-)\"",
        "isHighlight": false
      },
      {
        "ball": "1.1",
        "text": "Ojha to Uthappa, $$OUT$$ ,what a waste, more trouble for Pune, Uthappa pulls to square leg, Taylor wants the single, he is too far up the pitch before he turns back, Ojha makes a mess initially of the take as the throw arrives, but still has enough time to catch Taylor short",
        "isHighlight": true
      },
      {
        "ball": "1.1",
        "text": "$$LRPL$$ $$Taylor$$ $$run$$ $$out$$ $$4$$ $$(6m$$ $$5b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$80.00$$",
        "isHighlight": false
      },
      {
        "ball": "1.2",
        "text": "Ojha to Uthappa,no run,defended off the front foot",
        "isHighlight": false
      },
      {
        "ball": "1.3",
        "text": "Ojha to Uthappa, $$FOUR$$ ,shortish, and he opens up to pull it high over square leg",
        "isHighlight": true
      },
      {
        "ball": "1.4",
        "text": "Ojha to Uthappa,2 runs,shortish once more, neat bounce, and Uthappa can't time the punch, but he;s got it in the gap at cover",
        "isHighlight": false
      },
      {
        "ball": "1.5",
        "text": "Ojha to Uthappa,no run,makes room now to a quicker one on the stumps and runs it to point",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Ojha to Uthappa,1 wide,pushed through down the leg side",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "Ojha to Uthappa,1 run,moves across to one straightening on middle and turns it square",
        "isHighlight": false
      },
      {
        "ball": "1.6",
        "text": "DisappointedCommentsWriter: \"How about a Yuvraj discount offer on tickets?\" sub-10%, anyone?",
        "isHighlight": false
      },
      {
        "ball": "2.1",
        "text": "Johnson to Uthappa,no run,swings in and hits the inner half o the blade as he tries to drive through off",
        "isHighlight": false
      },
      {
        "ball": "2.2",
        "text": "Johnson to Uthappa,no run,hits the pad as he fails to work it to leg with the swing",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Johnson to Uthappa, $$OUT$$ ,Mitch is through another one, inswinger working big time, Uthappa tries to straight drive a good length delivery, he ends up pushing outside the line as Mitch sneaks in one more, off stump, it's time for evening walk",
        "isHighlight": true
      },
      {
        "ball": "2.3",
        "text": "$$RV$$ $$Uthappa$$ $$b$$ $$Johnson$$ $$7$$ $$(14m$$ $$9b$$ $$1x4$$ $$0x6)$$ $$SR:$$ $$77.77$$",
        "isHighlight": false
      },
      {
        "ball": "2.3",
        "text": "Abhinav: \"Cmon guys I am not kidding when I say WARRIORS do not look like reaching Dinda's target of 63\"",
        "isHighlight": false
      },
      {
        "ball": "2.4",
        "text": "Johnson to Suman, $$FOUR$$ ,opens the face and runs a back of a length ball wide of point, that;s timed so well third man gives up",
        "isHighlight": true
      },
      {
        "ball": "2.5",
        "text": "Johnson to Suman, $$FOUR$$ ,short, wide, and cut hard past point, Harbhajan at third man has no chance again",
        "isHighlight": true
      },
      {
        "ball": "2.6",
        "text": "Johnson to Suman,1 run,thick edge to third man as he pushes forward to one that goes across",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "vnbhise: \"Did Pune have some personal grudge against Rajasthan Royals?\"",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "Yuvraj yet to face a ball",
        "isHighlight": false
      },
      {
        "ball": "2.6",
        "text": "'John Inverarity': \"Cricket Australia are in serious contemplation about @free opinion's idea about Johnson wearing his IPL jersey and bowling for Australia...\"",
        "isHighlight": false
      },
      {
        "ball": "3.1",
        "text": "Harbhajan Singh to Suman,no run,quick and full on the stumps, pushed to extra cover off a leading edge",
        "isHighlight": false
      },
      {
        "ball": "3.2",
        "text": "Harbhajan Singh to Suman,no run,straighter one on off, pushed down the pitch",
        "isHighlight": false
      },
      {
        "ball": "3.3",
        "text": "Harbhajan Singh to Suman,no run,some spin in, punched to the bowler",
        "isHighlight": false
      },
      {
        "ball": "3.4",
        "text": "Harbhajan Singh to Suman,no run,fired a rocket in from a good length, hits him on the thigh pad",
        "isHighlight": false
      },
      {
        "ball": "3.5",
        "text": "Harbhajan Singh to Suman, $$FOUR$$ ,too much leg side from Harbhajan as he continues darting them in, Suman sweeps in the air to the fine leg rope",
        "isHighlight": true
      },
      {
        "ball": "3.6",
        "text": "Harbhajan Singh to Suman,no run,pushed to mid on",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "Yuvraj to face his first ball, from Malinga",
        "isHighlight": false
      },
      {
        "ball": "3.6",
        "text": "McRao: \"Warriors look like a bits and pieces collage hastily put together. Come on Yuvi, make me eat my words.\"",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "Malinga to Yuvraj Singh,1 run,opens the face and steers a back of a length ball to third man",
        "isHighlight": false
      },
      {
        "ball": "4.1",
        "text": "'shane warne': \"@john, free opinion....dont count me out...i dont mind a ashes return.\"",
        "isHighlight": false
      },
      {
        "ball": "4.2",
        "text": "Malinga to Suman,1 run,bouncing on him from short of a length, he stays beside it and runs it to third man",
        "isHighlight": false
      },
      {
        "ball": "4.3",
        "text": "Malinga to Yuvraj Singh,1 leg bye,hit on the pads with a big inswinger, but well outside leg stump",
        "isHighlight": false
      },
      {
        "ball": "4.4",
        "text": "Malinga to Suman, $$FOUR$$ ,pitched up widish, and he puts it away through cover, Suman playing some cracking shots",
        "isHighlight": true
      },
      {
        "ball": "4.5",
        "text": "Malinga to Suman,no run,away swinger, good length, bouncing, he is beaten as he tries to dab it to third man",
        "isHighlight": false
      },
      {
        "ball": "4.6",
        "text": "Malinga to Suman,1 run,caught in the crease and awkwardly runs a length ball to third man",
        "isHighlight": false
      },
      {
        "ball": "5.1",
        "text": "Harbhajan Singh to Suman, $$FOUR$$ ,Harbhajan starts the over with a flighted one, Suman comes out and looks to lift it over the off side, slices it over backward point",
        "isHighlight": true
      },
      {
        "ball": "5.2",
        "text": "Harbhajan Singh to Suman, $$OUT$$ ,end of the fun for Suman, and a wicket for Harbhajan, who tosses it up once more, and Suman lofts it to Pollard at long in some way in from the boundary",
        "isHighlight": true
      },
      {
        "ball": "5.2",
        "text": "$$TL$$ $$Suman$$ $$c$$ $$Pollard$$ $$b$$ $$Harbhajan$$ $$Singh$$ $$23$$ $$(12m$$ $$15b$$ $$5x4$$ $$0x6)$$ $$SR:$$ $$153.33$$",
        "isHighlight": false
      },
      {
        "ball": "5.2",
        "text": "Some confusion as they check for the no-ball, but Harbhajan is just fine",
        "isHighlight": false
      },
      {
        "ball": "5.3",
        "text": "Harbhajan Singh to Yuvraj Singh,no run,big turn wide outside off, slapped away to extra cover",
        "isHighlight": false
      },
      {
        "ball": "5.4",
        "text": "Harbhajan Singh to Yuvraj Singh,1 run,almost done in by one that comes in with the angle from round the stumps, thick inside edge past the stumps as Yuvraj pushes forward",
        "isHighlight": false
      },
      {
        "ball": "5.5",
        "text": "Harbhajan Singh to Mathews,no run,fired in and straightens on off, defended off the back foot",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Harbhajan Singh to Mathews,1 run,pushes an offbreak down to long on",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Seems Pune's strategy for getting these runs involves denying Yuvraj the strike",
        "isHighlight": false
      },
      {
        "ball": "5.6",
        "text": "Rishi Dhawan, young allrounder from Himachal Pradesh, in discussion with Tendulkar as he comes on to bowl",
        "isHighlight": false
      },
      {
        "ball": "6.1",
        "text": "Dhawan to Mathews,no run,nice start, holds its line from a length on off, and zooms past the outside edge, Ponting likes that",
        "isHighlight": false
      },
      {
        "ball": "6.2",
        "text": "Dhawan to Mathews,1 run,skiddy from back of a length, swatted down to long on",
        "isHighlight": false
      },
      {
        "ball": "6.3",
        "text": "Dhawan to Yuvraj Singh,no run,good length, right on off stump, defended to the bowler, not a bad start for Dhawan",
        "isHighlight": false
      },
      {
        "ball": "6.4",
        "text": "Dhawan to Yuvraj Singh,no run,beaten as he flashes at one leaving him outside off with the angle",
        "isHighlight": false
      },
      {
        "ball": "6.5",
        "text": "Dhawan to Yuvraj Singh, $$FOUR$$ ,Yuvraj gets away, makes room and swings at a length delivery, thick edge beats the keeper's drive",
        "isHighlight": true
      },
      {
        "ball": "6.6",
        "text": "Dhawan to Yuvraj Singh,1 run,129.6 kph, pitched up on the stumps, pushed to mid off for one",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Looks good, Rishi Dhawan, nippy, decentish pace",
        "isHighlight": false
      },
      {
        "ball": "6.6",
        "text": "Pollard on",
        "isHighlight": false
      },
      {
        "ball": "7.1",
        "text": "Pollard to Yuvraj Singh,1 run,Yuvraj dealing in thick edges, comes forward to this length ball, which scurries to short third man, some confusion before they cross over",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Pollard to Mathews,1 wide,good length, but pushed down the leg side",
        "isHighlight": false
      },
      {
        "ball": "7.2",
        "text": "Pollard to Mathews,no run,turned in the air, almost carries to short midwicket",
        "isHighlight": false
      },
      {
        "ball": "7.3",
        "text": "Pollard to Mathews,1 run,that bounced and cut in from back of a length, he adjusted to arch back and steer to third man",
        "isHighlight": false
      },
      {
        "ball": "7.4",
        "text": "Pollard to Yuvraj Singh, $$SIX$$ ,that's gone over deep backward square leg, short and sitting up, and Yuvraj swivels to pull it high",
        "isHighlight": true
      },
      {
        "ball": "7.5",
        "text": "Pollard to Yuvraj Singh,no run,defends a length ball to off, and bowler denies them the single",
        "isHighlight": false
      },
      {
        "ball": "7.5",
        "text": "Shahid Majeed: \"Rishi Dhawan's FC record is quite impressive; he should play every match of this IPL. IPL can be the opportunity for him and other like him to showcase their skills.\"",
        "isHighlight": false
      },
      {
        "ball": "7.6",
        "text": "Pollard to Yuvraj Singh,2 runs,reaches out and opens the face to lift this one over cover for a couple",
        "isHighlight": false
      },
      {
        "ball": "8.1",
        "text": "Dhawan to Mathews,2 runs,pitched up on the stumps, 130.8 kph, he is late on it but turns it through square leg",
        "isHighlight": false
      },
      {
        "ball": "8.2",
        "text": "Dhawan to Mathews,no run,that moved away sharply, full outside off, beats the edge by a mile",
        "isHighlight": false
      },
      {
        "ball": "8.3",
        "text": "Dhawan to Mathews,2 runs,charges out and smashes this past the bowler, Rohit runs across from long in and dives to stop the boundary",
        "isHighlight": true
      },
      {
        "ball": "8.4",
        "text": "Dhawan to Mathews,1 run,pitched up, on off, pushed wide of point",
        "isHighlight": false
      },
      {
        "ball": "8.5",
        "text": "Dhawan to Yuvraj Singh,no run,beats Yuvraj again outside off as he misses a dab to a length ball",
        "isHighlight": false
      },
      {
        "ball": "8.6",
        "text": "Dhawan to Yuvraj Singh, $$SIX$$ ,Yuvraj's reply is to cart the next one, a length ball, several rows over the long on boundary",
        "isHighlight": true
      },
      {
        "ball": "8.6",
        "text": "Prashant: \"Dinda's target reached!!! Do PWI get atleast 1 point now?\"",
        "isHighlight": false
      },
      {
        "ball": "9.1",
        "text": "Pollard to Mathews,no run,bends to off and tries to scoop it fine on leg, misses the length ball angled in",
        "isHighlight": false
      },
      {
        "ball": "9.2",
        "text": "Pollard to Mathews,1 run,flicked to short fine off the pad",
        "isHighlight": false
      },
      {
        "ball": "9.3",
        "text": "Pollard to Yuvraj Singh,2 runs,Yuvraj's creamed that through extra cover, the ones he plays when he is on song in a big ODI innings, sweeper dives to save the boundary",
        "isHighlight": false
      },
      {
        "ball": "9.4",
        "text": "Pollard to Yuvraj Singh, $$OUT$$ ,he;s connected with another one, but has found Dhawan at deep midwicket, Dhawan ran in first, it came zooming into him, and he adjusted well to hold on",
        "isHighlight": true
      },
      {
        "ball": "9.4",
        "text": "$$Yuvraj$$ $$Singh$$ $$c$$ $$Dhawan$$ $$b$$ $$Pollard$$ $$24$$ $$(43m$$ $$16b$$ $$1x4$$ $$2x6)$$ $$SR:$$ $$150.00$$",
        "isHighlight": false
      },
      {
        "ball": "9.5",
        "text": "Pollard to Marsh,no run,pushed in from wide of the crease, Pollard has a shout but that hit him too high",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Pollard to Marsh,1 run,pushes a back of a length ball to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "9.6",
        "text": "Padmanabhan: \"I don't understand how on earth Marsh is playing ahead of Nayar (who didn't bowl as well).\"",
        "isHighlight": false
      },
      {
        "ball": "10.1",
        "text": "Dhawan to Marsh,1 run,moves across and times it off the pads through midwicket, long on runs around",
        "isHighlight": false
      },
      {
        "ball": "10.2",
        "text": "Dhawan to Mathews,1 run,almost chops it on as he makes some room, it bounces over, keeper runs in, and lobs it at the stumps, but Marsh is too quick",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Dhawan to Marsh,1 run,length ball, he brings bat around front pad to nudge it through square leg",
        "isHighlight": false
      },
      {
        "ball": "10.3",
        "text": "Anurag: \"Swing generated by MI bowlers goes to show the blunder Mathews made by not bowling out Bhuvneshwar early on...could have made a big difference!\"",
        "isHighlight": false
      },
      {
        "ball": "10.4",
        "text": "Dhawan to Mathews,1 run,he backs away to leg, Dhawan bowls it slow and full one off, dragged through midwicket",
        "isHighlight": false
      },
      {
        "ball": "10.5",
        "text": "Dhawan to Marsh,no run,nice teasing outswinger, he goes for the drive and is beaten",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Dhawan to Marsh,1 run,pitched up, lifted over the bowler's head, long off fields",
        "isHighlight": false
      },
      {
        "ball": "10.6",
        "text": "Malinga back",
        "isHighlight": false
      },
      {
        "ball": "11.1",
        "text": "Malinga to Marsh,2 runs,turns a full toss to deep midwicket",
        "isHighlight": false
      },
      {
        "ball": "11.2",
        "text": "Malinga to Marsh,1 run,hops across to a back of a length ball and nudges it square to leg",
        "isHighlight": false
      },
      {
        "ball": "11.3",
        "text": "Malinga to Mathews,1 run,whips a length ball past midwicket",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Malinga to Marsh,1 run,pitched up outside off, driven to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "11.4",
        "text": "Raj: \"What is Matthews doing in the team? He is neither attacking with the bat nor too good with the ball. And as we have seen today, he is not a smart captain as well. So whats the point having him in the team. Instead get Ajantha Mendis in the team who has been paid so high and get maybe Steven Smith or Luke Wright in the team for Marsh.\"",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Malinga to Mathews,1 run,turns a pacy length ball to fine leg",
        "isHighlight": false
      },
      {
        "ball": "11.5",
        "text": "Achuthan: \"The way Pune are playing,it makes me think that they won their last match only so that the 11-match losing streak would end...so by this logic,their next victory is to take a long,long time...\"",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Malinga to Marsh,no run,bouncer, just outside off, Marsh moves across, stops, drops wrists and weaves out of the line",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Ojha back",
        "isHighlight": false
      },
      {
        "ball": "11.6",
        "text": "Murali J: \"MI should be careful of peaking too early.. We know what happens to them when they enter into the knockouts..\"",
        "isHighlight": false
      },
      {
        "ball": "12.1",
        "text": "Ojha to Mathews, $$SIX$$ ,tossed up delivery, and first ball on return, Ojha's been heaved for a six over deep midwicket",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "Ojha to Mathews, $$OUT$$ ,Angelo holes out, not to the pitch as he skips out to a tossed up ball which dips, goes through with the shot, Rohit settles under the steepler, and as casually as he hits cover drives, he takes the catch too, Jonty Rhodes sitting right behind in the dugout claps",
        "isHighlight": true
      },
      {
        "ball": "12.2",
        "text": "$$AD$$ $$Mathews$$ $$c$$ $$Sharma$$ $$b$$ $$Ojha$$ $$19$$ $$(36m$$ $$18b$$ $$0x4$$ $$1x6)$$ $$SR:$$ $$105.55$$",
        "isHighlight": false
      },
      {
        "ball": "12.3",
        "text": "Ojha to Marsh,2 runs,square drives one outside off, and comes back for two",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Ojha to Marsh,1 run,goes back and across and swats it through midwicket",
        "isHighlight": false
      },
      {
        "ball": "12.4",
        "text": "Kaushik: \"Pune Warriors are the shining example of what a team would be without a good leader inspite of having power performers\"",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Ojha to Nayar,1 wide,pitches on leg and turns down the leg side",
        "isHighlight": false
      },
      {
        "ball": "12.5",
        "text": "Ojha to Nayar,1 run,tried to back away for the cut, but that spun in to him and he has to dab it behind point",
        "isHighlight": false
      },
      {
        "ball": "12.6",
        "text": "Ojha to Marsh,1 run,swatted down to long on",
        "isHighlight": false
      },
      {
        "ball": "13.1",
        "text": "Harbhajan Singh to Marsh,no run,heaves at a tossed up offbreak, misses and is hit on the thigh pad",
        "isHighlight": false
      },
      {
        "ball": "13.2",
        "text": "Harbhajan Singh to Marsh, $$SIX$$ ,flighted wider, and this time he;s connected, and slog swept it big over deep midwicket",
        "isHighlight": true
      },
      {
        "ball": "13.3",
        "text": "Harbhajan Singh to Marsh,1 run,quicker and fuller and closer to the stumps, hit down to long off",
        "isHighlight": false
      },
      {
        "ball": "13.4",
        "text": "Harbhajan Singh to Nayar,1 run,slapped away to sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "13.5",
        "text": "Harbhajan Singh to Marsh,1 run,full, crashed down the ground to long off",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Harbhajan Singh to Nayar,1 run,on the front foot to push to the off side for one",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "Mitch is back",
        "isHighlight": false
      },
      {
        "ball": "13.6",
        "text": "baz: \"@kaushik, you could be the greatest leader but when your power performers don't perform, nothing much you can do\"",
        "isHighlight": false
      },
      {
        "ball": "14.1",
        "text": "Johnson to Nayar,1 run,pitched up outside off, Nayar whacks it in the air, just past extra cover",
        "isHighlight": false
      },
      {
        "ball": "14.2",
        "text": "Johnson to Marsh,no run,backs away and mistimes a swat to extra cover",
        "isHighlight": false
      },
      {
        "ball": "14.3",
        "text": "Johnson to Marsh, $$SIX$$ ,Marsh hitting a few late ones for PWI, golf-swings a length ball 99 metres into the crowd over forward square leg boundary",
        "isHighlight": true
      },
      {
        "ball": "14.4",
        "text": "Johnson to Marsh, $$FOUR$$ ,four more, Marsh makes room and swings, top edge flies high over the keeper",
        "isHighlight": true
      },
      {
        "ball": "14.5",
        "text": "Johnson to Marsh,1 run,drives a pitched up ball to sweeper cover",
        "isHighlight": false
      },
      {
        "ball": "14.5",
        "text": "Sathya: \"Just think blaming Matthews solely for Pune's troubles is very unfair. The team has just been poor.... none of the so-called \"power peformers\" has stepped up. He's not a great captain, but I don't think he's the biggest problem the team has, not by a long shot\"",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Johnson to Nayar,1 run,Nayar almost finding the man at mid off this time, with a drive in the air",
        "isHighlight": false
      },
      {
        "ball": "14.6",
        "text": "Sam: \"@padmanabhan Now you know why marsh is batting ahead of Nayar..!!\"",
        "isHighlight": false
      },
      {
        "ball": "15.1",
        "text": "Malinga to Nayar,1 run,very full just outside off, squeezed out to the sweeper",
        "isHighlight": false
      },
      {
        "ball": "15.2",
        "text": "Malinga to Marsh,1 run,belts a quick pitched up delivery down to long off",
        "isHighlight": false
      },
      {
        "ball": "15.3",
        "text": "Malinga to Nayar, $$OUT$$ ,Nayar has succeeded in holing out this time, to long off, tried to get under this very full one and loft it, picked out Pollard",
        "isHighlight": true
      },
      {
        "ball": "15.3",
        "text": "$$AM$$ $$Nayar$$ $$c$$ $$Pollard$$ $$b$$ $$Malinga$$ $$6$$ $$(14m$$ $$7b$$ $$0x4$$ $$0x6)$$ $$SR:$$ $$85.71$$",
        "isHighlight": false
      },
      {
        "ball": "15.4",
        "text": "Malinga to Marsh,1 run,full, wide and squeezed out to deep point",
        "isHighlight": false
      },
      {
        "ball": "15.5",
        "text": "Malinga to Kumar,no run,pats a pitched up delivery down the track",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "Malinga to Kumar,no run,slow around the blockhole, he is leaning forward early and working it towards leg, Malinga quick to deny the run",
        "isHighlight": false
      },
      {
        "ball": "15.6",
        "text": "LJ: \"Hilarious to see people criticizing Mathews for his poor captaincy. I wonder why Daredevils has not yet been able to won a single game under Jayawardena, although they had so many close chances.\"",
        "isHighlight": false
      },
      {
        "ball": "16.1",
        "text": "Johnson to Marsh, $$FOUR$$ ,low full toss, Marsh shovels that high over extra cover",
        "isHighlight": true
      },
      {
        "ball": "16.2",
        "text": "Johnson to Marsh,1 run,very low full toss, he swings and inside-edges to short fine leg",
        "isHighlight": false
      },
      {
        "ball": "16.3",
        "text": "Johnson to Kumar,1 run,length ball going across, steered to third man",
        "isHighlight": false
      },
      {
        "ball": "16.4",
        "text": "Johnson to Marsh, $$OUT$$ ,MI have been top drawer with their catching, here's another one, Marsh slicing it into the sky over sweeper cover, Dhawan settled under it, seemed to lose the ball as it came down but tumbled to take it safely in the end",
        "isHighlight": true
      },
      {
        "ball": "16.4",
        "text": "$$MR$$ $$Marsh$$ $$c$$ $$Dhawan$$ $$b$$ $$Johnson$$ $$38$$ $$(34m$$ $$26b$$ $$2x4$$ $$2x6)$$ $$SR:$$ $$146.15$$",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Johnson to Kumar,no run,pitched full just outside off, pushed to short extra cover",
        "isHighlight": false
      },
      {
        "ball": "16.5",
        "text": "Golani: \"Mathews is not being blamed because pune is losing.. but because of his decisions\"",
        "isHighlight": false
      },
      {
        "ball": "16.6",
        "text": "Johnson to Kumar,no run,fast and into the body from back of a length, he tries to make room but it reaches him quickly",
        "isHighlight": false
      },
      {
        "ball": "17.1",
        "text": "Dhawan to Sharma,no run,tries to heave it through the leg side, it is bowled slower, and bounces over the stumps",
        "isHighlight": false
      },
      {
        "ball": "17.2",
        "text": "Dhawan to Sharma,1 run,around the blockhole, turned square to leg",
        "isHighlight": false
      },
      {
        "ball": "17.3",
        "text": "Dhawan to Kumar,no run,swings and misses outside off to a length ball",
        "isHighlight": false
      },
      {
        "ball": "17.4",
        "text": "Dhawan to Kumar,1 run,slogs it down the ground, long on reaches it on the bounce",
        "isHighlight": false
      },
      {
        "ball": "17.5",
        "text": "Dhawan to Sharma,1 run,driven to sweeper cover for a single",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Dhawan to Kumar,2 runs,slower length ball whipped over square leg, there is a fielder in the deep there",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "rssampat: \"@ LJ, Jayawardene is a proven performer & good thinking captain while A.Mathews is captaining badly. DD are losing because they are playing poorly, while PW are not able to seize moments and are making technical blunder's, bad captaincy being one of them. Finch & Yuvi who bowled 2 good over's each and B.Kumar were not bowled full 4 overs and DINDA despite being HAMMERED was PERSISTED with bowling his full quota of 4 overs & that's just 1 example\"",
        "isHighlight": false
      },
      {
        "ball": "17.6",
        "text": "Uzair : \"Time to give Luke Wright and Steve Smith a chance. I am not criticizing Mathews, but he should drop himself and give Luke Wright a chance. They cant afford to leave it for too late..\"",
        "isHighlight": false
      },
      {
        "ball": "18.1",
        "text": "Malinga to Sharma,no run,misses a slower one outside off",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Malinga to Sharma,no run,full and quick just outside leg as he makes room, and another miss",
        "isHighlight": false
      },
      {
        "ball": "18.2",
        "text": "Mitch Johnson has the purple cap for now",
        "isHighlight": false
      },
      {
        "ball": "18.3",
        "text": "Malinga to Sharma,1 run,steered down to third man",
        "isHighlight": false
      },
      {
        "ball": "18.4",
        "text": "Malinga to Kumar,1 run,flicks a full one off the pad to fine leg",
        "isHighlight": false
      },
      {
        "ball": "18.5",
        "text": "Malinga to Sharma, $$FOUR$$ ,goes back and drills an overpitched ball straight down the ground",
        "isHighlight": true
      },
      {
        "ball": "18.6",
        "text": "Malinga to Sharma,no run,moves to leg, Malinga goes outside off, and he misses one more",
        "isHighlight": false
      },
      {
        "ball": "19.1",
        "text": "Pollard to Kumar,1 run,mishits a slow length ball through midwicket",
        "isHighlight": false
      },
      {
        "ball": "19.2",
        "text": "Pollard to Sharma,2 runs,makes room and pushes another slower one in the air through cover",
        "isHighlight": false
      },
      {
        "ball": "19.3",
        "text": "Pollard to Sharma,no run,yet another slower one, floated up wide, he has a heave and misses",
        "isHighlight": false
      },
      {
        "ball": "19.4",
        "text": "Pollard to Sharma,no run,tries to dismiss it through extra cover but can;t put bat to ball",
        "isHighlight": false
      },
      {
        "ball": "19.5",
        "text": "Pollard to Sharma,1 run,slower one loops in the air down to long on",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Pollard to Kumar,no run,Pollard ends with one more slower delivery, which is missed, and MI wrap up a comfortable win",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Hop over to  $$CSK$$ $$v$$ $$RCB$$  then. Good bye.",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Rohit Sharma is the Man of the Match. Rohit: \"It is important for the team for me to get going. I wanted to get runs behind my back and I am happy I did it today. Karthik was hitting the ball well, better than me, my role was to give him as many balls as possible. I wanted to wait for the right time, probably after the 15th and 16th over, and I got it right.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Ricky Ponting being cheered at Wankhede. Ponting: \"180 was always going to be tough for the opposition to chase. We got off to a better start. We laid the foundation for the boys to come in and smack it around. Dinesh and Rohit and playing incredibly well. We are getting to know each others' games particularly well. We were outstanding with the new ball today.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Angelo Mathews: \"We were pretty poor on the field. Last five overs we could not execute our plans. We had to nail those yorkers and could not do it. Dinda, Bhuvi, Marsh have been doing it for past few games, I back my bowlers.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Hang on for the presentation.",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "Pune outgunned by a powerful MI side today, but the lack of fight will rankle for their fans once more",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "$$Mitchell$$ $$Johnson$$ : \"I meant to swing the ball back in, that was my goal tonight, with the humid conditions, you try to swing the ball. That is what Ricky wanted me to do. When you can produce balls like that, seeing the off stumps cartwheel like that is pleasing for a fast bowler.\"",
        "isHighlight": false
      },
      {
        "ball": "19.6",
        "text": "sam: \"Mathews:\" I back my bowlers\". Yes Sir, you do but the wrong ones :p\"",
        "isHighlight": false
      }
    ],
    "innings": "Pune Warriors  innings"
  }
]